{
    "chunk_id": 655277044679,
    "source_file": "Sterness_of_Stone.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/86/Sterness_of_Stone.jpg",
    "alt_text": "Sterness of Stone.jpg",
    "position_desc": 1,
    "img_above_text": "# Sterness of Stone\nSterness of Stone is one of the main Key Items in Black Myth: Wukong's Yellow Wind Ridge area. It is a mandatory Key Item you will come across throughout the chapter, as you need it to progress towards the final boss: the Yellow Wind Sage.",
    "img_below_text": "The Sterness of Stone can be found at the Fright Cliff - Rockrest Flat Shrine. Just to the left, of the Shrine you can find a small arena. Once you enter it, you will fight the Stone Vanguard. Defeating it will drop the Sterness of Stone.\nFor a full guide through the Fright Cliff - Rockrest Flat area, be sure to read through our Fright Cliff Walkthrough in Chapter 2 - Yellow Sand, Desolate Dusk.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"# Sterness of Stone\nSterness of Stone is one of the main Key Items in Black Myth: Wukong's Yellow Wind Ridge area. It is a mandatory Key Item you will come across throughout the chapter, as you need it to progress towards the final boss: the Yellow Wind Sage.\"\n        - Following Text: \"The Sterness of Stone can be found at the Fright Cliff - Rockrest Flat Shrine. Just to the left, of the Shrine you can find a small arena. Once you enter it, you will fight the Stone Vanguard. Defeating it will drop the Sterness of Stone.\nFor a full guide through the Fright Cliff - Rockrest Flat area, be sure to read through our Fright Cliff Walkthrough in Chapter 2 - Yellow Sand, Desolate Dusk.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image shows the inventory screen from the game *Black Myth: Wukong*, highlighting the \"Sterness of Stone\" key item. This rare item, obtained from the Stone Vanguard's body, is described as a mysterious gadget with a unique shape that may unlock a specific mechanism. It is a mandatory item for progressing in the Yellow Wind Ridge area, leading to the final boss, the Yellow Wind Sage."
}