{
    "chunk_id": 396042790436,
    "source_file": "Webbed_Hollow_-_Upper_Hollow_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/ff/Wukong_UpperHollow_22.jpg",
    "alt_text": "Wukong UpperHollow 22.jpg",
    "position_desc": 23,
    "img_above_text": "![Wukong UpperHollow 21.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/87/Wukong_UpperHollow_21.jpg)\nA Puppet Spider will be waiting for you down here, as well as a green Wisp off in a darkened ledge.",
    "img_below_text": "Take the opposite path from the ledge to enter a passageway with a disturbing sight: Tons and tons of hanging cocoons that block your progress. As you approach, several of these will spring to life with large talons, and begin to wobble back and forth while violently swiping. To make matters worse, it's not easy to target the aggressive Clawed Cocoons vs the other ones that can also be knocked around.\n![Wukong UpperHollow 23.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/ae/Wukong_UpperHollow_23.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong UpperHollow 21.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/87/Wukong_UpperHollow_21.jpg)\nA Puppet Spider will be waiting for you down here, as well as a green Wisp off in a darkened ledge.\"\n        - Following Text: \"Take the opposite path from the ledge to enter a passageway with a disturbing sight: Tons and tons of hanging cocoons that block your progress. As you approach, several of these will spring to life with large talons, and begin to wobble back and forth while violently swiping. To make matters worse, it's not easy to target the aggressive Clawed Cocoons vs the other ones that can also be knocked around.\n![Wukong UpperHollow 23.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/ae/Wukong_UpperHollow_23.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character from *Black Myth: Wukong* in a dark, web-covered cavern, preparing to face a large Puppet Spider enemy. The character wields a glowing staff and is positioned cautiously, suggesting an imminent combat encounter. This scene follows the preceding mention of the Puppet Spider and precedes a passageway filled with hanging cocoons, emphasizing the hostile and eerie nature of the environment."
}