{
    "chunk_id": 557995940933,
    "source_file": "Mother_of_Flamlings.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/98/Field_Fire_Walkthrough_%2827%29.png",
    "alt_text": "Field Fire Walkthrough \\(27\\).png",
    "position_desc": 1,
    "img_above_text": "Mother of Flamlings one of the optional Yaoguai Chief boss fights Chapter 5 in Black Myth: Wukong. You'll need to summon her with Fire Ore to make her appear, then you're in for a fight against her and her Flamlings.\n## How to Find Mother of Flamlings",
    "img_below_text": "Take the path that slopes down behind the area where you fought the Flint Vanguard. You'll encounter some more of the Searing and Scorching-Flame enemies, as well as a little green Wisp to the right, by the lava lake.\n![Field Fire Walkthrough \\(26\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/aa/Field_Fire_Walkthrough_%2826%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Mother of Flamlings one of the optional Yaoguai Chief boss fights Chapter 5 in Black Myth: Wukong. You'll need to summon her with Fire Ore to make her appear, then you're in for a fight against her and her Flamlings.\n## How to Find Mother of Flamlings\"\n        - Following Text: \"Take the path that slopes down behind the area where you fought the Flint Vanguard. You'll encounter some more of the Searing and Scorching-Flame enemies, as well as a little green Wisp to the right, by the lava lake.\n![Field Fire Walkthrough \\(26\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/aa/Field_Fire_Walkthrough_%2826%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a rocky, volcanic environment with a glowing lava stream on the right and a player character standing in the foreground. A red arrow highlights a sloping path to the left, indicating the direction to proceed. This visual serves as a guide for navigating the area to locate the \"Mother of Flamlings\" boss in *Black Myth: Wukong*, as described in the accompanying walkthrough text."
}