{
    "chunk_id": 890517423953,
    "source_file": "Pagoda_Realm_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/30/Wukong_Pagoda_16X.jpg",
    "alt_text": "Wukong Pagoda 16X.jpg",
    "position_desc": 17,
    "img_above_text": "When you reach an open cell gate ahead with a small lantern posted above it, that's an indication that you've reached a stairway in the interior section that leads to the next level up.\nBefore you head up, keep progressing forward to find another Blade Monk by the ledge. Since he's facing away, you can actually hit him from behind with a charged thrust attack to send him into the pit!",
    "img_below_text": "Behind where the Blade Monk is, you can find a statue with an altar and a tiny chest that holds a **Fine China Tea Bowl Curio**.\n![Wukong Pagoda 17X.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f3/Wukong_Pagoda_17X.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"When you reach an open cell gate ahead with a small lantern posted above it, that's an indication that you've reached a stairway in the interior section that leads to the next level up.\nBefore you head up, keep progressing forward to find another Blade Monk by the ledge. Since he's facing away, you can actually hit him from behind with a charged thrust attack to send him into the pit!\"\n        - Following Text: \"Behind where the Blade Monk is, you can find a statue with an altar and a tiny chest that holds a **Fine China Tea Bowl Curio**.\n![Wukong Pagoda 17X.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f3/Wukong_Pagoda_17X.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from a video game where the player character, armed with a staff, approaches a statue of a seated figure with an altar in front of it. A small chest, highlighted with a red circle, is visible near the altar. This area is mentioned in the guide as the location of the **Fine China Tea Bowl Curio**, found behind the Blade Monk encountered earlier."
}