{
    "chunk_id": 132470707755,
    "source_file": "Loongscale_Set.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a5/Loongscale_Greaves_2.jpg",
    "alt_text": "Loongscale Greaves 2.jpg",
    "position_desc": 1,
    "img_above_text": "* Thunder Veins - Massively reduces the duration of Shocked state. Moderately increases Thunder damage (3 pieces equipped)\nThe full Loongscale Set of Armor and Gear is located within Chapter 3 - The New West. It is craftable at any Shrine upon defeating Kang-Jin Star in Bitter Lake In Turtle Island.",
    "img_below_text": "The Loongscale Set of Armor and Gear can be crafted, as it is the only way to get it. To craft it you need the following:\n* 5 Silk, 2 Cold Iron Leaves, 4,500 Will - headgear",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"* Thunder Veins - Massively reduces the duration of Shocked state. Moderately increases Thunder damage (3 pieces equipped)\nThe full Loongscale Set of Armor and Gear is located within Chapter 3 - The New West. It is craftable at any Shrine upon defeating Kang-Jin Star in Bitter Lake In Turtle Island.\"\n        - Following Text: \"The Loongscale Set of Armor and Gear can be crafted, as it is the only way to get it. To craft it you need the following:\n* 5 Silk, 2 Cold Iron Leaves, 4,500 Will - headgear\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "1. **Summary**: The image showcases the \"Loongscale Greaves,\" an Epic-tier leg armor piece from the Loongscale Set in a video game. It provides 32 Defense and 3 Shock Resistance, and its \"Thunder Veins\" perk reduces the duration of the Shocked state while increasing Thunder damage. The armor is equipped, and the interface displays character stats and other gear options.\n\n2. **Purpose/Content**: The image highlights the functionality and attributes of the Loongscale Greaves, part of a craftable armor set obtained in Chapter 3 after defeating Kang-Jin Star. It serves as a visual aid in a guide for equipping and utilizing the gear effectively."
}