{
    "chunk_id": 267774863660,
    "source_file": "Chapter_3_Secret_-_Mount_Mei_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/16/Mount_Mei_Walkthrough_%2813%29.png",
    "alt_text": "Mount Mei Walkthrough \\(13\\).png",
    "position_desc": 13,
    "img_above_text": "When the Four Heavenly Kings have been taken down, there's just one more giant to deal with, which is Erlang Shen.\n### Erlang Shen",
    "img_below_text": "You should similarly approach the fight to the Four Heavenly Kings, and use Primal Punch to build up your Focus. When it's built up, use Earthshatter Slam to replenish your health and perform a heavy attack, and keep Rock Solid for moments when you can deflect Erlang Shen's blade attack.\nWhen Erlang Shen's health reaches around 70%, he'll imbue his sword with fire, and start to use it as a whip. This will make the fight a bit tougher, but you'll replenish your health whenever you use Eartshatter Slam. Be sure to use Ice Bath to counter these fire attacks.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"When the Four Heavenly Kings have been taken down, there's just one more giant to deal with, which is Erlang Shen.\n### Erlang Shen\"\n        - Following Text: \"You should similarly approach the fight to the Four Heavenly Kings, and use Primal Punch to build up your Focus. When it's built up, use Earthshatter Slam to replenish your health and perform a heavy attack, and keep Rock Solid for moments when you can deflect Erlang Shen's blade attack.\nWhen Erlang Shen's health reaches around 70%, he'll imbue his sword with fire, and start to use it as a whip. This will make the fight a bit tougher, but you'll replenish your health whenever you use Eartshatter Slam. Be sure to use Ice Bath to counter these fire attacks.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dramatic confrontation between two characters in a snowy, mountainous landscape. The foreground shows a humanoid figure with animalistic features, likely the player's character, facing off against a large, armored opponent in the distance, identified in the context as Erlang Shen. This scene sets the stage for a boss battle, emphasizing the scale and intensity of the encounter."
}