{
    "chunk_id": 275482468142,
    "source_file": "Gore-Eye_Daoist_Spirit.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7f/Gore_eye_daoist_2.png",
    "alt_text": "Gore eye daoist 2.png",
    "position_desc": 2,
    "img_above_text": "## Gore-Eye Daoist Location\nGore-Eye Daoist can be found after defeating both the Stone Vanguard and Tiger Vanguard bosses. After defeating them, return to the area where you fought the King of Flowing Sands and Second Rat Price and place the Keenness of Tiger and Keenness of Stone items into the receptacle by the large stone door. Open the door, head down the hill, and over the bridge to reach an open cave area with a statue carved into the rock face.",
    "img_below_text": "The Gore-Eye Daoist is guarding a Luojia Fragrant Vine that you can use to empower your Gourd. Don't forget to pluck it off the tree after absorbing the Gore-Eye Daoist's Spirit.\n## Gore-Eye Daoist Fight",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Gore-Eye Daoist Location\nGore-Eye Daoist can be found after defeating both the Stone Vanguard and Tiger Vanguard bosses. After defeating them, return to the area where you fought the King of Flowing Sands and Second Rat Price and place the Keenness of Tiger and Keenness of Stone items into the receptacle by the large stone door. Open the door, head down the hill, and over the bridge to reach an open cave area with a statue carved into the rock face.\"\n        - Following Text: \"The Gore-Eye Daoist is guarding a Luojia Fragrant Vine that you can use to empower your Gourd. Don't forget to pluck it off the tree after absorbing the Gore-Eye Daoist's Spirit.\n## Gore-Eye Daoist Fight\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character confronting the Gore-Eye Daoist, a boss enemy in a rocky, open cave area. The Daoist is positioned near a glowing tree, likely the Luojia Fragrant Vine mentioned in the context. This encounter follows the placement of the Keenness of Tiger and Keenness of Stone items to access the area. The fight is a key step in obtaining the vine to empower the player's Gourd."
}