{
    "chunk_id": 942983702943,
    "source_file": "Shigandang.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/60/Wukong_Shigandang_2.jpg",
    "alt_text": "Wukong Shigandang 2.jpg",
    "position_desc": 7,
    "img_above_text": "* Finally, when resting at the Rockrest Flat Shrine, you need only advance forward toward the entrance to the Stone Vanguard / Shigandang Boss Fights to find the final statue and Buddha's Eyeball.\n## Shigandang Boss Fight and Guide",
    "img_below_text": "Though they appear in the same arena, the Shigandang is a much harder challenge compared to the Stone Vanguard. Because of this, it’s recommended that you save challenging this foe until you’re almost complete with Chapter 2 and have a good set of gear and medicines at your disposal to increase damage negation. He’s worth defeating before you fight the final boss of this chapter, as you’ll be able to craft a new weapon upon his defeat.\n### Secret - Defeat the Stone Vanguard with the Shigandang",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"* Finally, when resting at the Rockrest Flat Shrine, you need only advance forward toward the entrance to the Stone Vanguard / Shigandang Boss Fights to find the final statue and Buddha's Eyeball.\n## Shigandang Boss Fight and Guide\"\n        - Following Text: \"Though they appear in the same arena, the Shigandang is a much harder challenge compared to the Stone Vanguard. Because of this, it’s recommended that you save challenging this foe until you’re almost complete with Chapter 2 and have a good set of gear and medicines at your disposal to increase damage negation. He’s worth defeating before you fight the final boss of this chapter, as you’ll be able to craft a new weapon upon his defeat.\n### Secret - Defeat the Stone Vanguard with the Shigandang\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the Shigandang, a challenging boss encountered in the same arena as the Stone Vanguard within a rocky, desolate environment. The preceding and following text suggests this boss fight is part of a video game walkthrough, emphasizing the difficulty of the Shigandang and recommending players prepare thoroughly before engaging. Defeating this boss allows players to craft a new weapon and is advised before facing the chapter's final boss."
}