{
    "chunk_id": 698796601186,
    "source_file": "Snowhill_Path_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4c/Wukong_Snowhill_27.jpg",
    "alt_text": "Wukong Snowhill 27.jpg",
    "position_desc": 26,
    "img_above_text": "There's another Yaksha Patroller here waiting to challenge you, so try and isolate him first by luring the corpses down the stairs and then take him out. Once again, there's another green Wisp to absorb on the right to get some gourd healing back.\nAs you head to the end of the raised platform, you'll find a snowy sloping path off to the right, and another stairway path going straight ahead.",
    "img_below_text": "Take the path straight first, and you'll find a supercharged Yaksha Patroller surrounded by a horde of Frozen Corpses, making this fight a lot harder than usual. Don't worry about conserving your power here -- let loose with your Pluck of Many and Spirit Transformations spells to even the odds as much as you can so you can take down all the extra enemies and then focus on whittling down the Patroller's health.\n![Wukong Snowhill 28.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b8/Wukong_Snowhill_28.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"There's another Yaksha Patroller here waiting to challenge you, so try and isolate him first by luring the corpses down the stairs and then take him out. Once again, there's another green Wisp to absorb on the right to get some gourd healing back.\nAs you head to the end of the raised platform, you'll find a snowy sloping path off to the right, and another stairway path going straight ahead.\"\n        - Following Text: \"Take the path straight first, and you'll find a supercharged Yaksha Patroller surrounded by a horde of Frozen Corpses, making this fight a lot harder than usual. Don't worry about conserving your power here -- let loose with your Pluck of Many and Spirit Transformations spells to even the odds as much as you can so you can take down all the extra enemies and then focus on whittling down the Patroller's health.\n![Wukong Snowhill 28.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b8/Wukong_Snowhill_28.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat scenario in a snowy environment, where the player character is using the \"Rockfall\" spell to create a large area-of-effect attack against multiple enemies, including Frozen Corpses. The setting features a ruined structure and a staircase, aligning with the guide's description of a challenging encounter on the snowy path. The on-screen prompts highlight available attacks and spells, emphasizing the strategic use of abilities to manage the fight."
}