{
    "chunk_id": 288891470334,
    "source_file": "Sandgate_Village_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/cf/Wukong_Sandgate_62.jpg",
    "alt_text": "Wukong Sandgate 62.jpg",
    "position_desc": 60,
    "img_above_text": "King of Flowing Sands and Second Rat Prince\n## Valley of Despair",
    "img_below_text": "As the battle concludes, the lute-playing headless man will return to continue his ballad. A large imposing stone door stands before you, and a small shining statue near it can’t be interacted with unless you possess both the Sterness of Stone and Keeness of Tiger. If you listen to the headless man’s song, he’ll offer a clue: To beat the yellow rat sage who rules this place, you’ll need to defeat his henchmen who carry the keys to this door.\nFrom here, things can get pretty varied and more open than the paths were in Chapter 1. To the right of the sealed door is a bridge leading to the Fright Valley (plus a Ginsengling you can beat up to harvest its plants). To the left lies the Valley of Despair, and beyond it the Crouching Tiger Temple.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"King of Flowing Sands and Second Rat Prince\n## Valley of Despair\"\n        - Following Text: \"As the battle concludes, the lute-playing headless man will return to continue his ballad. A large imposing stone door stands before you, and a small shining statue near it can’t be interacted with unless you possess both the Sterness of Stone and Keeness of Tiger. If you listen to the headless man’s song, he’ll offer a clue: To beat the yellow rat sage who rules this place, you’ll need to defeat his henchmen who carry the keys to this door.\nFrom here, things can get pretty varied and more open than the paths were in Chapter 1. To the right of the sealed door is a bridge leading to the Fright Valley (plus a Ginsengling you can beat up to harvest its plants). To the left lies the Valley of Despair, and beyond it the Crouching Tiger Temple.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character standing before a small glowing statue near a large, sealed stone door. A prompt indicates that interacting with the statue requires \"Sterness of Stone\" and \"Keeness of Tiger.\" The context suggests this is part of a puzzle or progression mechanic in the game, where the player must obtain specific attributes or items to unlock the door and advance further."
}