{
    "chunk_id": 709874323938,
    "source_file": "Captain_Lotus-Vision.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f1/Wukong_Pagoda_35.jpg",
    "alt_text": "Wukong Pagoda 35.jpg",
    "position_desc": 4,
    "img_above_text": "![Wukong Pagoda 34.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/47/Wukong_Pagoda_34.jpg)\nEarly on, basic attacks will include a large circle of projectiles that expel from the crystal before arcing toward you. Other times, it will expel a trio of projectiles in three short bursts before they track you down in waves.",
    "img_below_text": "For each of these attacks, be ready with your Staff-Spin counter, and consider investing in skills to keep this move going and to attack out of it once you've deflected all the projectiles heading your way. A lot of this fight will come down to finding the right opportunities to strike after surviving his attacks, and you'll need all the boosts you can get.\nOther times, he may trigger a bunch of explosions on the floor, which only give you a moment's notice to dodge them, so stay mobile and roll around for a better chance of not getting hit.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Pagoda 34.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/47/Wukong_Pagoda_34.jpg)\nEarly on, basic attacks will include a large circle of projectiles that expel from the crystal before arcing toward you. Other times, it will expel a trio of projectiles in three short bursts before they track you down in waves.\"\n        - Following Text: \"For each of these attacks, be ready with your Staff-Spin counter, and consider investing in skills to keep this move going and to attack out of it once you've deflected all the projectiles heading your way. A lot of this fight will come down to finding the right opportunities to strike after surviving his attacks, and you'll need all the boosts you can get.\nOther times, he may trigger a bunch of explosions on the floor, which only give you a moment's notice to dodge them, so stay mobile and roll around for a better chance of not getting hit.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat sequence from the video game *Black Myth: Wukong*, showing the player character engaged in a battle against a boss named \"Captain Lotus-Vision.\" The scene highlights intense action, with debris and effects surrounding the character, suggesting a powerful attack or counter. The preceding and following text provides guidance on countering the boss's projectile-based attacks and floor explosions, emphasizing the use of the Staff-Spin move and strategic dodging to survive and find opportunities to strike."
}