{
    "chunk_id": 24528273478,
    "source_file": "Yellow_Loong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/55/Wukong_Sandgate_63.jpg",
    "alt_text": "Wukong Sandgate 63.jpg",
    "position_desc": 2,
    "img_above_text": "Follow the path up, and you'll reach a Shrine at the Relief of the Fallen Loong, and above will be a pavilion where the boss waits.\nHowever, in order to activate this secret boss, you'll need to obtain the Loong Scales from the Yellow Wind Ridge in Chapter 2.",
    "img_below_text": "Head through the Sandgate Village and defeat the King of Flowing Sand and his Second Rat Prince son. After defeating the pair (or only the son), head left from the boss arena and into the Valley of Despair.\n![Wukong Sandgate 71.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/94/Wukong_Sandgate_71.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Follow the path up, and you'll reach a Shrine at the Relief of the Fallen Loong, and above will be a pavilion where the boss waits.\nHowever, in order to activate this secret boss, you'll need to obtain the Loong Scales from the Yellow Wind Ridge in Chapter 2.\"\n        - Following Text: \"Head through the Sandgate Village and defeat the King of Flowing Sand and his Second Rat Prince son. After defeating the pair (or only the son), head left from the boss arena and into the Valley of Despair.\n![Wukong Sandgate 71.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/94/Wukong_Sandgate_71.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a gameplay scene from *Black Myth: Wukong*, showing the player character navigating a rocky, arid environment with sparse vegetation and jagged cliffs. The character wields a staff and appears to be approaching a glowing object or entity in the distance, possibly a point of interest or progression. Based on the context, this area is likely part of the journey toward Sandgate Village, where the player will encounter the King of Flowing Sand and his son, the Second Rat Prince. The image highlights exploration and the path leading to the next narrative or combat sequence."
}