{
    "chunk_id": 730497435736,
    "source_file": "Shigandang.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c5/Wukong_Shigandang_11.jpg",
    "alt_text": "Wukong Shigandang 11.jpg",
    "position_desc": 15,
    "img_above_text": "![Wukong Shigandang 5.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/25/Wukong_Shigandang_5.jpg)\nBe wary when trying to attack him from behind, as he’ll respond by doing a backward elbow drop into the ground, covering a wide area that will also cause spiky rocks to shoot up near the point of impact in a cone away from his body.",
    "img_below_text": "The Shigandang has a massive attack you’ll need to be on the lookout for. He’ll start by lifting an arm and a leg, before slamming down on all fours to create a massive shockwave covering a large portion of the arena. All four of his limbs will glow, and soon after will cause a massive detonation. It is possible to avoid this with a well timed pillar stance to gain height on your staff, but you’ll need to do it away from his body or the initial blast can still knock you down or damage you regardless.\n![Wukong Shigandang 10.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/ab/Wukong_Shigandang_10.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Shigandang 5.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/25/Wukong_Shigandang_5.jpg)\nBe wary when trying to attack him from behind, as he’ll respond by doing a backward elbow drop into the ground, covering a wide area that will also cause spiky rocks to shoot up near the point of impact in a cone away from his body.\"\n        - Following Text: \"The Shigandang has a massive attack you’ll need to be on the lookout for. He’ll start by lifting an arm and a leg, before slamming down on all fours to create a massive shockwave covering a large portion of the arena. All four of his limbs will glow, and soon after will cause a massive detonation. It is possible to avoid this with a well timed pillar stance to gain height on your staff, but you’ll need to do it away from his body or the initial blast can still knock you down or damage you regardless.\n![Wukong Shigandang 10.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/ab/Wukong_Shigandang_10.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a battle scene from the game *Black Myth: Wukong*, showing the player character, Wukong, engaging the Shigandang, a large, rocky boss enemy. The Shigandang is performing or recovering from an attack, with debris scattered around the arena. The preceding and following text warns players about the boss's dangerous area-of-effect attacks, including a backward elbow drop and a shockwave attack, emphasizing the need for strategic positioning and timing to avoid damage."
}