{
    "chunk_id": 60867066975,
    "source_file": "Chapter_1_Secret_-_Ancient_Guanyin_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/19/Wukong_Guanyin_4.jpg",
    "alt_text": "Wukong Guanyin 4.jpg",
    "position_desc": 6,
    "img_above_text": "## Yaoguai King Boss Battle - Elder Jinchi\nIf you fought the Wandering Wight then the good news is you’ll have a good idea of what to expect in this fight, as he shares many of the same moves. That said, he does hit harder and can empower certain moves, so don’t assume this will be a cakewalk. You’ll want to have upgraded your staff after defeating the Whiteclad Noble to dish out more damage, and using the Wandering Wight’s Spirit on this guy can help tremendously.",
    "img_below_text": "The big twist on this fight that you’ll notice immediately is all the wandering bronze-colored corpses milling about the arena. The good news is they actually aren’t a threat — at least at first. This means you can focus on attacking the boss without worrying about one of them randomly clawing at you, but there’s more to it than that.\nThough you can’t directly target them, you can kill them with a single swipe of your staff. Doing so will actually cause their spirit to be directly absorbed, and heal you for a small amount. It’s not enough that you should be turning your back to the boss to seek them out exactly, but there are situations where you’ll need to distance yourself from Jinchi’s tremor and earthquake attacks that provide a pause in combat where you might as well hit one nearby to get a bit of your health restored. That’s not all these corpses do, but we’ll get to the rest in a bit.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Yaoguai King Boss Battle - Elder Jinchi\nIf you fought the Wandering Wight then the good news is you’ll have a good idea of what to expect in this fight, as he shares many of the same moves. That said, he does hit harder and can empower certain moves, so don’t assume this will be a cakewalk. You’ll want to have upgraded your staff after defeating the Whiteclad Noble to dish out more damage, and using the Wandering Wight’s Spirit on this guy can help tremendously.\"\n        - Following Text: \"The big twist on this fight that you’ll notice immediately is all the wandering bronze-colored corpses milling about the arena. The good news is they actually aren’t a threat — at least at first. This means you can focus on attacking the boss without worrying about one of them randomly clawing at you, but there’s more to it than that.\nThough you can’t directly target them, you can kill them with a single swipe of your staff. Doing so will actually cause their spirit to be directly absorbed, and heal you for a small amount. It’s not enough that you should be turning your back to the boss to seek them out exactly, but there are situations where you’ll need to distance yourself from Jinchi’s tremor and earthquake attacks that provide a pause in combat where you might as well hit one nearby to get a bit of your health restored. That’s not all these corpses do, but we’ll get to the rest in a bit.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from a video game where the player character is facing the Yaoguai King, Elder Jinchi, in a boss battle. The arena is populated with bronze-colored corpses, which are initially non-threatening but can be killed to absorb their spirit and restore health. The player character is equipped with a staff, which is recommended to be upgraded for this fight. The image illustrates the strategic environment and elements involved in the battle, aligning with the guide's advice on managing the corpses and focusing on the boss."
}