{
    "chunk_id": 674484071717,
    "source_file": "Hundred-Eyed_Daoist_Master.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/af/Wukong_YellowFlower_81.jpg",
    "alt_text": "Wukong YellowFlower 81.jpg",
    "position_desc": 18,
    "img_above_text": "![Wukong YellowFlower 80.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9f/Wukong_YellowFlower_80.jpg)\nTo free yourself, you'll need to use the Weaver's Needle Vessel. It will take a moment to work so be prepared to dodge his next attack while the needle begins to shoot all around him.",
    "img_below_text": "Once it hits, he'll be knocked to the ground, the curse will be broken, and you'll get a massive opportunity to attack him with everything you've got! Still, don't expect him to go down without a fight after the stun wears off. He's got more tricks than ever, and is able to create huge blasts that can end the fight quickly if you don't react fast.\n![Wukong YellowFlower 87.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/70/Wukong_YellowFlower_87.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong YellowFlower 80.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9f/Wukong_YellowFlower_80.jpg)\nTo free yourself, you'll need to use the Weaver's Needle Vessel. It will take a moment to work so be prepared to dodge his next attack while the needle begins to shoot all around him.\"\n        - Following Text: \"Once it hits, he'll be knocked to the ground, the curse will be broken, and you'll get a massive opportunity to attack him with everything you've got! Still, don't expect him to go down without a fight after the stun wears off. He's got more tricks than ever, and is able to create huge blasts that can end the fight quickly if you don't react fast.\n![Wukong YellowFlower 87.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/70/Wukong_YellowFlower_87.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dramatic moment in *Black Myth: Wukong*, where the protagonist, Wukong, is seen leaping onto the \"Hundred-Eyed Daoist Master,\" a large humanoid enemy, in a field of yellow flowers. The HUD displays various abilities and consumables, such as \"Evil Repelling Medicament\" and \"Rock Solid,\" suggesting active combat preparation. The preceding and following text indicates that this scene occurs after using the Weaver's Needle Vessel to weaken the enemy, providing an opportunity for a powerful counterattack. The dialogue at the bottom hints at narrative context related to the needle's power."
}