{
    "chunk_id": 304916293592,
    "source_file": "Snowhill_Path_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9a/Wukong_Snowhill_36.jpg",
    "alt_text": "Wukong Snowhill 36.jpg",
    "position_desc": 35,
    "img_above_text": "That's pretty much all you can do in this area, so now you can head toward the ominous temple in the middle of the lake, only to be surprised by what appears to the lord of this land returning. They've got a back that seems to hold many surprises inside, and will share one with you - a mighty Yaoguai Queen!\n## Yaoguai Queen Boss Fight - Kang-Jin Loong",
    "img_below_text": "A majestic and terrifying Loong Dragon, Kang-Jin Loong will fly about the arena, making her a tricky foe to pin down. Even when she returns to a \"resting\" state, she'll usually be off the ground, and will regularly pull back her head out of reach. Expect her to deal a lot of shock damage, so stock up on shock-quelling medicine or you'll be taking double damage for a lot of this fight.\n![Wukong Snowhill 37.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9c/Wukong_Snowhill_37.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"That's pretty much all you can do in this area, so now you can head toward the ominous temple in the middle of the lake, only to be surprised by what appears to the lord of this land returning. They've got a back that seems to hold many surprises inside, and will share one with you - a mighty Yaoguai Queen!\n## Yaoguai Queen Boss Fight - Kang-Jin Loong\"\n        - Following Text: \"A majestic and terrifying Loong Dragon, Kang-Jin Loong will fly about the arena, making her a tricky foe to pin down. Even when she returns to a \"resting\" state, she'll usually be off the ground, and will regularly pull back her head out of reach. Expect her to deal a lot of shock damage, so stock up on shock-quelling medicine or you'll be taking double damage for a lot of this fight.\n![Wukong Snowhill 37.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9c/Wukong_Snowhill_37.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dramatic encounter between the player character, wielding a staff, and the Yaoguai Queen, Kang-Jin Loong, a majestic dragon-like boss in a snowy, mountainous arena. This scene is part of a boss fight in *Black Myth: Wukong*, where the player must contend with the dragon's aerial mobility and shock-based attacks. The setting emphasizes the challenge and grandeur of the battle."
}