{
    "chunk_id": 337826904658,
    "source_file": "Buddha%27s_Right_Hand.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/48/Wukong_MiddleHollow_54.jpg",
    "alt_text": "Wukong MiddleHollow 54.jpg",
    "position_desc": 5,
    "img_above_text": "![Wukong MiddleHollow 57.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0b/Wukong_MiddleHollow_57.jpg)\nIf it curls into a fist but doesn't raise up, watch for a gold glow to empower the hand as it punches around in a wide arch to try and trap you against the wall with.",
    "img_below_text": "At range, it can also charge up a magical dart that can't be deflected with your staff spin. There's a somewhat quick version where it performs a flicking motion, and a longer charged shot where an aura appears behind the hand.\nThankfully, there's ample opportunities to attack the hand after many of its attacks, but the fun is only just beginning.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong MiddleHollow 57.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0b/Wukong_MiddleHollow_57.jpg)\nIf it curls into a fist but doesn't raise up, watch for a gold glow to empower the hand as it punches around in a wide arch to try and trap you against the wall with.\"\n        - Following Text: \"At range, it can also charge up a magical dart that can't be deflected with your staff spin. There's a somewhat quick version where it performs a flicking motion, and a longer charged shot where an aura appears behind the hand.\nThankfully, there's ample opportunities to attack the hand after many of its attacks, but the fun is only just beginning.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a gameplay moment from *Black Myth: Wukong*, showcasing a boss fight against \"Buddha's Right Hand\" in a dimly lit cave environment. The player character is positioned mid-action, facing the large, glowing hand of the boss, which appears to be attacking with a magical dart. The preceding and following text describe the boss's attack patterns, including empowered punches and ranged magical attacks, while also noting opportunities for counterattacks."
}