{
    "chunk_id": 764166423344,
    "source_file": "Father_of_Stones.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c4/Woods_Ember_Walkthrough_%2854%29.png",
    "alt_text": "Woods Ember Walkthrough \\(54\\).png",
    "position_desc": 1,
    "img_above_text": "Father of Stones is a Yaoguai Chief you'll fight soon after you reach the Heights of Ember in Chapter 5 of Black Myth: Wukong.\n## How to Find Father of Stones",
    "img_below_text": "From the Heights of Ember Keeper's Shrine, continue toward the open space on the left. When you reach a certain point, the Father of Stones miniboss will jump over the wall near the door on the right.\n## Father of Stones Boss Fight and Guide",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Father of Stones is a Yaoguai Chief you'll fight soon after you reach the Heights of Ember in Chapter 5 of Black Myth: Wukong.\n## How to Find Father of Stones\"\n        - Following Text: \"From the Heights of Ember Keeper's Shrine, continue toward the open space on the left. When you reach a certain point, the Father of Stones miniboss will jump over the wall near the door on the right.\n## Father of Stones Boss Fight and Guide\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game *Black Myth: Wukong*, showing the player character approaching a small shrine with lit flames under a large, barren tree. The environment is rocky and shadowy, suggesting a foreboding atmosphere. A glowing marker, highlighted with a red outline, is visible in the distance, likely indicating a point of interest or the next objective. This setting aligns with the walkthrough's description of the area near the Heights of Ember, leading up to the encounter with the Father of Stones miniboss."
}