{
    "chunk_id": 322052048923,
    "source_file": "Webbed_Hollow_-_Lower_Hollow_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/42/Wukong_LowerHollow_8.jpg",
    "alt_text": "Wukong LowerHollow 8.jpg",
    "position_desc": 8,
    "img_above_text": "## Relief of the Fallen Loong\nAfter sneaking across the bridge (be sure to go back and grab the green Wisp only after you've taken out the archer), you'll find another exit from the Hollow leading to a lush cliffside path.",
    "img_below_text": "The area is chock-full of various plants to harvest, but you'll also find a bunch of Beetle Captains who appear to be doing the same. Since many of them have their backs turned as they scavenge, be sure to sneak up and charge up your focus points to deliver a big heavy attack.\n![Wukong LowerHollow 9.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/be/Wukong_LowerHollow_9.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Relief of the Fallen Loong\nAfter sneaking across the bridge (be sure to go back and grab the green Wisp only after you've taken out the archer), you'll find another exit from the Hollow leading to a lush cliffside path.\"\n        - Following Text: \"The area is chock-full of various plants to harvest, but you'll also find a bunch of Beetle Captains who appear to be doing the same. Since many of them have their backs turned as they scavenge, be sure to sneak up and charge up your focus points to deliver a big heavy attack.\n![Wukong LowerHollow 9.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/be/Wukong_LowerHollow_9.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a lush, forested area with vibrant greenery and scattered plants, consistent with the cliffside path described in the text. The player character, armed with a glowing staff, is positioned in the foreground, seemingly ready for action. In the background, a Beetle Captain is visible, likely one of the scavenging enemies mentioned in the following text. The interface indicates the player has collected \"Licorice x1,\" suggesting the area is rich in harvestable items. This scene emphasizes exploration, resource gathering, and stealth combat opportunities."
}