{
    "chunk_id": 333559373802,
    "source_file": "Venom_Daoist.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/af/Wukong_UpperHollow_XX.jpg",
    "alt_text": "Wukong UpperHollow XX.jpg",
    "position_desc": 8,
    "img_above_text": "Attack his back when you can either by Immobilizing him or using Spirit Attacks for large area of effect hits, and you'll actually be able to start tearing apart his extra limbs, dealing massive damage in the process.\nWhen he starts to complain about this, be ready for more quick dashes as a retaliation strike. Still, he's not too great at adapting, since his attack with two jump slams will still cause him to expose his back when his swords are buried in the ground.",
    "img_below_text": "When he starts getting low on health, expect him to get more desperate, throwing more sword slices into his combos. If you see him roll over himself at a distance, he'll slide at you foot first, but then vanish for a moment to appear straightened up before lashing out at you with a leap. Don't bother avoiding the slide, and just prepare to deflect his leap when he reappears.\n![Wukong UpperHollow 43.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2d/Wukong_UpperHollow_43.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Attack his back when you can either by Immobilizing him or using Spirit Attacks for large area of effect hits, and you'll actually be able to start tearing apart his extra limbs, dealing massive damage in the process.\nWhen he starts to complain about this, be ready for more quick dashes as a retaliation strike. Still, he's not too great at adapting, since his attack with two jump slams will still cause him to expose his back when his swords are buried in the ground.\"\n        - Following Text: \"When he starts getting low on health, expect him to get more desperate, throwing more sword slices into his combos. If you see him roll over himself at a distance, he'll slide at you foot first, but then vanish for a moment to appear straightened up before lashing out at you with a leap. Don't bother avoiding the slide, and just prepare to deflect his leap when he reappears.\n![Wukong UpperHollow 43.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2d/Wukong_UpperHollow_43.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat encounter from the video game *Black Myth: Wukong*. The player character, armed with a glowing staff, faces an enemy named \"Venom Daoist,\" whose health bar is visible at the bottom of the screen. The setting appears to be a dark, eerie area with skeletal remains scattered on the ground and a traditional building in the background. The preceding and following text suggests strategies for defeating the enemy, emphasizing attacking its back, deflecting its leap, and preparing for its increasingly desperate attacks as its health diminishes."
}