{
    "chunk_id": 998455240212,
    "source_file": "Webbed_Hollow_-_Middle_Hollow_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7b/Wukong_MiddleHollow_51.jpg",
    "alt_text": "Wukong MiddleHollow 51.jpg",
    "position_desc": 49,
    "img_above_text": "Talk to the Horse Guai some more to learn more of his story, and then head through the rest of the cocoon field, dealing with a few more Amourworms as you go.\nAfter climbing the path and leaving the cocoon field and Amourworms behind, you'll find another cave-like tunnel with the Cliff of Oblivion Shrine ahead.",
    "img_below_text": "Be sure to turn around before you reach the shrine, and you'll find another Purple Talisman Altar, so be sure to collect a second talisman by interacting with it.\nJust past the altar, you can find a small house with a **Treasure Chest** in the front that holds materials like a Blood of the Iron Bull, and two Wasp Guais hiding around the sides.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Talk to the Horse Guai some more to learn more of his story, and then head through the rest of the cocoon field, dealing with a few more Amourworms as you go.\nAfter climbing the path and leaving the cocoon field and Amourworms behind, you'll find another cave-like tunnel with the Cliff of Oblivion Shrine ahead.\"\n        - Following Text: \"Be sure to turn around before you reach the shrine, and you'll find another Purple Talisman Altar, so be sure to collect a second talisman by interacting with it.\nJust past the altar, you can find a small house with a **Treasure Chest** in the front that holds materials like a Blood of the Iron Bull, and two Wasp Guais hiding around the sides.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from a video game where the player character, wielding a fiery weapon, stands near a Purple Talisman Altar (highlighted with a red arrow) and a small house with a Treasure Chest (circled in red). This area is part of the journey after leaving the cocoon field and encountering the Cliff of Oblivion Shrine. Players are prompted to interact with the altar to collect a talisman and explore the house for materials and hidden enemies."
}