{
    "chunk_id": 428545989703,
    "source_file": "Foothills_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d3/Foothills_Walkthrough_.png",
    "alt_text": "Foothills Walkthrough .png",
    "position_desc": 27,
    "img_above_text": "The biggest issue is the poison attacks, and it's essential to interrupt them as often as you can. The Plantain Fan can prove invaluable here once again, especially if you deploy it just before a poison attack. It will push the Poison Chief back and allow you to follow up with attacks. Use Immobilize when the Plantain Fan has stopped working, to keep it in place and deplete its health as quickly as possible.\nPoison Chief 1",
    "img_below_text": "When the Poison Chief is down, fly up and continue left toward the water. Go almost to the end of the water, where you should see a giant creature. When you get close to it, it will leap in the air and jump to a nearby rock. Fly over to it, then land on its head.\n### Yaoguai Chief - Feng-Tail General",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The biggest issue is the poison attacks, and it's essential to interrupt them as often as you can. The Plantain Fan can prove invaluable here once again, especially if you deploy it just before a poison attack. It will push the Poison Chief back and allow you to follow up with attacks. Use Immobilize when the Plantain Fan has stopped working, to keep it in place and deplete its health as quickly as possible.\nPoison Chief 1\"\n        - Following Text: \"When the Poison Chief is down, fly up and continue left toward the water. Go almost to the end of the water, where you should see a giant creature. When you get close to it, it will leap in the air and jump to a nearby rock. Fly over to it, then land on its head.\n### Yaoguai Chief - Feng-Tail General\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character flying on a cloud above a lush, mountainous landscape with cliffs and a water-filled area below. A red arrow points toward a specific location near the water, likely indicating the next destination in the walkthrough. Based on the context, this scene follows the defeat of the Poison Chief and guides the player to approach a giant creature near the water, which will leap onto a nearby rock. The image serves as a visual aid to direct the player toward the next objective in the game."
}