{
    "chunk_id": 777183931276,
    "source_file": "Celestial_Nonary_Pill_Locations.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/aa/The_New_West_Nonary.jpg",
    "alt_text": "The New West Nonary.jpg",
    "position_desc": 4,
    "img_above_text": "## The New West Celestial Nonary Pill\nThe New West Celestial Nonary Pill",
    "img_below_text": "This Nonary Pill is on the grounds of the New Thunderclap Temple. Once you enter the temple grounds, run straight through the second entrance and take the stairs on the left. Head into the building on the left and run up the stairs inside to reach the second story. Continue up the steps behind the building and turn right. There, you will see a large frozen pond. The pill chest is sitting on a table in the pond.\n## The Webbed Hollow Celestial Nonary Pill",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## The New West Celestial Nonary Pill\nThe New West Celestial Nonary Pill\"\n        - Following Text: \"This Nonary Pill is on the grounds of the New Thunderclap Temple. Once you enter the temple grounds, run straight through the second entrance and take the stairs on the left. Head into the building on the left and run up the stairs inside to reach the second story. Continue up the steps behind the building and turn right. There, you will see a large frozen pond. The pill chest is sitting on a table in the pond.\n## The Webbed Hollow Celestial Nonary Pill\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from a video game where the player character, wielding a fiery staff, stands near a table on a frozen pond. The table holds an interactable chest labeled \"RT Open,\" suggesting the player can open it. This location aligns with the preceding and following text, which describes the quest to find the New West Celestial Nonary Pill at the New Thunderclap Temple. The chest likely contains the pill, as part of the walkthrough instructions."
}