{
    "chunk_id": 668604316136,
    "source_file": "Macaque_Chief.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/df/Wukong_Pagoda_123.jpg",
    "alt_text": "Wukong Pagoda 123.jpg",
    "position_desc": 10,
    "img_above_text": "Macaque Chief (Snowhill Path)\n### Second Encounter - Warding Temple",
    "img_below_text": "When you fight him a second time, he'll largely have the same moves, but as an added bonus for this fight, you can actually use the Ancient Master's circle of fire to your own advantage, as the Macaque Chief can't move through it. If you ever see him preparing for a big series of slashes or need to get away and heal simply move to the opposite side of the circle, and his attacks won't reach you.\nMacaque Chief (Warding Temple)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Macaque Chief (Snowhill Path)\n### Second Encounter - Warding Temple\"\n        - Following Text: \"When you fight him a second time, he'll largely have the same moves, but as an added bonus for this fight, you can actually use the Ancient Master's circle of fire to your own advantage, as the Macaque Chief can't move through it. If you ever see him preparing for a big series of slashes or need to get away and heal simply move to the opposite side of the circle, and his attacks won't reach you.\nMacaque Chief (Warding Temple)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a battle scene from a video game where the player is facing the Macaque Chief during their second encounter at the Warding Temple. The glowing circle of fire, referred to as the Ancient Master's circle, is a key gameplay element that the player can use strategically to avoid the boss's attacks. The surrounding snowy environment and temple architecture set the stage for the encounter, while the game's interface displays health bars, abilities, and controls."
}