{
    "chunk_id": 484520078159,
    "source_file": "Valley_of_Ecstasy_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/80/Wukong_Karma_12.jpg",
    "alt_text": "Wukong Karma 12.jpg",
    "position_desc": 91,
    "img_above_text": "![Wukong Karma 18.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/94/Wukong_Karma_18.jpg)\nThey behave much in the same way as regular Ginsenglings do, moving slightly faster than the boss, which can help you lure them away from his attacks. Prioritize taking them out first so you don't get blindsided later, and try the Ashen Slumber transformation spell to detonate yourself near them, or use Spirit Attacks with wide reaches.",
    "img_below_text": "Stick to staying in safe spots to keep using Thrust Stance out of the range of his roots, or Pillar Stance above him, and look for his many openings when he tumbles to the ground to press the attack, and he'll fall before long, granting you both the **Old Ginseng Guai Spirit** , Millenium Ginseng Seeds to give to Chen Loong, and the **Ginseng Cape** to wear.\nOld Ginseng Guai",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Karma 18.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/94/Wukong_Karma_18.jpg)\nThey behave much in the same way as regular Ginsenglings do, moving slightly faster than the boss, which can help you lure them away from his attacks. Prioritize taking them out first so you don't get blindsided later, and try the Ashen Slumber transformation spell to detonate yourself near them, or use Spirit Attacks with wide reaches.\"\n        - Following Text: \"Stick to staying in safe spots to keep using Thrust Stance out of the range of his roots, or Pillar Stance above him, and look for his many openings when he tumbles to the ground to press the attack, and he'll fall before long, granting you both the **Old Ginseng Guai Spirit** , Millenium Ginseng Seeds to give to Chen Loong, and the **Ginseng Cape** to wear.\nOld Ginseng Guai\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a gameplay moment from *Black Myth: Wukong*, showcasing a battle between the player character and the boss \"Old Ginseng Guai\" in a snowy forest environment. The player is mid-attack, using a polearm weapon, while the boss, a large humanoid creature with plant-like features, is recoiling. The health bar at the bottom indicates the boss's remaining health. The preceding and following text provide strategies for defeating the boss, such as targeting smaller enemies first and exploiting the boss's vulnerabilities during specific attack patterns."
}