{
    "chunk_id": 155488182695,
    "source_file": "Bamboo_Grove_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/48/Wukong_Bamboo_54.jpg",
    "alt_text": "Wukong Bamboo 54.jpg",
    "position_desc": 48,
    "img_above_text": "In addition to this, he can twirl his spear above his head, summoning water above it before slamming it down, sending a straight line of water right at you that you can dodge to the side to avoid.\nBeyond that, the rest of the second phase of this fight will come down to anticipating how his body twists before he unleashes his sweep attacks. Keep close and aggressive to dodge around to his sides, using your spells to amplify your attacks, and looking for the right moment to invoke your Spirit Attacks (the Wandering Wight is still a good choice when he’s stationary to flatten him).",
    "img_below_text": "Defeat him to earn a **Jade Fang** , and he’ll concede, revealing he was only feigning loyalty to the king of this mountain to learn more. He’ll also drop a helpful nugget of wisdom as he departs, mentioning though the temple lies in cinders, the Elder’s soul endures, and asks if you’ve seen the three bells.\nWhiteclad Noble",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"In addition to this, he can twirl his spear above his head, summoning water above it before slamming it down, sending a straight line of water right at you that you can dodge to the side to avoid.\nBeyond that, the rest of the second phase of this fight will come down to anticipating how his body twists before he unleashes his sweep attacks. Keep close and aggressive to dodge around to his sides, using your spells to amplify your attacks, and looking for the right moment to invoke your Spirit Attacks (the Wandering Wight is still a good choice when he’s stationary to flatten him).\"\n        - Following Text: \"Defeat him to earn a **Jade Fang** , and he’ll concede, revealing he was only feigning loyalty to the king of this mountain to learn more. He’ll also drop a helpful nugget of wisdom as he departs, mentioning though the temple lies in cinders, the Elder’s soul endures, and asks if you’ve seen the three bells.\nWhiteclad Noble\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a serene, lush environment with a waterfall cascading down rocky terrain, a temple partially visible on the left, and two characters standing near the water. The text at the bottom of the image reads, \"The Guanyin Temple now lies in cinders, yet the Elder's soul endures.\" This suggests a narrative moment where the player learns about the temple's destruction and the enduring spirit of an Elder, aligning with the context of a significant revelation or plot point in the game."
}