{
    "chunk_id": 785243753082,
    "source_file": "Black_Wind_Cave_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/df/Wukong_BlackWind_17.jpg",
    "alt_text": "Wukong BlackWind 17.jpg",
    "position_desc": 16,
    "img_above_text": "![Wukong BlackWind 16.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/99/Wukong_BlackWind_16.jpg)\nAfter his next Black Wind assault, be ready to transform using the Red Tides Spell, and charge up a dash attack the moment he lands in the center of the arena, and use it and the transformation spell’s pogo attack to perform a massive hit once you catch him after a teleport.",
    "img_below_text": "Counter each of his teleports when his attacks complete, and you’ll soon defeat the Yaoguai King, forcing him to retreat as he yells for you to face his true form at the top of the mountain. However, in his retreat, he’ll leave behind some of his Black Wind, which the Keeper of the Mountain will harness and pass onto you, giving you a brand new spell: **Cloud Step**.\nBlack Wind King",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong BlackWind 16.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/99/Wukong_BlackWind_16.jpg)\nAfter his next Black Wind assault, be ready to transform using the Red Tides Spell, and charge up a dash attack the moment he lands in the center of the arena, and use it and the transformation spell’s pogo attack to perform a massive hit once you catch him after a teleport.\"\n        - Following Text: \"Counter each of his teleports when his attacks complete, and you’ll soon defeat the Yaoguai King, forcing him to retreat as he yells for you to face his true form at the top of the mountain. However, in his retreat, he’ll leave behind some of his Black Wind, which the Keeper of the Mountain will harness and pass onto you, giving you a brand new spell: **Cloud Step**.\nBlack Wind King\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dynamic moment from *Black Myth: Wukong*, showcasing the protagonist mid-combat, wielding a glowing staff while in a spectral or transformed state. This scene aligns with the walkthrough's description of using the Red Tides Spell and transformation abilities to execute a powerful attack during the battle against the Black Wind King. The glowing effects and motion emphasize the intensity of the fight."
}