{
    "chunk_id": 357098328978,
    "source_file": "Twin_Serpents_Staff.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0a/Twin_Serpents_Staff_2.jpg",
    "alt_text": "Twin Serpents Staff 2.jpg",
    "position_desc": 1,
    "img_above_text": "The Twin Serpents Staff is an Uncommon weapon in Black Myth: Wukong. It comes with slightly improved stats compared to the Willow Wood Staff you are given at the beginning of the game. This will likely be your weapon of choice for most of the early game before you switch out to one of the other Weapons in Chapter 2 and beyond.\nThe weapon has a 40 damage stat, with no bonus critical hit chance. One perk of it over other weapons, however, is its unique effect. With the Twin Serpents Staff equipped, your light attack damage combo finishers have increased damage (by a moderate amount). When you are fighting in water, this effect is enhanced even more, making it a great weapon for the first chapter.",
    "img_below_text": "## Black Myth: Wukong Twin Serpents Staff Location\nThe Twin Serpents Staff can be found in Chapter 1 - Black Wind Mountain upon defeating Whiteclad Noble in Bamboo Grove. This is a mandatory boss, so you can't miss him.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Twin Serpents Staff is an Uncommon weapon in Black Myth: Wukong. It comes with slightly improved stats compared to the Willow Wood Staff you are given at the beginning of the game. This will likely be your weapon of choice for most of the early game before you switch out to one of the other Weapons in Chapter 2 and beyond.\nThe weapon has a 40 damage stat, with no bonus critical hit chance. One perk of it over other weapons, however, is its unique effect. With the Twin Serpents Staff equipped, your light attack damage combo finishers have increased damage (by a moderate amount). When you are fighting in water, this effect is enhanced even more, making it a great weapon for the first chapter.\"\n        - Following Text: \"## Black Myth: Wukong Twin Serpents Staff Location\nThe Twin Serpents Staff can be found in Chapter 1 - Black Wind Mountain upon defeating Whiteclad Noble in Bamboo Grove. This is a mandatory boss, so you can't miss him.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image showcases the in-game equipment menu from *Black Myth: Wukong*, highlighting the \"Twin Serpents Staff,\" an Uncommon weapon with a base attack stat of 40. The weapon's unique effect moderately boosts light attack combo finisher damage, with a significant enhancement when fighting in water. The image emphasizes the weapon's stats, description, and its visual design, aligning with the preceding and following text that details its early-game utility and acquisition in Chapter 1."
}