{
    "chunk_id": 101665009167,
    "source_file": "Valley_of_Ecstasy_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c5/Wukong_Brook_1.jpg",
    "alt_text": "Wukong Brook 1.jpg",
    "position_desc": 41,
    "img_above_text": "Since the main path down below leads on to the Longevity Road, we'll instead head to the right side of the Forest Shrine where a hilltop is teeming with a few praying Frozen Corpses and various plants to harvest. There are two paths here -- one before the shrine, and one after the archway where the Fox Guai spoke to you, and both lead down to the next sub-region.\n## Brook of Bliss",
    "img_below_text": "There are two easy paths to take down to the Brook of Bliss: one right next to the Forest Shrine, and one a bit further up along the main path. Both paths are lined with various Frozen Corpses and likely a Cyan Bat or two hiding up in the trees.\n![Wukong Brook 2.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ee/Wukong_Brook_2.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Since the main path down below leads on to the Longevity Road, we'll instead head to the right side of the Forest Shrine where a hilltop is teeming with a few praying Frozen Corpses and various plants to harvest. There are two paths here -- one before the shrine, and one after the archway where the Fox Guai spoke to you, and both lead down to the next sub-region.\n## Brook of Bliss\"\n        - Following Text: \"There are two easy paths to take down to the Brook of Bliss: one right next to the Forest Shrine, and one a bit further up along the main path. Both paths are lined with various Frozen Corpses and likely a Cyan Bat or two hiding up in the trees.\n![Wukong Brook 2.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ee/Wukong_Brook_2.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a snowy forest setting from the game *Black Myth: Wukong*, where the player character, armed with a staff, is engaged in combat with a Frozen Corpse enemy. The interface shows health and ability icons, suggesting active gameplay. This scene aligns with the walkthrough's description of exploring paths near the Forest Shrine, encountering Frozen Corpses, and progressing toward the Brook of Bliss."
}