{
    "chunk_id": 688637654025,
    "source_file": "Pungent_Flesh_Chunk.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5e/Pungent_Flesh_Chunk.jpg",
    "alt_text": "Pungent Flesh Chunk.jpg",
    "position_desc": 1,
    "img_above_text": "# Pungent Flesh Chunk\nThe Pungent Flesh Chunk is one of the Key Items you can find in Yellow Wind Ridge during Chapter 2. It is unmissable as it is dropped from the mandatory boss: King of Flowing Sand and Second Rat Prince in Sandgate Village - Valley of Despair.",
    "img_below_text": "The item is of a Legendary rarity as it is important to obtaining another Key Item, specifically the Loong Scales, which will allow you to access a number of secret areas and secret bosses.\nAs with most Key Items in the game, however, you may be wondering where to use the Pungent Flesh Chunk. Thankfully you won't have to stray too far from where you obtained it.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"# Pungent Flesh Chunk\nThe Pungent Flesh Chunk is one of the Key Items you can find in Yellow Wind Ridge during Chapter 2. It is unmissable as it is dropped from the mandatory boss: King of Flowing Sand and Second Rat Prince in Sandgate Village - Valley of Despair.\"\n        - Following Text: \"The item is of a Legendary rarity as it is important to obtaining another Key Item, specifically the Loong Scales, which will allow you to access a number of secret areas and secret bosses.\nAs with most Key Items in the game, however, you may be wondering where to use the Pungent Flesh Chunk. Thankfully you won't have to stray too far from where you obtained it.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image shows the inventory screen from a video game, featuring the \"Pungent Flesh Chunk,\" a Legendary Key Item. The item's description notes that it is flesh torn from a foe, emitting a pungent odor that may attract yaoguais (mythical creatures). The item is significant to the game's narrative, as it is required to obtain the \"Loong Scales,\" which unlock secret areas and bosses. The preceding and following text emphasizes its importance and hints at its nearby usage after being acquired from a mandatory boss encounter."
}