{
    "chunk_id": 426192501735,
    "source_file": "Foothills_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/98/Foothills_Walkthrough_%28119%29.png",
    "alt_text": "Foothills Walkthrough \\(119\\).png",
    "position_desc": 17,
    "img_above_text": "From the edge of the cliff, look straight down to see a pool of water. Go down and to the center of this water to fight our first optional boss, Jiao-Loong of Waves.\n### Yaoguai Chief - Jiao-Loong of Waves",
    "img_below_text": "Jiao-Loong of Waves has a limited moveset, so you can quickly pick up on the attack patterns. It will mainly use its tale to try and whip you, either by spinning or flipping around to catch you with it.\n![Foothills Walkthrough \\(112\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f1/Foothills_Walkthrough_%28112%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"From the edge of the cliff, look straight down to see a pool of water. Go down and to the center of this water to fight our first optional boss, Jiao-Loong of Waves.\n### Yaoguai Chief - Jiao-Loong of Waves\"\n        - Following Text: \"Jiao-Loong of Waves has a limited moveset, so you can quickly pick up on the attack patterns. It will mainly use its tale to try and whip you, either by spinning or flipping around to catch you with it.\n![Foothills Walkthrough \\(112\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f1/Foothills_Walkthrough_%28112%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dramatic encounter between the player character and the optional boss, Jiao-Loong of Waves, in the video game *Black Myth: Wukong*. Set in a reflective pool of water surrounded by rocky cliffs, the boss—a serpentine, dragon-like creature adorned with a green necklace—looms menacingly over the player. This scene aligns with the walkthrough's guidance to descend to the pool and engage in combat with Jiao-Loong, whose attack patterns primarily involve tail-based strikes."
}