{
    "chunk_id": 376096955734,
    "source_file": "Pagoda_Realm_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/de/Wukong_Pagoda_68.jpg",
    "alt_text": "Wukong Pagoda 68.jpg",
    "position_desc": 65,
    "img_above_text": "Stepping outside, you can see a long path down the left leading up and out of the prison at the far end, but walking the path is another tough Red-Haired Yaksha to deal with first.\nBe wary of ambushes from Frozen Corpses that will try to hamper your battles with the Red-Haired Yaksha, and engage them cautiously when you feel like you have the upper hand. Once he's out of the way, grab the green Wisp and then head up the broken wooden ramp.",
    "img_below_text": "After you defeat the lone archer guarding the ramp up out of the prison, you may notice any current curse applied to you will dissipate the moment you reach the top! You can celebrate this breath of fresh air, just be wary of a Frozen Corpse waiting to try and attack you as you cross the last wooden beam.\n![Wukong Pagoda 69.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f9/Wukong_Pagoda_69.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Stepping outside, you can see a long path down the left leading up and out of the prison at the far end, but walking the path is another tough Red-Haired Yaksha to deal with first.\nBe wary of ambushes from Frozen Corpses that will try to hamper your battles with the Red-Haired Yaksha, and engage them cautiously when you feel like you have the upper hand. Once he's out of the way, grab the green Wisp and then head up the broken wooden ramp.\"\n        - Following Text: \"After you defeat the lone archer guarding the ramp up out of the prison, you may notice any current curse applied to you will dissipate the moment you reach the top! You can celebrate this breath of fresh air, just be wary of a Frozen Corpse waiting to try and attack you as you cross the last wooden beam.\n![Wukong Pagoda 69.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f9/Wukong_Pagoda_69.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character in *Black Myth: Wukong* ascending a snowy, broken wooden ramp while under attack from an archer positioned above. The scene aligns with the guide's description of navigating out of the prison area, where players must defeat enemies, including a lone archer guarding the ramp. The environment features rugged cliffs and a statue visible at the top, emphasizing the perilous climb and the game's atmospheric design."
}