{
    "chunk_id": 177866597743,
    "source_file": "The_Stone_Monkey.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/cb/Water_Curtain_Cave_Walkthrough_%2835%29.png",
    "alt_text": "Water Curtain Cave Walkthrough \\(35\\).png",
    "position_desc": 30,
    "img_above_text": "![Water Curtain Cave Walkthrough \\(32\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/dd/Water_Curtain_Cave_Walkthrough_%2832%29.png)\nWhen the Stone Monkey's health bar has been depleted, he'll face off still against The Destined One. A cutscene will see the Destined One hold his own against the giant monkey, sending our duplicates to put an end to the creature.",
    "img_below_text": "As it staggers back and breaks down into stone, electricity will form around it and the Great Sage's Broken Shell will appear. Despite going straight into this fight from the Stone Monkey, all your Spells, Gourd uses, and health will be replenished.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Water Curtain Cave Walkthrough \\(32\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/dd/Water_Curtain_Cave_Walkthrough_%2832%29.png)\nWhen the Stone Monkey's health bar has been depleted, he'll face off still against The Destined One. A cutscene will see the Destined One hold his own against the giant monkey, sending our duplicates to put an end to the creature.\"\n        - Following Text: \"As it staggers back and breaks down into stone, electricity will form around it and the Great Sage's Broken Shell will appear. Despite going straight into this fight from the Stone Monkey, all your Spells, Gourd uses, and health will be replenished.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dramatic scene from the game *Black Myth: Wukong*, showing the protagonist, The Destined One, alongside duplicates or allies in a misty, atmospheric environment with twisted, surreal trees in the background. This moment follows the depletion of the Stone Monkey's health bar, leading to a cutscene where The Destined One confronts the giant monkey and summons duplicates to aid in defeating it. The image sets the tone for the climactic battle and transition to the next phase of the narrative."
}