{
    "chunk_id": 196598635482,
    "source_file": "Xiang_River_Goddess_Gourd.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5b/Wukong_MiddleHollow_6.jpg",
    "alt_text": "Wukong MiddleHollow 6.jpg",
    "position_desc": 1,
    "img_above_text": "## Black Myth: Wukong Xiang River Goddess Gourd Location\nThe Xiang River Goddess Gourd can be found within The Verdure Bridge Shrine location in The Webbed Hollow. From the Shrine, follow the path towards the lanterns on the left. Head through the opening on the right by them and open one of the chests in the area to get the Gourd.",
    "img_below_text": "For even more guides and tips on finding all the Gourd customisation items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, Awaken Wine Worm locations, and Luoija Fragrant Vine locations.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Black Myth: Wukong Xiang River Goddess Gourd Location\nThe Xiang River Goddess Gourd can be found within The Verdure Bridge Shrine location in The Webbed Hollow. From the Shrine, follow the path towards the lanterns on the left. Head through the opening on the right by them and open one of the chests in the area to get the Gourd.\"\n        - Following Text: \"For even more guides and tips on finding all the Gourd customisation items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, Awaken Wine Worm locations, and Luoija Fragrant Vine locations.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from *Black Myth: Wukong* showing a player character in a web-covered cave area within The Webbed Hollow. Three chests, marked with red arrows, are visible in the environment. This aligns with the preceding text, which describes the location of the Xiang River Goddess Gourd in one of the chests near The Verdure Bridge Shrine. The image serves as a visual guide to help players locate the Gourd and highlights the interactive elements in the area."
}