{
    "chunk_id": 490550383101,
    "source_file": "How_to_Find_All_Buddha%27s_Eyes_Locations_and_Unlock_Secret_Boss.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/49/Wukong_Shigan_Secret1.jpg",
    "alt_text": "Wukong Shigan Secret1.jpg",
    "position_desc": 16,
    "img_above_text": "![Wukong Shigandang 1.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/eb/Wukong_Shigandang_1.jpg)\nIf you find yourself having trouble with the Stone Vanguard, it is possible to get some assistance from the Shigandang in an unexpected way!",
    "img_below_text": "If you haven't yet defeated the Stone Vanguard on your own but have found all six Buddha Eyeballs, you can actually summon the Shigandang before engaging the Stone Vanguard. When summoned early, he will arise and immediately fight with the Stone Vanguard. The good news is he's a lot tougher than the Stone Vanguard, and will perform a flashy finisher to tear the other rock Guai to pieces, giving you all the rewards!\nOf course, after defeating the Stone Vanguard, the Shigandang will immediately turn on you, and might be too tough to fight early if you were having problems defeating the Vanguard on your own!",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Shigandang 1.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/eb/Wukong_Shigandang_1.jpg)\nIf you find yourself having trouble with the Stone Vanguard, it is possible to get some assistance from the Shigandang in an unexpected way!\"\n        - Following Text: \"If you haven't yet defeated the Stone Vanguard on your own but have found all six Buddha Eyeballs, you can actually summon the Shigandang before engaging the Stone Vanguard. When summoned early, he will arise and immediately fight with the Stone Vanguard. The good news is he's a lot tougher than the Stone Vanguard, and will perform a flashy finisher to tear the other rock Guai to pieces, giving you all the rewards!\nOf course, after defeating the Stone Vanguard, the Shigandang will immediately turn on you, and might be too tough to fight early if you were having problems defeating the Vanguard on your own!\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game \"Black Myth: Wukong,\" showing the protagonist, Wukong, facing off against the Stone Vanguard, a large rock-like creature. The context provided explains that players can summon the Shigandang to assist in defeating the Stone Vanguard if they have collected all six Buddha Eyeballs. The Shigandang is stronger and will perform a finisher move to defeat the Stone Vanguard, but will then turn on the player."
}