{
    "chunk_id": 50095390846,
    "source_file": "How_to_Unlock_the_Zodiac_Village_and_Upgrade_Armor_.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/ba/Challenge_Yin_Tiger_.png",
    "alt_text": "Challenge Yin Tiger .png",
    "position_desc": 8,
    "img_above_text": "* Celestial Ribbon\n## Challenge Yin Tiger",
    "img_below_text": "As mentioned, one of the options is to challenge Yin Tiger, which will end up in an intense fight between the two of you. It can be a tough battle, especially as he uses both wind and fire and performs a range of heavy attacks.\nWhen you manage to beat him, however, you'll be able to unlock a few rewards:",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"* Celestial Ribbon\n## Challenge Yin Tiger\"\n        - Following Text: \"As mentioned, one of the options is to challenge Yin Tiger, which will end up in an intense fight between the two of you. It can be a tough battle, especially as he uses both wind and fire and performs a range of heavy attacks.\nWhen you manage to beat him, however, you'll be able to unlock a few rewards:\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a tense moment from a video game where the player character, equipped with a staff and ornate armor, is engaged in combat with a large, imposing enemy wielding a massive sword. The setting is a forested area with a stream, adding to the atmospheric intensity of the encounter. This scene aligns with the guide's context of challenging \"Yin Tiger,\" a formidable foe known for using wind and fire attacks, as part of a high-stakes battle."
}