{
    "chunk_id": 451371398744,
    "source_file": "Celestial_Nonary_Pill_Locations.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fa/Nonary_Xy_Dog.jpg",
    "alt_text": "Nonary Xy Dog.jpg",
    "position_desc": 3,
    "img_above_text": "## Xu-Dog Celestial Nonary Pill\nXu-Dog Celestial Nonary Pill",
    "img_below_text": "Fall down the sand slide after exploring the Crouching Tiger Temple Cellar to meet the Xu-Dog. The Xu-Dog crafts Celestial Medicines for you in exchange for Mind Cores. You can craft a total of nine Celestial Nonary Pills with the Xu-Dog. You can find Mind Cores in chests or as loot for defeating particularly vicious foes.\n## The New West Celestial Nonary Pill",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Xu-Dog Celestial Nonary Pill\nXu-Dog Celestial Nonary Pill\"\n        - Following Text: \"Fall down the sand slide after exploring the Crouching Tiger Temple Cellar to meet the Xu-Dog. The Xu-Dog crafts Celestial Medicines for you in exchange for Mind Cores. You can craft a total of nine Celestial Nonary Pills with the Xu-Dog. You can find Mind Cores in chests or as loot for defeating particularly vicious foes.\n## The New West Celestial Nonary Pill\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image displays an in-game crafting menu for creating a \"Nonary Pill,\" a celestial medicine that permanently increases Maximum Stamina. The crafting requires 360 Will and 2 Mind Cores, with a maximum of 9 pills craftable. The menu highlights the player's current stats and the changes the pill will bring, alongside a character standing in a dimly lit environment. This scene aligns with the context of the Xu-Dog, who crafts Celestial Medicines in exchange for Mind Cores."
}