{
    "chunk_id": 801938457546,
    "source_file": "Black_Loong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/81/Wukong_BlackLoong_3.jpg",
    "alt_text": "Wukong BlackLoong 3.jpg",
    "position_desc": 8,
    "img_above_text": "With the Loong Scales, you'll be able to interact with the sandfall and remove it as a barrier, revealing a door behind it to take you into the Black Loong's lair.\n## Black Loong Boss Fight and Guide",
    "img_below_text": "The Black Loong is a fearsome dragon standing on two legs and wielding a pair of giant maces imbued with his electricity, which he can employ to create different kinds of shockwaves that deal incredible damage. Though you can face him early on in Chapter 2 once you find the Loong Scales, it’s recommended you wait until you’ve completed Chapter 2 or even started Chapter 3 before taking him on.\nIn particular, it’s a good idea to stock up on medicine to increase your shock resistance, and buy the Thunderbolt Horn Soak from the Shen Monkey as well.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"With the Loong Scales, you'll be able to interact with the sandfall and remove it as a barrier, revealing a door behind it to take you into the Black Loong's lair.\n## Black Loong Boss Fight and Guide\"\n        - Following Text: \"The Black Loong is a fearsome dragon standing on two legs and wielding a pair of giant maces imbued with his electricity, which he can employ to create different kinds of shockwaves that deal incredible damage. Though you can face him early on in Chapter 2 once you find the Loong Scales, it’s recommended you wait until you’ve completed Chapter 2 or even started Chapter 3 before taking him on.\nIn particular, it’s a good idea to stock up on medicine to increase your shock resistance, and buy the Thunderbolt Horn Soak from the Shen Monkey as well.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the Black Loong, a formidable dragon boss character from a video game. The Black Loong is shown wielding giant maces that emit electricity, which he uses to create damaging shockwaves. This image serves to visually introduce the Black Loong boss fight, which players encounter after using the Loong Scales to access his lair. The accompanying guide advises players to prepare adequately before facing this challenging opponent."
}