{
    "chunk_id": 705164833832,
    "source_file": "Foothills_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b3/Foothills_Walkthrough_%28138%29.png",
    "alt_text": "Foothills Walkthrough \\(138\\).png",
    "position_desc": 50,
    "img_above_text": "If he goes back into this state when you don't have the fan available, it's just a matter of hanging back and avoiding attacks until he changes back to red.\nLang-Baw-Baw",
    "img_below_text": "When you've beaten Lang-Baw-Baw, fly up again and look to the opposite side of the water. You'll see red trees in the distance, but it's the area on the right you'll want to go to first.\n### Yaoguai Chief - Poison Chief 3",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"If he goes back into this state when you don't have the fan available, it's just a matter of hanging back and avoiding attacks until he changes back to red.\nLang-Baw-Baw\"\n        - Following Text: \"When you've beaten Lang-Baw-Baw, fly up again and look to the opposite side of the water. You'll see red trees in the distance, but it's the area on the right you'll want to go to first.\n### Yaoguai Chief - Poison Chief 3\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a character flying on a cloud over a lush, forested landscape with rocky cliffs. A red arrow points toward a specific area on the ground, likely indicating the next destination or objective in the game. Based on the context, this scene follows the defeat of Lang-Baw-Baw and precedes exploration toward red trees and the Poison Chief encounter. The arrow suggests the player should head to the marked area first."
}