{
    "chunk_id": 674286544842,
    "source_file": "Bitter_Lake_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/dd/Wukong_Turtle_10.jpg",
    "alt_text": "Wukong Turtle 10.jpg",
    "position_desc": 10,
    "img_above_text": "![Wukong Turtle 9.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/dd/Wukong_Turtle_9.jpg)\nWhen appearing to float up above you, watch carefully if she summons an electrical imbued spike in her hand. She'll fly down close to throw it at the ground, and even if you dodge you'll need to watch for when it creates a tremor to explode the ground around it.",
    "img_below_text": "At around half health, she'll start to get madder, and teleport high up to summon several groups of electrical bolts that will fly out in small clusters to track you down. You can't deflect them with your staff, so either use Cloud Step or stick to dodging.\nAfter this, she'll trigger a thunderstorm that darkens the arena, filling you the area with static electricity and most likely giving you the Shocked status effect. Take a moment to use a Shock-Quelling medicine.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Turtle 9.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/dd/Wukong_Turtle_9.jpg)\nWhen appearing to float up above you, watch carefully if she summons an electrical imbued spike in her hand. She'll fly down close to throw it at the ground, and even if you dodge you'll need to watch for when it creates a tremor to explode the ground around it.\"\n        - Following Text: \"At around half health, she'll start to get madder, and teleport high up to summon several groups of electrical bolts that will fly out in small clusters to track you down. You can't deflect them with your staff, so either use Cloud Step or stick to dodging.\nAfter this, she'll trigger a thunderstorm that darkens the arena, filling you the area with static electricity and most likely giving you the Shocked status effect. Take a moment to use a Shock-Quelling medicine.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss battle in *Black Myth: Wukong*, featuring a snowy mountainous arena. The player character, armed with a fiery staff, faces off against a floating enemy surrounded by glowing electrical orbs. The preceding and following text describe the enemy's attack patterns, including summoning electrical spikes, creating ground tremors, and triggering thunderstorms that inflict the Shocked status effect. The battle requires precise dodging and the use of Shock-Quelling medicine to counter the effects of static electricity."
}