{
    "chunk_id": 705409533826,
    "source_file": "Secret_Bosses_in_Black_Myth_Wukong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d7/Buddhas_Eye_Secret_Boss_%2813%29.png",
    "alt_text": "Buddhas Eye Secret Boss \\(13\\).png",
    "position_desc": 3,
    "img_above_text": "Chapter 2 features a variety of secret bosses, with a few requiring Key Items to summon them. The Buddha's Eyeballs, Old-Rattle Drum, and Loong Scales are all important finds if you want to battle each hidden boss.\n## Shigandang",
    "img_below_text": "Grab yourself all 6 of the Buddha's Eyes in Fright Cliff and place them into the odd-looking rock near the Stone Vanguard. The result will be the emergence of Shigandang.\nShigandang",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Chapter 2 features a variety of secret bosses, with a few requiring Key Items to summon them. The Buddha's Eyeballs, Old-Rattle Drum, and Loong Scales are all important finds if you want to battle each hidden boss.\n## Shigandang\"\n        - Following Text: \"Grab yourself all 6 of the Buddha's Eyes in Fright Cliff and place them into the odd-looking rock near the Stone Vanguard. The result will be the emergence of Shigandang.\nShigandang\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts Shigandang, a secret boss in Chapter 2 of a video game. This formidable creature appears after players collect six Buddha's Eyes from Fright Cliff and place them into a specific rock near the Stone Vanguard. The image highlights Shigandang's intimidating, stone-like form in a rugged, mountainous environment."
}