{
    "chunk_id": 439357701395,
    "source_file": "Yellow_Loong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f7/Wukong_YellowLoong_7.jpg",
    "alt_text": "Wukong YellowLoong 7.jpg",
    "position_desc": 17,
    "img_above_text": "When he staggers back, follow up with a quick but damaging Spirit Attack to keep him staggered (something like the Earth Wolf can deal a lot if you get him cornered against a wall where you'll keep running into him), and then swap into a Transformation Spell to keep him on the defensive.\nTake care when using your Transformation Spells to maximize damage by not being too reckless, and conserve might and health by dodging anything he throws out. The Umbral Abyss is a good pick since you can attack right as you transform, and use the spell at full might to further stun and chill him.",
    "img_below_text": "Once you take off a good chunk of his health, the second \"phase\" will start, and things get extremely dangerous. It will begin when he stops fighting to charge up and release a blast of electricity around him.\nAfter he does this, he'll immediately fly at you low to the ground with a slash while imbued by electricity that is incredibly quick and hard to dodge -- and it only gets worse from here.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"When he staggers back, follow up with a quick but damaging Spirit Attack to keep him staggered (something like the Earth Wolf can deal a lot if you get him cornered against a wall where you'll keep running into him), and then swap into a Transformation Spell to keep him on the defensive.\nTake care when using your Transformation Spells to maximize damage by not being too reckless, and conserve might and health by dodging anything he throws out. The Umbral Abyss is a good pick since you can attack right as you transform, and use the spell at full might to further stun and chill him.\"\n        - Following Text: \"Once you take off a good chunk of his health, the second \"phase\" will start, and things get extremely dangerous. It will begin when he stops fighting to charge up and release a blast of electricity around him.\nAfter he does this, he'll immediately fly at you low to the ground with a slash while imbued by electricity that is incredibly quick and hard to dodge -- and it only gets worse from here.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a tense boss battle scene from a video game, featuring the player character facing off against an electrified enemy named \"Yellow Loong\" in a lush, forested environment. The player is preparing for combat, with visible health and ability meters, while the enemy is charging up a glowing, lightning-infused attack. This moment aligns with the guide's advice on using Spirit Attacks and Transformation Spells to stagger the boss, while warning of the upcoming second phase where the boss unleashes a powerful area attack and rapid follow-up moves."
}