{
    "chunk_id": 12826835640,
    "source_file": "Keeper_of_the_Flaming_Mountains_and_Yin-Yang_Fish.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fe/Furnace_Valley_Walkthrough_%2883%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(83\\).png",
    "position_desc": 1,
    "img_above_text": "After they discuss The Destined One obtaining the relics, the Keeper of the Flaming Mountains offers to care for Rakshashi, which Pingping protests. After he binds Pingping, Rakshashi is revealed to be Zhu Bajie transformed and it's time to take on the Keeper of the Flaming Mountains for yourself.\n## Keeper of the Flaming Mountains and Yin-Yang Fish Boss Fight and Guide",
    "img_below_text": "The Keeper of the Flaming Mountains will transport you to another place, in a monochrome illusion where he uses the power of yin-yang. Zhu Bajie will be there to help you at first, so focus on attacking the Keeper of the Flaming Mountains as quickly as you can. This is a two-phase fight, and as you might expect, the second phase is where the action really begins.\nIn the first phase, try to hold off on using your spells as much as you can. Instead, try to be aggressive and relentlessly attack the Keeper of the Flaming Mountains while he's on the ground.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"After they discuss The Destined One obtaining the relics, the Keeper of the Flaming Mountains offers to care for Rakshashi, which Pingping protests. After he binds Pingping, Rakshashi is revealed to be Zhu Bajie transformed and it's time to take on the Keeper of the Flaming Mountains for yourself.\n## Keeper of the Flaming Mountains and Yin-Yang Fish Boss Fight and Guide\"\n        - Following Text: \"The Keeper of the Flaming Mountains will transport you to another place, in a monochrome illusion where he uses the power of yin-yang. Zhu Bajie will be there to help you at first, so focus on attacking the Keeper of the Flaming Mountains as quickly as you can. This is a two-phase fight, and as you might expect, the second phase is where the action really begins.\nIn the first phase, try to hold off on using your spells as much as you can. Instead, try to be aggressive and relentlessly attack the Keeper of the Flaming Mountains while he's on the ground.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game where two characters, Zhu Bajie and another figure, are walking through a monochrome, reflective environment. This setting aligns with the narrative context of the Keeper of the Flaming Mountains transporting the player to an illusionary realm for the upcoming boss fight. The distant architectural structure and ominous atmosphere emphasize the transition to the yin-yang-themed battle."
}