{
    "chunk_id": 63056503051,
    "source_file": "Green-Capped_Martialist.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/df/Wukong_Karma_6.jpg",
    "alt_text": "Wukong Karma 6.jpg",
    "position_desc": 3,
    "img_above_text": "![Wukong Bitter 26.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f4/Wukong_Bitter_26.jpg)\nOnce you reach the shore, take a left when facing the Shrine and head past the area where Chen Loong is and through a gate to find a human being harassed by small Apramana Bats. Defeat them and talk to him to learn of his quest to find a treasure.",
    "img_below_text": "Once you reach the Valley of Ecstasy region, head along the main path through the Forest of Felicity and take a left down a slope to enter the Towers of Karma area. Search along the back of this sub-region to find the same Treasure Hunter freezing from the cold sitting in a large gnarled tree, left of the main Shrine in this area.\n![Wukong Karma 7.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e8/Wukong_Karma_7.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Bitter 26.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f4/Wukong_Bitter_26.jpg)\nOnce you reach the shore, take a left when facing the Shrine and head past the area where Chen Loong is and through a gate to find a human being harassed by small Apramana Bats. Defeat them and talk to him to learn of his quest to find a treasure.\"\n        - Following Text: \"Once you reach the Valley of Ecstasy region, head along the main path through the Forest of Felicity and take a left down a slope to enter the Towers of Karma area. Search along the back of this sub-region to find the same Treasure Hunter freezing from the cold sitting in a large gnarled tree, left of the main Shrine in this area.\n![Wukong Karma 7.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e8/Wukong_Karma_7.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a snowy, forested area with a large, gnarled tree at its center. A character, likely the protagonist, is approaching the tree while holding a staff. Nearby, a figure (the Treasure Hunter) is sitting against the tree, seemingly distressed and muttering, \"Fire. I need fire...\" This scene aligns with the narrative described in the following text, where the player encounters the Treasure Hunter freezing in the Towers of Karma area during their quest."
}