{
    "chunk_id": 448042834471,
    "source_file": "New_Thunderclap_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4a/Wukong_Thunderclap_57.jpg",
    "alt_text": "Wukong Thunderclap 57.jpg",
    "position_desc": 57,
    "img_above_text": "Head along the outer path past a Supporter Monk to a far building past the frozen waterfall. You can find a small gold pot at the base of the frozen falls here, but there are two Guardian Wolves overlooking it that you'll need to lure out and take care of first. Be wary you don't pull too far back down the frozen river and alert a Thunder Rhino Master on top of some rocks. After defeating them, open the pot to find a **Celestial Nonary Pill** to increase your stamina.\nThe New West Celestial Nonary Pill",
    "img_below_text": "Once you've claimed the pill, hop up the other side of the frozen river to fight the Clay Vajra. Follow the path around the frozen river past where several Censor Holders are praying before a Dual-Blade Monk, and you'll find a **Treasure Chest** in front of a large stone monument near where the frozen river leads to the bridge you ran across earlier.\nNow you can return back to the Main Plaza, and this time head up past where you defeated the other Clay Vajra for its Spirit, and enter the last part of the temple.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Head along the outer path past a Supporter Monk to a far building past the frozen waterfall. You can find a small gold pot at the base of the frozen falls here, but there are two Guardian Wolves overlooking it that you'll need to lure out and take care of first. Be wary you don't pull too far back down the frozen river and alert a Thunder Rhino Master on top of some rocks. After defeating them, open the pot to find a **Celestial Nonary Pill** to increase your stamina.\nThe New West Celestial Nonary Pill\"\n        - Following Text: \"Once you've claimed the pill, hop up the other side of the frozen river to fight the Clay Vajra. Follow the path around the frozen river past where several Censor Holders are praying before a Dual-Blade Monk, and you'll find a **Treasure Chest** in front of a large stone monument near where the frozen river leads to the bridge you ran across earlier.\nNow you can return back to the Main Plaza, and this time head up past where you defeated the other Clay Vajra for its Spirit, and enter the last part of the temple.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a snowy area in a video game, featuring a crouching player character armed with a spear, approaching a large stone monument. A red-dotted circle highlights a treasure chest near the monument, indicating an interactable object. This scene aligns with the guide's instructions to locate a **Treasure Chest** near a stone monument after navigating the frozen river and defeating enemies. The setting suggests a cautious approach to avoid detection or prepare for potential combat."
}