{
    "chunk_id": 313603356485,
    "source_file": "Cloud-Patterned_Stone_Staff.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/65/Cloud-Patterned_Stone_Staff_2.jpg",
    "alt_text": "Cloud-Patterned Stone Staff 2.jpg",
    "position_desc": 1,
    "img_above_text": "The Cloud-Patterned Stone Staff is a Rare weapon in Black Myth: Wukong. It comes with solid stats, damage, and a decent, albeit easily outbeaten unique effect compared to the other Weapons in the game.\nThe weapon comes with a respectable 60 damage, and the unique effect of making the fourth move of moderately increasing the damage executed by charged smash heavy attacks. It also has a bonus 30 Defense.",
    "img_below_text": "## Black Myth: Wukong Cloud-Patterned Stone Staff Location\nThe Cloud-Patterned Stone Staff can be found in Chapter 2 - Yellow Wind Ridge upon defeating Shigandang in Fright Cliff - Rock Clash Platform. You will need obtain all the Buddha Eyeballs items from the Fright Cliff area to activate the fight.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Cloud-Patterned Stone Staff is a Rare weapon in Black Myth: Wukong. It comes with solid stats, damage, and a decent, albeit easily outbeaten unique effect compared to the other Weapons in the game.\nThe weapon comes with a respectable 60 damage, and the unique effect of making the fourth move of moderately increasing the damage executed by charged smash heavy attacks. It also has a bonus 30 Defense.\"\n        - Following Text: \"## Black Myth: Wukong Cloud-Patterned Stone Staff Location\nThe Cloud-Patterned Stone Staff can be found in Chapter 2 - Yellow Wind Ridge upon defeating Shigandang in Fright Cliff - Rock Clash Platform. You will need obtain all the Buddha Eyeballs items from the Fright Cliff area to activate the fight.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image showcases the in-game menu screen of *Black Myth: Wukong*, specifically highlighting the \"Cloud-Patterned Stone Staff,\" a Rare weapon. The staff has 60 Attack, 30 Defense, and a unique effect that moderately increases damage from charged Smash Heavy Attacks. The weapon is part of the player's equipment, with detailed stats displayed on the right side of the screen. The preceding and following text explains the weapon's attributes and its location in Chapter 2 at Yellow Wind Ridge after defeating Shigandang."
}