{
    "chunk_id": 590141843375,
    "source_file": "Gall_Gem.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/81/Gall_Gem_2.jpg",
    "alt_text": "Gall Gem 2.jpg",
    "position_desc": 1,
    "img_above_text": "The Gall Gem is likely to be the first of the Soaks you find in Black Myth: Wukong during your exploration of Black Wind Mountain. The Gall Gem is one of the most basic Soaks, giving you a slight buff, although not quite as drastic of a buff as many of the others you will find later on.\nWhile not quite as potent as Drinks, Soaks are important to your overall build to ensure you have an extra passive buff that benefits your playstyle or gameplay while you heal. Having the Gall Gem equipped to your Gourds will moderately increase Poison Resistance for a short duration after using the Gourd.",
    "img_below_text": "Unlike the Drinks in the game and the Gourd itself, Soaks can't be upgraded at the Shen Monkey Vendor, so you are stuck with this small poison resistance buff throughout the game if you have it equipped. So, be sure to head back to the Shen Monkey Vendor at any point if you do want to change your Soak or how your Gourd behaves.\n## Black Myth: Wukong Gall Gem Location",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Gall Gem is likely to be the first of the Soaks you find in Black Myth: Wukong during your exploration of Black Wind Mountain. The Gall Gem is one of the most basic Soaks, giving you a slight buff, although not quite as drastic of a buff as many of the others you will find later on.\nWhile not quite as potent as Drinks, Soaks are important to your overall build to ensure you have an extra passive buff that benefits your playstyle or gameplay while you heal. Having the Gall Gem equipped to your Gourds will moderately increase Poison Resistance for a short duration after using the Gourd.\"\n        - Following Text: \"Unlike the Drinks in the game and the Gourd itself, Soaks can't be upgraded at the Shen Monkey Vendor, so you are stuck with this small poison resistance buff throughout the game if you have it equipped. So, be sure to head back to the Shen Monkey Vendor at any point if you do want to change your Soak or how your Gourd behaves.\n## Black Myth: Wukong Gall Gem Location\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image displays the inventory screen from *Black Myth: Wukong*, highlighting the \"Gall Gem,\" an uncommon Soak item. The Gall Gem provides a moderate, temporary increase in Poison Resistance when used with the Gourd. The item is part of the \"Drinks and Soaks\" category and is described as a basic buff that complements healing. The surrounding text emphasizes its utility in gameplay and notes that Soaks cannot be upgraded, encouraging players to consider their build strategy carefully."
}