{
    "chunk_id": 221765424788,
    "source_file": "First_Prince_of_Flowing_Sands.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/ff/Wukong_Sandgate_72.jpg",
    "alt_text": "Wukong Sandgate 72.jpg",
    "position_desc": 4,
    "img_above_text": "![Wukong Sandgate 71.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/94/Wukong_Sandgate_71.jpg)\nIf you didn’t kill the King of Flowing Sands when fighting him and his second son, he’ll have snuck over here to summon his even bigger first son to beat you into a pulp (the First Prince however, will promptly deal with the King himself). If you killed both King and Prince, you can instead toss down the Pungent Flesh Chunk to rouse the Prince out of his lair.",
    "img_below_text": "As a much bigger foe than the Second Prince, expect a lot of large slamming attacks in your direction. He’s a wild and unpredictable opponent, so be sure to use Cloud Step to get out of the way if you’re not sure what’s coming, then crash back into him from the sides.\nThe First Prince will usually start with a lunging two-hand slam attack after he stands on his hind legs that shakes up a lot of dust, but you can dodge to the side and keep attacking as he recovers.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Sandgate 71.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/94/Wukong_Sandgate_71.jpg)\nIf you didn’t kill the King of Flowing Sands when fighting him and his second son, he’ll have snuck over here to summon his even bigger first son to beat you into a pulp (the First Prince however, will promptly deal with the King himself). If you killed both King and Prince, you can instead toss down the Pungent Flesh Chunk to rouse the Prince out of his lair.\"\n        - Following Text: \"As a much bigger foe than the Second Prince, expect a lot of large slamming attacks in your direction. He’s a wild and unpredictable opponent, so be sure to use Cloud Step to get out of the way if you’re not sure what’s coming, then crash back into him from the sides.\nThe First Prince will usually start with a lunging two-hand slam attack after he stands on his hind legs that shakes up a lot of dust, but you can dodge to the side and keep attacking as he recovers.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a gameplay moment from *Black Myth: Wukong*, showing the player character engaged in combat with the \"First Prince of Flowing Sands,\" a large and imposing enemy. The scene highlights the Prince lunging forward with a two-handed slam attack, as the player character attempts to evade. The context suggests this is a challenging boss fight, requiring strategic dodging and counterattacks."
}