{
    "chunk_id": 610967308219,
    "source_file": "Field_of_Fire_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c2/Field_Fire_Walkthrough_%2852%29.png",
    "alt_text": "Field Fire Walkthrough \\(52\\).png",
    "position_desc": 44,
    "img_above_text": "When he does stand still -- or he's pausing from his own combos -- you won't be able to finish a combo of your own. It's best to just get a few hits in, then immediately jump back. This is because he'll breathe fire in a small arc directly in front of him as soon as you've hit him a few times.\nAs you'd expect from the final boss of The Flaming Mountains, the Red Boy uses a weapon imbued with fire and projectile fire attacks. For this reason, we'd recommend you stock up on Body-Cooling Powder and equip your Fireproof Mantle to help you should you start to take too much elemental damage.",
    "img_below_text": "When he winds his staff to create a ring of fire, the attack looks a lot worse than it actually is. He'll throw out the ring toward you and it will start to bounce around the clearing. Keep track of it by looking up and following it to stay away from where it lands. If you keep moving, it's fairly easy to avoid. After bouncing around a few times, the Red Boy will slam down into the ground to recover the spear. There's a brief pause here while he composes himself, so you'll be able to rush in to attack.\n![Field Fire Walkthrough \\(49\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/84/Field_Fire_Walkthrough_%2849%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"When he does stand still -- or he's pausing from his own combos -- you won't be able to finish a combo of your own. It's best to just get a few hits in, then immediately jump back. This is because he'll breathe fire in a small arc directly in front of him as soon as you've hit him a few times.\nAs you'd expect from the final boss of The Flaming Mountains, the Red Boy uses a weapon imbued with fire and projectile fire attacks. For this reason, we'd recommend you stock up on Body-Cooling Powder and equip your Fireproof Mantle to help you should you start to take too much elemental damage.\"\n        - Following Text: \"When he winds his staff to create a ring of fire, the attack looks a lot worse than it actually is. He'll throw out the ring toward you and it will start to bounce around the clearing. Keep track of it by looking up and following it to stay away from where it lands. If you keep moving, it's fairly easy to avoid. After bouncing around a few times, the Red Boy will slam down into the ground to recover the spear. There's a brief pause here while he composes himself, so you'll be able to rush in to attack.\n![Field Fire Walkthrough \\(49\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/84/Field_Fire_Walkthrough_%2849%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the Red Boy, the final boss of The Flaming Mountains, surrounded by flames and performing a fiery attack. He appears to be creating a ring of fire with his weapon, which matches the description of his projectile attack that bounces around the battlefield. The scene emphasizes the dangerous, fire-filled environment and the need for strategic movement and preparation, such as using Body-Cooling Powder and a Fireproof Mantle to mitigate elemental damage."
}