{
    "chunk_id": 594793317055,
    "source_file": "Stone_Essence.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b2/Stone_Essence_3.jpg",
    "alt_text": "Stone Essence 3.jpg",
    "position_desc": 3,
    "img_above_text": "## Where To Use The Stone Essence in Black Myth: Wukong\nWith the Stone Essence in hand, you can give it to the Man-In-Stone, who is located along the central path between the two raised paths from the Fright Cliff - Squall Hideout Shrine.",
    "img_below_text": "Giving it to him will cause him to stand up and he will tell you to go away. However, you can now target him and kill him, which is what you should do to get the Azure Dust Transformation Spells. For a full guide on the boss, be sure to check our Mother of Stones boss guide and our walkthrough of Fright Cliff.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Where To Use The Stone Essence in Black Myth: Wukong\nWith the Stone Essence in hand, you can give it to the Man-In-Stone, who is located along the central path between the two raised paths from the Fright Cliff - Squall Hideout Shrine.\"\n        - Following Text: \"Giving it to him will cause him to stand up and he will tell you to go away. However, you can now target him and kill him, which is what you should do to get the Azure Dust Transformation Spells. For a full guide on the boss, be sure to check our Mother of Stones boss guide and our walkthrough of Fright Cliff.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image shows a scene from *Black Myth: Wukong* where the player character is standing in a rocky, desolate area near the Fright Cliff - Squall Hideout Shrine. A red arrow highlights the central path leading to the \"Man-In-Stone,\" a key NPC to interact with using the Stone Essence. This location is part of the guide's instructions for progressing in the game."
}