{
    "chunk_id": 735027919631,
    "source_file": "Chapter_5_Secret_-_Bishui_Cave_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c0/Bishui_Cave_Walkthrough_%2824%29.png",
    "alt_text": "Bishui Cave Walkthrough \\(24\\).png",
    "position_desc": 10,
    "img_above_text": "After successfully wounding them both enough, you'll see them merge together and form the golden spiked ball. They'll use this to jump up in the air, pull back, and spin to launch themselves toward you. They will keep rolling around the room, and it's just a case of dodging this. However, when they're about to finish, they become significantly more aggressive and will leap up in the air again, slamming the ball down and causing explosions on impact. You'll need to dodge or jump to avoid this. Then the cycle will repeat again until you're able to put an end to them.\nTop Takes Bottom, Bottom Takes Top",
    "img_below_text": "After defeating Top Takes Bottom, Bottom Takes Top, go up the stairs. Take out the bull guard on the right as you enter the next section, and collect the green Wisp it stands near.\n![Bishui Cave Walkthrough \\(25\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d7/Bishui_Cave_Walkthrough_%2825%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"After successfully wounding them both enough, you'll see them merge together and form the golden spiked ball. They'll use this to jump up in the air, pull back, and spin to launch themselves toward you. They will keep rolling around the room, and it's just a case of dodging this. However, when they're about to finish, they become significantly more aggressive and will leap up in the air again, slamming the ball down and causing explosions on impact. You'll need to dodge or jump to avoid this. Then the cycle will repeat again until you're able to put an end to them.\nTop Takes Bottom, Bottom Takes Top\"\n        - Following Text: \"After defeating Top Takes Bottom, Bottom Takes Top, go up the stairs. Take out the bull guard on the right as you enter the next section, and collect the green Wisp it stands near.\n![Bishui Cave Walkthrough \\(25\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d7/Bishui_Cave_Walkthrough_%2825%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dark, ominous staircase leading to a large, shadowy doorway carved into a rocky, lava-lit cavern. The environment is detailed with glowing red fissures, ornate stone lanterns, and intricate carvings, creating a foreboding atmosphere. A character wielding a staff-like weapon is positioned in the foreground, seemingly preparing to ascend the stairs. The red arrow overlay indicates the next objective in the walkthrough, guiding the player to proceed through the doorway after defeating the \"Top Takes Bottom, Bottom Takes Top\" boss."
}