{
    "chunk_id": 465924461070,
    "source_file": "Pagoda_Realm_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/82/Wukong_Pagoda_91.jpg",
    "alt_text": "Wukong Pagoda 91.jpg",
    "position_desc": 88,
    "img_above_text": "![Wukong Pagoda 90.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/6b/Wukong_Pagoda_90.jpg)\nTo defeat him, stay patient by building up focus points with sustained damage on his leg, using your Spirit Attacks too to rack up damage so that it can stagger the boss, then unleash more combos before your biggest charged up strike to maximize damage to his weak point before he rises. Use Cloud Step to get away from some of his more pesky lighting strikes and beams, and use Immobilize to stop Lotus-Vision's wild melee stomps and attacks (it generally doesn't work to help extend his stunned state).",
    "img_below_text": "When Captain Wise-Voice finally falls to your assault, the Pagoda Realm will at last be free of his beguiling chant. This means you can head down to re-explore if you missed any areas without worrying about the debuff (but it also means any Sentry Lanterns not killed are gone forever).\nCaptain Wise-Voice",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Pagoda 90.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/6b/Wukong_Pagoda_90.jpg)\nTo defeat him, stay patient by building up focus points with sustained damage on his leg, using your Spirit Attacks too to rack up damage so that it can stagger the boss, then unleash more combos before your biggest charged up strike to maximize damage to his weak point before he rises. Use Cloud Step to get away from some of his more pesky lighting strikes and beams, and use Immobilize to stop Lotus-Vision's wild melee stomps and attacks (it generally doesn't work to help extend his stunned state).\"\n        - Following Text: \"When Captain Wise-Voice finally falls to your assault, the Pagoda Realm will at last be free of his beguiling chant. This means you can head down to re-explore if you missed any areas without worrying about the debuff (but it also means any Sentry Lanterns not killed are gone forever).\nCaptain Wise-Voice\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an intense combat scene from the video game *Black Myth: Wukong*, where the protagonist is striking a large, armored boss enemy, likely \"Captain Wise-Voice,\" with a glowing staff. This moment highlights a critical attack on the boss's weak point, aligning with the guide's strategy of staggering the boss to maximize damage before it recovers. The scene emphasizes the game's dynamic and visually striking boss battles."
}