{
    "chunk_id": 601935575672,
    "source_file": "How_to_Find_All_Buddha%27s_Eyes_Locations_and_Unlock_Secret_Boss.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/54/Buddhas_Eye_Secret_Boss_%2810%29.png",
    "alt_text": "Buddhas Eye Secret Boss \\(10\\).png",
    "position_desc": 9,
    "img_above_text": "Buddha’s Eyeball 4\n### Buddha’s Eyes 5",
    "img_below_text": "Turn back on yourself, and take the path in the cave that goes in the opposite direction. You’ll come to a small body of water, but what you’ll probably first notice is the wooden structure and the enemies using ranged attacks on the right. Across from the body of water is a large opening, that will take you to Rockrest Flatt. But there’s actually another small path off to the left, with a set of stairs that leads up to a boss encounter with Mother of Stones.\n![Buddhas Eye Secret Boss \\(11\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1d/Buddhas_Eye_Secret_Boss_%2811%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Buddha’s Eyeball 4\n### Buddha’s Eyes 5\"\n        - Following Text: \"Turn back on yourself, and take the path in the cave that goes in the opposite direction. You’ll come to a small body of water, but what you’ll probably first notice is the wooden structure and the enemies using ranged attacks on the right. Across from the body of water is a large opening, that will take you to Rockrest Flatt. But there’s actually another small path off to the left, with a set of stairs that leads up to a boss encounter with Mother of Stones.\n![Buddhas Eye Secret Boss \\(11\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1d/Buddhas_Eye_Secret_Boss_%2811%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from a video game where the player character, armed with a staff, stands in a cave-like area illuminated by sunlight streaming through an opening. A red arrow points toward a path on the left, indicating the direction the player should take. This scene is part of a walkthrough guiding players to navigate the cave, avoid ranged enemies near a wooden structure, and explore paths leading to a boss encounter with the \"Mother of Stones.\""
}