{
    "chunk_id": 985755267521,
    "source_file": "Webbed_Hollow_-_Lower_Hollow_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c8/Wukong_LowerHollow_71.jpg",
    "alt_text": "Wukong LowerHollow 71.jpg",
    "position_desc": 67,
    "img_above_text": "Moving along the main path, you'll find it guarded by one last Scorpion Prince, so be ready for his charging attacks and quick leaping tail strikes as you bait out opening to counter him. There's a few extra Skeletal Snakes in the vicinity, so beware they don't try and all gang up on you at once!\n## The Gathering Cave",
    "img_below_text": "You can check the left wall for a green Wisp and a hiding Fungiman among some mushrooms, and then continue on to find a switchback path heading up to a plateau above.\n![Wukong LowerHollow 72.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/34/Wukong_LowerHollow_72.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Moving along the main path, you'll find it guarded by one last Scorpion Prince, so be ready for his charging attacks and quick leaping tail strikes as you bait out opening to counter him. There's a few extra Skeletal Snakes in the vicinity, so beware they don't try and all gang up on you at once!\n## The Gathering Cave\"\n        - Following Text: \"You can check the left wall for a green Wisp and a hiding Fungiman among some mushrooms, and then continue on to find a switchback path heading up to a plateau above.\n![Wukong LowerHollow 72.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/34/Wukong_LowerHollow_72.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from *Black Myth: Wukong*, showcasing the player character wielding a glowing, fiery staff in a dimly lit, rocky environment with scattered vegetation. The setting appears to be part of \"The Gathering Cave\" area, as mentioned in the walkthrough. The player is preparing for combat, possibly against nearby enemies like Skeletal Snakes or the Scorpion Prince referenced in the preceding text. The interface displays health, abilities, and combat options, emphasizing the game's action-oriented mechanics."
}