{
    "chunk_id": 418955767420,
    "source_file": "Valley_of_Ecstasy_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3e/Wukong_Longevity_28.jpg",
    "alt_text": "Wukong Longevity 28.jpg",
    "position_desc": 124,
    "img_above_text": "There's a Shrine at the start of the next area just beyond the entrance gate, and you can use this as the perfect opportunity to return back to the Pagoda Realm.\n### Completing the Pagoda Prisoner's Quest",
    "img_below_text": "Head back to the Lower Pagoda Shrine, and revisit the Pagoda Realm Prisoner (aka, the Third Prince of Flowing Sands). He will be grateful for your work in putting his captains to rest, and will award you the **Chubai Spearhead** , which allows you to craft a spear variant of your trusty staff: the Chu-Bai Spear!\n![Wukong Longevity final.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c1/Wukong_Longevity_final.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"There's a Shrine at the start of the next area just beyond the entrance gate, and you can use this as the perfect opportunity to return back to the Pagoda Realm.\n### Completing the Pagoda Prisoner's Quest\"\n        - Following Text: \"Head back to the Lower Pagoda Shrine, and revisit the Pagoda Realm Prisoner (aka, the Third Prince of Flowing Sands). He will be grateful for your work in putting his captains to rest, and will award you the **Chubai Spearhead** , which allows you to craft a spear variant of your trusty staff: the Chu-Bai Spear!\n![Wukong Longevity final.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c1/Wukong_Longevity_final.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a key moment in the quest involving the Pagoda Realm Prisoner (the Third Prince of Flowing Sands) from the game \"Black Myth: Wukong.\" The prisoner appears to be presenting or awarding the player character with the **Chubai Spearhead**, a reward for completing the task of putting his captains to rest. This item allows the crafting of the Chu-Bai Spear, a spear variant of the player’s staff."
}