{
    "chunk_id": 419336846577,
    "source_file": "Valley_of_Ecstasy_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9f/Wukong_MindCliff_1.jpg",
    "alt_text": "Wukong MindCliff 1.jpg",
    "position_desc": 1,
    "img_above_text": "After you solved the monk's riddle by praying at four Buddha Statues in the Precept Corridor, you'll split up from Zhu Bajie and make your way into the belly button of a large Buddha statue along the cliffs, taking you up a narrow pathway and into the Mindfulness Cliff.\n## Mindfulness Cliff",
    "img_below_text": "From the Shrine, you'll find yourself at the edge of a large pit with a pathway spiraling around its edge.\nHowever, as you begin to head up the path around the pit, you'll be interrupted by the arrival of a jester-like figure who wants to wear your face.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"After you solved the monk's riddle by praying at four Buddha Statues in the Precept Corridor, you'll split up from Zhu Bajie and make your way into the belly button of a large Buddha statue along the cliffs, taking you up a narrow pathway and into the Mindfulness Cliff.\n## Mindfulness Cliff\"\n        - Following Text: \"From the Shrine, you'll find yourself at the edge of a large pit with a pathway spiraling around its edge.\nHowever, as you begin to head up the path around the pit, you'll be interrupted by the arrival of a jester-like figure who wants to wear your face.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a rocky, snow-covered area with intricate Buddhist statues carved into the cliffside, suggesting a spiritual or sacred location. A character holding a staff stands near a small shrine-like structure made of branches, likely marking a significant point in the journey through the Mindfulness Cliff. This area serves as a transition between solving the monk's riddle and encountering a jester-like figure further along the path."
}