{
    "chunk_id": 84716090269,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e5/Wukong_Wolves_11.jpg",
    "alt_text": "Wukong Wolves 11.jpg",
    "position_desc": 19,
    "img_above_text": "![Wukong Wolves 10.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d2/Wukong_Wolves_10.jpg)\nDefeat the next shield bearing Wolf Soldier down the road, and then another Wolf Stalwart guarding a **Purple Lingzhi** Mushroom you can harvest at the foot of a large tree. At this point, you’re likely to gain your first level up, giving you a “**Spark** ”.",
    "img_below_text": "These are essentially Skill Points, which you can begin investing in a large number of different Skill Trees. These can include general skills, or ones that relate to specific combat stances. Your Smash stance has already been unlocked, but you can also unlock two other stances that have unique heavy attacks by investing skill points in them.\nWhen the path leads down, you’ll be able to head right to proceed to a mini-boss, or go left along the stream leading back to the bridge you crossed earlier.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Wolves 10.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d2/Wukong_Wolves_10.jpg)\nDefeat the next shield bearing Wolf Soldier down the road, and then another Wolf Stalwart guarding a **Purple Lingzhi** Mushroom you can harvest at the foot of a large tree. At this point, you’re likely to gain your first level up, giving you a “**Spark** ”.\"\n        - Following Text: \"These are essentially Skill Points, which you can begin investing in a large number of different Skill Trees. These can include general skills, or ones that relate to specific combat stances. Your Smash stance has already been unlocked, but you can also unlock two other stances that have unique heavy attacks by investing skill points in them.\nWhen the path leads down, you’ll be able to head right to proceed to a mini-boss, or go left along the stream leading back to the bridge you crossed earlier.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image displays the skill tree interface from the game *Black Myth: Wukong*. It highlights the \"Endurance\" skill under the \"Stamina\" category, which reduces the stamina cost of sprinting. The player has one \"Spark\" (skill point) available to unlock this skill, as indicated by the \"Hold to Awaken\" prompt. This screen is part of the progression system where players can invest skill points earned through gameplay to enhance abilities."
}