{
    "chunk_id": 237584305662,
    "source_file": "Webbed_Hollow_-_Upper_Hollow_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b1/Wukong_UpperHollow_2.jpg",
    "alt_text": "Wukong UpperHollow 2.jpg",
    "position_desc": 2,
    "img_above_text": "After facing certain doom trapped in the web of the spider guais of this realm, the Destined One will suddenly awake safe in a bed, somewhere deep underground below the Lanxi Village.\nOnce you are up again, you'll find a helpful gold box has been placed by the bed, and you can open the small **Treasure Chest** to claim 3 Antimiasma Powder and 1 Longevity Decoction. If you can't take the hint, it means you're likely to run into a lot of poison-inducing enemies in this area.",
    "img_below_text": "Before following the golden trail of a nearby Shrine, look to the left of the bed and small chest to find a path leading to another larger **Treasure Chest** you can open to claim a **Cuo Jin-Yin Belt Hook Curio** , another item that can help resist all the poison you'll be encountering.\n## Upper Hollow",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"After facing certain doom trapped in the web of the spider guais of this realm, the Destined One will suddenly awake safe in a bed, somewhere deep underground below the Lanxi Village.\nOnce you are up again, you'll find a helpful gold box has been placed by the bed, and you can open the small **Treasure Chest** to claim 3 Antimiasma Powder and 1 Longevity Decoction. If you can't take the hint, it means you're likely to run into a lot of poison-inducing enemies in this area.\"\n        - Following Text: \"Before following the golden trail of a nearby Shrine, look to the left of the bed and small chest to find a path leading to another larger **Treasure Chest** you can open to claim a **Cuo Jin-Yin Belt Hook Curio** , another item that can help resist all the poison you'll be encountering.\n## Upper Hollow\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a character exploring a dark, rocky, and web-filled underground area, likely near Lanxi Village. The red-circled object in the distance appears to be a **Treasure Chest**, which aligns with the preceding text mentioning a small chest containing **Antimiasma Powder** and **Longevity Decoction** to prepare for poison-inducing enemies. The inventory on the right confirms the acquisition of these items. This scene serves as a preparatory moment in the narrative, emphasizing the importance of gathering resources to resist poison threats in the upcoming area."
}