{
    "chunk_id": 809273330247,
    "source_file": "Non-White.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/16/Wukong_Mindcliff_24.jpg",
    "alt_text": "Wukong Mindcliff 24.jpg",
    "position_desc": 14,
    "img_above_text": "Another dangerous attack that can be hard to follow will start with him moving erratically in his mist form to close the distance to you, and start with a spinning slash attack. As the momentum carries him in a circle, he'll return to face you by spewing poison in your face. Since it's a ranged attack you won't be able to deflect this one, but you can dodge to the side while sprays straight ahead.\nWhen he crouches down while crossing his blades, he'll leap over for a low jump attack with both daggers, followed by two delayed swings of his poisoned weapons, and ending with a quick uppercut attack.",
    "img_below_text": "One last move he can perform quickly when at a distance is using his vanishing act to slide along the ground and then feint up in the air to the side of you before slashing down at an angle. He'll do this twice in a row to keep your guessing at his movements, ending with a slam attack that will break the ground around him even if he misses you.\n![Wukong Mindcliff 25.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/71/Wukong_Mindcliff_25.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Another dangerous attack that can be hard to follow will start with him moving erratically in his mist form to close the distance to you, and start with a spinning slash attack. As the momentum carries him in a circle, he'll return to face you by spewing poison in your face. Since it's a ranged attack you won't be able to deflect this one, but you can dodge to the side while sprays straight ahead.\nWhen he crouches down while crossing his blades, he'll leap over for a low jump attack with both daggers, followed by two delayed swings of his poisoned weapons, and ending with a quick uppercut attack.\"\n        - Following Text: \"One last move he can perform quickly when at a distance is using his vanishing act to slide along the ground and then feint up in the air to the side of you before slashing down at an angle. He'll do this twice in a row to keep your guessing at his movements, ending with a slam attack that will break the ground around him even if he misses you.\n![Wukong Mindcliff 25.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/71/Wukong_Mindcliff_25.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an intense combat encounter in a snowy, mountainous environment, likely from the game *Black Myth: Wukong*. The player character is engaged in a dynamic battle with an enemy named \"Non-White,\" as indicated by the health bar. The scene showcases fluid animations, with the enemy seemingly mid-attack, surrounded by poison effects. The context suggests this is part of a guide explaining the enemy's attack patterns and strategies for countering them."
}