{
    "chunk_id": 895843724626,
    "source_file": "Bamboo_Grove_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/94/Wukong_Bamboo_38.jpg",
    "alt_text": "Wukong Bamboo 38.jpg",
    "position_desc": 36,
    "img_above_text": "* Brew - With your equipped Drink, you can enhance it by adding a Soak to increase additional effects beyond the heal. You can try it out now by adding the Gall Gem, which will increase your poison resistance in addition to the heal from your Gourd.\n* Store - If the Gall Gem isn’t all that enticing, be sure to check his shop, as the Shen Monkey sells **Celestial Lotus Seeds** , which can be used as an alternative Soak that continues to recover some health after the gourd’s initial heal!",
    "img_below_text": "Once you’re done chatting with the Shen Monkey, be sure to look near the wooden scaffolding ledge by a large statue, and absorb a green wisp spirit to earn a bunch of Will. You can drop down below for a shortcut down the main path along with a Snake-Head Mushroom, but there’s one more thing to grab outside first.\n![Wukong Bamboo 39.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/35/Wukong_Bamboo_39.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"* Brew - With your equipped Drink, you can enhance it by adding a Soak to increase additional effects beyond the heal. You can try it out now by adding the Gall Gem, which will increase your poison resistance in addition to the heal from your Gourd.\n* Store - If the Gall Gem isn’t all that enticing, be sure to check his shop, as the Shen Monkey sells **Celestial Lotus Seeds** , which can be used as an alternative Soak that continues to recover some health after the gourd’s initial heal!\"\n        - Following Text: \"Once you’re done chatting with the Shen Monkey, be sure to look near the wooden scaffolding ledge by a large statue, and absorb a green wisp spirit to earn a bunch of Will. You can drop down below for a shortcut down the main path along with a Snake-Head Mushroom, but there’s one more thing to grab outside first.\n![Wukong Bamboo 39.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/35/Wukong_Bamboo_39.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from *Black Myth: Wukong*, where the player character stands on a wooden scaffolding near a large, intricately carved statue. Green glowing wisps are visible near the statue, which aligns with the preceding and following text describing the absorption of a green wisp spirit to earn Will. This area appears to be part of the exploration and progression in the game, with the scaffolding serving as a pathway and the statue marking a significant location."
}