{
    "chunk_id": 840371087353,
    "source_file": "Temple_of_Yellow_Flowers_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/52/Wukong_YellowFlower_13.jpg",
    "alt_text": "Wukong YellowFlower 13.jpg",
    "position_desc": 11,
    "img_above_text": "## Forest of Ferocity\nAfter resting at the Forest of Ferocity Shrine, you'll see a group of Daoists off to the right practicing, with more voices coming from somewhere further up.",
    "img_below_text": "First, you should head left to defeat a Snake Herbalist, and then explore a far cliff where a small ledge holds a **Meditation Spot** where you can get a free Skill Point.\nThe Height, Forest of Ferocity Meditation Spot",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Forest of Ferocity\nAfter resting at the Forest of Ferocity Shrine, you'll see a group of Daoists off to the right practicing, with more voices coming from somewhere further up.\"\n        - Following Text: \"First, you should head left to defeat a Snake Herbalist, and then explore a far cliff where a small ledge holds a **Meditation Spot** where you can get a free Skill Point.\nThe Height, Forest of Ferocity Meditation Spot\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character in the Forest of Ferocity area, holding a fiery weapon and exploring a rocky, forested path. The UI indicates the collection of an item, \"Licorice x1,\" suggesting resource gathering. The red-circled area in the background may highlight a point of interest, possibly related to the Meditation Spot mentioned in the following text, where players can earn a Skill Point. The scene aligns with the walkthrough's guidance to explore and interact with the environment."
}