{
    "chunk_id": 925497654369,
    "source_file": "Bitter_Lake_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b5/Wukong_Bitter_11.jpg",
    "alt_text": "Wukong Bitter 11.jpg",
    "position_desc": 49,
    "img_above_text": "![Wukong Bitter 10.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2e/Wukong_Bitter_10.jpg)\nOther times, he may only summon one smaller tail, but this one can expel its electrical energy in a projectile blast when the tail swings.",
    "img_below_text": "His strongest attack by far is when he jumps into the air with his green weapon, charging it with energy before crashing down with it. It will cause a huge electrical explosion when he lands, but then spread outward with several lighting strikes that cover a wide area.\n![Wukong Bitter 16.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fc/Wukong_Bitter_16.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Bitter 10.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2e/Wukong_Bitter_10.jpg)\nOther times, he may only summon one smaller tail, but this one can expel its electrical energy in a projectile blast when the tail swings.\"\n        - Following Text: \"His strongest attack by far is when he jumps into the air with his green weapon, charging it with energy before crashing down with it. It will cause a huge electrical explosion when he lands, but then spread outward with several lighting strikes that cover a wide area.\n![Wukong Bitter 16.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fc/Wukong_Bitter_16.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dramatic battle scene from *Black Myth: Wukong*, showcasing the protagonist facing off against a formidable enemy named \"Chen Loong.\" The enemy appears as a large, dragon-like creature wielding electrical energy, with lightning effects surrounding its body. The preceding and following text describe Chen Loong's ability to summon tails that expel electrical blasts and perform powerful area attacks, emphasizing its use of lightning-based abilities. The on-screen text, \"With the fiercest lightning!\" reinforces the creature's elemental theme."
}