{
    "chunk_id": 479747821637,
    "source_file": "Non-Void.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/20/Wukong_Thunderclap_47.jpg",
    "alt_text": "Wukong Thunderclap 47.jpg",
    "position_desc": 2,
    "img_above_text": "![Wukong Thunderclap 38.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/58/Wukong_Thunderclap_38.jpg)\nYou'll need to enter the large temple complex, and make your way straight from the Shrine through the entrance courtyard and into the central plaza. After climbing the stairs, head left from the small central building to enter a large building on the left, where you can climb the stairs up and find a door up to a large temple building.",
    "img_below_text": "At the entrance to this temple, you can now use the Snow Fox Brush in your inventory to transform into The Fox, and step inside to trigger a cutscene (if you enter first you can speak to him, but transforming near the monk will instantly trigger the fight without a scene).\n### Non-Void Miniboss Fight and Guide",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Thunderclap 38.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/58/Wukong_Thunderclap_38.jpg)\nYou'll need to enter the large temple complex, and make your way straight from the Shrine through the entrance courtyard and into the central plaza. After climbing the stairs, head left from the small central building to enter a large building on the left, where you can climb the stairs up and find a door up to a large temple building.\"\n        - Following Text: \"At the entrance to this temple, you can now use the Snow Fox Brush in your inventory to transform into The Fox, and step inside to trigger a cutscene (if you enter first you can speak to him, but transforming near the monk will instantly trigger the fight without a scene).\n### Non-Void Miniboss Fight and Guide\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character approaching the entrance of a large temple building, where a golden statue and intricate decorations are visible inside. This scene aligns with the walkthrough instructions to climb stairs and enter the temple, which leads to a key interaction involving the Snow Fox Brush transformation and a subsequent cutscene or miniboss fight."
}