{
    "chunk_id": 869154722397,
    "source_file": "Yellow_Sand_Formation_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7b/Wukong_MadTiger_7.jpg",
    "alt_text": "Wukong MadTiger 7.jpg",
    "position_desc": 47,
    "img_above_text": "![Wukong MadTiger 6.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/85/Wukong_MadTiger_6.jpg)\nLook to the left of that statue altar, and you’ll find a small field around the back with a concerning amount of skeletons, and a well. Using the Rattle-Drum here one final time will cause the spirit of the boy to appear before you, and invite you to hop down the well to meet a “friend”.",
    "img_below_text": "Unfortunately, if the dull echoing roars coming from somewhere below are any indication, you’re not going to meet a friendly face down there. You can interact with the well to drop down to a secret area, where you’ll face off against an incredibly tough and dangerous Mad Tiger Miniboss (who may even be tougher than all the other Tigers you’ve faced)!\nReturning to the second spot you played the Rattle-Drum in Yellow Wind Formation, cross the rope bridge and you’ll contend with a few more Weasel Captains.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong MadTiger 6.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/85/Wukong_MadTiger_6.jpg)\nLook to the left of that statue altar, and you’ll find a small field around the back with a concerning amount of skeletons, and a well. Using the Rattle-Drum here one final time will cause the spirit of the boy to appear before you, and invite you to hop down the well to meet a “friend”.\"\n        - Following Text: \"Unfortunately, if the dull echoing roars coming from somewhere below are any indication, you’re not going to meet a friendly face down there. You can interact with the well to drop down to a secret area, where you’ll face off against an incredibly tough and dangerous Mad Tiger Miniboss (who may even be tougher than all the other Tigers you’ve faced)!\nReturning to the second spot you played the Rattle-Drum in Yellow Wind Formation, cross the rope bridge and you’ll contend with a few more Weasel Captains.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a well surrounded by skeletons in a desolate field, with a prompt to \"Jump In\" displayed on-screen. This scene is part of a video game sequence where the player uses the Rattle-Drum to summon the spirit of a boy, who invites them to descend into the well. The well leads to a secret area containing a challenging miniboss encounter with the Mad Tiger."
}