{
    "chunk_id": 634961164873,
    "source_file": "Bitter_Lake_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/28/Wukong_Bitter_27.jpg",
    "alt_text": "Wukong Bitter 27.jpg",
    "position_desc": 61,
    "img_above_text": "Once they've been defeated, you can approach the lone man. Zhu Bajie warns you to beware of him, but he seems harmless enough, and tells you he's in search of treasure, and promises to share it when he finds it -- though he'll likely get in trouble again before this is all through.\nHe'll mention part of the treasure's riddle - green without, and red within: a summer treat. Sounds tasty, so be sure to keep an eye out for something matching that description.",
    "img_below_text": "Before heading back to the North Shore Shrine, be sure to check the large pool of water to the left of the treasure hunter. There's a **Treasure Chest** at the foot of the pool that holds various materials, and at the far end, you can find a small rock with a Gourd Drink placed upon it: **Bluebridge Romance**!\n![Wukong Bitter 28.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b3/Wukong_Bitter_28.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Once they've been defeated, you can approach the lone man. Zhu Bajie warns you to beware of him, but he seems harmless enough, and tells you he's in search of treasure, and promises to share it when he finds it -- though he'll likely get in trouble again before this is all through.\nHe'll mention part of the treasure's riddle - green without, and red within: a summer treat. Sounds tasty, so be sure to keep an eye out for something matching that description.\"\n        - Following Text: \"Before heading back to the North Shore Shrine, be sure to check the large pool of water to the left of the treasure hunter. There's a **Treasure Chest** at the foot of the pool that holds various materials, and at the far end, you can find a small rock with a Gourd Drink placed upon it: **Bluebridge Romance**!\n![Wukong Bitter 28.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b3/Wukong_Bitter_28.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the player character from *Black Myth: Wukong* approaching a **Treasure Chest** located near a snowy pool of water. The chest is highlighted with a red arrow, indicating its importance as a lootable object containing materials. In the background, a small rock marked with a red circle holds a **Gourd Drink** called **Bluebridge Romance**, which is mentioned in the walkthrough text. The scene emphasizes exploration and rewards for interacting with the environment."
}