{
    "chunk_id": 46974478646,
    "source_file": "Black_Loong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/26/Wukong_BlackLoong_15.jpg",
    "alt_text": "Wukong BlackLoong 15.jpg",
    "position_desc": 20,
    "img_above_text": "![Wukong BlackLoong 13.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2b/Wukong_BlackLoong_13.jpg)\nLearning the electric ring dance is arguably the hardest part of this fight, as is evading his sandstorm if you can’t dissipate it. Immobilize can help you get some breathing room, but it’s harder to stagger him out of attacks, and even Rock Solid deflections aren’t guaranteed to stop his assaults. However, the Azure Dust Transformation can reliably keep him stumbling with many of its attacks, and sometimes even knock him out of his attempts to create rings of electricity altogether! You can also try using the Pluck of Many to disorient him with attacks on all sides, and use that time wisely to charge up your strikes when he’s distracted.",
    "img_below_text": "When the Black Loong falls, you’ll earn plenty of rewards, including a Loong Pearl, Mind Core, 2 Refined Iron Sand, 1576 Will, and 2770 Experience. In addition to this, you can find a gold chest nearby that contains a Tridacna Pendant curio, and a Thunderbone weapon material — one of two Loong materials needed to craft the Loongwreathe Staff!",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong BlackLoong 13.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2b/Wukong_BlackLoong_13.jpg)\nLearning the electric ring dance is arguably the hardest part of this fight, as is evading his sandstorm if you can’t dissipate it. Immobilize can help you get some breathing room, but it’s harder to stagger him out of attacks, and even Rock Solid deflections aren’t guaranteed to stop his assaults. However, the Azure Dust Transformation can reliably keep him stumbling with many of its attacks, and sometimes even knock him out of his attempts to create rings of electricity altogether! You can also try using the Pluck of Many to disorient him with attacks on all sides, and use that time wisely to charge up your strikes when he’s distracted.\"\n        - Following Text: \"When the Black Loong falls, you’ll earn plenty of rewards, including a Loong Pearl, Mind Core, 2 Refined Iron Sand, 1576 Will, and 2770 Experience. In addition to this, you can find a gold chest nearby that contains a Tridacna Pendant curio, and a Thunderbone weapon material — one of two Loong materials needed to craft the Loongwreathe Staff!\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the protagonist approaching a gold chest located on a stone platform, surrounded by a rugged environment with tree roots and carved stonework. This scene follows the defeat of the Black Loong in *Black Myth: Wukong*, where players are rewarded with valuable items including a Loong Pearl, Mind Core, and crafting materials. The chest likely contains additional rewards, such as the Tridacna Pendant curio and Thunderbone weapon material, essential for crafting the Loongwreathe Staff."
}