{
    "chunk_id": 582731136046,
    "source_file": "Chapter_2_Secret_-_Kingdom_of_Sahali_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/92/Wukong_Sahali_39.jpg",
    "alt_text": "Wukong Sahali 39.jpg",
    "position_desc": 40,
    "img_above_text": "![Wukong Sahali 38.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f2/Wukong_Sahali_38.jpg)\nAt this point, the battle will be paused and Fuban stunned, allowing you to climb up via its head to reach the large statue on its back. Jump onto the statue head, and look for a glowing eye to examine. You’ll then retrieve the Vessel that gives Fuban much of its power to fend off the yellow rat, who can now join you for the rest of the battle!",
    "img_below_text": "In this second phase, things will get even easier thanks to the Yellow Wind Sage on your side. You’ll be able to let him to the main talking. He can deal incredible damage with his wind attacks, which you can supplement by continuing the assault on his claws.You’ll still need to be mindful of his charge attacks and claw swipes, but you’re given more room to hang back and heal while the rat takes the brunt of his aggression.\n![Wukong Sahali 40.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1e/Wukong_Sahali_40.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Sahali 38.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f2/Wukong_Sahali_38.jpg)\nAt this point, the battle will be paused and Fuban stunned, allowing you to climb up via its head to reach the large statue on its back. Jump onto the statue head, and look for a glowing eye to examine. You’ll then retrieve the Vessel that gives Fuban much of its power to fend off the yellow rat, who can now join you for the rest of the battle!\"\n        - Following Text: \"In this second phase, things will get even easier thanks to the Yellow Wind Sage on your side. You’ll be able to let him to the main talking. He can deal incredible damage with his wind attacks, which you can supplement by continuing the assault on his claws.You’ll still need to be mindful of his charge attacks and claw swipes, but you’re given more room to hang back and heal while the rat takes the brunt of his aggression.\n![Wukong Sahali 40.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1e/Wukong_Sahali_40.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an intense battle scene from *Black Myth: Wukong*, where the protagonist is engaged in combat with a large enemy named Fuban in a desert environment. Fuban is shown towering over the player character, wielding a weapon, while the game's interface displays health bars, abilities, and a dialogue line from Fuban: \"Such ferocity was unforeseen... My apologies.\" The preceding text suggests this is part of a multi-phase fight, with the player having recently stunned Fuban and retrieved a Vessel from its back. The following text indicates that the Yellow Wind Sage will assist in the next phase of the battle."
}