{
    "chunk_id": 169474794608,
    "source_file": "Gold_Spikeplate.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b2/Wukong_Longevity_2.jpg",
    "alt_text": "Wukong Longevity 2.jpg",
    "position_desc": 1,
    "img_above_text": "## Black Myth: Wukong Gold Spikeplate Location\nThe Gold Spikeplate can be found in The New West, specifically within the Valley of Ecstasy, Longevity Road Shrine area. Follow the road along until you reach the Dark-faced Overlord in the back of the area. Defeat it to get the Curios item.",
    "img_below_text": "For even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Black Myth: Wukong Gold Spikeplate Location\nThe Gold Spikeplate can be found in The New West, specifically within the Valley of Ecstasy, Longevity Road Shrine area. Follow the road along until you reach the Dark-faced Overlord in the back of the area. Defeat it to get the Curios item.\"\n        - Following Text: \"For even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a gameplay moment from *Black Myth: Wukong*, showcasing a battle against the Dark-faced Overlord in a snowy environment. The player character, armed with a staff, is engaged in combat with the towering enemy, which emits green energy from its arm. This scene aligns with the preceding text, which describes defeating the Dark-faced Overlord in the Valley of Ecstasy to obtain the Gold Spikeplate item. The image serves as a visual reference for the guide's instructions."
}