{
    "chunk_id": 218789792369,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7f/Wukong_Fright_33.jpg",
    "alt_text": "Wukong Fright 33.jpg",
    "position_desc": 29,
    "img_above_text": "At the end of the cave path, you’ll find the object of the Man-in-Stone’s quest - an even larger statue embedded with shining blue crystals. Don’t get too enraptured that you miss a Poisestone along the walls trying to ambush you, though.\n### The Fifth Buddha’s Eyeball",
    "img_below_text": "Upon reaching the end of the large cave system where you’ll find the Mother of Stones, look for a large opening to the right to exit back outside and onto a cliff edge. There’s a raised platform here, and you’ll find another statue head to harvest its Buddha Eyeball.\n### Yaoguai Chief Mini-Boss Fight - Mother of Stones",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"At the end of the cave path, you’ll find the object of the Man-in-Stone’s quest - an even larger statue embedded with shining blue crystals. Don’t get too enraptured that you miss a Poisestone along the walls trying to ambush you, though.\n### The Fifth Buddha’s Eyeball\"\n        - Following Text: \"Upon reaching the end of the large cave system where you’ll find the Mother of Stones, look for a large opening to the right to exit back outside and onto a cliff edge. There’s a raised platform here, and you’ll find another statue head to harvest its Buddha Eyeball.\n### Yaoguai Chief Mini-Boss Fight - Mother of Stones\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character standing at the edge of a cliff within a rocky, desolate environment. The scene aligns with the guide's description of reaching the end of a cave system and finding a cliff edge with a raised platform. This area is likely where the player can harvest another Buddha Eyeball from a statue head, as mentioned in the text. The setting suggests progression toward the \"Mother of Stones\" encounter."
}