{
    "chunk_id": 954737749350,
    "source_file": "Lingxuzi.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/81/Wukong_Wolves_46.jpg",
    "alt_text": "Wukong Wolves 46.jpg",
    "position_desc": 3,
    "img_above_text": "## Lingxuzi Boss Fight and Guide\nCompared to Lingxuzi, the last wolf boss you fought may as well have been a puppy. This Yaoguai King is a large hulking beast of a wolf that hits as hard as he is big. Luckily, for all his size, his attacks come with clear telegraphs to help you dodge and counter his moves.",
    "img_below_text": "He’ll usually start the fight with a big leaping strike, falling to the ground with one slash, and then quickly following up with a second slash from his other claw. Unfortunately, he’s a pretty evasive foe, and finding the right moments to counter attack can be tricky.\n![Wukong Wolves 47.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a1/Wukong_Wolves_47.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Lingxuzi Boss Fight and Guide\nCompared to Lingxuzi, the last wolf boss you fought may as well have been a puppy. This Yaoguai King is a large hulking beast of a wolf that hits as hard as he is big. Luckily, for all his size, his attacks come with clear telegraphs to help you dodge and counter his moves.\"\n        - Following Text: \"He’ll usually start the fight with a big leaping strike, falling to the ground with one slash, and then quickly following up with a second slash from his other claw. Unfortunately, he’s a pretty evasive foe, and finding the right moments to counter attack can be tricky.\n![Wukong Wolves 47.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a1/Wukong_Wolves_47.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the intense boss fight against Lingxuzi, a massive, menacing wolf-like Yaoguai King in *Black Myth: Wukong*. Lingxuzi is shown mid-leap, preparing a powerful attack on the player character, who is armed with a staff and poised to evade. The scene highlights the boss's size, ferocity, and dynamic movement, aligning with the guide's description of Lingxuzi's telegraphed attacks and evasive nature."
}