{
    "chunk_id": 690608435303,
    "source_file": "Secrets_in_Black_Myth_Wukong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d7/Buddhas_Eye_Secret_Boss_%2813%29.png",
    "alt_text": "Buddhas Eye Secret Boss \\(13\\).png",
    "position_desc": 6,
    "img_above_text": "Defeating Shigandang will also reward you with the Skandha of Feeling. Just like the Skandha of Form, this will come in handy later on.\n## Shigandang Vs. Stone Vanguard",
    "img_below_text": "If you get the Buddha's Eyeballs and pop them into the rock _before_ you fight the Stone Vanguard, you can use the secret boss to your advantage. Put the Eyeballs into the rock to call on Shingdang, and let stone meet stone.\n### Relevant Guide Pages",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Defeating Shigandang will also reward you with the Skandha of Feeling. Just like the Skandha of Form, this will come in handy later on.\n## Shigandang Vs. Stone Vanguard\"\n        - Following Text: \"If you get the Buddha's Eyeballs and pop them into the rock _before_ you fight the Stone Vanguard, you can use the secret boss to your advantage. Put the Eyeballs into the rock to call on Shingdang, and let stone meet stone.\n### Relevant Guide Pages\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts Shigandang, a stone-like boss character in a rugged, mountainous environment. It is part of a video game guide, where defeating Shigandang rewards the player with the Skandha of Feeling, a useful item for later gameplay. The guide suggests a strategic approach involving the Buddha's Eyeballs to summon Shigandang and utilize him in a fight against the Stone Vanguard."
}