{
    "chunk_id": 111291946885,
    "source_file": "Blood_of_the_Iron_Bull.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9c/Blood_of_the_Iron_Bull_-_Specific_Location_Black_Wind_Cave_-_1.jpg",
    "alt_text": "Blood of the Iron Bull - Specific Location Black Wind Cave - 1.jpg",
    "position_desc": 5,
    "img_above_text": "The next Blood of the Iron Bull material can be found after the Black Wind Cave \\- Outside The Cave Shrine in Black Wind Mountain. It is located on the bamboo bridge, just after the Shrine itself. You will find it in a chest on the path, just heading off from the bridge, if you jump over the barriers of the bridge.\nYou can also find a Spirit here, which will give you another Blood of the Iron Bull.",
    "img_below_text": "### Blood of the Iron Bull Location 5\nThe next Blood of the Iron Bull is in Chapter 2, Yellow Wind Ridge. From the first Shrine: Village Entrance \\- Sandgate Village, head around to the edge of the cliff on the right (away from the archers on the gate's roof). After two tough mini-boss enemies, you will see a large hill in front of you. Head up it.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The next Blood of the Iron Bull material can be found after the Black Wind Cave \\- Outside The Cave Shrine in Black Wind Mountain. It is located on the bamboo bridge, just after the Shrine itself. You will find it in a chest on the path, just heading off from the bridge, if you jump over the barriers of the bridge.\nYou can also find a Spirit here, which will give you another Blood of the Iron Bull.\"\n        - Following Text: \"### Blood of the Iron Bull Location 5\nThe next Blood of the Iron Bull is in Chapter 2, Yellow Wind Ridge. From the first Shrine: Village Entrance \\- Sandgate Village, head around to the edge of the cliff on the right (away from the archers on the gate's roof). After two tough mini-boss enemies, you will see a large hill in front of you. Head up it.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character standing on a wooden bamboo bridge near a lit brazier in a forested area, likely in \"Black Wind Mountain\" as part of a video game walkthrough. This location is described as being just after the Cave Shrine, where players can find a \"Blood of the Iron Bull\" item in a chest by jumping over the bridge barriers. The setting aligns with the guide's instructions for progressing in the quest."
}