{
    "chunk_id": 72801255098,
    "source_file": "Woods_of_Ember_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/46/Woods_Ember_Walkthrough_.png",
    "alt_text": "Woods Ember Walkthrough .png",
    "position_desc": 20,
    "img_above_text": "![Woods Ember Walkthrough \\(37\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5e/Woods_Ember_Walkthrough_%2837%29.png)\nFrom the Camp of Seasons Keeper's Shrine go left and cross the bridge. On the other side of it is an archer, so be prepared to dodge its attacks or use Cloudstep to get across undisturbed.",
    "img_below_text": "Turn right on the other side of the bridge, and start to head through the cave. On the right side of the cave is a green Wisp, but you'll first want to deal with the Revenant Charbone that will run at you as you step into the darkness. These things will cause fire damage and when you've knocked their health bar down, they'll explore. Take it out immediately and then pick up the Wisp, avoiding the explosion.\n### Tip!",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Woods Ember Walkthrough \\(37\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5e/Woods_Ember_Walkthrough_%2837%29.png)\nFrom the Camp of Seasons Keeper's Shrine go left and cross the bridge. On the other side of it is an archer, so be prepared to dodge its attacks or use Cloudstep to get across undisturbed.\"\n        - Following Text: \"Turn right on the other side of the bridge, and start to head through the cave. On the right side of the cave is a green Wisp, but you'll first want to deal with the Revenant Charbone that will run at you as you step into the darkness. These things will cause fire damage and when you've knocked their health bar down, they'll explore. Take it out immediately and then pick up the Wisp, avoiding the explosion.\n### Tip!\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dark cave with a player character approaching its entrance. Inside the cave, two key elements are highlighted: a green Wisp on the right side and an enemy, likely the Revenant Charbone, further ahead in the darkness. The context suggests the player must prepare to engage the enemy, which causes fire damage and explodes upon defeat, before safely collecting the Wisp."
}