{
    "chunk_id": 970144557755,
    "source_file": "Chapter_4_Secret_-_Purple_Cloud_Mountain_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/31/Wukong_PurpleCloud_53.jpg",
    "alt_text": "Wukong PurpleCloud 53.jpg",
    "position_desc": 57,
    "img_above_text": "Daoist Mi\n## Cloudnest Peak",
    "img_below_text": "As the Daoist Mi falls, the snake woman will beg you to defeat the creature that lies at the peak. Return through the hamlet to rest at the Cloudnest Peak Shrine, and ready yourself to take on the final boss of this area.\nWarning - if you haven't already, be sure you have already defeated The Scorpionlord and Daoist Mi, as defeating the final boss of this secret area may cause them to disappear!",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Daoist Mi\n## Cloudnest Peak\"\n        - Following Text: \"As the Daoist Mi falls, the snake woman will beg you to defeat the creature that lies at the peak. Return through the hamlet to rest at the Cloudnest Peak Shrine, and ready yourself to take on the final boss of this area.\nWarning - if you haven't already, be sure you have already defeated The Scorpionlord and Daoist Mi, as defeating the final boss of this secret area may cause them to disappear!\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a character ascending a stone staircase surrounded by intricate statues and autumn foliage, leading toward a shrine-like structure at the top. This scene is part of the Cloudnest Peak area in a video game, where the player prepares to face the final boss after defeating Daoist Mi and The Scorpionlord. The setting emphasizes the journey to the shrine for rest and preparation before the climactic battle."
}