{
    "chunk_id": 606118175384,
    "source_file": "Chapter_2_Secret_-_Kingdom_of_Sahali_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a3/Wukong_Sahali_44.jpg",
    "alt_text": "Wukong Sahali 44.jpg",
    "position_desc": 44,
    "img_above_text": "When he’s finally out of health, the battle will be won, and the Yellow Wind Sage will valiantly land the final blow. It’s a shame we’ll have to beat him up in the future. For your part in the battle, you’ll earn a Sky-Piercing Horn weapon material, and a new Vessel: The Wind Tamer!\nFuban",
    "img_below_text": "Just as the Vessel from Chapter 1 proved a huge advantage against the Black Bear King, so too will the Wind Tamer be instrumental in negating the sandstorm attacks of the Yellow Wind Sage boss at the end of Chapter 2. Even outside of that fight, you can utilize it to grant additional damage negation, making it a great addition to your gear.\nKingdom of Sahali Complete",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"When he’s finally out of health, the battle will be won, and the Yellow Wind Sage will valiantly land the final blow. It’s a shame we’ll have to beat him up in the future. For your part in the battle, you’ll earn a Sky-Piercing Horn weapon material, and a new Vessel: The Wind Tamer!\nFuban\"\n        - Following Text: \"Just as the Vessel from Chapter 1 proved a huge advantage against the Black Bear King, so too will the Wind Tamer be instrumental in negating the sandstorm attacks of the Yellow Wind Sage boss at the end of Chapter 2. Even outside of that fight, you can utilize it to grant additional damage negation, making it a great addition to your gear.\nKingdom of Sahali Complete\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image showcases the \"Wind Tamer,\" a legendary Vessel in the game's equipment menu. Its activation effect provides significant damage reduction and immunity to strong winds, making it highly effective against specific enemies, such as the Yellow Wind Sage boss mentioned in the context. The Vessel also offers a passive effect of slightly increased damage reduction when equipped. The preceding and following text highlights its importance in countering wind-based attacks and its utility in future battles."
}