{
    "chunk_id": 145266814294,
    "source_file": "Yellow_Sand_Formation_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/48/Wukong_Yellow_9.jpg",
    "alt_text": "Wukong Yellow 9.jpg",
    "position_desc": 9,
    "img_above_text": "Heading to the left side of the hamlet instead will place you between rows of houses and a large building on the side. Be sure to search the first house on the left to find a chest with 1 **Small Piece of Gold** and 3 **Tiny Piece of Gold**.\nDefeat the Rat Soldier guarding the entrance to the larger house, and be sure to check the far end of this street for a green Wisp to absorb with a Withering Corpse near it, then enter the courtyard of the large building.",
    "img_below_text": "Another Rat Imperial Guard will jump down from the rooftops to ambush you, and a Blazebone in the corner of the courtyard may try to give you trouble while you're otherwise engaged. Lure the Rat out of range so you can deal with him in peace, then go for the bone thrower.\n![Wukong Yellow 10.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/13/Wukong_Yellow_10.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Heading to the left side of the hamlet instead will place you between rows of houses and a large building on the side. Be sure to search the first house on the left to find a chest with 1 **Small Piece of Gold** and 3 **Tiny Piece of Gold**.\nDefeat the Rat Soldier guarding the entrance to the larger house, and be sure to check the far end of this street for a green Wisp to absorb with a Withering Corpse near it, then enter the courtyard of the large building.\"\n        - Following Text: \"Another Rat Imperial Guard will jump down from the rooftops to ambush you, and a Blazebone in the corner of the courtyard may try to give you trouble while you're otherwise engaged. Lure the Rat out of range so you can deal with him in peace, then go for the bone thrower.\n![Wukong Yellow 10.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/13/Wukong_Yellow_10.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from *Black Myth: Wukong*, showing the player character, wielding a staff, in a courtyard surrounded by dilapidated buildings. A defeated enemy, likely the Rat Soldier mentioned in the preceding text, lies on the ground nearby. Loot rewards, including **Will**, **Tiny Piece of Gold**, and **Stone Spirit**, are displayed on the right side of the screen. This visual aligns with the walkthrough's description of exploring the hamlet, defeating enemies, and collecting items before progressing further into the area."
}