{
    "chunk_id": 322008812753,
    "source_file": "Yellow_Loong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f2/Wukong_YellowLoong_16.jpg",
    "alt_text": "Wukong YellowLoong 16.jpg",
    "position_desc": 13,
    "img_above_text": "![Wukong YellowLoong 14.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/62/Wukong_YellowLoong_14.jpg)\nYou'll want to dodge toward him and not away and get the hang of evading this attack early, as it won't be long before he'll upgrade the move to detonate a second bigger orange electric arc a moment after the initial slice.",
    "img_below_text": "Speaking of which, his other quick melee move will begin with a quick stab from the opposite end of his weapon (while turning his back to you) followed by an electric overhead slam. Don't get greedy, because he'll quickly pull his weapon out to swing it around for a big spinning arc that also extends a huge electric wave, which will shortly detonate with a bigger orange blast that you need to be well away from.\n![Wukong YellowLoong 11.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f5/Wukong_YellowLoong_11.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong YellowLoong 14.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/62/Wukong_YellowLoong_14.jpg)\nYou'll want to dodge toward him and not away and get the hang of evading this attack early, as it won't be long before he'll upgrade the move to detonate a second bigger orange electric arc a moment after the initial slice.\"\n        - Following Text: \"Speaking of which, his other quick melee move will begin with a quick stab from the opposite end of his weapon (while turning his back to you) followed by an electric overhead slam. Don't get greedy, because he'll quickly pull his weapon out to swing it around for a big spinning arc that also extends a huge electric wave, which will shortly detonate with a bigger orange blast that you need to be well away from.\n![Wukong YellowLoong 11.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f5/Wukong_YellowLoong_11.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat scene from *Black Myth: Wukong*, showcasing the \"Yellow Loong\" boss executing a powerful electric arc attack. The glowing energy slice spans across the battlefield, emphasizing the need for precise dodging as described in the preceding text. The player's health bar and abilities are visible, indicating active gameplay. This visual highlights the intensity of the boss fight and the importance of mastering evasion techniques against its upgraded electric moves."
}