{
    "chunk_id": 446582928580,
    "source_file": "Red_Tides.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/91/Wukong_Wolves_33.jpg",
    "alt_text": "Wukong Wolves 33.jpg",
    "position_desc": 4,
    "img_above_text": "Red Tides can be obtained by defeating Guangzhi in Forest of Wolves - Outside the Forest area in Black Wind Mountain. He is located at the far back, past the small bridge in the forest.\nThis is an optional boss, and with him being accessible so early in the game, you may struggle. However, our Guangzhi boss guide will help you out.",
    "img_below_text": "With the Transformation, you can equip it and switch to it at any point from the Shrine. Simply choose 'Reignite The Sparks' and 'Set Spells'.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Red Tides can be obtained by defeating Guangzhi in Forest of Wolves - Outside the Forest area in Black Wind Mountain. He is located at the far back, past the small bridge in the forest.\nThis is an optional boss, and with him being accessible so early in the game, you may struggle. However, our Guangzhi boss guide will help you out.\"\n        - Following Text: \"With the Transformation, you can equip it and switch to it at any point from the Shrine. Simply choose 'Reignite The Sparks' and 'Set Spells'.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from a video game set in a forest environment, possibly part of the Black Wind Mountain area mentioned in the preceding text. It shows a character equipped with a staff, moving towards a shrine-like structure. The interface displays the player's current \"Will\" count, suggesting resource management or ability usage. This scene likely serves as part of the journey to confront the optional boss Guangzhi, as described in the preceding text. The following text hints at gameplay mechanics involving transformations and spell setting at shrines, which may be relevant to the player's actions in this area."
}