{
    "chunk_id": 169269737336,
    "source_file": "Webbed_Hollow_-_Lower_Hollow_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/ac/Wukong_LowerHollow_11.jpg",
    "alt_text": "Wukong LowerHollow 11.jpg",
    "position_desc": 11,
    "img_above_text": "This man is actually the Yellow Loong, who claims he's been hiding upon the Ancient Master's garb as a pattern. As the last of the secret Loong bosses, he is an incredibly tough battle, especially at this point in the game, so you may want to back off and challenge him when you've got some stronger gear! If you're able to meet the challenge, you'll claim more materials needed to craft the ultimate Loong Staff, as well as a **Golden Carp Curio** , and the **Golden Lining Spell** to transform into the Yellow Loong himself!\n* See the **Yellow Loong Boss Guide** for details on how to defeat him.",
    "img_below_text": "Back at the Shrine, head up the trail of old treasure chests to find another entrance back into the Webbed Hollow where a Scorpion Prince is guarding the cave opening.\n![Wukong LowerHollow 12.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f7/Wukong_LowerHollow_12.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"This man is actually the Yellow Loong, who claims he's been hiding upon the Ancient Master's garb as a pattern. As the last of the secret Loong bosses, he is an incredibly tough battle, especially at this point in the game, so you may want to back off and challenge him when you've got some stronger gear! If you're able to meet the challenge, you'll claim more materials needed to craft the ultimate Loong Staff, as well as a **Golden Carp Curio** , and the **Golden Lining Spell** to transform into the Yellow Loong himself!\n* See the **Yellow Loong Boss Guide** for details on how to defeat him.\"\n        - Following Text: \"Back at the Shrine, head up the trail of old treasure chests to find another entrance back into the Webbed Hollow where a Scorpion Prince is guarding the cave opening.\n![Wukong LowerHollow 12.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f7/Wukong_LowerHollow_12.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a gameplay scene from *Black Myth: Wukong*, showcasing a battle between the player character and a large Scorpion Prince enemy in a lush, web-covered cave environment. The player appears to be mid-combat, utilizing abilities or evasive maneuvers, as indicated by the glowing effects and the partially translucent character model. This encounter is part of the progression after defeating the Yellow Loong boss, leading to the Webbed Hollow area where the Scorpion Prince guards a cave entrance."
}