{
    "chunk_id": 475231599030,
    "source_file": "Wandering_Wight.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/07/Wukong_Wight_3.jpg",
    "alt_text": "Wukong Wight 3.jpg",
    "position_desc": 4,
    "img_above_text": "![Wukong Wight 2.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0e/Wukong_Wight_2.jpg)\nWhat makes the Wandering Wight such a tough opponent isn’t just the massive damage he can deal with a single attack, but the deceptive power and speed some of his attacks can have. Many times the Wight will default to attacking with two lengthy foot stomps, which can be easy to dodge once you get the timing down.",
    "img_below_text": "However, he’ll usually follow these stomps with a series of up to three spinning sweep attacks, twirling quickly in a large arc that will damage you unless you dodge at the right time. Since he may or may not follow up one spin with another, you’ll need to be very careful in figuring out when it’s okay to retaliate with an attack.\n![Wukong Wight 9.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c5/Wukong_Wight_9.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Wight 2.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0e/Wukong_Wight_2.jpg)\nWhat makes the Wandering Wight such a tough opponent isn’t just the massive damage he can deal with a single attack, but the deceptive power and speed some of his attacks can have. Many times the Wight will default to attacking with two lengthy foot stomps, which can be easy to dodge once you get the timing down.\"\n        - Following Text: \"However, he’ll usually follow these stomps with a series of up to three spinning sweep attacks, twirling quickly in a large arc that will damage you unless you dodge at the right time. Since he may or may not follow up one spin with another, you’ll need to be very careful in figuring out when it’s okay to retaliate with an attack.\n![Wukong Wight 9.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c5/Wukong_Wight_9.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an intense combat scene from *Black Myth: Wukong*, showcasing the player character engaged in battle with the \"Wandering Wight,\" a large, menacing enemy. The Wight, with its dark, spiked appearance and glowing veins, is mid-attack, creating a dynamic blur of motion. This moment highlights the Wight's speed and power, as described in the accompanying text, emphasizing the challenge of dodging its sweeping and stomping attacks. The player's health and ability bars are visible, indicating the ongoing fight's stakes."
}