{
    "chunk_id": 246110573746,
    "source_file": "Pale-Axe_Stalwart.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a0/Woods_Ember_Walkthrough_%2818%29.png",
    "alt_text": "Woods Ember Walkthrough \\(18\\).png",
    "position_desc": 1,
    "img_above_text": "The Pale-Axe Stalwart is a Character boss you'll go up against at the start of Chapter 5 in Black Myth: Wukong. After defeating the imposing Stalwart, you'll be asked to complete a side quest for him.\n## How to Find Pale-Axe Stalwart",
    "img_below_text": "From the first Keeper's Shrine of the Chapter, go right. On the other side of the underpass, you'll walk straight into another round of fighting. This time, you'll find the Revenants fighting Bull Sergeants.\n![Woods Ember Walkthrough \\(19\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/6f/Woods_Ember_Walkthrough_%2819%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Pale-Axe Stalwart is a Character boss you'll go up against at the start of Chapter 5 in Black Myth: Wukong. After defeating the imposing Stalwart, you'll be asked to complete a side quest for him.\n## How to Find Pale-Axe Stalwart\"\n        - Following Text: \"From the first Keeper's Shrine of the Chapter, go right. On the other side of the underpass, you'll walk straight into another round of fighting. This time, you'll find the Revenants fighting Bull Sergeants.\n![Woods Ember Walkthrough \\(19\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/6f/Woods_Ember_Walkthrough_%2819%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dark, desolate landscape with charred trees, scattered flames, and rocky terrain, suggesting a recent battle or destruction. A character stands near a small shrine, with an arrow indicating the path forward through the fiery area. This scene serves as a visual guide for navigating the environment after encountering the Pale-Axe Stalwart in *Black Myth: Wukong*, directing players toward the next objective."
}