{
    "chunk_id": 486942774446,
    "source_file": "Captain_Wise-Voice.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7a/Wukong_Pagoda_87.jpg",
    "alt_text": "Wukong Pagoda 87.jpg",
    "position_desc": 10,
    "img_above_text": "![Wukong Pagoda 86.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/67/Wukong_Pagoda_86.jpg)\nOnce enough damage has been sustained to its leg, you'll see its leg start to explode with light, meaning your attacks have successfully staggered the boss. He'll fall to the ground in a heap, with its sphere-like core right in front of you.",
    "img_below_text": "This is your best chance to get in some real damage, but it's worth noting that a big charged heavy strike can sometimes knock it completely out of its dazed state. Instead, build up some more focus with one or two light combos, and then expend all your focus points on a bit charged hit to end its daze, taking off a huge amount of health in the process.\nRepeat the process of damaging its leg, or look for any opportunities to strike at its head -- particularly when it triggers the beguiling chant again to take off a chunk of your maximum HP.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Pagoda 86.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/67/Wukong_Pagoda_86.jpg)\nOnce enough damage has been sustained to its leg, you'll see its leg start to explode with light, meaning your attacks have successfully staggered the boss. He'll fall to the ground in a heap, with its sphere-like core right in front of you.\"\n        - Following Text: \"This is your best chance to get in some real damage, but it's worth noting that a big charged heavy strike can sometimes knock it completely out of its dazed state. Instead, build up some more focus with one or two light combos, and then expend all your focus points on a bit charged hit to end its daze, taking off a huge amount of health in the process.\nRepeat the process of damaging its leg, or look for any opportunities to strike at its head -- particularly when it triggers the beguiling chant again to take off a chunk of your maximum HP.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight against \"Captain Wise-Voice\" in *Black Myth: Wukong*. The boss appears to be a large, grotesque entity with twisting, organic structures. The player's character is attacking the boss, likely targeting its weak points to stagger it. The health bar at the bottom indicates the boss's remaining health, while the UI shows the player's abilities and resources. The preceding and following text suggests the strategy involves staggering the boss by damaging its leg, exploiting its dazed state to deal significant damage, and managing focus points for optimal attacks."
}