{
    "chunk_id": 465874506106,
    "source_file": "Kang-Jin_Loong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/eb/Wukong_Snowhill_45.jpg",
    "alt_text": "Wukong Snowhill 45.jpg",
    "position_desc": 10,
    "img_above_text": "![Wukong Snowhill 42.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/44/Wukong_Snowhill_42.jpg)\nBe wary when Kang-Jin Loong begins to roar and emit lightning all around, as they can perform an attack to summon a series of lightning strikes along the ground. They'll track your position, so keep strafing and dodging to outpace them, and don't worry about fighting while in this evasive mode.",
    "img_below_text": "Other times, with a particularly loud roar, the boss will summon a giant circle of lightning strikes all around them. They only hit a few times in different spots, and usually at a fair distance from the boss, so pursuing it and keeping close is often the way to go.\nMuch of this fight is about patience and waiting for the right time to strike back, as you don't want to waste time swinging wildly when there's no hope of reaching the boss. Let them come to you, and look for the right moments with stationary claw swipes or tail slams to deflect with Rock Solid for a better chance to stagger them.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Snowhill 42.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/44/Wukong_Snowhill_42.jpg)\nBe wary when Kang-Jin Loong begins to roar and emit lightning all around, as they can perform an attack to summon a series of lightning strikes along the ground. They'll track your position, so keep strafing and dodging to outpace them, and don't worry about fighting while in this evasive mode.\"\n        - Following Text: \"Other times, with a particularly loud roar, the boss will summon a giant circle of lightning strikes all around them. They only hit a few times in different spots, and usually at a fair distance from the boss, so pursuing it and keeping close is often the way to go.\nMuch of this fight is about patience and waiting for the right time to strike back, as you don't want to waste time swinging wildly when there's no hope of reaching the boss. Let them come to you, and look for the right moments with stationary claw swipes or tail slams to deflect with Rock Solid for a better chance to stagger them.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game \"Black Myth: Wukong,\" showing a boss fight against Kang-Jin Loong. The boss is emitting lightning strikes across a snowy landscape, with the player character actively dodging the attacks. The accompanying text advises players to keep strafing and dodging to avoid the lightning strikes, and to stay close to the boss during certain attacks for better opportunities to strike back. The fight requires patience and strategic timing to effectively counter the boss's moves."
}