{
    "chunk_id": 251135912804,
    "source_file": "Valley_of_Ecstasy_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b5/Wukong_Karma_1.jpg",
    "alt_text": "Wukong Karma 1.jpg",
    "position_desc": 74,
    "img_above_text": "There's not much else to loot around the large stone pagoda where you fought Non-Able, so now is a good time to head back to the Forest of Felicity Shrine, and make your way through the canyon where the Frog Guai boss was to enter the next optional area.\n## Towers of Karma",
    "img_below_text": "The large forested field beyond the Forest of Felicity's canyon is fairly wide open, and as you exit the canyon you'll find a few small trails leading to the right, left and straight ahead.\n![Wukong Karma 2.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/23/Wukong_Karma_2.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"There's not much else to loot around the large stone pagoda where you fought Non-Able, so now is a good time to head back to the Forest of Felicity Shrine, and make your way through the canyon where the Frog Guai boss was to enter the next optional area.\n## Towers of Karma\"\n        - Following Text: \"The large forested field beyond the Forest of Felicity's canyon is fairly wide open, and as you exit the canyon you'll find a few small trails leading to the right, left and straight ahead.\n![Wukong Karma 2.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/23/Wukong_Karma_2.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a snowy forested area in the video game *Black Myth: Wukong*. The player character, wielding a staff, is navigating through the snow-covered terrain. The HUD displays various gameplay elements, including health, abilities, and inventory items. This scene appears to follow the guide's instructions to proceed through the Forest of Felicity's canyon toward the next optional area, likely the Towers of Karma. The environment suggests exploration and potential combat encounters in a wide-open field."
}