{
    "chunk_id": 216295206643,
    "source_file": "Webbed_Hollow_-_Lower_Hollow_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/02/Wukong_LowerHollow_52.jpg",
    "alt_text": "Wukong LowerHollow 52.jpg",
    "position_desc": 49,
    "img_above_text": "This means you'll have to be even more precise in your dodging, and using spells like Immobilize, Rock Solid, or Cloud Step to avoid attacks you can't roll away from in time.\nThe most important thing to note is that the mud hinders your ability to dodge, but it does **not** slow your ability to sprint. This means there are several situations and attacks where it can be preferable to run instead of waiting for a last second evade, so try to remember that option during this fight.",
    "img_below_text": "If there's any good news, its that for the first half of the fight, he'll continue to use most of the same moves as he did in the Hut of Immortality. Though you will have to be more precise in your dodging, you'll at least have an idea of what to expect.\n![Wukong LowerHollow 53.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8a/Wukong_LowerHollow_53.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"This means you'll have to be even more precise in your dodging, and using spells like Immobilize, Rock Solid, or Cloud Step to avoid attacks you can't roll away from in time.\nThe most important thing to note is that the mud hinders your ability to dodge, but it does **not** slow your ability to sprint. This means there are several situations and attacks where it can be preferable to run instead of waiting for a last second evade, so try to remember that option during this fight.\"\n        - Following Text: \"If there's any good news, its that for the first half of the fight, he'll continue to use most of the same moves as he did in the Hut of Immortality. Though you will have to be more precise in your dodging, you'll at least have an idea of what to expect.\n![Wukong LowerHollow 53.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8a/Wukong_LowerHollow_53.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight in *Black Myth: Wukong*, featuring the protagonist battling Zhu Bajie in a muddy, rocky environment. Zhu Bajie, a large boar-like creature wielding a glowing staff, is shown attacking the player amidst sparks and combat effects. The muddy terrain impacts dodging mechanics but allows sprinting, as noted in the preceding text. The fight requires precise evasion and strategic use of spells to counter attacks. The health bar at the bottom indicates the ongoing battle's progress."
}