{
    "chunk_id": 574777370389,
    "source_file": "New_Thunderclap_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/ca/Wukong_Thunderclap_64.jpg",
    "alt_text": "Wukong Thunderclap 64.jpg",
    "position_desc": 67,
    "img_above_text": "![Wukong Thunderclap 65.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/54/Wukong_Thunderclap_65.jpg)\nAnother quick two-hit combo he can employ is a quick side slice followed by an overhead slam. Since many of his combo attacks cover both vertical and horizontal hits, you can't just backpedal in one direction to evade them.",
    "img_below_text": "When he decides to get nasty with his combos, you'll either want to learn the moves and deflect one to knock him off balance, or Immobilize to shut him down. One of his most lengthy combos will come when he sweeps his weapon upward and then back down for two rotations, and then quickly swings it back and forth three more times, before leaping up to perform one last spin attack as he lands. Without a lot of stamina in reserve, it will be tough one to evade completely.\n![Wukong Thunderclap 69.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8a/Wukong_Thunderclap_69.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Thunderclap 65.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/54/Wukong_Thunderclap_65.jpg)\nAnother quick two-hit combo he can employ is a quick side slice followed by an overhead slam. Since many of his combo attacks cover both vertical and horizontal hits, you can't just backpedal in one direction to evade them.\"\n        - Following Text: \"When he decides to get nasty with his combos, you'll either want to learn the moves and deflect one to knock him off balance, or Immobilize to shut him down. One of his most lengthy combos will come when he sweeps his weapon upward and then back down for two rotations, and then quickly swings it back and forth three more times, before leaping up to perform one last spin attack as he lands. Without a lot of stamina in reserve, it will be tough one to evade completely.\n![Wukong Thunderclap 69.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8a/Wukong_Thunderclap_69.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat scene from *Black Myth: Wukong*, showcasing the protagonist engaged in a battle against an enemy labeled \"Non-Pure.\" The character is wielding a staff and appears to be mid-action, likely performing an attack or evading. The UI elements indicate health, stamina, and abilities, emphasizing the strategic nature of the encounter. The preceding and following text describe the enemy's complex attack patterns and combos, suggesting this is part of a guide to help players understand and counter the enemy's moves effectively."
}