{
    "chunk_id": 584289000522,
    "source_file": "Hundred-Eyed_Daoist_Master.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/aa/Wukong_YellowFlower_72.jpg",
    "alt_text": "Wukong YellowFlower 72.jpg",
    "position_desc": 8,
    "img_above_text": "![Wukong YellowFlower 71.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b2/Wukong_YellowFlower_71.jpg)\nSpeaking of deflecting, it you favor the Rock Solid spell, do be warned that the Hundred-Eyed Daoist has a particular distaste for the skill. After you successfully use it to deflect his attacks, there's a good chance that he'll notice the move and say he \"forbids\" as he burrows into the ground.",
    "img_below_text": "He'll then start coming for you while burrowed, which you can see by the disturbed earth heading in your direction. As lightning strikes, he'll leap out in an unblockable grab that deals major damage, and the timing can prove fairly difficult to dodge when you can't see or target him. We recommend running away while panning the camera behind you, and the exact moment you see a larger lightning strike behind you, dodge forward to avoid him as he bursts upward.\n![Wukong YellowFlower 73.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/50/Wukong_YellowFlower_73.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong YellowFlower 71.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b2/Wukong_YellowFlower_71.jpg)\nSpeaking of deflecting, it you favor the Rock Solid spell, do be warned that the Hundred-Eyed Daoist has a particular distaste for the skill. After you successfully use it to deflect his attacks, there's a good chance that he'll notice the move and say he \"forbids\" as he burrows into the ground.\"\n        - Following Text: \"He'll then start coming for you while burrowed, which you can see by the disturbed earth heading in your direction. As lightning strikes, he'll leap out in an unblockable grab that deals major damage, and the timing can prove fairly difficult to dodge when you can't see or target him. We recommend running away while panning the camera behind you, and the exact moment you see a larger lightning strike behind you, dodge forward to avoid him as he bursts upward.\n![Wukong YellowFlower 73.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/50/Wukong_YellowFlower_73.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a moment from the game *Black Myth: Wukong* where the player faces the \"Hundred-Eyed Daoist Master\" boss. A dramatic lightning strike is seen hitting the ground, likely signaling the boss's burrowed attack phase described in the text. The glowing impact and disturbed earth align with the warning about the boss's unblockable grab attack, emphasizing the need for precise timing and dodging. The lush yellow flower field and dark forest setting provide the backdrop for this intense encounter."
}