{
    "chunk_id": 899933680251,
    "source_file": "Luojia_Fragrant_Vine_Locations.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/13/Pagoda_Luojia_Fragrant_Vine.jpg",
    "alt_text": "Pagoda Luojia Fragrant Vine.jpg",
    "position_desc": 4,
    "img_above_text": "### Outside the Wheel Luojia Fragrant Vine\nOutside the Wheel Luojia Fragrant Vine",
    "img_below_text": "The Outside the Wheel Luojia Fragrant Vine is in the cave you will pass through after defeating Captain Wise-Voice. Follow the path until you reach a room with a large pool of water in the center. The vine will be draped across the branches of a tree on the left side of the room.\n### North Shore of the Bitter Lake Luojia Fragrant Vine",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"### Outside the Wheel Luojia Fragrant Vine\nOutside the Wheel Luojia Fragrant Vine\"\n        - Following Text: \"The Outside the Wheel Luojia Fragrant Vine is in the cave you will pass through after defeating Captain Wise-Voice. Follow the path until you reach a room with a large pool of water in the center. The vine will be draped across the branches of a tree on the left side of the room.\n### North Shore of the Bitter Lake Luojia Fragrant Vine\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character standing in a cave-like environment, facing a large tree entwined with glowing orange flowers, likely representing the \"Outside the Wheel Luojia Fragrant Vine\" mentioned in the text. This vine appears to be a key environmental feature or objective, located near a central pool of water and draped across the tree's branches. The scene aligns with the walkthrough's description of the area after defeating Captain Wise-Voice."
}