{
    "chunk_id": 85117481396,
    "source_file": "Cloudtreading_Deer.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/14/Foothills_Walkthrough_%2854%29.png",
    "alt_text": "Foothills Walkthrough \\(54\\).png",
    "position_desc": 6,
    "img_above_text": "![Foothills Walkthrough \\(58\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/38/Foothills_Walkthrough_%2858%29.png)\nTo make the first part of this fight easier, we'd recommend equipping the Wind Tamer as your vessel. It will wipe these tornadoes out as soon as you use it, and mean there's one less thing to focus on. The deer will still leap in the air and tread the clouds to attack you, but you won't need to worry about being hit by the annoying tornadoes. While this is useful once, you'll obviously need to wait for it to become available again, and in the meantime, the deer will continue to use this attack.",
    "img_below_text": "If you're taking it on without the vessel, the best thing you can do is get as far away from the tornadoes as possible and let the deer come to you. You'll be able to get a better look at it like this, while it jumps around in the air and prepares to slam into the ground. When it lands, dodge or jump to avoid the shockwave of frost, and then go all in on attacking the deer.\n![Foothills Walkthrough \\(61\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/65/Foothills_Walkthrough_%2861%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Foothills Walkthrough \\(58\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/38/Foothills_Walkthrough_%2858%29.png)\nTo make the first part of this fight easier, we'd recommend equipping the Wind Tamer as your vessel. It will wipe these tornadoes out as soon as you use it, and mean there's one less thing to focus on. The deer will still leap in the air and tread the clouds to attack you, but you won't need to worry about being hit by the annoying tornadoes. While this is useful once, you'll obviously need to wait for it to become available again, and in the meantime, the deer will continue to use this attack.\"\n        - Following Text: \"If you're taking it on without the vessel, the best thing you can do is get as far away from the tornadoes as possible and let the deer come to you. You'll be able to get a better look at it like this, while it jumps around in the air and prepares to slam into the ground. When it lands, dodge or jump to avoid the shockwave of frost, and then go all in on attacking the deer.\n![Foothills Walkthrough \\(61\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/65/Foothills_Walkthrough_%2861%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a large, mythical deer-like creature in a snowy, rocky landscape, likely from the video game \"Black Myth: Wukong.\" The context suggests this scene is part of a boss fight where the player must contend with the creature's aerial and frost-based attacks. The preceding and following text provide strategies for dealing with the creature, either by using the Wind Tamer vessel to eliminate tornadoes or by dodging and attacking when the creature lands."
}