{
    "chunk_id": 166403451655,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/43/Furnace_Valley_Walkthrough_%28105%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(105\\).png",
    "position_desc": 63,
    "img_above_text": "![Furnace Valley Walkthrough \\(113\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/76/Furnace_Valley_Walkthrough_%28113%29.png)\nContinue up the stairs to the left, and follow the rocky path up to the top of the mountain, where you'll reach the Ashen Pass III Keeper's Shrine and be ready to take on the Field of Fire.",
    "img_below_text": "If you haven't already, go back to the Valley Entrance to get the Dark Thunder Transformation Spell from Ma Tianba in the dead cart. You'll know when you arrive if you'll get the spell, as he'll tell you to come closer before his soul departs. This time, the option to Pull Forcefully will appear. Pull the whip and you'll receive the Dark Thunder spell.\nFurnace Valley Complete",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Furnace Valley Walkthrough \\(113\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/76/Furnace_Valley_Walkthrough_%28113%29.png)\nContinue up the stairs to the left, and follow the rocky path up to the top of the mountain, where you'll reach the Ashen Pass III Keeper's Shrine and be ready to take on the Field of Fire.\"\n        - Following Text: \"If you haven't already, go back to the Valley Entrance to get the Dark Thunder Transformation Spell from Ma Tianba in the dead cart. You'll know when you arrive if you'll get the spell, as he'll tell you to come closer before his soul departs. This time, the option to Pull Forcefully will appear. Pull the whip and you'll receive the Dark Thunder spell.\nFurnace Valley Complete\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game \"Black Myth: Wukong,\" showing a character navigating a rocky, mountainous terrain with a large staff in hand. The character appears to be approaching a glowing, electrified area, possibly a significant location or objective in the game. This scene is part of the Furnace Valley walkthrough, specifically leading up to the Ashen Pass III Keeper's Shrine and the Field of Fire. The preceding text advises players to continue up the stairs and follow the path to this point, while the following text suggests returning to the Valley Entrance to obtain the Dark Thunder Transformation Spell from an NPC named Ma Tianba."
}