{
    "chunk_id": 840997248850,
    "source_file": "Buddha%27s_Eyeball_Locations.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a5/Buddhas_Eyeball_8.jpg",
    "alt_text": "Buddhas Eyeball 8.jpg",
    "position_desc": 6,
    "img_above_text": "### Black Myth: Wukong Buddha's Eyeball 5 Location\nA little further on, on the left side of the area, you will see a covered area of the cave with some more Blazebones. This is before the Rockrest Flat Shrine. On your left, there will be a path curving up to another caved area.",
    "img_below_text": "Continue up the hill and you will find the Mother of Stones boss. Either fight her, or leave her for later. Take a right where the light is shining through the cave at the top, and you will find the Buddha statue with the eyeball on the cliff edge.\nBuddha's Eyeball 5",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"### Black Myth: Wukong Buddha's Eyeball 5 Location\nA little further on, on the left side of the area, you will see a covered area of the cave with some more Blazebones. This is before the Rockrest Flat Shrine. On your left, there will be a path curving up to another caved area.\"\n        - Following Text: \"Continue up the hill and you will find the Mother of Stones boss. Either fight her, or leave her for later. Take a right where the light is shining through the cave at the top, and you will find the Buddha statue with the eyeball on the cliff edge.\nBuddha's Eyeball 5\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game *Black Myth: Wukong*, showing the player character standing in a dimly lit cave area illuminated by fire braziers. The setting matches the description of the path leading to the \"Buddha's Eyeball 5\" location, just before encountering the Mother of Stones boss. The environment features rugged terrain and a glowing light source in the distance, guiding the player forward."
}