{
    "chunk_id": 818298151569,
    "source_file": "Temple_of_Yellow_Flowers_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/86/Wukong_YellowFlower_14.jpg",
    "alt_text": "Wukong YellowFlower 14.jpg",
    "position_desc": 12,
    "img_above_text": "First, you should head left to defeat a Snake Herbalist, and then explore a far cliff where a small ledge holds a **Meditation Spot** where you can get a free Skill Point.\nThe Height, Forest of Ferocity Meditation Spot",
    "img_below_text": "Next, take the right path to defeat the group of Sword Daoists practicing, and beyond them you'll find two more Worm Practitioners by a broken building with a green Wisp. Defeat them both, and you should gain the **Virtuous Bamboo Engraving Curio**.\n![Wukong YellowFlower 15.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8d/Wukong_YellowFlower_15.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"First, you should head left to defeat a Snake Herbalist, and then explore a far cliff where a small ledge holds a **Meditation Spot** where you can get a free Skill Point.\nThe Height, Forest of Ferocity Meditation Spot\"\n        - Following Text: \"Next, take the right path to defeat the group of Sword Daoists practicing, and beyond them you'll find two more Worm Practitioners by a broken building with a green Wisp. Defeat them both, and you should gain the **Virtuous Bamboo Engraving Curio**.\n![Wukong YellowFlower 15.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8d/Wukong_YellowFlower_15.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game *Black Myth: Wukong*, showing the player character wielding a fiery staff and standing on a stone path in a forested area. In the background, two enemies (likely Worm Practitioners) are visible near a broken building, with a glowing green Wisp marked by a red circle. This location aligns with the guide's description of the area where players must defeat the Worm Practitioners to obtain the **Virtuous Bamboo Engraving Curio**."
}