{
    "chunk_id": 142897521033,
    "source_file": "Foothills_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5a/Foothills_Walkthrough_%28129%29.png",
    "alt_text": "Foothills Walkthrough \\(129\\).png",
    "position_desc": 22,
    "img_above_text": "Thankfully, with a limited range of attacks and a fairly straightforward way to avoid them, Jiao-Loong of Waves shouldn't require too much to take it down. Don't feel the need to conserve your spells during this fight; take advantage of them to quickly take down this miniboss.\nJiao-Loong of Waves",
    "img_below_text": "With your first optional miniboss defeated, it's time to work on clearing out the rest of the Foothills. From the area where you fought Jiao-Loong of Waves, ascend and look to the left. You should be able to see another body of water here, on a higher part of the cliff.\n![Foothills Walkthrough \\(133\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/86/Foothills_Walkthrough_%28133%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Thankfully, with a limited range of attacks and a fairly straightforward way to avoid them, Jiao-Loong of Waves shouldn't require too much to take it down. Don't feel the need to conserve your spells during this fight; take advantage of them to quickly take down this miniboss.\nJiao-Loong of Waves\"\n        - Following Text: \"With your first optional miniboss defeated, it's time to work on clearing out the rest of the Foothills. From the area where you fought Jiao-Loong of Waves, ascend and look to the left. You should be able to see another body of water here, on a higher part of the cliff.\n![Foothills Walkthrough \\(133\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/86/Foothills_Walkthrough_%28133%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character in \"Black Myth: Wukong\" hovering on a cloud, overlooking a lush, mountainous area with bodies of water and dense vegetation. A red arrow in the image points toward a higher part of the cliff, guiding the player to the next objective after defeating the miniboss \"Jiao-Loong of Waves.\" This serves as a visual cue for navigating the Foothills area."
}