{
    "chunk_id": 207494114360,
    "source_file": "First_Prince_of_Flowing_Sands.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/02/Wukong_RedLoong_2.jpg",
    "alt_text": "Wukong RedLoong 2.jpg",
    "position_desc": 9,
    "img_above_text": "Once he’s been defeated, he’ll drop the **Arhat Gold Piece** Key Item. We'll need it for a sidequest elsewhere in this chapter.\n### The Loong’s Secret Tomb",
    "img_below_text": "If you got lucky, the First Prince’s attacks may have formed a giant crack in the slightly rounded wall full of little statues on the side of the boss arena, forming a hole you can slide through. If you weren’t able to trigger this, don't worry. You can crack the wall yourself, but it will require a major attack, much bigger than your little monkey frame can deal out. However, specific transformations will get the job done - like the Wandering Wight’s Spirit headbutt attack, or the Azure Dust transformation spell found elsewhere in this chapter.\n![Wukong RedLoong 3.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fb/Wukong_RedLoong_3.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Once he’s been defeated, he’ll drop the **Arhat Gold Piece** Key Item. We'll need it for a sidequest elsewhere in this chapter.\n### The Loong’s Secret Tomb\"\n        - Following Text: \"If you got lucky, the First Prince’s attacks may have formed a giant crack in the slightly rounded wall full of little statues on the side of the boss arena, forming a hole you can slide through. If you weren’t able to trigger this, don't worry. You can crack the wall yourself, but it will require a major attack, much bigger than your little monkey frame can deal out. However, specific transformations will get the job done - like the Wandering Wight’s Spirit headbutt attack, or the Azure Dust transformation spell found elsewhere in this chapter.\n![Wukong RedLoong 3.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fb/Wukong_RedLoong_3.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the protagonist standing near a cracked wall adorned with numerous small statues, holding a fiery staff. A prompt labeled \"RT Go In\" suggests the player can interact with the wall to enter through the crack. This scene aligns with the following text, which explains that the wall can be broken either by the First Prince’s attacks or specific transformations, allowing access to a hidden area in the boss arena."
}