{
    "chunk_id": 763445278536,
    "source_file": "Woods_of_Ember_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/dc/Woods_Ember_Walkthrough_%2838%29.png",
    "alt_text": "Woods Ember Walkthrough \\(38\\).png",
    "position_desc": 12,
    "img_above_text": "![Woods Ember Walkthrough \\(22\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/01/Woods_Ember_Walkthrough_%2822%29.png)\nThe most beneficial thing to you here is the fire from above. He is also impacted by the fire attacks, so watch where the projectiles land and bait him into standing in the vicinity of them. This will build up his Fire Damage, weakening his health bar while you attack, and also completely stagger him at times, leaving him vulnerable to longer combos and heavier attacks.",
    "img_below_text": "When you've knocked his health bar almost all the way down, he will kneel. To make the area safer, clear out the rest of the fighting Yaoguais, then approach the Pale-Axe Stalwart, who will now become an NPC with his own side quest for you to complete.\nPale-Axe Stalwart",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Woods Ember Walkthrough \\(22\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/01/Woods_Ember_Walkthrough_%2822%29.png)\nThe most beneficial thing to you here is the fire from above. He is also impacted by the fire attacks, so watch where the projectiles land and bait him into standing in the vicinity of them. This will build up his Fire Damage, weakening his health bar while you attack, and also completely stagger him at times, leaving him vulnerable to longer combos and heavier attacks.\"\n        - Following Text: \"When you've knocked his health bar almost all the way down, he will kneel. To make the area safer, clear out the rest of the fighting Yaoguais, then approach the Pale-Axe Stalwart, who will now become an NPC with his own side quest for you to complete.\nPale-Axe Stalwart\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game *Black Myth: Wukong*, showing a player character facing off against the \"Pale-Axe Stalwart,\" a large humanoid enemy. The environment is a desolate, rocky area with fire scattered on the ground, which plays a strategic role in weakening the enemy by building up fire damage. The preceding text suggests using fire projectiles to stagger the enemy for longer combos, while the following text indicates that once the enemy's health is depleted, it transitions into an NPC offering a side quest."
}