{
    "chunk_id": 650395382246,
    "source_file": "Macaque_Chief.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/20/Wukong_Snowhill_15.jpg",
    "alt_text": "Wukong Snowhill 15.jpg",
    "position_desc": 5,
    "img_above_text": "![Wukong Snowhill 14.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/23/Wukong_Snowhill_14.jpg)\nHe'll step back to grab the sword with his foot and jump onto its hilt, before preforming a quick roll along the ground to drag the sword in a whirlwind slice with a large reach to it, followed by a final downward slam, so don't press your attack too hard during this combo, or Immobilize him before the second part of his combo.",
    "img_below_text": "A longer deadly combo attack he can employ comes with three quick slashes ending in a jumping upward slash. After a brief pause in the air, he'll use his foot to send the blade slamming down vertically, and then yank it back up in an arc for a final two-hand diagonal slice attack. Your Rock Solid won't always stagger him mid-combo, so it's better to wait and parry the final slice so you can retaliate faster.\n![Wukong Snowhill 16.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/12/Wukong_Snowhill_16.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Snowhill 14.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/23/Wukong_Snowhill_14.jpg)\nHe'll step back to grab the sword with his foot and jump onto its hilt, before preforming a quick roll along the ground to drag the sword in a whirlwind slice with a large reach to it, followed by a final downward slam, so don't press your attack too hard during this combo, or Immobilize him before the second part of his combo.\"\n        - Following Text: \"A longer deadly combo attack he can employ comes with three quick slashes ending in a jumping upward slash. After a brief pause in the air, he'll use his foot to send the blade slamming down vertically, and then yank it back up in an arc for a final two-hand diagonal slice attack. Your Rock Solid won't always stagger him mid-combo, so it's better to wait and parry the final slice so you can retaliate faster.\n![Wukong Snowhill 16.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/12/Wukong_Snowhill_16.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight in *Black Myth: Wukong* against the \"Macaque Chief\" in a snowy environment. The boss, a large humanoid creature wielding a massive sword, is mid-attack, showcasing its dynamic and aggressive combat style. The player character, Wukong, is positioned defensively, with visible health and ability indicators at the bottom of the screen. This scene aligns with the guide's description of the boss's powerful combo attacks and emphasizes the need for strategic timing to counter its moves effectively."
}