{
    "chunk_id": 491284240303,
    "source_file": "Valley_of_Ecstasy_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/05/Wukong_Felicity_11.jpg",
    "alt_text": "Wukong Felicity 11.jpg",
    "position_desc": 37,
    "img_above_text": "Defeat this third frog menace, and you'll gain another Tadpole and other materials to upgrade your Spirits and gear.\nLang-Li-Guhh-Lang",
    "img_below_text": "You can head up the canyon past where the frog miniboss was to find some plants to harvest and a path leading into a large forested field where the Towers of Karma are, but first we'll head back to the main road.\n![Wukong Felicity 13.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/83/Wukong_Felicity_13.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Defeat this third frog menace, and you'll gain another Tadpole and other materials to upgrade your Spirits and gear.\nLang-Li-Guhh-Lang\"\n        - Following Text: \"You can head up the canyon past where the frog miniboss was to find some plants to harvest and a path leading into a large forested field where the Towers of Karma are, but first we'll head back to the main road.\n![Wukong Felicity 13.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/83/Wukong_Felicity_13.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a snowy canyon environment from the game *Black Myth: Wukong*. The player character, armed with a staff, is navigating through the icy terrain surrounded by rocky cliffs and sparse vegetation. The preceding text suggests the player has recently defeated a frog miniboss and obtained rewards, while the following text indicates the player can explore further up the canyon to gather resources and access a forested area leading to the Towers of Karma. The image likely illustrates the transition area between these events."
}