{
    "chunk_id": 414334062836,
    "source_file": "Drunken_Boar_Questline.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/54/Wukong_Sahali_8.jpg",
    "alt_text": "Wukong Sahali 8.jpg",
    "position_desc": 15,
    "img_above_text": "If you notice him throw out sand and then raise his hand high while it begins to glow, be ready for him to summon his secret weapon — a large bladed ring with barbs that he can employ for the rest of his combo.\nCertain times, he’ll start with a large downward slash, and then follow up after a delay with a second jumping slash attack, and then one final pivoting slash attack before it disappears into sand. As his health gets slower, he’ll add summoning the ring blade to his other combo attacks, but they can still be parried with Rock Solid.",
    "img_below_text": "If you try to pull back too far away from him, he also has a few more sandy surprises. Instead of crafting a ring blade, he can also summon a spear of sand behind his back that glows as it appears, and then he’ll launch it at you extremely fast.\n![Wukong Sahali 9.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/07/Wukong_Sahali_9.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"If you notice him throw out sand and then raise his hand high while it begins to glow, be ready for him to summon his secret weapon — a large bladed ring with barbs that he can employ for the rest of his combo.\nCertain times, he’ll start with a large downward slash, and then follow up after a delay with a second jumping slash attack, and then one final pivoting slash attack before it disappears into sand. As his health gets slower, he’ll add summoning the ring blade to his other combo attacks, but they can still be parried with Rock Solid.\"\n        - Following Text: \"If you try to pull back too far away from him, he also has a few more sandy surprises. Instead of crafting a ring blade, he can also summon a spear of sand behind his back that glows as it appears, and then he’ll launch it at you extremely fast.\n![Wukong Sahali 9.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/07/Wukong_Sahali_9.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat encounter in *Black Myth: Wukong*, showcasing the player character facing off against an enemy named \"Yellow-Robed Squire\" in a desolate, sandy environment. The enemy appears to be preparing an attack, possibly involving sand-based abilities as described in the preceding and following text. The UI displays health bars, ability icons, and controls, emphasizing the tactical nature of the fight and the need to react to the enemy's sand weaponry and combos."
}