{
    "chunk_id": 617658381309,
    "source_file": "Chapter_5_Secret_-_Bishui_Cave_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/28/Bishui_Cave_Walkthrough_%2818%29.png",
    "alt_text": "Bishui Cave Walkthrough \\(18\\).png",
    "position_desc": 5,
    "img_above_text": "![Bishui Cave Walkthrough \\(15\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/cf/Bishui_Cave_Walkthrough_%2815%29.png)\nIt turns out that the spiked gold ball is hiding a secret inside, which is two minibosses for you to take on. They will both use a portion of the ball as a shield and have a sword to complement it.",
    "img_below_text": "Like the other pairs of bosses in the chapters, you'll have them attack you in succession. You'll start with Bottom Takes Top, who will cycle through two moves. He'll leap at you -- just dodge back from this -- and then roll into the ball. You can attack him while he regains his composure when he's inside it.\nTo follow this, he'll put his sword away, then jump at you and slam the ball down. He'll then drag it around him. Both of these attacks can be avoided by keeping your distance. Attack when he's getting himself back together, and chip away at his health steadily.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Bishui Cave Walkthrough \\(15\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/cf/Bishui_Cave_Walkthrough_%2815%29.png)\nIt turns out that the spiked gold ball is hiding a secret inside, which is two minibosses for you to take on. They will both use a portion of the ball as a shield and have a sword to complement it.\"\n        - Following Text: \"Like the other pairs of bosses in the chapters, you'll have them attack you in succession. You'll start with Bottom Takes Top, who will cycle through two moves. He'll leap at you -- just dodge back from this -- and then roll into the ball. You can attack him while he regains his composure when he's inside it.\nTo follow this, he'll put his sword away, then jump at you and slam the ball down. He'll then drag it around him. Both of these attacks can be avoided by keeping your distance. Attack when he's getting himself back together, and chip away at his health steadily.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts two minibosses from the video game *Black Myth: Wukong*, named \"Top Takes Bottom\" and \"Bottom Takes Top.\" Both characters are shown wielding portions of a spiked gold ball as shields and carrying swords. The preceding and following text explains their attack patterns and strategies for defeating them, emphasizing dodging their moves and attacking during their recovery phases. The image visually introduces these minibosses in the Bishui Cave chapter."
}