{
    "chunk_id": 432291568211,
    "source_file": "Snowhill_Path_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a2/Wukong_Snowhill_3.jpg",
    "alt_text": "Wukong Snowhill 3.jpg",
    "position_desc": 2,
    "img_above_text": "![Wukong Snowhill 2.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e1/Wukong_Snowhill_2.jpg)\nThese foes are fairly slow but durable, and will use the large stones they carry to try pummeling you with. Thankfully, they are fairly susceptible to being deflected with Rock Solid.",
    "img_below_text": "Head up the stairs at the end of the path to reach a high ledge in the cave, and on the way down you'll meet another new enemy. These Cyan Bats like to cling to ceiling and drop down to ambush you. While they are way less durable than the Swift Bats of the Yellow Wind Ridge, they can dive at you with their spears, or send ice attack projectiles your way that will try to inflict you with frostbite. If they try to dart out of reach, use the Thrust Stance to chase them down.\n![Wukong Snowhill 4.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a6/Wukong_Snowhill_4.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Snowhill 2.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e1/Wukong_Snowhill_2.jpg)\nThese foes are fairly slow but durable, and will use the large stones they carry to try pummeling you with. Thankfully, they are fairly susceptible to being deflected with Rock Solid.\"\n        - Following Text: \"Head up the stairs at the end of the path to reach a high ledge in the cave, and on the way down you'll meet another new enemy. These Cyan Bats like to cling to ceiling and drop down to ambush you. While they are way less durable than the Swift Bats of the Yellow Wind Ridge, they can dive at you with their spears, or send ice attack projectiles your way that will try to inflict you with frostbite. If they try to dart out of reach, use the Thrust Stance to chase them down.\n![Wukong Snowhill 4.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a6/Wukong_Snowhill_4.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a gameplay scene from *Black Myth: Wukong*, set in a snowy, rocky cave environment. The player character is engaged in combat with an enemy wielding a large stone, as indicated by the preceding text describing slow but durable foes. The HUD displays various abilities and health bars, suggesting active combat mechanics. The bright light at the cave's exit hints at progression toward the next area, where new enemies like Cyan Bats are introduced, as mentioned in the following text."
}