{
    "chunk_id": 451010820309,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8a/Wukong_Wolves_29.jpg",
    "alt_text": "Wukong Wolves 29.jpg",
    "position_desc": 36,
    "img_above_text": "![Wukong Wolves 28.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f9/Wukong_Wolves_28.jpg)\nThere’s more optional things to explore in this wide area however, starting by taking the path to the left past the first two Wolves near the Shrine. Past several fallen trees, some **Purple Lingzhi** and **Aged Ginseng** , you can reach a small peak with broken pillars and a Wolf guarding some pots to break for Will.",
    "img_below_text": "Near this peak is a bridge, where you’ll find a Bandit Chief with a large sword guarding a chest. He can perform some surprisingly agile lunging attacks, and his multi-hit sword swings can deal a lot of damage. Each of his combos end with a large downward slam, and gives you a wide opening to begin your counter-attack as he struggles to pull his blade out of the ground. For as tough as he is, he luckily won’t respawn when defeated.\nOnce he’s gone, help yourself to the chest to find 2 **Evil Repelling Medicament** and 5 **Tiny Piece of Gold**!",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Wolves 28.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f9/Wukong_Wolves_28.jpg)\nThere’s more optional things to explore in this wide area however, starting by taking the path to the left past the first two Wolves near the Shrine. Past several fallen trees, some **Purple Lingzhi** and **Aged Ginseng** , you can reach a small peak with broken pillars and a Wolf guarding some pots to break for Will.\"\n        - Following Text: \"Near this peak is a bridge, where you’ll find a Bandit Chief with a large sword guarding a chest. He can perform some surprisingly agile lunging attacks, and his multi-hit sword swings can deal a lot of damage. Each of his combos end with a large downward slam, and gives you a wide opening to begin your counter-attack as he struggles to pull his blade out of the ground. For as tough as he is, he luckily won’t respawn when defeated.\nOnce he’s gone, help yourself to the chest to find 2 **Evil Repelling Medicament** and 5 **Tiny Piece of Gold**!\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game *Black Myth: Wukong*, showing the player character approaching a Wolf enemy near a chest highlighted with a red circle. The surrounding environment is a lush forest with broken pillars and fallen trees, aligning with the walkthrough's description of an optional exploration area. This location features collectible items and enemies, with the chest likely containing rewards for defeating the Wolf."
}