{
    "chunk_id": 678768727189,
    "source_file": "Chapter_3_Secret_-_Mount_Mei_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/17/Mount_Mei_Walkthrough_%285%29.png",
    "alt_text": "Mount Mei Walkthrough \\(5\\).png",
    "position_desc": 3,
    "img_above_text": "As you reach the peak of the mountain, you'll see a black dog. It will run toward the building at the top of the peak and soon join Erlang, The Sacred Divinity, who you fought at the very beginning of the game. This time, however, it's a bigger challenge.\nErlang is undoubtedly one of the toughest bosses in the game. To make it harder, he has a health bar and a shield bar, and you'll need to deplete his shield to do maximum damage. There is a quick way to knock this down, however, and that's to use the Plantain Fan. Each time you're able to throw this out, it will get his shield gone in a few seconds. You can then make the most of his vulnerable state, by following up with heavy attacks.",
    "img_below_text": "You can opt for a build where you try to use spells against Erlang, but he's pretty good at countering them all. For example, if you use a Transformation, he will transform as well, and sometimes will just remove your Transformation entirely. If you are going for spells, Immobilize is good but only when you've knocked his shield down. Be mindful that he can use it against you as well. Cloudstep also is useful to evade the more dangerous attacks and sneak up on him. If you do go with Spells, you'll want to get your Plantain Fan back as quickly as possible to keep knocking down his shield.\nHowever, we'd actually recommend using Spellbinder (fully upgraded), which you'll have picked up from the Treasure Hunter/Green-Capped Martialist side quest in Chapter 3. Equip medicines like the Loong Aura Amplication Pellets and Enhanced Tiger Subduing Pellets to make the most out of your Attacks and Critical Hit chances. It's also worth using Ginseng Pellets to help you with Focus recovery, and if you're finding it very hard, you might want to take the Soul Remigration Pill, which will resurrect you if you die.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"As you reach the peak of the mountain, you'll see a black dog. It will run toward the building at the top of the peak and soon join Erlang, The Sacred Divinity, who you fought at the very beginning of the game. This time, however, it's a bigger challenge.\nErlang is undoubtedly one of the toughest bosses in the game. To make it harder, he has a health bar and a shield bar, and you'll need to deplete his shield to do maximum damage. There is a quick way to knock this down, however, and that's to use the Plantain Fan. Each time you're able to throw this out, it will get his shield gone in a few seconds. You can then make the most of his vulnerable state, by following up with heavy attacks.\"\n        - Following Text: \"You can opt for a build where you try to use spells against Erlang, but he's pretty good at countering them all. For example, if you use a Transformation, he will transform as well, and sometimes will just remove your Transformation entirely. If you are going for spells, Immobilize is good but only when you've knocked his shield down. Be mindful that he can use it against you as well. Cloudstep also is useful to evade the more dangerous attacks and sneak up on him. If you do go with Spells, you'll want to get your Plantain Fan back as quickly as possible to keep knocking down his shield.\nHowever, we'd actually recommend using Spellbinder (fully upgraded), which you'll have picked up from the Treasure Hunter/Green-Capped Martialist side quest in Chapter 3. Equip medicines like the Loong Aura Amplication Pellets and Enhanced Tiger Subduing Pellets to make the most out of your Attacks and Critical Hit chances. It's also worth using Ginseng Pellets to help you with Focus recovery, and if you're finding it very hard, you might want to take the Soul Remigration Pill, which will resurrect you if you die.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a climactic boss encounter with Erlang, The Sacred Divinity, at the peak of a snowy mountain. The player character, wielding a glowing weapon, faces Erlang, who is emerging from a radiant, mystical portal. This scene aligns with the guide's description of the challenging battle against Erlang, emphasizing strategies such as using the Plantain Fan to break his shield and exploiting his vulnerable state with heavy attacks or spells. The visual reinforces the intensity of the fight and the importance of preparation and tactics."
}