{
    "chunk_id": 390329835503,
    "source_file": "Yellow_Sand_Formation_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7b/Wukong_Yellow_35.jpg",
    "alt_text": "Wukong Yellow 35.jpg",
    "position_desc": 36,
    "img_above_text": "![Wukong Yellow 34.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4f/Wukong_Yellow_34.jpg)\nBe sure to travel back to the Crouching Tiger Temple entrance next, and look for him near the top of the stairs to the right — opposite where the Meditation Spot is. He’ll be resting against the far wall, and complaining about the meat. What he really wants now is some Jade Lotus. You should already have plenty of that stored away, but if not, you can easily find some in most pools of water, especially the large pool where you first entered the chapter.",
    "img_below_text": "Give it to him, and he’ll give you a cryptic message about the Realm of Gold located where the sun sets, but it’s not a lot to go on. He also mentions the Yellow Wind Guai said “our senior brother gave me a piece of gold. I’ll need it here when the time’s right.” The Boar thinks the time is right to try it now.\nIt’s a bit of a riddle, but the “senior brother” was the First Prince of Flowing Sand that you fought in the Valley of Despair, who just happened to drop the Arhat Gold Piece. All that’s left is to bring it to the right place, which happens to be back where you first encountered the Boar Guai.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Yellow 34.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4f/Wukong_Yellow_34.jpg)\nBe sure to travel back to the Crouching Tiger Temple entrance next, and look for him near the top of the stairs to the right — opposite where the Meditation Spot is. He’ll be resting against the far wall, and complaining about the meat. What he really wants now is some Jade Lotus. You should already have plenty of that stored away, but if not, you can easily find some in most pools of water, especially the large pool where you first entered the chapter.\"\n        - Following Text: \"Give it to him, and he’ll give you a cryptic message about the Realm of Gold located where the sun sets, but it’s not a lot to go on. He also mentions the Yellow Wind Guai said “our senior brother gave me a piece of gold. I’ll need it here when the time’s right.” The Boar thinks the time is right to try it now.\nIt’s a bit of a riddle, but the “senior brother” was the First Prince of Flowing Sand that you fought in the Valley of Despair, who just happened to drop the Arhat Gold Piece. All that’s left is to bring it to the right place, which happens to be back where you first encountered the Boar Guai.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from *Black Myth: Wukong*, showing the protagonist standing near a large statue at the Crouching Tiger Temple. To the right, the Boar Guai character is seated, seemingly in conversation with the protagonist. This moment aligns with the narrative where the Boar Guai expresses readiness to use the Arhat Gold Piece, referencing a cryptic riddle about the \"Realm of Gold.\" The setting emphasizes the temple's intricate design and the ongoing quest progression."
}