{
    "chunk_id": 163974886031,
    "source_file": "Feng-Tail_General.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3e/Foothills_Walkthrough_%2824%29.png",
    "alt_text": "Foothills Walkthrough \\(24\\).png",
    "position_desc": 2,
    "img_above_text": "When the first Poison Chief is down, fly up and continue left toward the water. Go almost to the end of the water, where you should see a giant creature. When you get close to it, it will leap in the air and jump to a nearby rock. Fly over to it, then land on its head.\n## Feng-Tail General Boss Fight and Guides",
    "img_below_text": "The boss fight against the Feng-Tail General is more of a skill check than anything, testing out whether you've got the necessary health and stamina to continue.\n![Foothills Walkthrough \\(30\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c5/Foothills_Walkthrough_%2830%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"When the first Poison Chief is down, fly up and continue left toward the water. Go almost to the end of the water, where you should see a giant creature. When you get close to it, it will leap in the air and jump to a nearby rock. Fly over to it, then land on its head.\n## Feng-Tail General Boss Fight and Guides\"\n        - Following Text: \"The boss fight against the Feng-Tail General is more of a skill check than anything, testing out whether you've got the necessary health and stamina to continue.\n![Foothills Walkthrough \\(30\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c5/Foothills_Walkthrough_%2830%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dramatic, silhouetted view of a giant insect-like creature perched on a rocky outcrop in a dark, mountainous landscape under a cloudy sky. This scene appears to set the stage for the encounter with the Feng-Tail General, a boss fight in the game, as described in the surrounding text. The creature's imposing presence emphasizes the challenge ahead, aligning with the guide's focus on preparing players for this pivotal moment."
}