{
    "chunk_id": 679630441572,
    "source_file": "Rat_Sage_Staff.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/08/Rat_Sage_Staff_2.jpg",
    "alt_text": "Rat Sage Staff 2.jpg",
    "position_desc": 1,
    "img_above_text": "The Rat Sage Staff Staff is an Epic weapon in Black Myth: Wukong. It comes with solid stats, damage, and a decent, albeit easily outbeaten unique effect compared to the other Weapons in the game.\nThe weapon comes with a respectable 66 damage, and the unique effect of making the fourth move of a light attack combo and the mobile staff spin stir up a whirlwind of sands, increasing attack range and damage.",
    "img_below_text": "## Black Myth: Wukong Rat Sage Staff Location\nThe Rat Sage Staff can be found in Chapter 2 - Yellow Wind Ridge upon defeating Yellow Wind Sage at the end of the chapter. This is a mandatory boss that is at the end of the chapter, so you can't miss him.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Rat Sage Staff Staff is an Epic weapon in Black Myth: Wukong. It comes with solid stats, damage, and a decent, albeit easily outbeaten unique effect compared to the other Weapons in the game.\nThe weapon comes with a respectable 66 damage, and the unique effect of making the fourth move of a light attack combo and the mobile staff spin stir up a whirlwind of sands, increasing attack range and damage.\"\n        - Following Text: \"## Black Myth: Wukong Rat Sage Staff Location\nThe Rat Sage Staff can be found in Chapter 2 - Yellow Wind Ridge upon defeating Yellow Wind Sage at the end of the chapter. This is a mandatory boss that is at the end of the chapter, so you can't miss him.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image showcases the \"Rat Sage Staff,\" an Epic weapon in *Black Myth: Wukong*. It highlights the weapon's stats, including 66 Attack and 7% Critical Hit Chance, along with its unique effect: the fourth move of a light attack combo and mobile staff spin create a whirlwind of sands, increasing attack range and damage. The weapon is obtained in Chapter 2 - Yellow Wind Ridge by defeating the mandatory boss, Yellow Wind Sage."
}