{
    "chunk_id": 56356728957,
    "source_file": "New_Thunderclap_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/20/Wukong_Thunderclap_47.jpg",
    "alt_text": "Wukong Thunderclap 47.jpg",
    "position_desc": 46,
    "img_above_text": "Many Censor Holders pray around this area, but most will ignore you. There's also a lone Overseeing Monk praying to an altar off to the left, which holds another green Wisp to absorb.\nOnce you reach the top of the stairs, you'll find a few small sealed shacks on the side with Overseeing Monks, and the main building entrance guarded by two Thunder Rhino Masters.",
    "img_below_text": "After defeating them, you can spot a lone monk standing inside. This is the target of the Snow Fox's quest for revenge, and you can now use the Snow Fox Brush in your inventory to transform into The Fox, and step inside to trigger a cutscene (if you enter first you can speak to him, but transforming near the monk will instantly trigger the fight without a scene).\n## Yaoguai Chief Miniboss Fight - Non-Void",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Many Censor Holders pray around this area, but most will ignore you. There's also a lone Overseeing Monk praying to an altar off to the left, which holds another green Wisp to absorb.\nOnce you reach the top of the stairs, you'll find a few small sealed shacks on the side with Overseeing Monks, and the main building entrance guarded by two Thunder Rhino Masters.\"\n        - Following Text: \"After defeating them, you can spot a lone monk standing inside. This is the target of the Snow Fox's quest for revenge, and you can now use the Snow Fox Brush in your inventory to transform into The Fox, and step inside to trigger a cutscene (if you enter first you can speak to him, but transforming near the monk will instantly trigger the fight without a scene).\n## Yaoguai Chief Miniboss Fight - Non-Void\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character approaching the entrance of a grand temple-like structure with an ornate altar inside. A monk is seen praying before the altar, which is central to the narrative progression described in the context. This area serves as a key location for triggering a cutscene or initiating a fight related to the Snow Fox's quest for revenge."
}