{
    "chunk_id": 805072025884,
    "source_file": "Secret_Bosses_in_Black_Myth_Wukong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b7/How_To_Find_Yellow_Loong_%284%29.png",
    "alt_text": "How To Find Yellow Loong \\(4\\).png",
    "position_desc": 9,
    "img_above_text": "Chapter 4 brings a conclusion to the run of secret Loong bosses, but is also packed with plenty of hidden bosses, including 3 in a secret area.\n## Yellow Loong",
    "img_below_text": "As you make your way through the Webbed Hollow, you'll start to work toward the bottom of the area, past the Cliff of Oblivion. This is where you can find the Relief of the Fallen Loong, and Yellow Loong waiting at the edge of the nearby cliff.\nYellow Loong",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Chapter 4 brings a conclusion to the run of secret Loong bosses, but is also packed with plenty of hidden bosses, including 3 in a secret area.\n## Yellow Loong\"\n        - Following Text: \"As you make your way through the Webbed Hollow, you'll start to work toward the bottom of the area, past the Cliff of Oblivion. This is where you can find the Relief of the Fallen Loong, and Yellow Loong waiting at the edge of the nearby cliff.\nYellow Loong\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the Yellow Loong, a hidden boss encountered in Chapter 4 of the game. Set in a lush, rocky environment near the Webbed Hollow and Cliff of Oblivion, the character is shown wielding a weapon and delivering a threatening line, \"I'll kill you to unbind our destinies.\" This scene highlights the boss's role as a significant challenge tied to the narrative and exploration of the secret area."
}