{
    "chunk_id": 50445672189,
    "source_file": "Plaguebane_Gourd.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/91/Old_Rattle-Drum_Spot_3.jpg",
    "alt_text": "Old Rattle-Drum Spot 3.jpg",
    "position_desc": 4,
    "img_above_text": "Finally, the last location is in Sandgate Village. From the Village Entrance Shrine, head through the gate you opened when you fought Earth Wolf in the large courtyard. You will have also seen the horseman here tied to a post. To the left of that post, where he was tied, is a small path leading to a well.\nHere you can use the drum and summon the boy who will lead you down into the well.",
    "img_below_text": "If you defeat the Mad Tiger down here, you will be able to open the chest and get yourself the Gourd.\nFor even more guides and tips on finding all the Gourd customisation items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, Awaken Wine Worm locations, and Luoija Fragrant Vine locations.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Finally, the last location is in Sandgate Village. From the Village Entrance Shrine, head through the gate you opened when you fought Earth Wolf in the large courtyard. You will have also seen the horseman here tied to a post. To the left of that post, where he was tied, is a small path leading to a well.\nHere you can use the drum and summon the boy who will lead you down into the well.\"\n        - Following Text: \"If you defeat the Mad Tiger down here, you will be able to open the chest and get yourself the Gourd.\nFor even more guides and tips on finding all the Gourd customisation items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, Awaken Wine Worm locations, and Luoija Fragrant Vine locations.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from a video game set in Sandgate Village, showcasing a player character in a detailed environment with rocky terrain, dry vegetation, and a wooden structure. This location is part of a walkthrough where players are instructed to find a well near the horseman's post to summon a boy using a drum. The subsequent gameplay involves descending into the well to defeat the Mad Tiger and obtain the Gourd from a chest."
}