{
    "chunk_id": 539744822512,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/25/Furnace_Valley_Walkthrough_%2849%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(49\\).png",
    "position_desc": 24,
    "img_above_text": "As soon as you pass through the archway, the next boss battle will begin and you'll discover who was responsible for the voices you heard earlier.\n### Yaoguai Chief - Cloudy Mist, Misty Cloud",
    "img_below_text": "Cloudy Mist and Misty Cloud are another duo that will use different elements to fight you. You'll go up against Cloudy Mist first, who is the creature with the staff.\n![Furnace Valley Walkthrough \\(54\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a6/Furnace_Valley_Walkthrough_%2854%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"As soon as you pass through the archway, the next boss battle will begin and you'll discover who was responsible for the voices you heard earlier.\n### Yaoguai Chief - Cloudy Mist, Misty Cloud\"\n        - Following Text: \"Cloudy Mist and Misty Cloud are another duo that will use different elements to fight you. You'll go up against Cloudy Mist first, who is the creature with the staff.\n![Furnace Valley Walkthrough \\(54\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a6/Furnace_Valley_Walkthrough_%2854%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the Yaoguai Chief duo, \"Cloudy Mist\" and \"Misty Cloud,\" who serve as bosses in the game. The characters feature eerie, monstrous appearances, with one holding a staff. The text overlay introduces their names and a warning to intruders, suggesting their role as guardians of the Princess' palace. This scene marks the beginning of a boss battle after passing through an archway."
}