{
    "chunk_id": 660378289914,
    "source_file": "Chen_Loong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5c/Wukong_Bitter_20.jpg",
    "alt_text": "Wukong Bitter 20.jpg",
    "position_desc": 16,
    "img_above_text": "![Wukong Bitter 19.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d9/Wukong_Bitter_19.jpg)\nSpeak to him here, and he'll pass along a Special-made Bone-Strengthening Pellet for the poor old Loong. You'll also get the formula to make your own Fortifying Medicament for your trouble!",
    "img_below_text": "Return to Chen Loong (who now stands outside the shack by the water), and deliver the pellet to him. The old dragon will be overjoyed at your gift, and in return will pass along The Ruyi Scroll to you. He'll proclaim that he now has the strength to unseal the Painted Realm, where he and his fellow deities will now reside -- and you're invited!",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Bitter 19.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d9/Wukong_Bitter_19.jpg)\nSpeak to him here, and he'll pass along a Special-made Bone-Strengthening Pellet for the poor old Loong. You'll also get the formula to make your own Fortifying Medicament for your trouble!\"\n        - Following Text: \"Return to Chen Loong (who now stands outside the shack by the water), and deliver the pellet to him. The old dragon will be overjoyed at your gift, and in return will pass along The Ruyi Scroll to you. He'll proclaim that he now has the strength to unseal the Painted Realm, where he and his fellow deities will now reside -- and you're invited!\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the protagonist, Wukong, standing in a snowy area while examining a scroll. This scene aligns with the narrative progression described in the text, where Wukong receives \"The Ruyi Scroll\" as a reward from Chen Loong after delivering the Special-made Bone-Strengthening Pellet. The scroll is significant as it symbolizes the next step in the quest, involving the unsealing of the Painted Realm."
}