{
    "chunk_id": 526063502211,
    "source_file": "Temple_of_Yellow_Flowers_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3b/Wukong_YellowFlower_33.jpg",
    "alt_text": "Wukong YellowFlower 33.jpg",
    "position_desc": 31,
    "img_above_text": "![Wukong YellowFlower 32.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c8/Wukong_YellowFlower_32.jpg)\nExpect the lion-headed enemy to be tougher than the rest as you climb the first set of stairs, but defeating it will earn you the Snake Sheriff Spirit.",
    "img_below_text": "At the top of the other stairs, you'll find a small enclosed area where the Ancient Master sits alone, playing an instrument called the guqin. While you can talk to him about the Violet Spider, the more important item here is located just behind him in a glowing pot - an **Awaken Wine Worm** to add to your Gourds!\nTemple of Yellow Flowers Awaken Wine Worm",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong YellowFlower 32.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c8/Wukong_YellowFlower_32.jpg)\nExpect the lion-headed enemy to be tougher than the rest as you climb the first set of stairs, but defeating it will earn you the Snake Sheriff Spirit.\"\n        - Following Text: \"At the top of the other stairs, you'll find a small enclosed area where the Ancient Master sits alone, playing an instrument called the guqin. While you can talk to him about the Violet Spider, the more important item here is located just behind him in a glowing pot - an **Awaken Wine Worm** to add to your Gourds!\nTemple of Yellow Flowers Awaken Wine Worm\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the game where the player approaches an Ancient Master sitting under a large tree, playing a guqin. A glowing pot, highlighted with a red circle, is positioned behind the Ancient Master. This pot contains the **Awaken Wine Worm**, a key item for upgrading the player's Gourds, as mentioned in the following text. The setting is surrounded by yellow leaves and a serene atmosphere, emphasizing the importance of this location in the walkthrough."
}