{
    "chunk_id": 881041720129,
    "source_file": "Pagoda_Realm_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/43/Wukong_Pagoda_51.jpg",
    "alt_text": "Wukong Pagoda 51.jpg",
    "position_desc": 51,
    "img_above_text": "![Wukong Pagoda 53.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/01/Wukong_Pagoda_53.jpg)\nUp ahead, watch out for an ambushing Frozen Corpse before you reach another long wooden plank that you'll need to cross. You may also run into another Lantern Sentry on this section of the walkway, so be sure to take him out as well.",
    "img_below_text": "This plank will be even harder to cross than the first, as you'll have to not only deal with a Yaksha Archer on a small platform halfway across, but a second archer in an open cell window on the left, and another near the end of the wooden plank. Worse still -- there's a Cyan Bat hiding above the archer halfway across the plank who will divebomb you if you attempt to fight that archer, and likely send you toppling down to the level below to die from fall damage.\nIf you survive the fall, make sure to use the Incense Trail Talisman to quickly warp back to the Shrine instead of having to make the climb yet again.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Pagoda 53.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/01/Wukong_Pagoda_53.jpg)\nUp ahead, watch out for an ambushing Frozen Corpse before you reach another long wooden plank that you'll need to cross. You may also run into another Lantern Sentry on this section of the walkway, so be sure to take him out as well.\"\n        - Following Text: \"This plank will be even harder to cross than the first, as you'll have to not only deal with a Yaksha Archer on a small platform halfway across, but a second archer in an open cell window on the left, and another near the end of the wooden plank. Worse still -- there's a Cyan Bat hiding above the archer halfway across the plank who will divebomb you if you attempt to fight that archer, and likely send you toppling down to the level below to die from fall damage.\nIf you survive the fall, make sure to use the Incense Trail Talisman to quickly warp back to the Shrine instead of having to make the climb yet again.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a challenging traversal section in *Black Myth: Wukong*, where the player character is crossing a precarious wooden plank suspended over a deep chasm. Visible threats include a Yaksha Archer positioned on a small platform ahead, with additional dangers mentioned in the text, such as other archers and a Cyan Bat ambush. The scene emphasizes the need for careful navigation and combat strategy to avoid falling and sustaining fatal damage."
}