{
    "chunk_id": 588689214351,
    "source_file": "Apramana_Bat.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f7/Wukong_Bitter_39.jpg",
    "alt_text": "Wukong Bitter 39.jpg",
    "position_desc": 8,
    "img_above_text": "Once you've gotten it on the ground for an extended period to dish out damage, be mindful not to get overconfident. If you see it hunch over and turn completely gold, it will use its own rock solid deflection to make your attack bounce off.\nListen for the sound cue of your attack being deflected, and it will quickly rise up and extend a bladed wing up in the air before slamming it down on you. You can turn the tables with your own deflection (though it will send you sliding back), or dodge to the side and bash it with a Spirit Attack.",
    "img_below_text": "Zhu Bajie can be a big boon for this fight, as the bat will largely focus on you with its ranged flying attacks, and as it drops to the ground between attacks, the little pig guy will be right there waiting for score some free hits. Don't be afraid to fall back either and wait for him to heal you as needed, but otherwise you can bait out several of the Apramana Bats ranged attacks without having to worry too much about closing the distance until the opportunity presents itself, allowing your sidekick to chip away in the meantime.\nOnce defeated, you'll gain a journal entry, experience, and some materials for your victory, but the Apramana Bat itself will retreat, and fly off into the distance. This won't be the last you see of it...",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Once you've gotten it on the ground for an extended period to dish out damage, be mindful not to get overconfident. If you see it hunch over and turn completely gold, it will use its own rock solid deflection to make your attack bounce off.\nListen for the sound cue of your attack being deflected, and it will quickly rise up and extend a bladed wing up in the air before slamming it down on you. You can turn the tables with your own deflection (though it will send you sliding back), or dodge to the side and bash it with a Spirit Attack.\"\n        - Following Text: \"Zhu Bajie can be a big boon for this fight, as the bat will largely focus on you with its ranged flying attacks, and as it drops to the ground between attacks, the little pig guy will be right there waiting for score some free hits. Don't be afraid to fall back either and wait for him to heal you as needed, but otherwise you can bait out several of the Apramana Bats ranged attacks without having to worry too much about closing the distance until the opportunity presents itself, allowing your sidekick to chip away in the meantime.\nOnce defeated, you'll gain a journal entry, experience, and some materials for your victory, but the Apramana Bat itself will retreat, and fly off into the distance. This won't be the last you see of it...\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a battle scene from a video game, where the player character is engaged in combat with the Apramana Bat, a large winged enemy. The snowy environment and skeletal remains in the background set the stage for the encounter. The preceding text provides strategic advice for dealing with the bat's defensive and offensive moves, emphasizing deflection and dodging techniques. The following text highlights the role of Zhu Bajie, a sidekick character, in assisting during the fight by distracting the bat and dealing damage. Defeating the bat rewards the player with experience, materials, and a journal entry, though the bat retreats afterward, hinting at a future encounter."
}