{
    "chunk_id": 778406557712,
    "source_file": "Stained_Jade_Gourd.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/84/Wukong_PurpleCloud_13.jpg",
    "alt_text": "Wukong PurpleCloud 13.jpg",
    "position_desc": 1,
    "img_above_text": "As The Scorpionlord is optional, you will want to keep to the right from the area's first Shrine. Here you will find the Bounds of Deity's Abode Shrine. Up the stairs, The Scorpionlord can be found drinking on the top of a building. Rile him up by destroying some of the pots to initiate the fight.\nRemember, if you want the Stained Jade Gourd, you need to defeat him before completing the area and defeating The Duskveil.",
    "img_below_text": "Our page on The Scorpionlord boss fight has a bunch of tips to help you defeat him.\nFor even more guides and tips on finding all the Gourd customisation items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, Awaken Wine Worm locations, and Luoija Fragrant Vine locations.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"As The Scorpionlord is optional, you will want to keep to the right from the area's first Shrine. Here you will find the Bounds of Deity's Abode Shrine. Up the stairs, The Scorpionlord can be found drinking on the top of a building. Rile him up by destroying some of the pots to initiate the fight.\nRemember, if you want the Stained Jade Gourd, you need to defeat him before completing the area and defeating The Duskveil.\"\n        - Following Text: \"Our page on The Scorpionlord boss fight has a bunch of tips to help you defeat him.\nFor even more guides and tips on finding all the Gourd customisation items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, Awaken Wine Worm locations, and Luoija Fragrant Vine locations.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a gameplay moment from a video game where the player is engaged in combat with \"The Scorpionlord,\" an optional boss. The scene takes place in a scenic autumnal area near a shrine, with the boss's health bar displayed at the bottom and various consumable items and abilities visible in the HUD. The preceding and following text suggests that defeating The Scorpionlord is necessary to obtain the Stained Jade Gourd before progressing further in the area. The image serves as a visual reference for players tackling this specific boss encounter."
}