{
    "chunk_id": 468059561550,
    "source_file": "Baw-Li-Guhh-Baw.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/31/Wukong_LowerHollow_35.jpg",
    "alt_text": "Wukong LowerHollow 35.jpg",
    "position_desc": 4,
    "img_above_text": "This leaves two options: Retreat and continue the fight in a severely reduced space, or pop an Antimiasma Pill and brute force ahead while your immunity lasts. Given that the frog can also do a regular spew of poison in a wide arc that creates more hazardous spots on the ground, it's often better to just rely on the pills rather than restricting your movement even more.\nIf you thought that was the extent of his moves, you'll be in for a nasty surprise. Perhaps you've been wondering ever since defeating Buddha's Right Hand where the other hand went? Turns out, it's inside Baw-Li-Guhh-Baw!",
    "img_below_text": "When he gets to around half his health or so, the boss will start using tongue attacks on you, only the tongue is actually a very long hand with its own unique and bizarre attacks!\n![Wukong LowerHollow 32.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/92/Wukong_LowerHollow_32.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"This leaves two options: Retreat and continue the fight in a severely reduced space, or pop an Antimiasma Pill and brute force ahead while your immunity lasts. Given that the frog can also do a regular spew of poison in a wide arc that creates more hazardous spots on the ground, it's often better to just rely on the pills rather than restricting your movement even more.\nIf you thought that was the extent of his moves, you'll be in for a nasty surprise. Perhaps you've been wondering ever since defeating Buddha's Right Hand where the other hand went? Turns out, it's inside Baw-Li-Guhh-Baw!\"\n        - Following Text: \"When he gets to around half his health or so, the boss will start using tongue attacks on you, only the tongue is actually a very long hand with its own unique and bizarre attacks!\n![Wukong LowerHollow 32.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/92/Wukong_LowerHollow_32.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight against \"Baw-Li-Guhh-Baw\" in *Black Myth: Wukong*. The player is engaged in combat within a poison-filled environment, as indicated by the green haze and hazardous ground. The boss, a frog-like creature, is shown performing an attack, with its health bar displayed at the bottom. The interface highlights consumable items such as \"Antimiasma Powder\" to counteract poison effects, alongside other abilities and tools. This scene aligns with the preceding text, which discusses strategies for dealing with the boss's poison attacks and reveals its connection to Buddha's missing hand."
}