{
    "chunk_id": 517960551150,
    "source_file": "Fine_China_Tea_Bowl.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1d/Fine_China_Tea_Bowl_1.jpg",
    "alt_text": "Fine China Tea Bowl 1.jpg",
    "position_desc": 2,
    "img_above_text": "As mentioned, finding this Curios item isn't the easiest. The Fine China Tea Bowl is in a box by a statue and a blade-wielding enemy in the Pagoda Realm along the lowest level. From the Lower Pagoda Shrine in The New West continue along to the end of the path, ignoring the stairs up a level.\nAt the end of this lowest level, just ahead of the stairs, you can find the statue and box with the Curios item in it.",
    "img_below_text": "For even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"As mentioned, finding this Curios item isn't the easiest. The Fine China Tea Bowl is in a box by a statue and a blade-wielding enemy in the Pagoda Realm along the lowest level. From the Lower Pagoda Shrine in The New West continue along to the end of the path, ignoring the stairs up a level.\nAt the end of this lowest level, just ahead of the stairs, you can find the statue and box with the Curios item in it.\"\n        - Following Text: \"For even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character in a dimly lit, rocky environment within the Pagoda Realm, standing near a lit brazier. A red dashed circle highlights a distant box near a statue, indicating the location of the Fine China Tea Bowl, a Curios item mentioned in the preceding text. This visual serves as a guide to help players locate the item at the lowest level of the area, just ahead of the stairs, as described."
}