{
    "chunk_id": 159901639597,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/49/Wukong_Wolves_50.jpg",
    "alt_text": "Wukong Wolves 50.jpg",
    "position_desc": 55,
    "img_above_text": "Certain times, he’ll dodge back after his attacks, but if he pauses to lick his claws, that’s your cue to sprint in (gaining a bonus from the Pilgrim Set) and attack with a quick light combo. Sometimes he may appear to charge the air around him — which means he’s preparing for a damaging howl. That’s your cue to simply run back a few paces to stand outside his range.\nTry not to get disoriented as he strafes before many of his attacks - which can sometimes end in a strafing lunge where he swipes upward as he slides toward you.",
    "img_below_text": "Once he stops running, watch for him to raise a claw. These attacks are usually simple swipes with a big delay, so wait for the claw to descend before dodging and attacking. His two-hit attacks only come from his leaps, so as long as he’s stationary, his attacks will be easier to anticipate.\n![Wukong Wolves 48.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bf/Wukong_Wolves_48.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Certain times, he’ll dodge back after his attacks, but if he pauses to lick his claws, that’s your cue to sprint in (gaining a bonus from the Pilgrim Set) and attack with a quick light combo. Sometimes he may appear to charge the air around him — which means he’s preparing for a damaging howl. That’s your cue to simply run back a few paces to stand outside his range.\nTry not to get disoriented as he strafes before many of his attacks - which can sometimes end in a strafing lunge where he swipes upward as he slides toward you.\"\n        - Following Text: \"Once he stops running, watch for him to raise a claw. These attacks are usually simple swipes with a big delay, so wait for the claw to descend before dodging and attacking. His two-hit attacks only come from his leaps, so as long as he’s stationary, his attacks will be easier to anticipate.\n![Wukong Wolves 48.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bf/Wukong_Wolves_48.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a fierce battle scene from the video game \"Black Myth: Wukong,\" showing the protagonist engaged in combat with a large, menacing wolf-like creature named Lingxuzi. The context provided in the preceding and following text offers strategic advice for players on how to anticipate and counter the creature's attacks, emphasizing the importance of timing and positioning during the fight."
}