{
    "chunk_id": 295746757210,
    "source_file": "Pagoda_Realm_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/87/Wukong_Pagoda_97.jpg",
    "alt_text": "Wukong Pagoda 97.jpg",
    "position_desc": 93,
    "img_above_text": "![Wukong Pagoda 96.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/47/Wukong_Pagoda_96.jpg)\nBefore continuing along the main path, break open the wooden fence behind the pill containers, and you'll find an alternate path.",
    "img_below_text": "This will lead to the bottom of a giant frozen waterfall, and guarding it is a strange type of Abomination enemy. This foe sports two tentacle-like appendages growing over his shoulder that he can use to attack with, alternating lashes with both sides before bringing them both upward.\nHe can also spin in place while using his appendages to grab a snow-covered rock out of the ground, using his momentum to slam it down on you for a startling amount of damage, requiring you to dodge quickly to avoid taking damage.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Pagoda 96.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/47/Wukong_Pagoda_96.jpg)\nBefore continuing along the main path, break open the wooden fence behind the pill containers, and you'll find an alternate path.\"\n        - Following Text: \"This will lead to the bottom of a giant frozen waterfall, and guarding it is a strange type of Abomination enemy. This foe sports two tentacle-like appendages growing over his shoulder that he can use to attack with, alternating lashes with both sides before bringing them both upward.\nHe can also spin in place while using his appendages to grab a snow-covered rock out of the ground, using his momentum to slam it down on you for a startling amount of damage, requiring you to dodge quickly to avoid taking damage.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat encounter in a snowy environment, likely near the bottom of a frozen waterfall. The player character is engaged in a battle with multiple enemies, including a central foe with distinctive tentacle-like appendages. The scene emphasizes action and strategy, as the player must navigate attacks from multiple directions while dealing with the unique abilities of the highlighted enemy."
}