{
    "chunk_id": 574273998942,
    "source_file": "Webbed_Hollow_-_Lower_Hollow_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/34/Wukong_LowerHollow_72.jpg",
    "alt_text": "Wukong LowerHollow 72.jpg",
    "position_desc": 68,
    "img_above_text": "![Wukong LowerHollow 71.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c8/Wukong_LowerHollow_71.jpg)\nYou can check the left wall for a green Wisp and a hiding Fungiman among some mushrooms, and then continue on to find a switchback path heading up to a plateau above.",
    "img_below_text": "Here you'll find one last Shrine for the Webbed Hollow, meaning the final boss of this particular area is fast approaching. As with other bosses in this realm, poison can be a big factor in the fight, so it's worth crafting extra Antimiasma Pills, and equipping poison resistant gear, curios, and Gourd soaks to help out where possible.\nWhen you're ready to face the mother of spiders, head through into the large cave opening to face the Lady of the Webbed Hollow. You'll learn more about her tragic life during the adventures of Wukong as she speaks with Zhu Bajie, and once you interrupt the scene, you'll need to prepare for battle.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong LowerHollow 71.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c8/Wukong_LowerHollow_71.jpg)\nYou can check the left wall for a green Wisp and a hiding Fungiman among some mushrooms, and then continue on to find a switchback path heading up to a plateau above.\"\n        - Following Text: \"Here you'll find one last Shrine for the Webbed Hollow, meaning the final boss of this particular area is fast approaching. As with other bosses in this realm, poison can be a big factor in the fight, so it's worth crafting extra Antimiasma Pills, and equipping poison resistant gear, curios, and Gourd soaks to help out where possible.\nWhen you're ready to face the mother of spiders, head through into the large cave opening to face the Lady of the Webbed Hollow. You'll learn more about her tragic life during the adventures of Wukong as she speaks with Zhu Bajie, and once you interrupt the scene, you'll need to prepare for battle.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game \"Black Myth: Wukong,\" where the protagonist, Wukong, is preparing for an upcoming boss battle in the Webbed Hollow area. The environment is dark and cavernous, with spider webs visible, indicating proximity to the final boss, the Lady of the Webbed Hollow. Wukong is equipped with a flaming weapon, suggesting readiness for combat. The preceding text mentions finding a green Wisp and a hiding Fungiman, while the following text advises preparing for poison resistance, hinting at the challenges ahead."
}