{
    "chunk_id": 906592290682,
    "source_file": "Kang-Jin_Loong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/ff/Wukong_Snowhill_38.jpg",
    "alt_text": "Wukong Snowhill 38.jpg",
    "position_desc": 3,
    "img_above_text": "Kang-Jin Loong will often begin the fight by racing right at you headfirst, so be ready to dodge to the side. If you can time things right, Immobilize can pin her in place long enough to get some hits in.\nGet your hits in on her face when she returns to float in front of you, and be ready for the boss to whip around and prepare new attacks.",
    "img_below_text": "If she starts to rapidly fly in circles, dodge back and you'll avoid a whirlwind attack that has a fairly large range outside of her actual body.\n![Wukong Snowhill 39.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c7/Wukong_Snowhill_39.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Kang-Jin Loong will often begin the fight by racing right at you headfirst, so be ready to dodge to the side. If you can time things right, Immobilize can pin her in place long enough to get some hits in.\nGet your hits in on her face when she returns to float in front of you, and be ready for the boss to whip around and prepare new attacks.\"\n        - Following Text: \"If she starts to rapidly fly in circles, dodge back and you'll avoid a whirlwind attack that has a fairly large range outside of her actual body.\n![Wukong Snowhill 39.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c7/Wukong_Snowhill_39.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight scene from *Black Myth: Wukong*, showcasing the player character facing Kang-Jin Loong, a dragon-like enemy. The icy environment and visible combat interface suggest an intense battle, with the boss mid-action, possibly preparing an attack. The preceding and following text provides tips on dodging Kang-Jin Loong's aggressive moves, including headfirst charges and whirlwind attacks, emphasizing strategic timing and positioning."
}