{
    "chunk_id": 268311563332,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b9/Wukong_Wolves_8.jpg",
    "alt_text": "Wukong Wolves 8.jpg",
    "position_desc": 16,
    "img_above_text": "This friendly guy will be your guide and mentor for this part of the world, and will bid you to set out in search of Guanyin Temple, which burned down long ago but has since been rebuilt - but not by human hands. As the Keeper departs, he’ll bestow you with the Incense Trail Talisman, which can let you warp back to the last Shrine you rested at.\n## Front Hills",
    "img_below_text": "Leaving the Shrine behind, you can round the corner to find two lesser Wolf Guais, a Swordsworn, and a new Wolf Soldier. The latter is armed with a shield, and can sometimes deflect your attacks to knock you off-balance. When this happens, watch for his counter and dodge at the last moment. A perfect dodge will slow down time and create an after-image of the Destined One, which lets you get in close for your own counter, and raises your Focus.\n![Wukong Wolves 9.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/cf/Wukong_Wolves_9.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"This friendly guy will be your guide and mentor for this part of the world, and will bid you to set out in search of Guanyin Temple, which burned down long ago but has since been rebuilt - but not by human hands. As the Keeper departs, he’ll bestow you with the Incense Trail Talisman, which can let you warp back to the last Shrine you rested at.\n## Front Hills\"\n        - Following Text: \"Leaving the Shrine behind, you can round the corner to find two lesser Wolf Guais, a Swordsworn, and a new Wolf Soldier. The latter is armed with a shield, and can sometimes deflect your attacks to knock you off-balance. When this happens, watch for his counter and dodge at the last moment. A perfect dodge will slow down time and create an after-image of the Destined One, which lets you get in close for your own counter, and raises your Focus.\n![Wukong Wolves 9.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/cf/Wukong_Wolves_9.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a gameplay scene from *Black Myth: Wukong*, where the player character is engaged in combat with a Wolf Soldier near a forested area. The setting includes moss-covered rocks and a traditional gate structure in the background, suggesting a path leading deeper into the environment. The Wolf Soldier is armed with a shield, as described in the following text, and the player appears to be preparing an attack or maneuver. HUD elements show resources such as \"Will\" and \"Stone Spirit,\" indicating progression or item collection. This scene aligns with the narrative of encountering enemies while exploring the Front Hills after leaving the Shrine."
}