{
    "chunk_id": 928181273404,
    "source_file": "New_Thunderclap_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1d/Wukong_Thunderclap_33.jpg",
    "alt_text": "Wukong Thunderclap 33.jpg",
    "position_desc": 32,
    "img_above_text": "Heading through here will lead you to the same central plaza that can be reached from the Temple Entrance Shrine's main path, or the higher path on the right.\nTaking either side path to each this plaza leads to a large road with a few patrolling Monk Supporters and an Overseeing Monk, with two Thunder Rhino Masters guarding the main stairs upward.",
    "img_below_text": "If you check to the side of the stairs first, you can find a green Wisp to absorb in a large pot, but you'll need to watch out for a Wolf Guardian standing on a wooden platform above looking to ambush you.\n![Wukong Thunderclap 34.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1e/Wukong_Thunderclap_34.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Heading through here will lead you to the same central plaza that can be reached from the Temple Entrance Shrine's main path, or the higher path on the right.\nTaking either side path to each this plaza leads to a large road with a few patrolling Monk Supporters and an Overseeing Monk, with two Thunder Rhino Masters guarding the main stairs upward.\"\n        - Following Text: \"If you check to the side of the stairs first, you can find a green Wisp to absorb in a large pot, but you'll need to watch out for a Wolf Guardian standing on a wooden platform above looking to ambush you.\n![Wukong Thunderclap 34.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1e/Wukong_Thunderclap_34.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a snowy outdoor area in *Black Myth: Wukong*, where the player character approaches a glowing green Wisp located inside a large pot near a stone wall. The Wisp is highlighted with a red circle, indicating its importance. Above the pot, a Wolf Guardian stands on a wooden platform, suggesting an ambush threat. The game's interface shows health, abilities, and inventory, with \"Fire Bellflower x2\" displayed as a collected item. This scene aligns with the guide's instructions to check near the stairs for the Wisp while being cautious of the ambush."
}