{
    "chunk_id": 664623075892,
    "source_file": "Webbed_Hollow_-_Upper_Hollow_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9f/Wukong_UpperHollow_1.jpg",
    "alt_text": "Wukong UpperHollow 1.jpg",
    "position_desc": 1,
    "img_above_text": "Due to the length, complexity, and number of bosses scattered throughout the Webbed Hollow section of Chapter 4, this particular region walkthrough will be split up into three parts with each section largely covering a major floor level of the hollow.\n## Webbed Hollow",
    "img_below_text": "After facing certain doom trapped in the web of the spider guais of this realm, the Destined One will suddenly awake safe in a bed, somewhere deep underground below the Lanxi Village.\nOnce you are up again, you'll find a helpful gold box has been placed by the bed, and you can open the small **Treasure Chest** to claim 3 Antimiasma Powder and 1 Longevity Decoction. If you can't take the hint, it means you're likely to run into a lot of poison-inducing enemies in this area.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Due to the length, complexity, and number of bosses scattered throughout the Webbed Hollow section of Chapter 4, this particular region walkthrough will be split up into three parts with each section largely covering a major floor level of the hollow.\n## Webbed Hollow\"\n        - Following Text: \"After facing certain doom trapped in the web of the spider guais of this realm, the Destined One will suddenly awake safe in a bed, somewhere deep underground below the Lanxi Village.\nOnce you are up again, you'll find a helpful gold box has been placed by the bed, and you can open the small **Treasure Chest** to claim 3 Antimiasma Powder and 1 Longevity Decoction. If you can't take the hint, it means you're likely to run into a lot of poison-inducing enemies in this area.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a character sitting on a bed, likely representing the moment when the \"Destined One\" awakens after being trapped in a web in the Webbed Hollow section of Chapter 4. This scene is set underground, below Lanxi Village, and signifies a transition from danger to safety. The narrative suggests the character will soon encounter poison-inducing enemies, hinted by the presence of a gold box and a treasure chest containing items like Antimiasma Powder and Longevity Decoction, which are useful for dealing with such threats."
}