{
    "chunk_id": 693934870422,
    "source_file": "Temple_of_Yellow_Flowers_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1f/Wukong_YellowFlower_88.jpg",
    "alt_text": "Wukong YellowFlower 88.jpg",
    "position_desc": 85,
    "img_above_text": "Once you've finally defeated the Hundred-Eyed Daoist Master, you'll be treated to the finale of the Spider Sisters and their mother. Note that you'll now gain all the Yaoguai Chief entries for the First, Third, Fourth, and Fifth Sister (despite you not having actually fought against them).\nHundred-Eyed Daoist Master",
    "img_below_text": "With a bittersweet ending to this chapter, you'll gain the next piece of the Great Sage's Senses - the Envious Tongue, which has some interesting talents you can pick from:\n* **Refreshing Taste** \\- After consuming medicine, increases the Critical Hit Chance of the next attack.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Once you've finally defeated the Hundred-Eyed Daoist Master, you'll be treated to the finale of the Spider Sisters and their mother. Note that you'll now gain all the Yaoguai Chief entries for the First, Third, Fourth, and Fifth Sister (despite you not having actually fought against them).\nHundred-Eyed Daoist Master\"\n        - Following Text: \"With a bittersweet ending to this chapter, you'll gain the next piece of the Great Sage's Senses - the Envious Tongue, which has some interesting talents you can pick from:\n* **Refreshing Taste** \\- After consuming medicine, increases the Critical Hit Chance of the next attack.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the aftermath of a battle with the Hundred-Eyed Daoist Master, showcasing a defeated creature lying on the ground surrounded by greenery and yellow flowers. This scene marks the conclusion of the Spider Sisters' storyline, leading to the acquisition of the Yaoguai Chief entries for the sisters and the Envious Tongue, a piece of the Great Sage's Senses, which offers new talents like \"Refreshing Taste.\""
}