{
    "chunk_id": 367325835334,
    "source_file": "Whiteclad_Noble.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fe/Wukong_Bamboo_40.jpg",
    "alt_text": "Wukong Bamboo 40.jpg",
    "position_desc": 1,
    "img_above_text": "* **Rewards:** Jade Fang, 3x Yarn, 1049 Experience, 688 Will\n## Where to Find the Whiteclad Noble",
    "img_below_text": "As a required boss, you can't miss running into this character when exploring Black Wind Mountain. You'll find him guarding the end of the Marsh of White Mist in the Bamboo Grove, past where you save and befriend the Shen Monkey that can upgrade your Gourd.\nYou'll find him at the bottom of the ramp across a large flooded marsh area lined with reeds.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"* **Rewards:** Jade Fang, 3x Yarn, 1049 Experience, 688 Will\n## Where to Find the Whiteclad Noble\"\n        - Following Text: \"As a required boss, you can't miss running into this character when exploring Black Wind Mountain. You'll find him guarding the end of the Marsh of White Mist in the Bamboo Grove, past where you save and befriend the Shen Monkey that can upgrade your Gourd.\nYou'll find him at the bottom of the ramp across a large flooded marsh area lined with reeds.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dark and atmospheric scene from a video game, showing a character wading through a flooded marsh area surrounded by reeds, eerie trees, and stone statues. In the background, a traditional structure with lit torches is visible, suggesting a significant location. Based on the context, this area is part of the Marsh of White Mist in Black Wind Mountain, where the player encounters the Whiteclad Noble, a required boss guarding the Bamboo Grove. The image highlights the setting leading up to this encounter."
}