{
    "chunk_id": 896628069952,
    "source_file": "Tiger%27s_Acolyte.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/24/Wukong_Yellow_22.jpg",
    "alt_text": "Wukong Yellow 22.jpg",
    "position_desc": 4,
    "img_above_text": "![Wukong Yellow 21.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b5/Wukong_Yellow_21.jpg)\nThe battle will often begin with him lowering his sword, only to leap forward at blinding speed to attack with both sword and claw at once, rolling past you as he does, and then performing a follow up slash as he finishes his roll. This means you’ll want to dodge past him as he approaches, so you can safely distance yourself from the following slash and then attack him back.",
    "img_below_text": "However, if he suddenly pivots after his slash to face away, be ready for him to perform a large overhand swing as he twists to face you. Though it's a vertical strike, it has a great deal of reach, sending a tremor along the ground from its force.\nUnfortunately, this isn’t even his only unpredictable leaping attack, as he can also just vault at you at top speed from a fair distance without a hint of preparation and cleave you with his sword for massive damage.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Yellow 21.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b5/Wukong_Yellow_21.jpg)\nThe battle will often begin with him lowering his sword, only to leap forward at blinding speed to attack with both sword and claw at once, rolling past you as he does, and then performing a follow up slash as he finishes his roll. This means you’ll want to dodge past him as he approaches, so you can safely distance yourself from the following slash and then attack him back.\"\n        - Following Text: \"However, if he suddenly pivots after his slash to face away, be ready for him to perform a large overhand swing as he twists to face you. Though it's a vertical strike, it has a great deal of reach, sending a tremor along the ground from its force.\nUnfortunately, this isn’t even his only unpredictable leaping attack, as he can also just vault at you at top speed from a fair distance without a hint of preparation and cleave you with his sword for massive damage.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat encounter in *Black Myth: Wukong*, showcasing the player character facing off against an enemy named \"Tiger's Acolyte.\" The enemy is mid-leap, seemingly executing a fast, aggressive attack, as described in the preceding text. The environment features a rugged, rocky terrain with sparse vegetation, emphasizing the intense and dynamic nature of the battle. The player’s health and ability icons are visible, indicating active gameplay."
}