{
    "chunk_id": 539877432888,
    "source_file": "Bitter_Lake_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f1/Wukong_Turtle_23.jpg",
    "alt_text": "Wukong Turtle 23.jpg",
    "position_desc": 23,
    "img_above_text": "![Wukong Turtle 22.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8b/Wukong_Turtle_22.jpg)\nLook for ledges to jump up past the Tree Pearl, and you'll find another section ending in some braziers beside a second **Treasure Chest** with more materials.",
    "img_below_text": "Most of the opposite side of the turtle boasts more criss-crossing ledge paths with Frozen Corpses or Golden Lotus Guai, and a few green Wisps stashed away in corners you can absorb, but not much more than that.\nThe biggest secret lies directly to the right of the Turtle Island Shrine when facing toward the front, but it will require you to have obtained the Loong Scales back in Chapter 2 behind a wall you can crack where the First Prince of Flowing Sands is summoned.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Turtle 22.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8b/Wukong_Turtle_22.jpg)\nLook for ledges to jump up past the Tree Pearl, and you'll find another section ending in some braziers beside a second **Treasure Chest** with more materials.\"\n        - Following Text: \"Most of the opposite side of the turtle boasts more criss-crossing ledge paths with Frozen Corpses or Golden Lotus Guai, and a few green Wisps stashed away in corners you can absorb, but not much more than that.\nThe biggest secret lies directly to the right of the Turtle Island Shrine when facing toward the front, but it will require you to have obtained the Loong Scales back in Chapter 2 behind a wall you can crack where the First Prince of Flowing Sands is summoned.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a snowy, rocky terrain where the player character, likely Wukong, is preparing to engage three humanoid enemies in combat. The interface displays various combat abilities and consumable items, such as \"Evil Repelling Medicament\" and \"Tiger Subduing Pellets,\" suggesting a strategic approach to the encounter. This scene appears to be part of the exploration and combat sequence described in the context, where players navigate ledges and face enemies while collecting resources and progressing through the game."
}