{
    "chunk_id": 77269593360,
    "source_file": "Goji_Shoots.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9c/Wukong_UpperHollow_6.jpg",
    "alt_text": "Wukong UpperHollow 6.jpg",
    "position_desc": 1,
    "img_above_text": "## Black Myth: Wukong Goji Shoots Location\nThe Goji Shoots can be found in the Upper Hollow area of The Webbed Hollow. From the Shrine, turn around and head up the stairs along the hillside. Continue all the way to the top. At the top you can find a hut with the Soak inside.",
    "img_below_text": "Soaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Black Myth: Wukong Goji Shoots Location\nThe Goji Shoots can be found in the Upper Hollow area of The Webbed Hollow. From the Shrine, turn around and head up the stairs along the hillside. Continue all the way to the top. At the top you can find a hut with the Soak inside.\"\n        - Following Text: \"Soaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from *Black Myth: Wukong*, showing the player character standing near a hut in the Upper Hollow area of The Webbed Hollow. The hut contains a golden turtle-shaped object, likely the \"Soak\" mentioned in the preceding text, which is used for healing purposes. The character's fiery weapon and detailed environment suggest a key moment in exploration or resource collection. The image aligns with the guide's focus on locating items like Goji Shoots and Soaks to enhance gameplay and healing potential."
}