{
    "chunk_id": 12826832720,
    "source_file": "New_Thunderclap_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/94/Wukong_Thunderclap_9.jpg",
    "alt_text": "Wukong Thunderclap 9.jpg",
    "position_desc": 9,
    "img_above_text": "Inside the building itself, you'll find another Overseeing Monk in the main room (plus another on the far right side of the building exterior), and on the other side is the beginning of the main plaza, but the stairs beyond are lined with several Thunder Rhino Masters, so let's backtrack and find an optional side path.\nBack at the Temple Entrance Shrine, move to the right to find two other paths:",
    "img_below_text": "Take the first left to find a quicker path to the Main Plaza that's a little less guarded, as there's only a Supporter Monk patrolling the path to where a lone Overseeing Monk guarding a smaller gate.\n![Wukong Thunderclap 10.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d4/Wukong_Thunderclap_10.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Inside the building itself, you'll find another Overseeing Monk in the main room (plus another on the far right side of the building exterior), and on the other side is the beginning of the main plaza, but the stairs beyond are lined with several Thunder Rhino Masters, so let's backtrack and find an optional side path.\nBack at the Temple Entrance Shrine, move to the right to find two other paths:\"\n        - Following Text: \"Take the first left to find a quicker path to the Main Plaza that's a little less guarded, as there's only a Supporter Monk patrolling the path to where a lone Overseeing Monk guarding a smaller gate.\n![Wukong Thunderclap 10.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d4/Wukong_Thunderclap_10.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a snowy outdoor area in *Black Myth: Wukong*, showing the player's character overlooking two distinct paths marked by red arrows. This scene corresponds to the guide's instructions for navigating from the Temple Entrance Shrine, where players can choose between two paths leading to different areas. The left path offers a quicker route to the Main Plaza with fewer enemies, while the right path likely leads to another location. The image serves to visually guide players in making their decision."
}