{
    "chunk_id": 684243155266,
    "source_file": "How_to_Unlock_the_Zodiac_Village_and_Upgrade_Armor_.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b4/Zodiac_Village_%2836%29.png",
    "alt_text": "Zodiac Village \\(36\\).png",
    "position_desc": 9,
    "img_above_text": "* Iron-Tough Greaves\n## Request Medicines from Xu Dog",
    "img_below_text": "Interacting with Xu Dog in the Painted Realm now offers the option to Request Medicine. Each time you do this, Xu Dog will provide you with potions.\nYou'll need to wait a little while before new medicines are available, but you'll know when they are if the red dot next to Request Medicines appears.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"* Iron-Tough Greaves\n## Request Medicines from Xu Dog\"\n        - Following Text: \"Interacting with Xu Dog in the Painted Realm now offers the option to Request Medicine. Each time you do this, Xu Dog will provide you with potions.\nYou'll need to wait a little while before new medicines are available, but you'll know when they are if the red dot next to Request Medicines appears.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from a video game where the player interacts with a character named Xu Dog in the Painted Realm. The menu options visible on the screen allow the player to request medicine, make medicines, remake celestial medicines, store items, or leave the interaction. The preceding and following text indicates that requesting medicine from Xu Dog will provide the player with potions, and new medicines become available after a waiting period, signaled by a red dot next to the request option."
}