{
    "chunk_id": 268000975496,
    "source_file": "Golden_Lining.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3f/Pungent_Flesh_Chunk_USe.jpg",
    "alt_text": "Pungent Flesh Chunk USe.jpg",
    "position_desc": 1,
    "img_above_text": "Golden Lining can be found in Relief of the Fallen Loong Shrine in The Webbed Hollow upon defeating Yellow Loong after you have killed Red Loong, Black Loong, and Cyan Loong. This requires you to have the Loong Scales.\nThe Loong Scales can be found by defeating the First Prince of Flowing Sands in Yellow Wind Ridge. The boss is located underneath the arena where you fight the King of Flowing Sand and Second Rat Prince upon throwing the Pungent Flesh Chunk off the cliff. Get the boss to destroy the mural wall in the arena, or use a powerful Transformation ability and head through to pick up the Key Item.",
    "img_below_text": "You can then use these scales on the sand waterfall in Fright Cliff in Yellow Wind Ridge to fight Black Loong.\nSecondly, head to the Forest of Wolves in Black Wind Mountain and head through the waterfall to defeat Red Loong.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Golden Lining can be found in Relief of the Fallen Loong Shrine in The Webbed Hollow upon defeating Yellow Loong after you have killed Red Loong, Black Loong, and Cyan Loong. This requires you to have the Loong Scales.\nThe Loong Scales can be found by defeating the First Prince of Flowing Sands in Yellow Wind Ridge. The boss is located underneath the arena where you fight the King of Flowing Sand and Second Rat Prince upon throwing the Pungent Flesh Chunk off the cliff. Get the boss to destroy the mural wall in the arena, or use a powerful Transformation ability and head through to pick up the Key Item.\"\n        - Following Text: \"You can then use these scales on the sand waterfall in Fright Cliff in Yellow Wind Ridge to fight Black Loong.\nSecondly, head to the Forest of Wolves in Black Wind Mountain and head through the waterfall to defeat Red Loong.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight against the \"First Prince of Flowing Sands\" in a sandy, cavernous environment. This encounter is crucial for obtaining the Loong Scales, a key item required to progress in the game by accessing other boss fights, such as Black Loong in Yellow Wind Ridge. The player's interface shows abilities and health, emphasizing the combat-focused nature of this sequence."
}