{
    "chunk_id": 932904403054,
    "source_file": "Whiteclad_Noble.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/48/Wukong_Bamboo_54.jpg",
    "alt_text": "Wukong Bamboo 54.jpg",
    "position_desc": 11,
    "img_above_text": "In addition to this, he can twirl his spear above his head, summoning water above it before slamming it down, sending a straight line of water right at you that you can dodge to the side to avoid.\nBeyond that, the rest of the second phase of this fight will come down to anticipating how his body twists before he unleashes his sweep attacks. Keep close and aggressive to dodge around to his sides, using your spells to amplify your attacks, and looking for the right moment to invoke your Spirit Attacks (the Wandering Wight is still a good choice when he’s stationary to flatten him).",
    "img_below_text": "Defeat him to earn a **Jade Fang** , and he’ll concede, revealing he was only feigning loyalty to the king of this mountain to learn more. He’ll also drop a helpful nugget of wisdom as he departs, mentioning though the temple lies in cinders, the Elder’s soul endures, and asks if you’ve seen the three bells.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"In addition to this, he can twirl his spear above his head, summoning water above it before slamming it down, sending a straight line of water right at you that you can dodge to the side to avoid.\nBeyond that, the rest of the second phase of this fight will come down to anticipating how his body twists before he unleashes his sweep attacks. Keep close and aggressive to dodge around to his sides, using your spells to amplify your attacks, and looking for the right moment to invoke your Spirit Attacks (the Wandering Wight is still a good choice when he’s stationary to flatten him).\"\n        - Following Text: \"Defeat him to earn a **Jade Fang** , and he’ll concede, revealing he was only feigning loyalty to the king of this mountain to learn more. He’ll also drop a helpful nugget of wisdom as he departs, mentioning though the temple lies in cinders, the Elder’s soul endures, and asks if you’ve seen the three bells.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a serene yet ominous scene from a video game, showcasing a lush, rocky environment with a waterfall and a reflective water surface. A character stands near the water, while another figure kneels, possibly in defeat or contemplation. The caption, \"The Guanyin Temple now lies in cinders, yet the Elder's soul endures,\" ties the image to the narrative, suggesting the aftermath of a significant event or battle near the temple ruins. This moment connects to the preceding and following text, emphasizing the Elder's lingering presence and the importance of the temple in the storyline."
}