{
    "chunk_id": 805924849296,
    "source_file": "Village_of_Lanxi_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/6f/Wukong_Lanxi_4.jpg",
    "alt_text": "Wukong Lanxi 4.jpg",
    "position_desc": 4,
    "img_above_text": "![Wukong Lanxi 3.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e2/Wukong_Lanxi_3.jpg)\nMaking your way past the scattered homes, the place is eerily quiet, but you can find a few other plants to harvest. Head through the wooded area to find another green Wisp, and you may notice a body hiding up in the trees.",
    "img_below_text": "Down will drop a Puppet Spider, a Yaoguai that likes to ambush and stab at you with its many legs. Luckily, you'll have Zhu Bajie on your side once more, and overwhelming lone opponents will be an easy task. They can spew poison from a distance, so watch yourself that you don't have to waste any Antimiasma potions this early.\n![Wukong Lanxi 5.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/73/Wukong_Lanxi_5.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Lanxi 3.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e2/Wukong_Lanxi_3.jpg)\nMaking your way past the scattered homes, the place is eerily quiet, but you can find a few other plants to harvest. Head through the wooded area to find another green Wisp, and you may notice a body hiding up in the trees.\"\n        - Following Text: \"Down will drop a Puppet Spider, a Yaoguai that likes to ambush and stab at you with its many legs. Luckily, you'll have Zhu Bajie on your side once more, and overwhelming lone opponents will be an easy task. They can spew poison from a distance, so watch yourself that you don't have to waste any Antimiasma potions this early.\n![Wukong Lanxi 5.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/73/Wukong_Lanxi_5.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a gameplay scene from *Black Myth: Wukong*, where the player character, Wukong, is engaged in combat within a lush, wooded area. Wukong wields a glowing, fiery staff while facing an enemy, likely the Puppet Spider mentioned in the text. The environment is detailed with rocky terrain, greenery, and a backdrop of cliffs, emphasizing the game's atmospheric setting. The HUD displays health, abilities, and item options, indicating active combat preparation."
}