{
    "chunk_id": 123675081803,
    "source_file": "Drunken_Boar_Questline.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7e/Wukong_Fright_39.jpg",
    "alt_text": "Wukong Fright 39.jpg",
    "position_desc": 1,
    "img_above_text": "The Drunken Boar (aka Drunken Pig or his official name, the Yellow-Robed Squire) is a character you can meet and also fight in Chapter 2 of Black Myth Wukong. This character will ask you to complete a side quest for him that will unlock Chapter 2’s Secret Area: The Kingdom of Sahali.\n## Where to Find the Drunken Boar",
    "img_below_text": "You can first meet the Yellow-Robed Squire Boar in the Fright Cliff region of the Yellow Wind Ridge. Head through the Fright Cliff area to reach the **Rockrest Flat Shrine** , and continue to the back of this area past a small destructible wooden fence to find a large dry field.\n![Wukong Fright 59.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8c/Wukong_Fright_59.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Drunken Boar (aka Drunken Pig or his official name, the Yellow-Robed Squire) is a character you can meet and also fight in Chapter 2 of Black Myth Wukong. This character will ask you to complete a side quest for him that will unlock Chapter 2’s Secret Area: The Kingdom of Sahali.\n## Where to Find the Drunken Boar\"\n        - Following Text: \"You can first meet the Yellow-Robed Squire Boar in the Fright Cliff region of the Yellow Wind Ridge. Head through the Fright Cliff area to reach the **Rockrest Flat Shrine** , and continue to the back of this area past a small destructible wooden fence to find a large dry field.\n![Wukong Fright 59.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8c/Wukong_Fright_59.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a gameplay scene from *Black Myth: Wukong*, showing the protagonist approaching the Yellow-Robed Squire, also known as the Drunken Boar, in a dry, rocky field. This encounter occurs in the Fright Cliff region of the Yellow Wind Ridge, near the Rockrest Flat Shrine. The character is central to a side quest that unlocks Chapter 2’s Secret Area, the Kingdom of Sahali. Combat appears imminent, as the Drunken Boar is in a defensive stance with a visible health bar."
}