{
    "chunk_id": 197808189196,
    "source_file": "The_Second_Sister.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f0/Wukong_Lanxi_22.jpg",
    "alt_text": "Wukong Lanxi 22.jpg",
    "position_desc": 2,
    "img_above_text": "Most of The Second Sister's main attack will come from her two front razor-sharp legs, and will be where you will want to focus the bulk (but not all) of your attention. She may often begin the fight by raising up one talon high up to the side, slice down with her two front legs in quick succession, and then rise up into the air to slam down after a delay.\nAnother move she can use at close range is to raise most of her body up on her back legs, and dance down upon you with her front talons to stab the ground multiple times in quick succession. Since it's hard to evade each blow individually, consider using the Thrust Stance to retreat and strike from a distance.",
    "img_below_text": "When she follows up her mad dance with a giant leap, roll forward to dodge under her slam, and you'll be able to pivot and unleash an attack of your own.\n![Wukong Lanxi 23.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/16/Wukong_Lanxi_23.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Most of The Second Sister's main attack will come from her two front razor-sharp legs, and will be where you will want to focus the bulk (but not all) of your attention. She may often begin the fight by raising up one talon high up to the side, slice down with her two front legs in quick succession, and then rise up into the air to slam down after a delay.\nAnother move she can use at close range is to raise most of her body up on her back legs, and dance down upon you with her front talons to stab the ground multiple times in quick succession. Since it's hard to evade each blow individually, consider using the Thrust Stance to retreat and strike from a distance.\"\n        - Following Text: \"When she follows up her mad dance with a giant leap, roll forward to dodge under her slam, and you'll be able to pivot and unleash an attack of your own.\n![Wukong Lanxi 23.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/16/Wukong_Lanxi_23.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss battle against \"The Second Sister\" in *Black Myth: Wukong*. The player character, armed with a glowing weapon, faces a large spider-like creature suspended in mid-air. The setting is a dark, eerie environment with dilapidated structures, leafless trees, and glowing red lanterns, emphasizing a tense and atmospheric confrontation. The health bar for \"The Second Sister\" is visible, along with the player's HUD showing abilities and health status. This visual aligns with the preceding and following text, which describes the creature's attack patterns and strategies for evasion and counterattacks during the fight."
}