{
    "chunk_id": 717858280701,
    "source_file": "Iron_Set.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/66/Wukong_Bitter_22.jpg",
    "alt_text": "Wukong Bitter 22.jpg",
    "position_desc": 1,
    "img_above_text": "* Upon successful Rock Solid deflections, considerably reduces its cooldown (4 pieces)\nThe full Iron Set of Armor and Gear is located within Chapter 3 - The New West. It is craftable at any Shrine upon defeating Yin Tiger within the Zodiac Realm. You will need to fight Chen Loong and obtain the Special-made Bone-Strengthening Pellet from Xu Dog he requests to gain access to the realm. Once in the realm you can fight Yin Tiger by challenging him.",
    "img_below_text": "The Iron Set of Armor and Gear can be crafted, as it is the only way to get it. To craft it you need the following:\n* 4 Cold Iron Leaves, 2 Fine Gold Thread, 1 The Duskveil's Horn, 6,400 Will - headgear",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"* Upon successful Rock Solid deflections, considerably reduces its cooldown (4 pieces)\nThe full Iron Set of Armor and Gear is located within Chapter 3 - The New West. It is craftable at any Shrine upon defeating Yin Tiger within the Zodiac Realm. You will need to fight Chen Loong and obtain the Special-made Bone-Strengthening Pellet from Xu Dog he requests to gain access to the realm. Once in the realm you can fight Yin Tiger by challenging him.\"\n        - Following Text: \"The Iron Set of Armor and Gear can be crafted, as it is the only way to get it. To craft it you need the following:\n* 4 Cold Iron Leaves, 2 Fine Gold Thread, 1 The Duskveil's Horn, 6,400 Will - headgear\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a menu interface in a video game where the player interacts with Yin Tiger, a character associated with crafting and upgrading gear. The menu options include \"Craft Weapons,\" \"Craft Armor,\" and \"Upgrade Armor,\" allowing players to enhance previously obtained armor. This interaction is part of the process to acquire and upgrade the Iron Set of Armor and Gear, which requires specific materials and is tied to defeating Yin Tiger in the Zodiac Realm, as described in the preceding and following text."
}