{
    "chunk_id": 326429772064,
    "source_file": "Foothills_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3e/Foothills_Walkthrough_%2824%29.png",
    "alt_text": "Foothills Walkthrough \\(24\\).png",
    "position_desc": 28,
    "img_above_text": "When the Poison Chief is down, fly up and continue left toward the water. Go almost to the end of the water, where you should see a giant creature. When you get close to it, it will leap in the air and jump to a nearby rock. Fly over to it, then land on its head.\n### Yaoguai Chief - Feng-Tail General",
    "img_below_text": "The boss fight against the Feng-Tail General is more of a skill check than anything, testing out whether you've got the necessary health and stamina to continue.\n![Foothills Walkthrough \\(30\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c5/Foothills_Walkthrough_%2830%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"When the Poison Chief is down, fly up and continue left toward the water. Go almost to the end of the water, where you should see a giant creature. When you get close to it, it will leap in the air and jump to a nearby rock. Fly over to it, then land on its head.\n### Yaoguai Chief - Feng-Tail General\"\n        - Following Text: \"The boss fight against the Feng-Tail General is more of a skill check than anything, testing out whether you've got the necessary health and stamina to continue.\n![Foothills Walkthrough \\(30\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c5/Foothills_Walkthrough_%2830%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dramatic, silhouetted scene of a giant insect-like creature perched on a rocky outcrop against a dark, cloudy sky. This visual appears to align with the walkthrough's description of encountering a large creature near the water, which leaps to a nearby rock. The setting emphasizes the creature's imposing presence and sets the stage for the upcoming interaction or challenge involving the Feng-Tail General."
}