{
    "chunk_id": 432910549542,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/31/Wukong_Fright_13.jpg",
    "alt_text": "Wukong Fright 13.jpg",
    "position_desc": 14,
    "img_above_text": "The large cave entrance has a few paths, with the outer one on the right leading past another Pitstone to a wooden coffin chest holding 3 **Silk** and some **Will**.\n### The Second Buddha’s Eyeball",
    "img_below_text": "Ignore the middle path leading into the main cave entrance for the moment, and head toward the large open cave area to the left by following some braziers. They’ll lead toward a large ominous statue in the dark. More Palestones will try to ambush you here, and they guard another stone statue head at the foot of the larger statue’s altar. Examine it to gain another Buddha’s Eyeball.\n![Wukong Fright 14.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bd/Wukong_Fright_14.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The large cave entrance has a few paths, with the outer one on the right leading past another Pitstone to a wooden coffin chest holding 3 **Silk** and some **Will**.\n### The Second Buddha’s Eyeball\"\n        - Following Text: \"Ignore the middle path leading into the main cave entrance for the moment, and head toward the large open cave area to the left by following some braziers. They’ll lead toward a large ominous statue in the dark. More Palestones will try to ambush you here, and they guard another stone statue head at the foot of the larger statue’s altar. Examine it to gain another Buddha’s Eyeball.\n![Wukong Fright 14.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bd/Wukong_Fright_14.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat encounter in a dark, ominous cave area near a large statue. The player character is engaged in a fight with a ghostly enemy, likely one of the Palestones mentioned in the text, as they attempt to ambush the player. The background shows the altar of the large statue, which is tied to the narrative goal of obtaining another Buddha’s Eyeball. The scene emphasizes the eerie atmosphere and the challenges faced while exploring this area."
}