{
    "chunk_id": 45823914734,
    "source_file": "Chapter_5_Secret_-_Bishui_Cave_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bf/Bishui_Cave_Walkthrough_%2832%29.png",
    "alt_text": "Bishui Cave Walkthrough \\(32\\).png",
    "position_desc": 18,
    "img_above_text": "Head down to the left, and slide all the way down the slope. Here you'll reach the final Keeper's Shrine of the hidden area, called the Corridor of Fire and Ice.\n## Corridor of Fire and Ice",
    "img_below_text": "Head right from the Keeper's Shrine and go down the stairs. A cutscene will play as you drop down, and the Bishui Golden-Eyed Beast will appear.\n## Yaoguai King - Bishui Golden-Eyed Beast",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Head down to the left, and slide all the way down the slope. Here you'll reach the final Keeper's Shrine of the hidden area, called the Corridor of Fire and Ice.\n## Corridor of Fire and Ice\"\n        - Following Text: \"Head right from the Keeper's Shrine and go down the stairs. A cutscene will play as you drop down, and the Bishui Golden-Eyed Beast will appear.\n## Yaoguai King - Bishui Golden-Eyed Beast\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dark, atmospheric cavern featuring contrasting elements of fire and ice, aligning with the \"Corridor of Fire and Ice\" mentioned in the preceding text. In the foreground, glowing embers and swirling energy suggest the presence of the Keeper's Shrine, while the background reveals icy formations and a foreboding environment leading toward the next narrative event involving the Bishui Golden-Eyed Beast. This setting serves as a transition point in the walkthrough, marking the shrine's location and the path toward an impending cutscene and encounter."
}