{
    "chunk_id": 400482224497,
    "source_file": "Chapter_1_Secret_-_Ancient_Guanyin_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2c/Wukong_Guanyin_9.jpg",
    "alt_text": "Wukong Guanyin 9.jpg",
    "position_desc": 11,
    "img_above_text": "After losing a bit of his health, the Elder Jinchi will get mad, often proclaiming you’ve stolen some treasure from him, and command his followers to attack. Now, finally, the shambling bodies will finally become a threat, and begin to glow as they chase you.\nThe good news is they don’t move all that fast, and must stop for a moment before finally exploding. All you need to do is lead them on a merry chase, and zigzag around to cause them to begin to explode before dashing away. Once no more glowing zombies are near you, resume your fight against Jinchi.",
    "img_below_text": "Once Elder Jinchi reaches around half of his health, he’ll suddenly teleport away, reappearing in the middle of the arena and adopting a praying pose hovering too far up to reliably reach. All of the shambling bodies in the arena will be removed, but it’s when they start to reappear that you’ll need to be ready.\nIn this segment, the bodies will slowly walk toward Jinchi in the middle of the arena, appearing slowly at first, but soon swarming from all sides. If any of them reach a spot close to the center, they’ll be absorbed by Jinchi giving him part of his health bar back.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"After losing a bit of his health, the Elder Jinchi will get mad, often proclaiming you’ve stolen some treasure from him, and command his followers to attack. Now, finally, the shambling bodies will finally become a threat, and begin to glow as they chase you.\nThe good news is they don’t move all that fast, and must stop for a moment before finally exploding. All you need to do is lead them on a merry chase, and zigzag around to cause them to begin to explode before dashing away. Once no more glowing zombies are near you, resume your fight against Jinchi.\"\n        - Following Text: \"Once Elder Jinchi reaches around half of his health, he’ll suddenly teleport away, reappearing in the middle of the arena and adopting a praying pose hovering too far up to reliably reach. All of the shambling bodies in the arena will be removed, but it’s when they start to reappear that you’ll need to be ready.\nIn this segment, the bodies will slowly walk toward Jinchi in the middle of the arena, appearing slowly at first, but soon swarming from all sides. If any of them reach a spot close to the center, they’ll be absorbed by Jinchi giving him part of his health bar back.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight against Elder Jinchi in a dark, atmospheric arena surrounded by trees and temple structures. Elder Jinchi is shown in a glowing, elevated praying pose, signaling the phase where he teleports to the center of the arena and becomes unreachable for direct attacks. This phase involves shambling bodies slowly approaching Jinchi to restore his health, requiring the player to intercept them while continuing the battle. The player's health bar, abilities, and weapon are visible in the interface, emphasizing the strategic and action-oriented nature of the encounter."
}