{
    "chunk_id": 912172934398,
    "source_file": "Yellow_Loong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9a/Wukong_YellowLoong_6.jpg",
    "alt_text": "Wukong YellowLoong 6.jpg",
    "position_desc": 15,
    "img_above_text": "![Wukong YellowLoong 11.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f5/Wukong_YellowLoong_11.jpg)\nBe **very** wary if you see him whip his weapon around to stab you with the opposite tip without turning his body like the aforementioned attack. If he's able to stab you, it will become an unblockable grab that will almost always give you the Shocked Status, and deplete a huge amount of your health in the process!",
    "img_below_text": "The first half of this fight will largely come down to learning these moves and how best to avoid them, and chain together counters to keep him staggered. You can offload a lot of damage early before he starts using his bigger moves by chaining initial light combo attacks to build your Focus past three points, Rock Solid deflect to fill the fourth meter and chain that into a heavy attack riposte with either the Thrust or Pillar Stance.\n![Wukong YellowLoong 4.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/27/Wukong_YellowLoong_4.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong YellowLoong 11.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f5/Wukong_YellowLoong_11.jpg)\nBe **very** wary if you see him whip his weapon around to stab you with the opposite tip without turning his body like the aforementioned attack. If he's able to stab you, it will become an unblockable grab that will almost always give you the Shocked Status, and deplete a huge amount of your health in the process!\"\n        - Following Text: \"The first half of this fight will largely come down to learning these moves and how best to avoid them, and chain together counters to keep him staggered. You can offload a lot of damage early before he starts using his bigger moves by chaining initial light combo attacks to build your Focus past three points, Rock Solid deflect to fill the fourth meter and chain that into a heavy attack riposte with either the Thrust or Pillar Stance.\n![Wukong YellowLoong 4.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/27/Wukong_YellowLoong_4.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat sequence from *Black Myth: Wukong*, showcasing the protagonist battling the boss \"Yellow Loong.\" The scene is visually intense, with glowing effects and sparks surrounding the characters, indicating a powerful attack or ability being used. The health bar at the bottom reflects the ongoing fight, while the preceding and following text warns players about the boss's unblockable grab attack and advises strategies for countering its moves effectively during the first phase of the encounter."
}