{
    "chunk_id": 999483168224,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d1/Wukong_Fright_30.jpg",
    "alt_text": "Wukong Fright 30.jpg",
    "position_desc": 32,
    "img_above_text": "![Wukong Fright 29.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/ff/Wukong_Fright_29.jpg)\nAfter taking enough damage, the Mother of Stones will let out a roar, signaling a Palestone will quickly appear to defend her. That’s your cue to immediately break off your attack, regain your stamina, and be ready to dodge the incoming stone monster. Survival will hinge on how well you can deal with each wave while taking minimal damage, and understanding their melee and ranged attacks.",
    "img_below_text": "Once you’ve defeated two waves of single Palestones each, the third wave will consist of two Palestones at the same time. This can be a huge problem fast if they gang up on you with alternating attacks. Deflecting their ranged quartz missiles isn’t too bad… until you’re also dealing with one trying to body slam you.\nThis is the time to use everything in your arsenal to stay alive. Make sure you’re using your Spirit attacks to focus fire a target, unleash any stored Focus Points, and use Immobilize or Cloud Step to stay out of danger.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Fright 29.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/ff/Wukong_Fright_29.jpg)\nAfter taking enough damage, the Mother of Stones will let out a roar, signaling a Palestone will quickly appear to defend her. That’s your cue to immediately break off your attack, regain your stamina, and be ready to dodge the incoming stone monster. Survival will hinge on how well you can deal with each wave while taking minimal damage, and understanding their melee and ranged attacks.\"\n        - Following Text: \"Once you’ve defeated two waves of single Palestones each, the third wave will consist of two Palestones at the same time. This can be a huge problem fast if they gang up on you with alternating attacks. Deflecting their ranged quartz missiles isn’t too bad… until you’re also dealing with one trying to body slam you.\nThis is the time to use everything in your arsenal to stay alive. Make sure you’re using your Spirit attacks to focus fire a target, unleash any stored Focus Points, and use Immobilize or Cloud Step to stay out of danger.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game \"Black Myth: Wukong,\" where the player is engaged in a battle against the \"Mother of Stones.\" The image shows the game's interface, including health bars and various abilities available to the player. The context provided suggests that the player must manage their stamina and prepare to dodge attacks from stone monsters called Palestones, which appear to defend the Mother of Stones after she takes damage. The image serves to illustrate the intensity and strategy required in this particular battle sequence."
}