{
    "chunk_id": 97108254299,
    "source_file": "Mad_Tiger.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ed/Wukong_MadTiger_18.jpg",
    "alt_text": "Wukong MadTiger 18.jpg",
    "position_desc": 20,
    "img_above_text": "![Wukong MadTiger 20.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9a/Wukong_MadTiger_20.jpg)\nIf you don’t dodge as he lands, he’ll send you into the air, grab you, and slam you repeatedly into the ground — which usually ends in instant death if you have anything less than full health.",
    "img_below_text": "Expect this fight to take a lot of practice, and considerable upgrades in skills on your part to deal enough damage to survive the fight. While most Rock Solid deflections won’t be enough to stop him, retaliating with charged heavy strikes or crashing an Immobilize can sometimes stagger him several times and give you several openings. Using the Azure Dust Transformation is also useful to soak up his most damaging combos and retaliate with heavy charged hits to take chunks off his health.\nKeep practicing against dodging his moves, finding the right times to deflect the end of his combos (or just use Cloud Step to get out of the way) and always watch carefully when you stagger him to avoid his rising grab. Having the concoction to increase your max health can be beneficial if you’re unable to evade his grab or lengthy combos.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong MadTiger 20.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9a/Wukong_MadTiger_20.jpg)\nIf you don’t dodge as he lands, he’ll send you into the air, grab you, and slam you repeatedly into the ground — which usually ends in instant death if you have anything less than full health.\"\n        - Following Text: \"Expect this fight to take a lot of practice, and considerable upgrades in skills on your part to deal enough damage to survive the fight. While most Rock Solid deflections won’t be enough to stop him, retaliating with charged heavy strikes or crashing an Immobilize can sometimes stagger him several times and give you several openings. Using the Azure Dust Transformation is also useful to soak up his most damaging combos and retaliate with heavy charged hits to take chunks off his health.\nKeep practicing against dodging his moves, finding the right times to deflect the end of his combos (or just use Cloud Step to get out of the way) and always watch carefully when you stagger him to avoid his rising grab. Having the concoction to increase your max health can be beneficial if you’re unable to evade his grab or lengthy combos.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight against the \"Mad Tiger\" in *Black Myth: Wukong*. The scene showcases the intense combat environment, with the player character facing the tiger amidst flying debris and visual effects. On-screen prompts highlight available attacks, such as \"Earth Shatter\" (light attack) and \"Mountain Splitter\" (heavy attack), emphasizing strategic combat options. The preceding and following text provides guidance on surviving the fight, including dodging, deflecting, and using upgrades or transformations to counter the boss's powerful moves and avoid instant death."
}