{
    "chunk_id": 593313968125,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ec/Wukong_Wolves_22X.jpg",
    "alt_text": "Wukong Wolves 22X.jpg",
    "position_desc": 30,
    "img_above_text": "Past the wooden gate the Bullguard was blocking, you’ll find another forested area with a sloping path up to the left. If you want to explore a bit first, head to the right to find a Wolf and some **Purple Lingzhi** , and a small pool of water where two Croaky enemies wait alongside some **Jade Lotus**.\nTaking the path up to the left, be ready to deal with a few more Wolf Scouts and Swordsworns. Grab the **Aged Ginseng** by a stone pillar as the path curves right.",
    "img_below_text": "Past another Wolf, you’ll come upon the top of the path where a large wooden balcony overlooks the temple below. There’s a small orange pillow you can interact with to activate a **Meditation Spot**. Each chapter has a few of these, and resting at one will grant you a **free Spark Skill Point**\nThe Arbor, Forest of Wolves Meditation Spot",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Past the wooden gate the Bullguard was blocking, you’ll find another forested area with a sloping path up to the left. If you want to explore a bit first, head to the right to find a Wolf and some **Purple Lingzhi** , and a small pool of water where two Croaky enemies wait alongside some **Jade Lotus**.\nTaking the path up to the left, be ready to deal with a few more Wolf Scouts and Swordsworns. Grab the **Aged Ginseng** by a stone pillar as the path curves right.\"\n        - Following Text: \"Past another Wolf, you’ll come upon the top of the path where a large wooden balcony overlooks the temple below. There’s a small orange pillow you can interact with to activate a **Meditation Spot**. Each chapter has a few of these, and resting at one will grant you a **free Spark Skill Point**\nThe Arbor, Forest of Wolves Meditation Spot\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character approaching a highlighted object on a wooden balcony overlooking a scenic temple area. The object, marked with a red targeting circle, appears to be the **Meditation Spot** mentioned in the following text. Interacting with this spot provides a **free Spark Skill Point**, serving as a resting and progression feature within the game. The surrounding environment aligns with the forested and sloping path described in the preceding text."
}