{
    "chunk_id": 523769226171,
    "source_file": "Blood_of_the_Iron_Bull.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7f/Gore_eye_daoist_2.png",
    "alt_text": "Gore eye daoist 2.png",
    "position_desc": 14,
    "img_above_text": "At the base of the sand slope in Fright Cliff, you will see the Yellow Sand Formation \\- Windseal Gate Shrine in Yellow Wind Ridge. Instead of going through the gate with the Sterness of Stone and Keeness of Tiger, head up the path opposite the slope.\nHere you will find the Gore-Eye Daoist boss, which you can defeat. They will drop the Blood of the Iron Bull and a Spirit for you.",
    "img_below_text": "### Blood of the Iron Bull Location 12\nThe next Blood of the Iron Bull can be found by defeating the Tiger's Acolyte in Yellow Sand Formation \\- Windrest Hamlet in Yellow Wind Ridge. This can be accessed by going across the bridge from the Valley of Despair Shrine in Sandgate Village.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"At the base of the sand slope in Fright Cliff, you will see the Yellow Sand Formation \\- Windseal Gate Shrine in Yellow Wind Ridge. Instead of going through the gate with the Sterness of Stone and Keeness of Tiger, head up the path opposite the slope.\nHere you will find the Gore-Eye Daoist boss, which you can defeat. They will drop the Blood of the Iron Bull and a Spirit for you.\"\n        - Following Text: \"### Blood of the Iron Bull Location 12\nThe next Blood of the Iron Bull can be found by defeating the Tiger's Acolyte in Yellow Sand Formation \\- Windrest Hamlet in Yellow Wind Ridge. This can be accessed by going across the bridge from the Valley of Despair Shrine in Sandgate Village.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character confronting the Gore-Eye Daoist boss in a rocky, desolate area. The boss is wielding a weapon and appears hostile, while the player is equipped with armor and a staff-like weapon. This encounter is part of the walkthrough's instructions for defeating the Gore-Eye Daoist to obtain the Blood of the Iron Bull and a Spirit, located near the sand slope in Fright Cliff, opposite the Windseal Gate Shrine in Yellow Wind Ridge."
}