{
    "chunk_id": 465733165102,
    "source_file": "Hundred-Eyed_Daoist_Master.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/61/Wukong_YellowFlower_78.png",
    "alt_text": "Wukong YellowFlower 78.png",
    "position_desc": 14,
    "img_above_text": "![Wukong YellowFlower 77.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4e/Wukong_YellowFlower_77.jpg)\nHe can also hold his sword high up above him while charging it with lightning strikes. After a delay, he'll begin slashing the air in your direction, unleashing a low projectile wave followed by a diagonal slash wave, and then charge up his sword before jabbing it ahead to send a beam of lightning straight at you. It's better to keep your distance the moment you see him charging up, then dodge the three blasts before moving back in to fight.",
    "img_below_text": "Finally, if he sheathes his sword entirely to concentrate on sending his electric talismans at you, prepare for a length barrage. As he performs a gesture with his hands low, he'll bring them up as he explodes with energy, and then send a salvo of electric talismans flying at you.\nIf caught off guard, it's very hard to escape them once you first get staggered, but if you see the attack coming, step back and refresh your stamina, and then start spinning your staff to deflect the barrage until he's done.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong YellowFlower 77.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4e/Wukong_YellowFlower_77.jpg)\nHe can also hold his sword high up above him while charging it with lightning strikes. After a delay, he'll begin slashing the air in your direction, unleashing a low projectile wave followed by a diagonal slash wave, and then charge up his sword before jabbing it ahead to send a beam of lightning straight at you. It's better to keep your distance the moment you see him charging up, then dodge the three blasts before moving back in to fight.\"\n        - Following Text: \"Finally, if he sheathes his sword entirely to concentrate on sending his electric talismans at you, prepare for a length barrage. As he performs a gesture with his hands low, he'll bring them up as he explodes with energy, and then send a salvo of electric talismans flying at you.\nIf caught off guard, it's very hard to escape them once you first get staggered, but if you see the attack coming, step back and refresh your stamina, and then start spinning your staff to deflect the barrage until he's done.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss battle in *Black Myth: Wukong* against the \"Hundred-Eyed Daoist Master.\" The boss, mounted on a spider-like creature, is shown wielding a glowing sword charged with energy, likely preparing one of its lightning-based attacks described in the text. The player character, armed with a staff, is engaged in combat amidst a vibrant field of yellow flowers. The preceding and following text detail the boss's attack patterns, emphasizing its lightning strikes, projectile waves, and electric talisman barrages, which require strategic dodging and deflection to survive."
}