{
    "chunk_id": 939415992040,
    "source_file": "How_to_Find_All_Purple_Talisman_Altars_in_Chapter_4.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5f/Purple_Talismans_Chapter_4_.png",
    "alt_text": "Purple Talismans Chapter 4 .png",
    "position_desc": 13,
    "img_above_text": "This will lead you to a courtyard, where the last altar and Talisman is. You'll hear someone shout \"Run!\" as you approach.\n## What Happens When You Collect All 4 Talismans?",
    "img_below_text": "When you collect the final Talisman, the Altar will disappear and a boss called the Supreme Inspector will emerge. Fight for as long as you can and a cutscene will begin. The Supreme Inspector will be taken away by the Crane Immortal who emerges, and the fight will end here.\nWhen it's over, you can collect a Celestial Nonary Pill from the box behind the fight area and will achieve the trophy Misfit with Merit.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"This will lead you to a courtyard, where the last altar and Talisman is. You'll hear someone shout \"Run!\" as you approach.\n## What Happens When You Collect All 4 Talismans?\"\n        - Following Text: \"When you collect the final Talisman, the Altar will disappear and a boss called the Supreme Inspector will emerge. Fight for as long as you can and a cutscene will begin. The Supreme Inspector will be taken away by the Crane Immortal who emerges, and the fight will end here.\nWhen it's over, you can collect a Celestial Nonary Pill from the box behind the fight area and will achieve the trophy Misfit with Merit.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a pivotal moment in the game where the player character confronts the Supreme Inspector, a boss that emerges after collecting the final Talisman. The setting is a courtyard with a mystical altar, which disappears as the boss appears. This encounter leads to a significant battle, followed by a cutscene involving the Crane Immortal and rewards such as the Celestial Nonary Pill and the \"Misfit with Merit\" trophy."
}