{
    "chunk_id": 266388475646,
    "source_file": "Luojia_Fragrant_Vine_Locations.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c9/Temple_of_the_Yellow_Flowers_Luojia_Fragrant_Vine.jpg",
    "alt_text": "Temple of the Yellow Flowers Luojia Fragrant Vine.jpg",
    "position_desc": 8,
    "img_above_text": "### Temple of the Yellow Flowers Luojia Fragrant Vine\nTemple of the Yellow Flowers Luojia Fragrant Vine",
    "img_below_text": "The Temple of the Yellow Flowers Luojia Fragrant Vine is accessible after defeating the Violet Spider in the Webbed Hollow. Follow the spiders up the hill after defeating the boss to find yourself near the trail leading to the Temple of the Yellow Flowers. The vine is hanging from the branches of a tree right at the start of the trail.\n### Relief of the Fallen Loong Luojia Fragrant Vine",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"### Temple of the Yellow Flowers Luojia Fragrant Vine\nTemple of the Yellow Flowers Luojia Fragrant Vine\"\n        - Following Text: \"The Temple of the Yellow Flowers Luojia Fragrant Vine is accessible after defeating the Violet Spider in the Webbed Hollow. Follow the spiders up the hill after defeating the boss to find yourself near the trail leading to the Temple of the Yellow Flowers. The vine is hanging from the branches of a tree right at the start of the trail.\n### Relief of the Fallen Loong Luojia Fragrant Vine\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character standing near a tree adorned with glowing orange leaves and vines, with an interactive prompt labeled \"Gather\" (RT) visible. This scene aligns with the context of the Temple of the Yellow Flowers Luojia Fragrant Vine, where players collect the vine hanging from the branches of a tree at the start of the trail. The environment features rocky terrain and subdued lighting, suggesting a mystical or secluded area within the game."
}