{
    "chunk_id": 791818233141,
    "source_file": "Things_Black_Myth_Wukong_Doesn%27t_Tell_You.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/dd/Wukong_Wolves_5.jpg",
    "alt_text": "Wukong Wolves 5.jpg",
    "position_desc": 16,
    "img_above_text": "Each region has a number of Meditation Spots to uncover and every time you take a quiet moment to reflect, you’ll gain Sparks. If you want to unlock all those skills quickly, it’s worth tracking down every Meditation Spot and enjoying a moment of calm.\n### 11\\. Heavy Attacks Work Differently",
    "img_below_text": "Heavy attacks work very differently than in most action games, as their function differs depending on whether they’re used in or outside of a combo, and also depending on what stance you’re in. When used outside of a combo, they can be charged up to the number of focus points that you have unlocked, with each level of charge dramatically increasing the amount of damage the heavy attack will deal.\nWhen used in combos with the standard attack button, you'll perform a Varied Combo, assuming you’ve unlocked the specific Varied Combo from the skill tree in that stance. Varied combos require one point of focus, and unlike standalone heavy attacks, cannot be charged. That said, further upgrades can be purchased in the skill tree that can power them up and allow for follow up attacks that use additional focus points.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Each region has a number of Meditation Spots to uncover and every time you take a quiet moment to reflect, you’ll gain Sparks. If you want to unlock all those skills quickly, it’s worth tracking down every Meditation Spot and enjoying a moment of calm.\n### 11\\. Heavy Attacks Work Differently\"\n        - Following Text: \"Heavy attacks work very differently than in most action games, as their function differs depending on whether they’re used in or outside of a combo, and also depending on what stance you’re in. When used outside of a combo, they can be charged up to the number of focus points that you have unlocked, with each level of charge dramatically increasing the amount of damage the heavy attack will deal.\nWhen used in combos with the standard attack button, you'll perform a Varied Combo, assuming you’ve unlocked the specific Varied Combo from the skill tree in that stance. Varied combos require one point of focus, and unlike standalone heavy attacks, cannot be charged. That said, further upgrades can be purchased in the skill tree that can power them up and allow for follow up attacks that use additional focus points.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from a video game where a character is engaged in combat or performing an action near a fallen enemy. The environment is a lush forest with detailed vegetation, a large fallen tree, and a treasure chest nearby. The red glow suggests the collection of energy or resources, possibly Sparks, aligning with the preceding text about Meditation Spots and gaining Sparks. The HUD elements, including health and focus bars, indicate gameplay mechanics tied to combat and resource management, which connects to the following text discussing heavy attacks and focus points."
}