{
    "chunk_id": 967337542005,
    "source_file": "Plaguebane_Gourd.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/58/Plaguebane_Gourd.jpg",
    "alt_text": "Plaguebane Gourd.jpg",
    "position_desc": 1,
    "img_above_text": "The Plaguebane Gourd is a unique Gourd in Black Myth: Wukong in that it offers an effect focused entirely around not refilling your health. The Rare Gourd comes with the bonus of halving your health recovery when using it, but your attack is increased for a short duration.\nThis makes it a great Gourd for those looking to play risky, when compared to the other Gourds in the game, as the attack boost is quite potent. The Gourd only has five uses and can't be upgraded.",
    "img_below_text": "## Black Myth: Wukong Plaguebane Gourd Location\nThe Plaguebane Gourd can be found in in the chest after defeating the Mad Tiger boss in Yellow Wind Ridge. It requires you to defeat the Tiger Acolyte and obtain the Old Rattle-Drum Key Item.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Plaguebane Gourd is a unique Gourd in Black Myth: Wukong in that it offers an effect focused entirely around not refilling your health. The Rare Gourd comes with the bonus of halving your health recovery when using it, but your attack is increased for a short duration.\nThis makes it a great Gourd for those looking to play risky, when compared to the other Gourds in the game, as the attack boost is quite potent. The Gourd only has five uses and can't be upgraded.\"\n        - Following Text: \"## Black Myth: Wukong Plaguebane Gourd Location\nThe Plaguebane Gourd can be found in in the chest after defeating the Mad Tiger boss in Yellow Wind Ridge. It requires you to defeat the Tiger Acolyte and obtain the Old Rattle-Drum Key Item.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image showcases the \"Plaguebane Gourd\" from *Black Myth: Wukong*, a rare item in the game's inventory menu. This Gourd reduces health recovery but temporarily boosts attack power, making it ideal for high-risk, high-reward gameplay. The description highlights its limited uses (five) and inability to be upgraded. Additional details include its compatibility with items like \"10-Year-Old Coconut Wine\" for health recovery and \"Laurel Buds\" for damage reduction."
}