{
    "chunk_id": 383443784154,
    "source_file": "Field_of_Fire_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/aa/Field_Fire_Walkthrough_%2826%29.png",
    "alt_text": "Field Fire Walkthrough \\(26\\).png",
    "position_desc": 24,
    "img_above_text": "![Field Fire Walkthrough \\(27\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/98/Field_Fire_Walkthrough_%2827%29.png)\nAfter the fight, take the path that slopes down behind the area where you fought the Flint Vanguard. You'll encounter some more of the Searing and Scorching-Flame enemies, as well as a little green Wisp to the right, by the lava lake.",
    "img_below_text": "As you head into the next barren section, you may notice the glow of a treasure chest up ahead. Be warned that there are also little glowing patches leading up to, and inside the next clearing, and these are all Flamlings. Clear them out before you go over to the chest, where you can collect Refined Iron Sand from it.\nWhen you've looted the chest, go around to the other side of the rock. There will be an open clearing here, that looks like it's empty. Again, remove any Flamlings from the area, then go to the center of the clearing. Here you'll find a larger glowing patch.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Field Fire Walkthrough \\(27\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/98/Field_Fire_Walkthrough_%2827%29.png)\nAfter the fight, take the path that slopes down behind the area where you fought the Flint Vanguard. You'll encounter some more of the Searing and Scorching-Flame enemies, as well as a little green Wisp to the right, by the lava lake.\"\n        - Following Text: \"As you head into the next barren section, you may notice the glow of a treasure chest up ahead. Be warned that there are also little glowing patches leading up to, and inside the next clearing, and these are all Flamlings. Clear them out before you go over to the chest, where you can collect Refined Iron Sand from it.\nWhen you've looted the chest, go around to the other side of the rock. There will be an open clearing here, that looks like it's empty. Again, remove any Flamlings from the area, then go to the center of the clearing. Here you'll find a larger glowing patch.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a volcanic, barren landscape with lava pools and rocky terrain. A player character, wielding a weapon, is engaged in combat with a fiery enemy on the right. Red arrows and a dashed circle highlight a path leading forward and a specific point of interest, likely the \"little green Wisp\" mentioned in the preceding text. The image serves to guide players through this section of the game, emphasizing navigation and enemy encounters in the area."
}