{
    "chunk_id": 395908489052,
    "source_file": "Snowhill_Path_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/ff/Wukong_Snowhill_32.jpg",
    "alt_text": "Wukong Snowhill 32.jpg",
    "position_desc": 31,
    "img_above_text": "When at last you reach your destination and return to monkey form, you'll find yourself at the foot of the Mirrormere Shrine. The Keeper of the New West will bid you to plunder the small temple on the frozen lake to find the next Sense of the Great Sage.\nBefore you do that however, there's a couple things to check out before crossing the giant frozen lake.",
    "img_below_text": "First, start by exploring the area to the right when facing the lakeshore. You'll find assorted materials to harvest here, including **Fire Bellflowers** and a **Celestial Pear** tree in the far corner. Be on the lookout for a few scattered Frozen Corpses as you explore, and a Cyan Bat or two hiding up in the trees.\nThough the massive frozen lake expanse is largely empty, there is one thing worth stepping onto the ice for while on the right side. Head around a section of impassible rocks when stepping onto the ice, and run around past it to find a small alcove section with a small tree along another shore on the right.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"When at last you reach your destination and return to monkey form, you'll find yourself at the foot of the Mirrormere Shrine. The Keeper of the New West will bid you to plunder the small temple on the frozen lake to find the next Sense of the Great Sage.\nBefore you do that however, there's a couple things to check out before crossing the giant frozen lake.\"\n        - Following Text: \"First, start by exploring the area to the right when facing the lakeshore. You'll find assorted materials to harvest here, including **Fire Bellflowers** and a **Celestial Pear** tree in the far corner. Be on the lookout for a few scattered Frozen Corpses as you explore, and a Cyan Bat or two hiding up in the trees.\nThough the massive frozen lake expanse is largely empty, there is one thing worth stepping onto the ice for while on the right side. Head around a section of impassible rocks when stepping onto the ice, and run around past it to find a small alcove section with a small tree along another shore on the right.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image shows a player character exploring a snowy area near the Mirrormere Shrine, as described in the walkthrough. The player has just harvested **Fire Bellflower Seeds**, with a notification confirming the collection of two Fire Bellflowers. The setting features rugged, snow-covered terrain with scattered vegetation and a prominent tree, aligning with the guide's suggestion to explore the lakeshore area for materials before crossing the frozen lake."
}