{
    "chunk_id": 614254642344,
    "source_file": "Temple_of_Yellow_Flowers_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/70/Wukong_YellowFlower_30.jpg",
    "alt_text": "Wukong YellowFlower 30.jpg",
    "position_desc": 28,
    "img_above_text": "At the top of the stairs, pass through the gate to enter the first courtyard. This large open area sports a large tree with a **Treasure Chest** straight ahead, while a blood trail leads along the main path to the left.\nFirst, however, we will take the right path to a large gateway along the yellow walls after grabbing the chest.",
    "img_below_text": "This inner hall is teeming with tons of Worm Practitioners all over the lower walkway, with a Snake Sheriff patrolling up some stairs ahead. On the plus side, many of the Worm Practitioners are lying out in the sun and won't react until you get close, so you can either ignore them, or sneak up to hit them with charge attacks before finishing them off.\n![Wukong YellowFlower 31.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f7/Wukong_YellowFlower_31.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"At the top of the stairs, pass through the gate to enter the first courtyard. This large open area sports a large tree with a **Treasure Chest** straight ahead, while a blood trail leads along the main path to the left.\nFirst, however, we will take the right path to a large gateway along the yellow walls after grabbing the chest.\"\n        - Following Text: \"This inner hall is teeming with tons of Worm Practitioners all over the lower walkway, with a Snake Sheriff patrolling up some stairs ahead. On the plus side, many of the Worm Practitioners are lying out in the sun and won't react until you get close, so you can either ignore them, or sneak up to hit them with charge attacks before finishing them off.\n![Wukong YellowFlower 31.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f7/Wukong_YellowFlower_31.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a courtyard area with yellow walls, a large tree, and stone pathways, as described in the preceding text. A character wielding a fiery weapon is seen approaching two enemies, one of which appears to be a Worm Practitioner in a yellow robe. This scene aligns with the narrative of exploring the courtyard and encountering enemies, some of whom are passive until approached."
}