{
    "chunk_id": 833394037494,
    "source_file": "Best_Spirits_to_Use.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/07/Best_Spirits_%283%29.png",
    "alt_text": "Best Spirits \\(3\\).png",
    "position_desc": 4,
    "img_above_text": "If you want to make the most of the spells you can cast, the Gore-Eye Daoist moderately buffs your Maximum Mana levels. To complement the equipped effect, his Raging Blood attack sees him create an area that will enhance your attacks along as you stay inside the glow.\n### Tiger's Acolyte",
    "img_below_text": "It's a fairly simple attack that the Tiger's Acolyte offers, but Sharp Edge is a quick hack-and-slash move that can deal a chunk of damage. In addition to the move, you'll also gain a moderate increase in Critical Damage, so using it at the right time can be a powerful attack. As another added bonus, the Qi cost of using Tiger's Acolyte is moderate, while most others are high.\n### Blade Monk",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"If you want to make the most of the spells you can cast, the Gore-Eye Daoist moderately buffs your Maximum Mana levels. To complement the equipped effect, his Raging Blood attack sees him create an area that will enhance your attacks along as you stay inside the glow.\n### Tiger's Acolyte\"\n        - Following Text: \"It's a fairly simple attack that the Tiger's Acolyte offers, but Sharp Edge is a quick hack-and-slash move that can deal a chunk of damage. In addition to the move, you'll also gain a moderate increase in Critical Damage, so using it at the right time can be a powerful attack. As another added bonus, the Qi cost of using Tiger's Acolyte is moderate, while most others are high.\n### Blade Monk\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image showcases a character screen from a video game, specifically highlighting the \"Equipment\" menu. The character depicted appears to be a warrior or combat-focused entity, wielding a large weapon and dressed in detailed armor or robes. This screen likely serves as a visual representation of the player's equipped gear and stats, tying into the narrative context of enhancing abilities such as mana, critical damage, and attack power, as described in the preceding and following text."
}