{
    "chunk_id": 174924416026,
    "source_file": "Crouching_Tiger_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d6/Wukong_Tiger_26.jpg",
    "alt_text": "Wukong Tiger 26.jpg",
    "position_desc": 27,
    "img_above_text": "![Wukong Tiger 25.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ea/Wukong_Tiger_25.jpg)\nHere, you’ll find a large group of unique enemies not found elsewhere - Civet Sergeants. These small cat-like Yaoguai are armed with two swords apiece, and are led by an emboldened Civet Sergeant who boasts more health and attack, as he drops the Civet Sergeant Spirit when killed.",
    "img_below_text": "Due to their overwhelming numbers and ferocity of their relentless strikes, it can be hard to clear them out safely. This is a perfect place to unleash the Azure Dust Transformation to slam into them as a Rock Guai. The more they attack you on all sides with tiny blades, the faster you’ll charge your Might to unleash your big area of effect spell attack.\nOutside of your transformation, try to use Spirits who can attack multiple targets like the Earth Wolf’s charge, and consider using the Pillar Stance’s heavy attack to spin around on staff and attack the group as a whole.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Tiger 25.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ea/Wukong_Tiger_25.jpg)\nHere, you’ll find a large group of unique enemies not found elsewhere - Civet Sergeants. These small cat-like Yaoguai are armed with two swords apiece, and are led by an emboldened Civet Sergeant who boasts more health and attack, as he drops the Civet Sergeant Spirit when killed.\"\n        - Following Text: \"Due to their overwhelming numbers and ferocity of their relentless strikes, it can be hard to clear them out safely. This is a perfect place to unleash the Azure Dust Transformation to slam into them as a Rock Guai. The more they attack you on all sides with tiny blades, the faster you’ll charge your Might to unleash your big area of effect spell attack.\nOutside of your transformation, try to use Spirits who can attack multiple targets like the Earth Wolf’s charge, and consider using the Pillar Stance’s heavy attack to spin around on staff and attack the group as a whole.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts gameplay from *Black Myth: Wukong*, showing the player character mid-combat in a dimly lit area, likely against the Civet Sergeants mentioned in the text. The on-screen instructions highlight three abilities: \"Earth Shatter\" (light attack), \"Mountain Splitter\" (heavy attack), and \"Rockfall\" (spell causing area damage). These abilities align with the strategy described in the text for dealing with large groups of enemies, emphasizing area-of-effect attacks to manage the overwhelming numbers."
}