{
    "chunk_id": 377766918186,
    "source_file": "Endings_Explained.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8d/Endings_Explained_%2816%29.png",
    "alt_text": "Endings Explained \\(16\\).png",
    "position_desc": 4,
    "img_above_text": "This will see you face off against Erlang, The Sacred Divinity, The Four Heavenly Kings, and Erlang Shen. After winning the battle against them, you'll need to return to fight the Stone Monkey and The Great Sage's Broken Shell.\nYou'll see the exact same cutscene for this ending, where Wukong falls to his knees and loses the Six Senses from his body only for The Destined One to absorb them.",
    "img_below_text": "The difference with this ending, however, is that when the gold crown drops into the water, and The Old Monkey picks it up and places it on The Destined One's head, there will be a flash where The Destined One opens his eyes.\n![Endings Explained \\(15\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/72/Endings_Explained_%2815%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"This will see you face off against Erlang, The Sacred Divinity, The Four Heavenly Kings, and Erlang Shen. After winning the battle against them, you'll need to return to fight the Stone Monkey and The Great Sage's Broken Shell.\nYou'll see the exact same cutscene for this ending, where Wukong falls to his knees and loses the Six Senses from his body only for The Destined One to absorb them.\"\n        - Following Text: \"The difference with this ending, however, is that when the gold crown drops into the water, and The Old Monkey picks it up and places it on The Destined One's head, there will be a flash where The Destined One opens his eyes.\n![Endings Explained \\(15\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/72/Endings_Explained_%2815%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a character adorned in ornate, golden armor with intricate designs, likely representing a significant figure in the game's narrative. Based on the context, this moment appears to be tied to the ending sequence of *Black Myth: Wukong*, where \"The Destined One\" undergoes a transformation or realization, as hinted by the flash and the opening of their eyes. The visual emphasizes the character's importance and the culmination of the storyline."
}