{
    "chunk_id": 862713782033,
    "source_file": "Earth_Rakshasa_Spirit.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9e/Shield_Spirit.jpg",
    "alt_text": "Shield Spirit.jpg",
    "position_desc": 3,
    "img_above_text": "To defeat the Earth Rakshasa, hang back and wait until the enemy charges you. Dodge to the side just before the attack hits and quickly run back to hit it in the back and damage the Earth Rakshasa's body instead of its shield. It can be difficult to get around the shield, but casting Immobilize makes it much easier if you're struggling.\n## Earth Rakshasa Spirit",
    "img_below_text": "* **Bulwark Shield**\n* Equipped Effect: Moderately increases Damage Reduction for a short duration after being hit.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"To defeat the Earth Rakshasa, hang back and wait until the enemy charges you. Dodge to the side just before the attack hits and quickly run back to hit it in the back and damage the Earth Rakshasa's body instead of its shield. It can be difficult to get around the shield, but casting Immobilize makes it much easier if you're struggling.\n## Earth Rakshasa Spirit\"\n        - Following Text: \"* **Bulwark Shield**\n* Equipped Effect: Moderately increases Damage Reduction for a short duration after being hit.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "1. **Summary**: The image showcases the \"Earth Rakshasa\" spirit from a video game, which is categorized as a rare spirit with high Qi cost. Its ability, \"Bulwark Shield,\" allows the player to take the form of the Earth Rakshasa, using a heavy shield to smash the ground and damage nearby foes, then planting the shield to block attacks. The equipped effect moderately increases damage reduction for a short duration after being hit. The interface also displays other spirits available for selection and detailed stats of the character.\n\n2. **Purpose/Content**: The image provides information about the Earth Rakshasa spirit's abilities and effects, serving as part of the game's equipment menu where players can choose and equip spirits to enhance their combat strategy."
}