{
    "chunk_id": 561525015240,
    "source_file": "Sandgate_Village_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/34/Wukong_Sandgate_3.jpg",
    "alt_text": "Wukong Sandgate 3.jpg",
    "position_desc": 3,
    "img_above_text": "![Wukong Sandgate 2.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/cc/Wukong_Sandgate_2.jpg)\nWhen you regain control, head into the stagnant shallow pool of water, where you’ll find a few Jade Lotus to harvest. Over on the right, the source of the arrows you became riddled with will become apparent, as a nearby ridge is lined with Rat Archers who will fire long salvos of flaming arrows from above.",
    "img_below_text": "Sprint past them along the water until you can find a small area to climb up onto, where a Rat Soldier will engage you from the left. Be sure to strafe around to keep the archers between you and the soldier, and bait out his shield slam before hitting him with a heavy attack to shatter his shield (the shield’s health appears as a white bar above his health bar).\n![Wukong Sandgate 4.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f4/Wukong_Sandgate_4.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Sandgate 2.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/cc/Wukong_Sandgate_2.jpg)\nWhen you regain control, head into the stagnant shallow pool of water, where you’ll find a few Jade Lotus to harvest. Over on the right, the source of the arrows you became riddled with will become apparent, as a nearby ridge is lined with Rat Archers who will fire long salvos of flaming arrows from above.\"\n        - Following Text: \"Sprint past them along the water until you can find a small area to climb up onto, where a Rat Soldier will engage you from the left. Be sure to strafe around to keep the archers between you and the soldier, and bait out his shield slam before hitting him with a heavy attack to shatter his shield (the shield’s health appears as a white bar above his health bar).\n![Wukong Sandgate 4.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f4/Wukong_Sandgate_4.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat encounter in *Black Myth: Wukong*, where the protagonist engages a Rat Soldier wielding a large shield and spear in a rocky, arid environment. The preceding and following text suggests this is part of a sequence where players must navigate past Rat Archers and confront this soldier, using strategic movement to bait out his shield slam and counter with heavy attacks to break his shield. The image highlights the intensity of the battle and the game's focus on tactical combat mechanics."
}