{
    "chunk_id": 532695756894,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/be/Furnace_Valley_Walkthrough_%2899%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(99\\).png",
    "position_desc": 40,
    "img_above_text": "Keep following the staircases, turning right after the next set to cross the bridge toward the bull guard with the two staffs and the two Flame Rhino Masters.\nCross the bridge and up the small set of stairs, towards the giants. On the right, you'll encounter a Bull Governor. Though it's best to deal with the creature now, don't go to the right just yet.",
    "img_below_text": "Instead, take the path to the left. You'll see a set of stares with the Flame Rhino Master at the top, and a small temple with a flame glowing inside. Head for the stairs first and take out the Flame Rhino Master, then hop over to the temple.\n![Furnace Valley Walkthrough \\(101\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fe/Furnace_Valley_Walkthrough_%28101%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Keep following the staircases, turning right after the next set to cross the bridge toward the bull guard with the two staffs and the two Flame Rhino Masters.\nCross the bridge and up the small set of stairs, towards the giants. On the right, you'll encounter a Bull Governor. Though it's best to deal with the creature now, don't go to the right just yet.\"\n        - Following Text: \"Instead, take the path to the left. You'll see a set of stares with the Flame Rhino Master at the top, and a small temple with a flame glowing inside. Head for the stairs first and take out the Flame Rhino Master, then hop over to the temple.\n![Furnace Valley Walkthrough \\(101\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fe/Furnace_Valley_Walkthrough_%28101%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dark, rocky environment with glowing lava flows and ancient architectural elements, including stairs, bridges, and temple-like structures. A large, intimidating enemy resembling a Bull Governor is visible in the background, standing near fiery terrain. A red arrow on the left indicates the suggested path for the player to take, aligning with the walkthrough's instruction to avoid the right side and proceed left toward stairs leading to a Flame Rhino Master and a glowing temple."
}