{
    "chunk_id": 848444824048,
    "source_file": "Apramana_Bat.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/13/Wukong_Bitter_35.jpg",
    "alt_text": "Wukong Bitter 35.jpg",
    "position_desc": 5,
    "img_above_text": "![Wukong Bitter 38.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b2/Wukong_Bitter_38.jpg)\nIt's most common attack in the air is spreading its wings wide before beating them together, creating a cross slash projectile down at your location that requires some quick dodging.",
    "img_below_text": "If you see its legs extend upwards (similar to the lesser variants) it's preparing to slam down its talons on you in a quick downward slam. However, deflecting with Rock Solid will send it flying backward, only to topple out of the sky and provide you a moment to sprint over and retaliate.\n![Wukong Bitter 42.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/53/Wukong_Bitter_42.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Bitter 38.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b2/Wukong_Bitter_38.jpg)\nIt's most common attack in the air is spreading its wings wide before beating them together, creating a cross slash projectile down at your location that requires some quick dodging.\"\n        - Following Text: \"If you see its legs extend upwards (similar to the lesser variants) it's preparing to slam down its talons on you in a quick downward slam. However, deflecting with Rock Solid will send it flying backward, only to topple out of the sky and provide you a moment to sprint over and retaliate.\n![Wukong Bitter 42.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/53/Wukong_Bitter_42.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an intense moment from the video game *Black Myth: Wukong*, showcasing the player facing a large airborne enemy, the \"Apramana Bat.\" The bat is positioned overhead, preparing to attack, likely using its wing-based cross slash projectile as described in the preceding text. The player’s interface displays various combat and item options, such as \"Rock Solid\" for deflection and consumables like \"Tiger Subduing Pellets.\" The following text suggests strategies for countering the bat's downward talon slam, emphasizing timing and retaliation opportunities."
}