{
    "chunk_id": 770854965954,
    "source_file": "Webbed_Hollow_-_Lower_Hollow_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/80/Wukong_LowerHollow_86.jpg",
    "alt_text": "Wukong LowerHollow 86.jpg",
    "position_desc": 82,
    "img_above_text": "When the queen of spiders finally falls to your assault, she'll beat a hasty retreat to return to wherever she's hidden the Sage's Relic. You'll need to follow quickly, because a literal spider army will appear to give chase!\nViolet Spider",
    "img_below_text": "Quickly run toward the cave entrance on the far side, and don't stop sprinting for anything.\n![Wukong LowerHollow 87.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c0/Wukong_LowerHollow_87.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"When the queen of spiders finally falls to your assault, she'll beat a hasty retreat to return to wherever she's hidden the Sage's Relic. You'll need to follow quickly, because a literal spider army will appear to give chase!\nViolet Spider\"\n        - Following Text: \"Quickly run toward the cave entrance on the far side, and don't stop sprinting for anything.\n![Wukong LowerHollow 87.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c0/Wukong_LowerHollow_87.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a moment from the game where the player character, armed with a staff, is kneeling in a dimly lit cave filled with cobwebs and an overwhelming swarm of spiders in the background. The HUD displays collected materials, including a \"Spider Leg,\" and the player's resources such as \"Will\" and \"Refined Iron Sand.\" This scene follows the defeat of the spider queen and sets the stage for a high-stakes chase sequence, emphasizing urgency and danger."
}