{
    "chunk_id": 770630461077,
    "source_file": "Civet_Sergeant_Spirit.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/18/Civet_Power.png",
    "alt_text": "Civet Power.png",
    "position_desc": 3,
    "img_above_text": "The Civet Sergeant fight is no walk in the park. There are around five Civet Sergeants to deal with, all of which are hurling knives, flipping around you, and hounding you at once. Immobilize and A Pluck of Many spells will make this fight much easier and level the playing field a little.\n## Civet Sergeant Spirit",
    "img_below_text": "* **Heart Ripper**\n* Equipped Effect: Slightly increases Attack.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Civet Sergeant fight is no walk in the park. There are around five Civet Sergeants to deal with, all of which are hurling knives, flipping around you, and hounding you at once. Immobilize and A Pluck of Many spells will make this fight much easier and level the playing field a little.\n## Civet Sergeant Spirit\"\n        - Following Text: \"* **Heart Ripper**\n* Equipped Effect: Slightly increases Attack.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "1. **Summary**:  \nThe image showcases the \"Civet Sergeant\" spirit in the game's equipment menu. This rare spirit allows the player to assume the form of a Civet Sergeant, wielding twin blades to attack enemies and inflict the \"Heart Ripper\" effect, which causes piercing damage. It has a moderate Qi cost and slightly increases attack when equipped. The menu also provides options to equip the spirit, view its demo, and sort spirits by acquisition order.\n\n2. **Purpose/Narrative Role**:  \nThe Civet Sergeant spirit is a combat tool that enhances the player's offensive capabilities, particularly useful in challenging fights like the Civet Sergeant encounter mentioned in the preceding text. Its equipped effect aligns with the game's emphasis on strategic spirit usage to overcome tough enemies."
}