{
    "chunk_id": 267450977346,
    "source_file": "Frostsprout_Twig.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b8/Frostspout_Twig_2.jpg",
    "alt_text": "Frostspout Twig 2.jpg",
    "position_desc": 1,
    "img_above_text": "The Frostsprout Twig Curios item in Black Myth: Wukong can be found within Chapter 3 of the game. While well-hidden, you will want to pick this up as it is locked behind a secret boss that will open additional areas in the Pagoda Realm.\nWith the Frostsprout Twig equipped, your Chill resistance is moderately increased, which is incredibly useful in The New West, especially in the locations after you find this Curios item.",
    "img_below_text": "As with all other Curios' in Black Myth: Wukong, the Frosprout Twig can't be upgraded, so you can't increase its power or potency. Therefore, you will want to switch to other Curios items to better fit your build as you play via the Equipment menu.\n## Black Myth: Wukong Frostsprout Twig Location",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Frostsprout Twig Curios item in Black Myth: Wukong can be found within Chapter 3 of the game. While well-hidden, you will want to pick this up as it is locked behind a secret boss that will open additional areas in the Pagoda Realm.\nWith the Frostsprout Twig equipped, your Chill resistance is moderately increased, which is incredibly useful in The New West, especially in the locations after you find this Curios item.\"\n        - Following Text: \"As with all other Curios' in Black Myth: Wukong, the Frosprout Twig can't be upgraded, so you can't increase its power or potency. Therefore, you will want to switch to other Curios items to better fit your build as you play via the Equipment menu.\n## Black Myth: Wukong Frostsprout Twig Location\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image showcases the Equipment menu in *Black Myth: Wukong*, specifically highlighting the \"Frostsprout Twig\" Curios item. This rare item moderately increases Chill resistance, making it useful in areas with cold-related challenges, such as The New West. The Frostsprout Twig is part of the Curios collection, which cannot be upgraded, and players are encouraged to switch items to suit their build as they progress."
}