{
    "chunk_id": 266807515670,
    "source_file": "Elder_Jinchi.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/aa/Wukong_Guanyin_13.jpg",
    "alt_text": "Wukong Guanyin 13.jpg",
    "position_desc": 12,
    "img_above_text": "![Wukong Guanyin 12.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/77/Wukong_Guanyin_12.jpg)\nSo long as you deny him opportunities to restore his health, and watch out for when his followers are activated, you only need to keep up the assault and shut down his ground slams or stay far away when they happen. Save your Red Tides transformation spell for right after his healing segment so you don’t waste any time in that form killing walking corpses.",
    "img_below_text": "Once Elder Jinchi is defeated, you’ll automatically be returned back to the third bell in the Marsh of the White Mist. You can now interact with the Wolf Guai hanging from the tree, causing it to turn to dust, and rewarding you with the Fireproof Mantle Vessel, and 2,000 Will.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Guanyin 12.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/77/Wukong_Guanyin_12.jpg)\nSo long as you deny him opportunities to restore his health, and watch out for when his followers are activated, you only need to keep up the assault and shut down his ground slams or stay far away when they happen. Save your Red Tides transformation spell for right after his healing segment so you don’t waste any time in that form killing walking corpses.\"\n        - Following Text: \"Once Elder Jinchi is defeated, you’ll automatically be returned back to the third bell in the Marsh of the White Mist. You can now interact with the Wolf Guai hanging from the tree, causing it to turn to dust, and rewarding you with the Fireproof Mantle Vessel, and 2,000 Will.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from *Black Myth: Wukong* where the player character approaches a Wolf Guai hanging from a tree. The Wolf Guai is shown disintegrating into dust, signifying the completion of an interaction that rewards the player with the Fireproof Mantle Vessel and 2,000 Will. This event occurs after defeating Elder Jinchi and returning to the third bell in the Marsh of the White Mist."
}