{
    "chunk_id": 680760412605,
    "source_file": "Agate_Jar.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a3/Agate_Jar_1.jpg",
    "alt_text": "Agate Jar 1.jpg",
    "position_desc": 2,
    "img_above_text": "## Black Myth: Wukong Agate Jar Location\nThe Agate Jar can be found in a box in the arena after fighting the Black Wind King in Black Wind Cave \\- Cave Interior in Black Wind Mountain. Simply defeat the Black Wind King and head over to this box in the arena to get the Agate Jar.",
    "img_below_text": "For even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Black Myth: Wukong Agate Jar Location\nThe Agate Jar can be found in a box in the arena after fighting the Black Wind King in Black Wind Cave \\- Cave Interior in Black Wind Mountain. Simply defeat the Black Wind King and head over to this box in the arena to get the Agate Jar.\"\n        - Following Text: \"For even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game *Black Myth: Wukong*, showing the player character standing in an arena-like area with a box placed on a table in the background. This box is likely the location of the Agate Jar, which can be obtained after defeating the Black Wind King in the Black Wind Cave. The image complements the walkthrough text by visually guiding players to the item’s location."
}