{
    "chunk_id": 585323555428,
    "source_file": "Commander_Beetle.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/06/Wukong_YellowFlower_20.jpg",
    "alt_text": "Wukong YellowFlower 20.jpg",
    "position_desc": 7,
    "img_above_text": "![Wukong YellowFlower 18.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e1/Wukong_YellowFlower_18.jpg)\nHowever, if he decides to hold his left weapon up by his face in a reverse grip fashion, it will become his shield, and he'll be able to soak any blows you try and land on him (even when Immobilized). Hit him too many times, and he'll launch into a swift two-hit counterattack. Luckily, you can counter his counter with a well-timed Rock Solid to throw him off.",
    "img_below_text": "Along with a variety of lunging attacks and dual-wield slashes, he also has a few unorthodox moves. If he tries to headbutt you by leaping on his side, resist the impulses to kick him when he's down. He'll recover from falling to the ground by doing a breakdancing kick spin while slashing with both swords to lift off the ground and damage you if you get close.\n![Wukong YellowFlower 23.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/87/Wukong_YellowFlower_23.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong YellowFlower 18.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e1/Wukong_YellowFlower_18.jpg)\nHowever, if he decides to hold his left weapon up by his face in a reverse grip fashion, it will become his shield, and he'll be able to soak any blows you try and land on him (even when Immobilized). Hit him too many times, and he'll launch into a swift two-hit counterattack. Luckily, you can counter his counter with a well-timed Rock Solid to throw him off.\"\n        - Following Text: \"Along with a variety of lunging attacks and dual-wield slashes, he also has a few unorthodox moves. If he tries to headbutt you by leaping on his side, resist the impulses to kick him when he's down. He'll recover from falling to the ground by doing a breakdancing kick spin while slashing with both swords to lift off the ground and damage you if you get close.\n![Wukong YellowFlower 23.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/87/Wukong_YellowFlower_23.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat sequence from *Black Myth: Wukong*, showcasing the protagonist, Wukong, engaging in battle with an enemy named \"Commander Beetle.\" The scene highlights close-quarters combat, with Wukong seemingly striking the enemy while the opponent is on the ground. The preceding and following text describe Commander Beetle's defensive and counterattacking abilities, emphasizing his use of a reverse grip weapon as a shield and his breakdancing recovery move. The image visually complements the guide's explanation of the enemy's mechanics and strategies for overcoming him."
}