{
    "chunk_id": 400242722414,
    "source_file": "Laurel_Buds.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/52/Laurel_Buds.jpg",
    "alt_text": "Laurel Buds.jpg",
    "position_desc": 2,
    "img_above_text": "The Laurel Buds can be found past the Lang-Li-Guhh-Baw boss to the left of the Sandgate Village - Village Entrance Shrine in Yellow Wind Ridge. Head towards where you will fight the King of Flowing Sand and Second Rat Prince. Just before that boss arena, you will see a statue.\nBy this statue, you can pick up the Laurel Buds.",
    "img_below_text": "Soaks are far more plentiful than the Drinks for your Gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Laurel Buds can be found past the Lang-Li-Guhh-Baw boss to the left of the Sandgate Village - Village Entrance Shrine in Yellow Wind Ridge. Head towards where you will fight the King of Flowing Sand and Second Rat Prince. Just before that boss arena, you will see a statue.\nBy this statue, you can pick up the Laurel Buds.\"\n        - Following Text: \"Soaks are far more plentiful than the Drinks for your Gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character standing near a statue in *Black Myth: Wukong*. This location is significant as it is where players can find the Laurel Buds, an item mentioned in the preceding text. The statue and surrounding area serve as a visual marker for the item’s location, situated before the arena of the King of Flowing Sand and Second Rat Prince bosses. The following text transitions to discussing other collectible items and upgrades in the game."
}