{
    "chunk_id": 356087716983,
    "source_file": "Cloudtreading_Deer.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1f/Foothills_Walkthrough_%2852%29.png",
    "alt_text": "Foothills Walkthrough \\(52\\).png",
    "position_desc": 2,
    "img_above_text": "Activate the Deer Sight Forest Keeper's Shrine and go toward the lightning and red tree in the middle of the clearing. Underneath the tree sits the Cloudtreading Deer.\n## Cloudtreading Deer Boss Fight and Guide",
    "img_below_text": "The Cloudtreading Deer will try to put as much distance as possible between you, so you'll want to use spells like Immobilize to keep it in place or Cloudstep to catch up to it. There are two phases to this fight, and aggression is key in the first one, so you can get to the second phase in as little time as possible with spells left over.\n![Foothills Walkthrough \\(53\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8b/Foothills_Walkthrough_%2853%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Activate the Deer Sight Forest Keeper's Shrine and go toward the lightning and red tree in the middle of the clearing. Underneath the tree sits the Cloudtreading Deer.\n## Cloudtreading Deer Boss Fight and Guide\"\n        - Following Text: \"The Cloudtreading Deer will try to put as much distance as possible between you, so you'll want to use spells like Immobilize to keep it in place or Cloudstep to catch up to it. There are two phases to this fight, and aggression is key in the first one, so you can get to the second phase in as little time as possible with spells left over.\n![Foothills Walkthrough \\(53\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8b/Foothills_Walkthrough_%2853%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the Cloudtreading Deer, a boss encountered in the game *Black Myth: Wukong*. It is shown sitting beneath a vibrant red tree in a dark, atmospheric forest clearing. This setting aligns with the preceding text, which describes the location of the boss, and the following text, which outlines strategies for the upcoming fight. The image serves to visually introduce the boss and its environment before the guide details the mechanics of the battle."
}