{
    "chunk_id": 974090024239,
    "source_file": "Yellow_Sand_Formation_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/64/Wukong_Yellow_32.jpg",
    "alt_text": "Wukong Yellow 32.jpg",
    "position_desc": 33,
    "img_above_text": "After taking them out, look for an opening in the cave wall where a large column is, and at its base will be a small chest near a Blazebone firing projectiles at you. Loot the chest after defeating it to gain a new Curio - the **Glazed Reliquary**.\nJust past the box, you can find stairs down to a path leading out the cave, putting you on a ledge right above where you fought the Stone Vanguard in the Fright Cliff!",
    "img_below_text": "This is actually a very opportune time to challenge the hidden Shiandang Yaoguai King boss in this same arena by putting the six Buddha Eyeballs in the large rock nearby — if you haven’t challenged him already.\n![Wukong Yellow 33.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/55/Wukong_Yellow_33.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"After taking them out, look for an opening in the cave wall where a large column is, and at its base will be a small chest near a Blazebone firing projectiles at you. Loot the chest after defeating it to gain a new Curio - the **Glazed Reliquary**.\nJust past the box, you can find stairs down to a path leading out the cave, putting you on a ledge right above where you fought the Stone Vanguard in the Fright Cliff!\"\n        - Following Text: \"This is actually a very opportune time to challenge the hidden Shiandang Yaoguai King boss in this same arena by putting the six Buddha Eyeballs in the large rock nearby — if you haven’t challenged him already.\n![Wukong Yellow 33.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/55/Wukong_Yellow_33.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image shows a player character standing on a ledge overlooking a rocky, barren area with sparse vegetation. A red arrow points to a specific rock formation below, which is likely the location of the large rock mentioned in the text. This rock is used to summon the hidden Shiandang Yaoguai King boss by placing six Buddha Eyeballs. The setting is part of the Fright Cliff area, as described in the walkthrough."
}