{
    "chunk_id": 217003441900,
    "source_file": "Meditation_Spots.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c9/Cave_Depths_Lower_Hollow_Meditation_Spots.jpg",
    "alt_text": "Cave Depths Lower Hollow Meditation Spots.jpg",
    "position_desc": 17,
    "img_above_text": "### Cave Depths, Lower Hollow Meditation Spot\nCave Depths, Lower Hollow Meditation Spot",
    "img_below_text": "Turn right and head into a crack in the wall just before you enter the Hut of Immortality grounds. Follow the path until you find a cavern filled with hanging webs. On the left wall is another crack. Head through there to find the next Meditation Spot.\n### The Height, Forest of Ferocity Meditation Spot",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"### Cave Depths, Lower Hollow Meditation Spot\nCave Depths, Lower Hollow Meditation Spot\"\n        - Following Text: \"Turn right and head into a crack in the wall just before you enter the Hut of Immortality grounds. Follow the path until you find a cavern filled with hanging webs. On the left wall is another crack. Head through there to find the next Meditation Spot.\n### The Height, Forest of Ferocity Meditation Spot\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from a video game where a character is positioned at a Meditation Spot within a cave environment. The setting is dark and atmospheric, with stone structures and a tree visible. The character is prompted to meditate, likely to restore health or gain abilities. This Meditation Spot is part of the Cave Depths, Lower Hollow area, and the narrative suggests that players should explore further to find additional Meditation Spots, such as the one in the Forest of Ferocity."
}