{
    "chunk_id": 430903840618,
    "source_file": "Woods_of_Ember_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b2/Woods_Ember_Walkthrough_%28106%29.png",
    "alt_text": "Woods Ember Walkthrough \\(106\\).png",
    "position_desc": 60,
    "img_above_text": "Enter a large open area to find the fox guai suspended from a tree, and her two captors on the way. After she explains that she's been captured, two giant heads will descend upon the arena.\n### Yoaguai Chief - Quick as Fire, Fast as Wind",
    "img_below_text": "Quick as Fire, Fast as Wind are a duo of heads that will use two elements to attack, both causing fire damage. As you may have guessed through this Chapter so far, the Fireproof Mantle is one of the best bits of equipment you can bring along with you. Quick as Fire is the head on the ground that will roll toward you, leaving trails of fire in its wake, while Fast as Wind is the floating head with the tusks.\n![Woods Ember Walkthrough \\(108\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fd/Woods_Ember_Walkthrough_%28108%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Enter a large open area to find the fox guai suspended from a tree, and her two captors on the way. After she explains that she's been captured, two giant heads will descend upon the arena.\n### Yoaguai Chief - Quick as Fire, Fast as Wind\"\n        - Following Text: \"Quick as Fire, Fast as Wind are a duo of heads that will use two elements to attack, both causing fire damage. As you may have guessed through this Chapter so far, the Fireproof Mantle is one of the best bits of equipment you can bring along with you. Quick as Fire is the head on the ground that will roll toward you, leaving trails of fire in its wake, while Fast as Wind is the floating head with the tusks.\n![Woods Ember Walkthrough \\(108\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fd/Woods_Ember_Walkthrough_%28108%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dramatic boss battle arena from *Black Myth: Wukong*, featuring the two giant heads, \"Quick as Fire\" (grounded head) and \"Fast as Wind\" (floating head with tusks), as described in the walkthrough. The player character stands ready to face them in a dark, rocky environment with fire effects scattered across the scene. The setting aligns with the narrative of encountering these elemental foes after freeing the fox guai."
}