{
    "chunk_id": 354620613060,
    "source_file": "Non-Able.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3e/Wukong_Brook_18.jpg",
    "alt_text": "Wukong Brook 18.jpg",
    "position_desc": 5,
    "img_above_text": "He can also easily chain this into a high leap as he somersaults into a slam onto the ground requiring another fast dodge.\nAny of these attacks can be chained together with rolling kicks that come in a few different ways when he's low to the ground, so you'll need to be very aware of his movements and when the best time is to press the attack, and when to back off and conserve stamina.",
    "img_below_text": "With many of his attacks having severely short range, the Thrust Stance can be incredibly useful to retreat into a heavy attack once you have a focus point. The Pillar Stance can also be useful to gain height over many of his low kicks, but you'll need to make sure you have a lot of spare stamina to soak up his hits.\n![Wukong Brook 20.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8d/Wukong_Brook_20.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"He can also easily chain this into a high leap as he somersaults into a slam onto the ground requiring another fast dodge.\nAny of these attacks can be chained together with rolling kicks that come in a few different ways when he's low to the ground, so you'll need to be very aware of his movements and when the best time is to press the attack, and when to back off and conserve stamina.\"\n        - Following Text: \"With many of his attacks having severely short range, the Thrust Stance can be incredibly useful to retreat into a heavy attack once you have a focus point. The Pillar Stance can also be useful to gain height over many of his low kicks, but you'll need to make sure you have a lot of spare stamina to soak up his hits.\n![Wukong Brook 20.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8d/Wukong_Brook_20.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an intense combat scene from *Black Myth: Wukong*, set in a snowy environment. The player character, resembling the Monkey King, is engaged in battle with a large humanoid enemy. The enemy is delivering a powerful attack, indicated by the red energy effect, while the player appears to be struck or staggered, as suggested by the \"Non-Able\" status bar. The preceding and following text provides strategies for dealing with the enemy's chained attacks, emphasizing timing, stamina management, and the use of specific stances like Thrust and Pillar to counter the foe's short-range and low-kicking moves."
}