{
    "chunk_id": 831740830620,
    "source_file": "Secrets_in_Black_Myth_Wukong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c4/Secrets_Black_Myth_Wukong_%282%29.png",
    "alt_text": "Secrets Black Myth Wukong \\(2\\).png",
    "position_desc": 19,
    "img_above_text": "We've listed the secret bosses in Purple Cloud Mountain in a particular order because players have reported that this is a missable encounter. For that reason, we'd recommend tackling the Scorpionlord first when you're in Purple Cloud Mountain.\n## Daoist Mi and the Snake Lady - Purple Cloud Mountain",
    "img_below_text": "As you begin to follow the path in Purple Cloud Mountain, you'll encounter a weeping snake curled around a tree. To help her out, you need to find the Daoist Mi, who waits near the Petalfall Hamlet. He'll ask you to find Violet Hail for him, which you can obtain from the yellow-robed enemies in the area. Once you have it, Daoist Mi will become a boss with two phases.\n### Don't Miss This Boss!",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"We've listed the secret bosses in Purple Cloud Mountain in a particular order because players have reported that this is a missable encounter. For that reason, we'd recommend tackling the Scorpionlord first when you're in Purple Cloud Mountain.\n## Daoist Mi and the Snake Lady - Purple Cloud Mountain\"\n        - Following Text: \"As you begin to follow the path in Purple Cloud Mountain, you'll encounter a weeping snake curled around a tree. To help her out, you need to find the Daoist Mi, who waits near the Petalfall Hamlet. He'll ask you to find Violet Hail for him, which you can obtain from the yellow-robed enemies in the area. Once you have it, Daoist Mi will become a boss with two phases.\n### Don't Miss This Boss!\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a serene outdoor setting in Purple Cloud Mountain, featuring a traditional building and a character standing near a stone basin. This scene likely represents the location where players can find Daoist Mi, an NPC involved in a quest. According to the walkthrough, Daoist Mi tasks players with retrieving Violet Hail, leading to a boss encounter with two phases. The image serves to visually guide players to this key quest location."
}