{
    "chunk_id": 987179408059,
    "source_file": "Foothills_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0b/Foothills_Walkthrough_%2826%29.png",
    "alt_text": "Foothills Walkthrough \\(26\\).png",
    "position_desc": 34,
    "img_above_text": "When the second Poison Chief is down, return to the Rhino Watch Slope and then head into the area with the flames on the ground. A cutscene will play out as you get there, and the Gold Armored Rhino will appear.\n### Yaoguai Chief - Gold Armored Rhino",
    "img_below_text": "The key to making this fight as easy as possible is to break the Rhino's horn. You want to do this as quickly as possible, so we'd recommend going in with the Wandering Wight Spirit equipped. Speed is essential here, as you'll need to hit the Rhino head-on to break the horn.\n![Foothills Walkthrough \\(27\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b2/Foothills_Walkthrough_%2827%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"When the second Poison Chief is down, return to the Rhino Watch Slope and then head into the area with the flames on the ground. A cutscene will play out as you get there, and the Gold Armored Rhino will appear.\n### Yaoguai Chief - Gold Armored Rhino\"\n        - Following Text: \"The key to making this fight as easy as possible is to break the Rhino's horn. You want to do this as quickly as possible, so we'd recommend going in with the Wandering Wight Spirit equipped. Speed is essential here, as you'll need to hit the Rhino head-on to break the horn.\n![Foothills Walkthrough \\(27\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b2/Foothills_Walkthrough_%2827%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dramatic encounter with the Gold Armored Rhino, a Yaoguai Chief in *Black Myth: Wukong*. The scene is set in a fiery battlefield surrounded by flames and a stormy sky, emphasizing the intensity of the upcoming fight. The player character is positioned facing the massive rhino, which has a glowing horn, highlighting the objective of breaking the horn to weaken the enemy. This image serves to illustrate the setting and key moment of the battle described in the walkthrough."
}