{
    "chunk_id": 558122986981,
    "source_file": "The_Great_Sage%27s_Broken_Shell.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bf/Water_Curtain_Cave_Walkthrough_%2853%29.png",
    "alt_text": "Water Curtain Cave Walkthrough \\(53\\).png",
    "position_desc": 3,
    "img_above_text": "You'll see the Great Sage's Broken Shell's version of a heavy attack, as the staff glows gold and he jumps up with his staff to smash it down on you. These moves can also be evaded, to help build up your own focus for a counterattack. Again, you'll want to take advantage of Wukong's arm and staff in this fight, by using the fourth focus point for heavy attacks, and making use of the increased Critical Hit Chance.\nWhen the Great Sage uses his variation of Pluck of Many, you'll see a duplicate appear as close as possible to you and will swing its staff. This will disappear after attacking, so you won't have to face multiple duplicates all at once.",
    "img_below_text": "As mentioned, the Great Sage will use multiple stances, and you'll occasionally see him climb his staff to perform Pillar Stance. This is not to evade your attacks but is just a way to slam down on you from above. As you see the staff start to bend toward you, get ready to dash away.\nFinally, be mindful of where you stand in this fight. If you're too far from him, he'll throw out his staff as a spinning projectile, or swap to Thrust Stance to attack you. It's best to stick close to him but jump back when he performs perfect dodges or throws out Pluck of Many.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"You'll see the Great Sage's Broken Shell's version of a heavy attack, as the staff glows gold and he jumps up with his staff to smash it down on you. These moves can also be evaded, to help build up your own focus for a counterattack. Again, you'll want to take advantage of Wukong's arm and staff in this fight, by using the fourth focus point for heavy attacks, and making use of the increased Critical Hit Chance.\nWhen the Great Sage uses his variation of Pluck of Many, you'll see a duplicate appear as close as possible to you and will swing its staff. This will disappear after attacking, so you won't have to face multiple duplicates all at once.\"\n        - Following Text: \"As mentioned, the Great Sage will use multiple stances, and you'll occasionally see him climb his staff to perform Pillar Stance. This is not to evade your attacks but is just a way to slam down on you from above. As you see the staff start to bend toward you, get ready to dash away.\nFinally, be mindful of where you stand in this fight. If you're too far from him, he'll throw out his staff as a spinning projectile, or swap to Thrust Stance to attack you. It's best to stick close to him but jump back when he performs perfect dodges or throws out Pluck of Many.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the Great Sage performing the Pillar Stance, a move where he climbs his staff to prepare for a powerful slam attack from above. This stance is part of his diverse combat techniques, requiring the player to anticipate the staff bending and dash away to avoid damage. The fiery particles in the background emphasize the intensity of the battle."
}