{
    "chunk_id": 168626390321,
    "source_file": "Webbed_Hollow_-_Lower_Hollow_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/86/Wukong_LowerHollow_62.jpg",
    "alt_text": "Wukong LowerHollow 62.jpg",
    "position_desc": 55,
    "img_above_text": "Spot dodging can also work here, and if you try to perform a Rock Solid Deflect, you'll be knocked backward, but he'll often stumble to the ground as well, letting you get up and get some hits in before he regains his footing.\nBoar Bajie has a lot of wide swinging attacks to be wary of, often shifting his body weight to slam his head to the side or swing it upwards.",
    "img_below_text": "He can also dive at you in a diving tackle that can be very damaging if it lands, and you'll need to dodge as he lands, but be ready for him to rise up and turn to hit you with his hind legs in a mule kick attack.\nAfter taking a bit of damage, Boar Bajie will eventually let out a huge roar, starting a very long and terrifying phase. He'll begin to transform into different beasts, which have their own attacks you'll need to adapt to.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Spot dodging can also work here, and if you try to perform a Rock Solid Deflect, you'll be knocked backward, but he'll often stumble to the ground as well, letting you get up and get some hits in before he regains his footing.\nBoar Bajie has a lot of wide swinging attacks to be wary of, often shifting his body weight to slam his head to the side or swing it upwards.\"\n        - Following Text: \"He can also dive at you in a diving tackle that can be very damaging if it lands, and you'll need to dodge as he lands, but be ready for him to rise up and turn to hit you with his hind legs in a mule kick attack.\nAfter taking a bit of damage, Boar Bajie will eventually let out a huge roar, starting a very long and terrifying phase. He'll begin to transform into different beasts, which have their own attacks you'll need to adapt to.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from a video game featuring a boss fight against Zhu Bajie, a formidable creature with glowing red eyes, set in a dark, eerie environment. The preceding text describes strategies to counter Zhu Bajie's wide swinging attacks and the following text warns of his damaging diving tackle and transformation into different beasts. The image likely illustrates the intense and challenging nature of this battle, emphasizing the need for strategic dodging and adaptation to his varied attack patterns."
}