{
    "chunk_id": 554786658177,
    "source_file": "Man-in-Stone_Questline.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/97/Wukong_Fright_1.jpg",
    "alt_text": "Wukong Fright 1.jpg",
    "position_desc": 1,
    "img_above_text": "The Man-in-Stone is a character, boss, and later merchant you can meet in Chapter 2 of Black Myth Wukong. This character will ask you to retrieve an item from a nearby cave, and if defeated in a fight, will grant you a Transformation Spell, and then begin to sell you items later on.\n## Where to Find the Man-in-Stone",
    "img_below_text": "You can first encounter the Man-in-Stone in the Fright Cliff area of Chapter 2’s Yellow Wind Ridge. You can reach it by traveling through Sandgate Village and defeating the King of Flowing Sands and Second Rat Prince, and then taking the path across a rope bridge to the right from the large sealed stone door.\n![Wukong Fright 19.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f3/Wukong_Fright_19.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Man-in-Stone is a character, boss, and later merchant you can meet in Chapter 2 of Black Myth Wukong. This character will ask you to retrieve an item from a nearby cave, and if defeated in a fight, will grant you a Transformation Spell, and then begin to sell you items later on.\n## Where to Find the Man-in-Stone\"\n        - Following Text: \"You can first encounter the Man-in-Stone in the Fright Cliff area of Chapter 2’s Yellow Wind Ridge. You can reach it by traveling through Sandgate Village and defeating the King of Flowing Sands and Second Rat Prince, and then taking the path across a rope bridge to the right from the large sealed stone door.\n![Wukong Fright 19.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f3/Wukong_Fright_19.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a gameplay scene from *Black Myth: Wukong*, showing the player character running toward a large, ornate stone gate in a rocky, desolate environment. This area is part of the Fright Cliff region in Chapter 2, where players can encounter the Man-in-Stone after progressing through Sandgate Village and defeating key enemies. The gate and surrounding terrain suggest the path leading to the Man-in-Stone's location."
}