{
    "chunk_id": 637390724187,
    "source_file": "Chapter_2_Secret_-_Kingdom_of_Sahali_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a5/Wukong_Sahali_26.jpg",
    "alt_text": "Wukong Sahali 26.jpg",
    "position_desc": 27,
    "img_above_text": "Next, search the far right side of this sandy area above the slope, until you come to the farthest edge by the rocks. Here you’ll find another wooden chest, and inside you can grab a **Mind Core** , 4 **Yaoguai Core** , and 523 **Will**.\nNow head up the middle cliff to find none other than the Yellow Wind Sage — only its a version of him from the past. Since your goal isn’t to fight this incarnation, you’ll actually be able to offer your help in defeating another Yaoguai King - a legendary and dangerous scarab who haunts the sands below.",
    "img_below_text": "The yellow-furred rat is at an impasse, as the scarab’s magic is preventing him from engaging the monster directly. This is where you come on. The Yellow Rat Sage will agree to pound the drums to force the scarab to the surface, allowing you to engage the behemoth directly and find whatever vessel is giving it its power.\n## Yaoguai King Boss Fight - Fuban",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Next, search the far right side of this sandy area above the slope, until you come to the farthest edge by the rocks. Here you’ll find another wooden chest, and inside you can grab a **Mind Core** , 4 **Yaoguai Core** , and 523 **Will**.\nNow head up the middle cliff to find none other than the Yellow Wind Sage — only its a version of him from the past. Since your goal isn’t to fight this incarnation, you’ll actually be able to offer your help in defeating another Yaoguai King - a legendary and dangerous scarab who haunts the sands below.\"\n        - Following Text: \"The yellow-furred rat is at an impasse, as the scarab’s magic is preventing him from engaging the monster directly. This is where you come on. The Yellow Rat Sage will agree to pound the drums to force the scarab to the surface, allowing you to engage the behemoth directly and find whatever vessel is giving it its power.\n## Yaoguai King Boss Fight - Fuban\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the Yellow Wind Sage, a yellow-furred rat-like character holding a staff, set against a rocky, sandy background. This scene aligns with the narrative where the Sage seeks the player's assistance to defeat the Yaoguai King, a powerful scarab monster. The Sage explains his inability to directly engage the scarab due to its magic and asks the player to seize the vessel empowering the creature at the right moment during the upcoming boss fight."
}