{
    "chunk_id": 991575952780,
    "source_file": "The_Stone_Monkey.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/01/Water_Curtain_Cave_Walkthrough_%2818%29.png",
    "alt_text": "Water Curtain Cave Walkthrough \\(18\\).png",
    "position_desc": 17,
    "img_above_text": "The first thing to note is that the Stone Monkey, like other Stone enemies, is resistant to elemental attacks, so the best thing you can do here is have a build that focuses on high attack strength and increasing the chances of critical attacks. His resistance to these attacks should also influence the Transformation you take into the fight with you – we'd recommend Ebon Flow or Azure Dust, which can both deliver heavy blows.\n### The Stone Monkey Phase One",
    "img_below_text": "During the first phase of the fight, the Stone Monkey will generally try to attack with a combo of punches. These can be avoided but it's best to use dodges to build up your focus quickly. Speed is key for this first phase, to keep as many of your medicines and Gourd uses available for the second phase.\nHe will also leap up and pound his fists down onto the ground, causing a shockwave of rocks immediately around him. As long as you dive out of the way when he goes to land or step back from him slightly, you can avoid this attack.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The first thing to note is that the Stone Monkey, like other Stone enemies, is resistant to elemental attacks, so the best thing you can do here is have a build that focuses on high attack strength and increasing the chances of critical attacks. His resistance to these attacks should also influence the Transformation you take into the fight with you – we'd recommend Ebon Flow or Azure Dust, which can both deliver heavy blows.\n### The Stone Monkey Phase One\"\n        - Following Text: \"During the first phase of the fight, the Stone Monkey will generally try to attack with a combo of punches. These can be avoided but it's best to use dodges to build up your focus quickly. Speed is key for this first phase, to keep as many of your medicines and Gourd uses available for the second phase.\nHe will also leap up and pound his fists down onto the ground, causing a shockwave of rocks immediately around him. As long as you dive out of the way when he goes to land or step back from him slightly, you can avoid this attack.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an in-game battle scene between a player character and the Stone Monkey enemy, set in a shallow water environment surrounded by rocky terrain. The Stone Monkey is mid-action, possibly preparing an attack, while the player character appears poised to respond. This visual aligns with the preceding and following text, which provides strategic advice for the fight, emphasizing the Stone Monkey's resistance to elemental attacks, the importance of critical hits, and dodging techniques during the first phase of the encounter."
}