{
    "chunk_id": 550749869888,
    "source_file": "Steel_Ginseng.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/dd/Aged_Ginseg_1.jpg",
    "alt_text": "Aged Ginseg 1.jpg",
    "position_desc": 1,
    "img_above_text": "## Black Myth: Wukong Steel Ginseng Location\nThe Steel Ginseng can be obtained randomly from any Aged Ginseng plant throughout the game.",
    "img_below_text": "Soaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Black Myth: Wukong Steel Ginseng Location\nThe Steel Ginseng can be obtained randomly from any Aged Ginseng plant throughout the game.\"\n        - Following Text: \"Soaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character in *Black Myth: Wukong* standing in a lush, forested area near an interactive object marked \"Gather.\" This likely represents a location where the player can collect resources, such as an Aged Ginseng plant, which may yield the Steel Ginseng mentioned in the preceding text. The surrounding environment suggests exploration and resource gathering as key gameplay elements."
}