{
    "chunk_id": 489338641086,
    "source_file": "Webbed_Hollow_-_Lower_Hollow_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/55/Wukong_LowerHollow_18.jpg",
    "alt_text": "Wukong LowerHollow 18.jpg",
    "position_desc": 18,
    "img_above_text": "![Wukong LowerHollow 17.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/11/Wukong_LowerHollow_17.jpg)\nHeading along this path, there will only be a lone Dragonfly Guai to stop you, and behind him is a ledge leading down a large sloping path to the bottom of the Hollow.",
    "img_below_text": "Once you reach the bottom, you'll find a passageway to a wooden ledge overlooking a home set around a large purple-flowering tree. You're just in time to see the Second Sister return with a very docile Zhu Bajie, completely under a spell thanks to the Sage's Relic. It seems he's all set to be married to the mother of spiders, which doesn't really sound good.\n![Wukong LowerHollow 19.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b1/Wukong_LowerHollow_19.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong LowerHollow 17.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/11/Wukong_LowerHollow_17.jpg)\nHeading along this path, there will only be a lone Dragonfly Guai to stop you, and behind him is a ledge leading down a large sloping path to the bottom of the Hollow.\"\n        - Following Text: \"Once you reach the bottom, you'll find a passageway to a wooden ledge overlooking a home set around a large purple-flowering tree. You're just in time to see the Second Sister return with a very docile Zhu Bajie, completely under a spell thanks to the Sage's Relic. It seems he's all set to be married to the mother of spiders, which doesn't really sound good.\n![Wukong LowerHollow 19.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b1/Wukong_LowerHollow_19.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a character standing on a ledge in front of a traditional Chinese-style building, surrounded by intricate architectural details and dim lighting. The scene appears to be part of the journey through the Lower Hollow area in *Black Myth: Wukong*, where the player is navigating towards a passageway leading to a significant narrative moment involving Zhu Bajie and the Second Sister. The setting emphasizes the atmospheric and mystical tone of the game."
}