{
    "chunk_id": 169361364482,
    "source_file": "Yellow_Wind_Sage.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/46/Wukong_Yellow_48.jpg",
    "alt_text": "Wukong Yellow 48.jpg",
    "position_desc": 2,
    "img_above_text": "The Sterness of Stone can be gained by defeating the Stone Vanguard in the Fright Cliff Region.\nThe Keeness of Tiger can be gained by defeating the Tiger Vanguard in the Crouching Tiger Temple Region.",
    "img_below_text": "With both pieces, you can open the door where you defeated the King of Flowing Sands, or open up the temple cellar in the Crouching Tiger Temple, or slide down past the Rock Crash Platform to the Windseal Gate.\n## Yellow Wind Sage Boss Fight and Guide",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Sterness of Stone can be gained by defeating the Stone Vanguard in the Fright Cliff Region.\nThe Keeness of Tiger can be gained by defeating the Tiger Vanguard in the Crouching Tiger Temple Region.\"\n        - Following Text: \"With both pieces, you can open the door where you defeated the King of Flowing Sands, or open up the temple cellar in the Crouching Tiger Temple, or slide down past the Rock Crash Platform to the Windseal Gate.\n## Yellow Wind Sage Boss Fight and Guide\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character standing in a rocky, desert-like environment, framed by large stone structures. This scene likely represents a key location tied to the narrative described in the preceding and following text, where the player may use the \"Sterness of Stone\" and \"Keeness of Tiger\" items to unlock specific areas, such as the temple cellar or Windseal Gate. The setting appears to be part of the Fright Cliff or Crouching Tiger Temple regions, leading up to the Yellow Wind Sage boss fight."
}