{
    "chunk_id": 461613466964,
    "source_file": "Baw-Li-Guhh-Lang.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/49/Wukong_Bamboo_12.jpg",
    "alt_text": "Wukong Bamboo 12.jpg",
    "position_desc": 1,
    "img_above_text": "## Where to Find Baw-Li-Guhh-Lang\nYou can encounter this miniboss while exploring the large area partway through the Bamboo Grove in Snake Trail. From the Shrine, you can either head up and over the bridge, or jump through a grove of bamboo left of the shrine to reach a stream.",
    "img_below_text": "Follow the stream upriver near the ramp and stick to the left to find a marshy area full of white reed flowers, and the boss will leap out of its lair to attack.\n### Yaoguai Chief Mini-Boss Fight - Baw-Li-Guhh-Lang",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Where to Find Baw-Li-Guhh-Lang\nYou can encounter this miniboss while exploring the large area partway through the Bamboo Grove in Snake Trail. From the Shrine, you can either head up and over the bridge, or jump through a grove of bamboo left of the shrine to reach a stream.\"\n        - Following Text: \"Follow the stream upriver near the ramp and stick to the left to find a marshy area full of white reed flowers, and the boss will leap out of its lair to attack.\n### Yaoguai Chief Mini-Boss Fight - Baw-Li-Guhh-Lang\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character navigating a stream in a lush, rocky environment, with a red arrow indicating the direction to proceed. This scene aligns with the walkthrough's instructions to follow the stream upriver near the ramp to locate the miniboss, Baw-Li-Guhh-Lang, in a marshy area filled with white reed flowers. The image serves as a visual guide to help players identify the correct path during exploration."
}