{
    "chunk_id": 363252748779,
    "source_file": "Yellow_Sand_Formation_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d3/Wukong_Yellow_59.jpg",
    "alt_text": "Wukong Yellow 59.jpg",
    "position_desc": 67,
    "img_above_text": "Note - if you have the Wind Tamer, you can use it now to fully negate the sandstorm and stop it from happening, which will also force him out of many of the attacks he uses in this phase. As an added bonus, using the Wind Tamer will also stun him for an extended period, so make use of it by hitting him with your biggest charged heavy strikes!\nIf you don’t have the Wind Tamer, he’ll vanish into the sandstorm, and instead send out giant sand copies of himself to strike at you in different directions. Since they are copies, you can’t really counter attack them, and they’ll fade away right after attacking:",
    "img_below_text": "* One version will run up to you with its free hand glowing and swing it upwards to trigger a line of sand spears to explode up from the ground. It will then launch into several sweeping attacks with its spear\n![Wukong Yellow 60.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fd/Wukong_Yellow_60.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Note - if you have the Wind Tamer, you can use it now to fully negate the sandstorm and stop it from happening, which will also force him out of many of the attacks he uses in this phase. As an added bonus, using the Wind Tamer will also stun him for an extended period, so make use of it by hitting him with your biggest charged heavy strikes!\nIf you don’t have the Wind Tamer, he’ll vanish into the sandstorm, and instead send out giant sand copies of himself to strike at you in different directions. Since they are copies, you can’t really counter attack them, and they’ll fade away right after attacking:\"\n        - Following Text: \"* One version will run up to you with its free hand glowing and swing it upwards to trigger a line of sand spears to explode up from the ground. It will then launch into several sweeping attacks with its spear\n![Wukong Yellow 60.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fd/Wukong_Yellow_60.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat sequence from *Black Myth: Wukong*, showcasing the player character battling the \"Yellow Wind Sage\" amidst a sandstorm. The boss appears to summon glowing sand-based attacks, including trident-like sand spears erupting from the ground. The preceding and following text explains that the Wind Tamer item can be used to negate the sandstorm and stun the boss, while without it, the boss creates sand copies to attack. The image visually highlights the chaotic nature of the battle and the boss's powerful abilities."
}