{
    "chunk_id": 952694316304,
    "source_file": "Violet_Spider.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e1/Wukong_LowerHollow_74.jpg",
    "alt_text": "Wukong LowerHollow 74.jpg",
    "position_desc": 3,
    "img_above_text": "![Wukong LowerHollow 79.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0d/Wukong_LowerHollow_79.jpg)\nShe'll often follow up her webbing with a poison attack, sending out a similar salvo of five poison projectiles that will seek you out rather quickly. The good news is you'll be able to use your staff spin to repel these heat-seeking gobs of poison, rather than having to dodge at the last moment.",
    "img_below_text": "The Violet Spider shares more than just the look of The Second Sister -- she also uses a few of the same moves with her talon-like appendages. This includes the feint of raising up her front leg to the side before performing alternating downward stabs, followed by a large leaping slam.\nThe bad news is even if you've gotten familiar with these attacks, she often follows them by spewing poison right onto the ground in front of her, which will limit your ability to retaliate. Be sure to dodge to the side first before starting your attack to get out of the way of most of her poison.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong LowerHollow 79.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0d/Wukong_LowerHollow_79.jpg)\nShe'll often follow up her webbing with a poison attack, sending out a similar salvo of five poison projectiles that will seek you out rather quickly. The good news is you'll be able to use your staff spin to repel these heat-seeking gobs of poison, rather than having to dodge at the last moment.\"\n        - Following Text: \"The Violet Spider shares more than just the look of The Second Sister -- she also uses a few of the same moves with her talon-like appendages. This includes the feint of raising up her front leg to the side before performing alternating downward stabs, followed by a large leaping slam.\nThe bad news is even if you've gotten familiar with these attacks, she often follows them by spewing poison right onto the ground in front of her, which will limit your ability to retaliate. Be sure to dodge to the side first before starting your attack to get out of the way of most of her poison.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a battle against the Violet Spider, a boss in *Black Myth: Wukong*. The environment is a web-covered cavern, emphasizing the spider's domain. The player character is engaged in combat, with the spider looming menacingly. The preceding and following text describe the spider's attacks, including poison projectiles, ground poison spewing, and talon-like strikes, offering strategies like dodging and using the staff spin to counter its moves. The image visually reinforces the guide's focus on the spider's challenging mechanics and the need for precise tactics."
}