{
    "chunk_id": 643155408700,
    "source_file": "Yellow_Sand_Formation_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7f/Wukong_Yellow_56.jpg",
    "alt_text": "Wukong Yellow 56.jpg",
    "position_desc": 64,
    "img_above_text": "![Wukong Yellow 57.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/59/Wukong_Yellow_57.jpg)\nEven carrying that bulky head, the Yellow Wind Sage will be quick to retaliate when you try to attack from other sides. Expect him to perform a retreating slash aimed behind him while jumping away if you try to flank him.",
    "img_below_text": "He can also do a very quick jab with the butt of his trident that comes after the end of the weapon glows for a moment, and he’ll soon follow it with a stomp that’ll be hard to dodge if staggered by the first attack. If you spot the other end of his spear glowing, you should have enough time to parry it with Rock Solid when he jabs, and interrupt his follow up attack!\n![Wukong Yellow 58.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/05/Wukong_Yellow_58.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Yellow 57.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/59/Wukong_Yellow_57.jpg)\nEven carrying that bulky head, the Yellow Wind Sage will be quick to retaliate when you try to attack from other sides. Expect him to perform a retreating slash aimed behind him while jumping away if you try to flank him.\"\n        - Following Text: \"He can also do a very quick jab with the butt of his trident that comes after the end of the weapon glows for a moment, and he’ll soon follow it with a stomp that’ll be hard to dodge if staggered by the first attack. If you spot the other end of his spear glowing, you should have enough time to parry it with Rock Solid when he jabs, and interrupt his follow up attack!\n![Wukong Yellow 58.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/05/Wukong_Yellow_58.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a gameplay moment from *Black Myth: Wukong*, showing the protagonist engaged in combat with the Yellow Wind Sage, a large enemy wielding a glowing trident. The scene highlights the Sage's dynamic attack patterns, including a retreating slash and glowing weapon strikes. The preceding and following text provides strategies for countering the Sage's moves, emphasizing the importance of timing and parrying with the Rock Solid ability."
}