{
    "chunk_id": 590278248202,
    "source_file": "How_to_Increase_Gourd_Uses_and_Healing_Amount.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/50/8_ForestofWolves_7.mp4.00_04_31_28.Still005.jpg",
    "alt_text": "8 ForestofWolves 7.mp4.00 04 31 28.Still005.jpg",
    "position_desc": 1,
    "img_above_text": "* How to Brew\n## How to Gain Guidance to Absorb Spirits",
    "img_below_text": "Early on, you may try and best certain powerful optional bosses to see glowing spirits they leave behind. Trying to interact with them will prompt the notification \"Cannot absorb Spirits without guidance.\"\n![20240815101010 1.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c9/20240815101010_1.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"* How to Brew\n## How to Gain Guidance to Absorb Spirits\"\n        - Following Text: \"Early on, you may try and best certain powerful optional bosses to see glowing spirits they leave behind. Trying to interact with them will prompt the notification \"Cannot absorb Spirits without guidance.\"\n![20240815101010 1.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c9/20240815101010_1.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "1. The image depicts a scene from a video game where the player character is standing in a forested area near a glowing blue spirit. The interface displays \"Cat's Eye Beads\" as a collectible item under \"Curios,\" along with resource counters for \"Will\" and \"Stone Spirit.\" The \"Sparks\" counter at the top suggests progress or energy accumulation.\n\n2. The image aligns with the context of gaining guidance to absorb spirits, likely showcasing the moment after defeating an optional boss and encountering the glowing spirit they leave behind. It emphasizes the need for specific guidance to interact with and absorb such spirits."
}