{
    "chunk_id": 835561185438,
    "source_file": "Gold_Sun_Crow.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/cd/Wukong_PurpleCloud_5.jpg",
    "alt_text": "Wukong PurpleCloud 5.jpg",
    "position_desc": 1,
    "img_above_text": "## Black Myth: Wukong Gold Sun Crow Location\nThe Gold Sun Crow can be found in the secret Purple Cloud Mountain area of The Webbed Hollow. It is in a chest up a log which you can climb up to reach a rock high above the area.",
    "img_below_text": "A full guide on how to access Purple Cloud Mountain can be found in the video below:\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Black Myth: Wukong Gold Sun Crow Location\nThe Gold Sun Crow can be found in the secret Purple Cloud Mountain area of The Webbed Hollow. It is in a chest up a log which you can climb up to reach a rock high above the area.\"\n        - Following Text: \"A full guide on how to access Purple Cloud Mountain can be found in the video below:\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image showcases a gameplay scene from *Black Myth: Wukong*, highlighting the player's journey through a vibrant autumn forest area. The red arrow in the image points toward a path leading to a climbable log, which is part of the guide's instructions for reaching the secret Purple Cloud Mountain area in The Webbed Hollow. This location contains a chest with the Gold Sun Crow item. The image serves as a visual aid to help players navigate this specific section of the game."
}