{
    "chunk_id": 62840255673,
    "source_file": "Best_Spirits_to_Use.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fd/Best_Spirits_%284%29.png",
    "alt_text": "Best Spirits \\(4\\).png",
    "position_desc": 7,
    "img_above_text": "The Falcon Hermit Spirit uses Frosty Wind, which is another way you can freeze enemies in place. Frosty Wind appears like a tornado, moving around and battering enemies that stand in its way. It's great for crowd control and offers the chance to freeze enemies in place, so you can follow up quickly with your own attacks.\n### Clay Vajra",
    "img_below_text": "If you've got to Chapter 3 and encountered a Clay Vajra, you'll know they're a walking fire machine, and who wouldn't want to use that as an attack? Flames of Doom will see the Clay Vajra shoot fire from its knees in a wide arc, meaning you can deal with groups or cover a large area when attacking. The buff you'll receive for having this Spirit equipped is burn resistance, so it's also great to use against enemies that deliver fire attacks themselves.\n### Flint Vanguard",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Falcon Hermit Spirit uses Frosty Wind, which is another way you can freeze enemies in place. Frosty Wind appears like a tornado, moving around and battering enemies that stand in its way. It's great for crowd control and offers the chance to freeze enemies in place, so you can follow up quickly with your own attacks.\n### Clay Vajra\"\n        - Following Text: \"If you've got to Chapter 3 and encountered a Clay Vajra, you'll know they're a walking fire machine, and who wouldn't want to use that as an attack? Flames of Doom will see the Clay Vajra shoot fire from its knees in a wide arc, meaning you can deal with groups or cover a large area when attacking. The buff you'll receive for having this Spirit equipped is burn resistance, so it's also great to use against enemies that deliver fire attacks themselves.\n### Flint Vanguard\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image showcases the in-game menu screen for the \"Equipment\" section, highlighting a detailed character model of the Clay Vajra Spirit. This Spirit, described in the accompanying text, is a fire-based entity with unique abilities such as \"Flames of Doom,\" which unleashes wide-area fire attacks. The menu interface suggests the player is customizing or examining their equipped Spirit, with options for further adjustments visible at the top."
}