{
    "chunk_id": 572230177710,
    "source_file": "Valley_of_Ecstasy_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a3/Wukong_Longevity_14.jpg",
    "alt_text": "Wukong Longevity 14.jpg",
    "position_desc": 110,
    "img_above_text": "Make use of your spells to keep the foe off-balance and to get away from their explosive attacks, and once they've been defeated, jump and perform a heavy attack to smash the glowing pot on the small wooden platform to gain an Awaken Wine Worm!\nLongevity Road Awaken Wine Worm",
    "img_below_text": "If you want something to pair with that worm, keep moving along the lower path as it goes up some stairs, and you'll eventually reach the end of this loop, where a small tree stands at the end of a large field with a Luojia Fragrant Vine. However, you'll need to defeat not one but two Falcon Fan-Makers to claim it!\n![Wukong Longevity 15.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a2/Wukong_Longevity_15.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Make use of your spells to keep the foe off-balance and to get away from their explosive attacks, and once they've been defeated, jump and perform a heavy attack to smash the glowing pot on the small wooden platform to gain an Awaken Wine Worm!\nLongevity Road Awaken Wine Worm\"\n        - Following Text: \"If you want something to pair with that worm, keep moving along the lower path as it goes up some stairs, and you'll eventually reach the end of this loop, where a small tree stands at the end of a large field with a Luojia Fragrant Vine. However, you'll need to defeat not one but two Falcon Fan-Makers to claim it!\n![Wukong Longevity 15.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a2/Wukong_Longevity_15.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a snowy battlefield in *Black Myth: Wukong*, where the player character is engaging two Falcon Fan-Maker enemies. The red arrow highlights a small tree in the background, which is tied to the narrative goal of obtaining the Luojia Fragrant Vine. Defeating these foes is required to claim the item and progress along the lower path described in the guide."
}