{
    "chunk_id": 37551795767,
    "source_file": "Webbed_Hollow_-_Lower_Hollow_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ee/Wukong_LowerHollow_73.jpg",
    "alt_text": "Wukong LowerHollow 73.jpg",
    "position_desc": 69,
    "img_above_text": "## Yaoguai Queen Boss Fight - Violet Spider\nMuch like The Second Sister, this boss will take the form of a gigantic and fearsome spider, and uses attacks in a few similar ways. She can lash out with her appendages, which will subtly shift into long blades but also give you a clue as to where her main attacks will come from. As you might expect, you'll also have to deal with dodging both poison and webbing, making mobility key to your survival.",
    "img_below_text": "The Violet Spider will often begin the fight with a signature webbing attack, shooting out several strands in a large frontal arc that you'll need to dodge or you'll waste time getting stuck and having to free yourself while being unable to do much else. Even if you do dodge the initial blast, there will be a web coating on the ground where the attack land that will slow you considerably, and you'll want to move the fight away from such spots as much as possible.\n![Wukong LowerHollow 79.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0d/Wukong_LowerHollow_79.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Yaoguai Queen Boss Fight - Violet Spider\nMuch like The Second Sister, this boss will take the form of a gigantic and fearsome spider, and uses attacks in a few similar ways. She can lash out with her appendages, which will subtly shift into long blades but also give you a clue as to where her main attacks will come from. As you might expect, you'll also have to deal with dodging both poison and webbing, making mobility key to your survival.\"\n        - Following Text: \"The Violet Spider will often begin the fight with a signature webbing attack, shooting out several strands in a large frontal arc that you'll need to dodge or you'll waste time getting stuck and having to free yourself while being unable to do much else. Even if you do dodge the initial blast, there will be a web coating on the ground where the attack land that will slow you considerably, and you'll want to move the fight away from such spots as much as possible.\n![Wukong LowerHollow 79.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0d/Wukong_LowerHollow_79.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the player character engaged in combat with the Violet Spider, a boss in *Black Myth: Wukong*. The scene showcases the spider's webbing attack, which creates a dense web-like effect across the battlefield, potentially immobilizing or slowing the player. The text at the bottom warns the player to avoid the web strands to maintain mobility during the fight. This visual complements the guide's explanation of the spider's mechanics, emphasizing the importance of dodging and positioning to overcome the boss."
}