{
    "chunk_id": 927438371267,
    "source_file": "Chapter_4_Secret_-_Purple_Cloud_Mountain_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/42/Wukong_PurpleCloud_55.jpg",
    "alt_text": "Wukong PurpleCloud 55.jpg",
    "position_desc": 60,
    "img_above_text": "They can also extend white protrusions from their wings at range, and send a row of projectiles toward you. Luckily, these are easy to both dodge through or simply deflect with a quick staff spin, and since the boss performs it at range, you don't need to be wary of quick follow-up attack.\nWhen you close the distance, The Duskveil has a few different stomps and arm sweeps it can perform, but the variations aren't too much to worry about:",
    "img_below_text": "If it raises its right hoof, be prepared for a quick slam, after which it can either flap away quickly to retreat from any counters you might have in mind, or it will rear back its head and -- after a short delay -- slam it into the ground. The latter will give you more time to retaliate, and both of these moves can be deflected.\n![Wukong PurpleCloud 58.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/15/Wukong_PurpleCloud_58.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"They can also extend white protrusions from their wings at range, and send a row of projectiles toward you. Luckily, these are easy to both dodge through or simply deflect with a quick staff spin, and since the boss performs it at range, you don't need to be wary of quick follow-up attack.\nWhen you close the distance, The Duskveil has a few different stomps and arm sweeps it can perform, but the variations aren't too much to worry about:\"\n        - Following Text: \"If it raises its right hoof, be prepared for a quick slam, after which it can either flap away quickly to retreat from any counters you might have in mind, or it will rear back its head and -- after a short delay -- slam it into the ground. The latter will give you more time to retaliate, and both of these moves can be deflected.\n![Wukong PurpleCloud 58.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/15/Wukong_PurpleCloud_58.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight against \"The Duskveil\" in *Black Myth: Wukong*. The player character is seen dodging a powerful attack from the boss, which appears to be mid-action, slamming the ground with its right hoof. The surrounding environment features a natural, rocky landscape with twisted trees and structures. The health bar for \"The Duskveil\" is visible, along with player HUD elements showing abilities and resources. This scene aligns with the preceding and following text, describing the boss's attack patterns and strategies for countering them."
}