{
    "chunk_id": 819770783581,
    "source_file": "Black_Bear_Guai.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c6/Wukong_BlackWind_33.jpg",
    "alt_text": "Wukong BlackWind 33.jpg",
    "position_desc": 2,
    "img_above_text": "To make matters worse, Black Bear Guai can and will utilize his black wind magic to teleport around the arena, and pop out of thin air in the middle of a two-hit charge attack you’ll need to evade with little warning.\nEven without the wind form, it can be hard to tell which moves the black bear is using when you’re right underneath him, so be sure not to get too far into your attacks that you can’t tell when he’s preparing a new attack.",
    "img_below_text": "There’s more than a few attack combos he can launch at close range, including two-hit swipes, which are sometimes followed by a raised foot slam afterward. Later in the fight, he can extend this combo with more slashes before finally slamming his foot down.\nHe can also simply belly flop down, requiring you to dodge to the side rather than backwards.This move can come from the front, as well as from the sides if he collapses on his side, meaning even if you aren’t attacking from the front you won’t automatically be safe.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"To make matters worse, Black Bear Guai can and will utilize his black wind magic to teleport around the arena, and pop out of thin air in the middle of a two-hit charge attack you’ll need to evade with little warning.\nEven without the wind form, it can be hard to tell which moves the black bear is using when you’re right underneath him, so be sure not to get too far into your attacks that you can’t tell when he’s preparing a new attack.\"\n        - Following Text: \"There’s more than a few attack combos he can launch at close range, including two-hit swipes, which are sometimes followed by a raised foot slam afterward. Later in the fight, he can extend this combo with more slashes before finally slamming his foot down.\nHe can also simply belly flop down, requiring you to dodge to the side rather than backwards.This move can come from the front, as well as from the sides if he collapses on his side, meaning even if you aren’t attacking from the front you won’t automatically be safe.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat encounter with the \"Black Bear Guai,\" a formidable boss in a video game. The bear is mid-attack, showcasing its aggressive nature and large, imposing figure. The preceding and following text highlights the bear's unpredictable attack patterns, including teleportation, multi-hit combos, and area attacks like belly flops, requiring precise evasion. The player’s health bar and abilities are visible, emphasizing the need for strategy and awareness during this challenging fight."
}