{
    "chunk_id": 81296025772,
    "source_file": "Crouching_Tiger_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/64/Wukong_Tiger_12.jpg",
    "alt_text": "Wukong Tiger 12.jpg",
    "position_desc": 18,
    "img_above_text": "![Wukong Tiger 17.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a5/Wukong_Tiger_17.jpg)\nFinally, if you try to get too far away from him to rest and heal up, there’s a chance his single blade slash will instead create tornadoes of blood to seek you out! This only seems to happen when you stay at range from him, and he can follow these up with his other blood slashes to keep you from getting close.",
    "img_below_text": "This will be a tough fight no matter what you do, so the best thing you can do is to learn his moves, and which ones you can afford to hit back with a big charge attack. Certain times you may even be able to stagger him before he can perform a combo, or Immobilize him to shut him down from going on a sword-swinging spree — but if you don’t crash him out of it, he may just pick up where he left off.\n![Wukong Tiger 13.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c7/Wukong_Tiger_13.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Tiger 17.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a5/Wukong_Tiger_17.jpg)\nFinally, if you try to get too far away from him to rest and heal up, there’s a chance his single blade slash will instead create tornadoes of blood to seek you out! This only seems to happen when you stay at range from him, and he can follow these up with his other blood slashes to keep you from getting close.\"\n        - Following Text: \"This will be a tough fight no matter what you do, so the best thing you can do is to learn his moves, and which ones you can afford to hit back with a big charge attack. Certain times you may even be able to stagger him before he can perform a combo, or Immobilize him to shut him down from going on a sword-swinging spree — but if you don’t crash him out of it, he may just pick up where he left off.\n![Wukong Tiger 13.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c7/Wukong_Tiger_13.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an intense combat moment from *Black Myth: Wukong*, showcasing the player character battling the \"Tiger Vanguard\" boss. The scene highlights a powerful attack with dramatic golden sparks and visual effects, emphasizing the difficulty and high stakes of the fight. The preceding and following text advises players to learn the boss's moves, manage distance carefully, and exploit opportunities to stagger or immobilize the enemy to counter its relentless attacks."
}