{
    "chunk_id": 20278545968,
    "source_file": "Maitreya%27s_Orb.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3a/Wukong_Mindcliff_16.jpg",
    "alt_text": "Wukong Mindcliff 16.jpg",
    "position_desc": 1,
    "img_above_text": "## Black Myth: Wukong Maitreya's Orb Location\nThe Maitreya's Orb can be found in the Valley of Ecstasy in The New West, specifically at the Mindfullness Cliff Shrine. From the Shrine, head up the long staircase ahead and continue along until you reach the room with the lit torches. Sitting in the box you can find the orb.",
    "img_below_text": "For even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Black Myth: Wukong Maitreya's Orb Location\nThe Maitreya's Orb can be found in the Valley of Ecstasy in The New West, specifically at the Mindfullness Cliff Shrine. From the Shrine, head up the long staircase ahead and continue along until you reach the room with the lit torches. Sitting in the box you can find the orb.\"\n        - Following Text: \"For even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image showcases a gameplay moment from *Black Myth: Wukong*, where the player character, wielding a staff, faces two enemies in a dimly lit room. A red arrow highlights a box near a large statue, indicating the location of Maitreya's Orb, as described in the guide. This visual aids players in identifying the exact spot to find the orb at the Mindfulness Cliff Shrine in the Valley of Ecstasy."
}