{
    "chunk_id": 800066470277,
    "source_file": "Man-in-Stone.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/32/Wukong_Fright_35.jpg",
    "alt_text": "Wukong Fright 35.jpg",
    "position_desc": 3,
    "img_above_text": "In order to fight him, you'll first need to complete his questline by defeating the Mother of Stones found in a large cave tunnel to the left, and return the Stone Essence to him. He'll then mock you for being gullible enough to give him the stone, and you'll then be able to fight him for the prize.\n## Man-in-Stone Boss Fight and Guide",
    "img_below_text": "While he technically has a boss health bar and everything, he’s kind of a pushover, barely having much more health than a regular Pinstone, and only doing their regular attacks anyway. Simply Immobilize him, rack up some Focus Points, and deliver a charged strike to send him packing.\n![Wukong Fright 36.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/51/Wukong_Fright_36.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"In order to fight him, you'll first need to complete his questline by defeating the Mother of Stones found in a large cave tunnel to the left, and return the Stone Essence to him. He'll then mock you for being gullible enough to give him the stone, and you'll then be able to fight him for the prize.\n## Man-in-Stone Boss Fight and Guide\"\n        - Following Text: \"While he technically has a boss health bar and everything, he’s kind of a pushover, barely having much more health than a regular Pinstone, and only doing their regular attacks anyway. Simply Immobilize him, rack up some Focus Points, and deliver a charged strike to send him packing.\n![Wukong Fright 36.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/51/Wukong_Fright_36.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the \"Man-in-Stone\" boss fight from *Black Myth: Wukong*. The player character is engaged in combat with the boss, whose health bar is visible at the bottom of the screen. The scene takes place in a rocky, sunlit environment, with visual effects showing debris and sparks from the ongoing battle. The preceding and following text describe the boss as relatively weak, suggesting strategies like immobilizing him and using charged strikes to defeat him efficiently."
}