{
    "chunk_id": 546744070851,
    "source_file": "Guangmou.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/da/Wukong_Bamboo_26.jpg",
    "alt_text": "Wukong Bamboo 26.jpg",
    "position_desc": 2,
    "img_above_text": "### Guangmou Mini-Boss Fight and Guide\nGuangmou is one of the more tricky fights you’ll have faced so far, relying on a variety of sneaky projectile attacks to keep you on the defensive and limit your ability to pursue him. Though he’s not technically a snake, you will find yourself in danger of being poisoned during this fight, so you may want to buy a few anti-poison medicine from the Shrine’s shop.",
    "img_below_text": "He’ll almost always begin the fight by summoning a cluster of homing ghostly projectiles that burst out of him before tracking you down. You can avoid the group by dodging to the side, or holding down your staff spin until they’ve been deflected.\n![Wukong Bamboo 28.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5e/Wukong_Bamboo_28.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"### Guangmou Mini-Boss Fight and Guide\nGuangmou is one of the more tricky fights you’ll have faced so far, relying on a variety of sneaky projectile attacks to keep you on the defensive and limit your ability to pursue him. Though he’s not technically a snake, you will find yourself in danger of being poisoned during this fight, so you may want to buy a few anti-poison medicine from the Shrine’s shop.\"\n        - Following Text: \"He’ll almost always begin the fight by summoning a cluster of homing ghostly projectiles that burst out of him before tracking you down. You can avoid the group by dodging to the side, or holding down your staff spin until they’ve been deflected.\n![Wukong Bamboo 28.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5e/Wukong_Bamboo_28.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a moment from the Guangmou mini-boss fight in *Black Myth: Wukong*. The player character is shown in a forested area, facing Guangmou, who is summoning ghostly homing projectiles as described in the guide. The projectiles are visible as glowing entities, while the player prepares to counter or evade them. The health bar for Guangmou is displayed at the bottom, along with the player's HUD showing abilities and resources. This visual aligns with the guide's explanation of Guangmou's attack patterns and strategies for defense."
}