{
    "chunk_id": 314726391571,
    "source_file": "Locust_Antennae_Mask.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9a/Wukong_MiddleHollow_3.jpg",
    "alt_text": "Wukong MiddleHollow 3.jpg",
    "position_desc": 1,
    "img_above_text": "* Considerably increases power of all jump attacks\nThe Locust Antennae Mask is obtained upon defeating any Grasshopper Guai enemy in The Verdure Bridge in Chapter 4 - The Webbed Hollow. Simply farm the enemy until it drops.",
    "img_below_text": "Armor can be upgraded, with Silk once you reach Chen Loong and open the Zodiac Realm in The New West in Chapter 3.\nFor even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Weapons locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"* Considerably increases power of all jump attacks\nThe Locust Antennae Mask is obtained upon defeating any Grasshopper Guai enemy in The Verdure Bridge in Chapter 4 - The Webbed Hollow. Simply farm the enemy until it drops.\"\n        - Following Text: \"Armor can be upgraded, with Silk once you reach Chen Loong and open the Zodiac Realm in The New West in Chapter 3.\nFor even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Weapons locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image showcases a player character in *Black Myth: Wukong* defeating a Grasshopper Guai enemy in The Verdure Bridge area during Chapter 4 - The Webbed Hollow. Upon defeating the enemy, the Locust Antennae Mask, categorized as headgear, is obtained as a loot drop. The preceding text highlights the mask's ability to significantly enhance jump attack power, while the following text provides additional tips for upgrading armor and locating items in the game."
}