{
    "chunk_id": 537656503040,
    "source_file": "Lang-Li-Guhh-Baw.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/cc/Wukong_Sandgate_17.jpg",
    "alt_text": "Wukong Sandgate 17.jpg",
    "position_desc": 5,
    "img_above_text": "![Wukong Sandgate 16.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/56/Wukong_Sandgate_16.jpg)\nBe sure not to attack too much from the frog’s rear, as its quick hop mule kick can deal a ton of damage with little warning. If you see his arms cross, he’ll bloat his chest out for a frontal assault.",
    "img_below_text": "Several of its new electric attacks can deal a flurry of damage if you aren’t prepared to deal with them. The usual tell will be when the frog’s throat swells with electric energy. He will then shoot out dozens of electrified tadpoles — sometimes in a large frontal arc around him, and sometimes he’ll just spew them out and have them scatter around him.\n![Wukong Sandgate 19.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2b/Wukong_Sandgate_19.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Sandgate 16.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/56/Wukong_Sandgate_16.jpg)\nBe sure not to attack too much from the frog’s rear, as its quick hop mule kick can deal a ton of damage with little warning. If you see his arms cross, he’ll bloat his chest out for a frontal assault.\"\n        - Following Text: \"Several of its new electric attacks can deal a flurry of damage if you aren’t prepared to deal with them. The usual tell will be when the frog’s throat swells with electric energy. He will then shoot out dozens of electrified tadpoles — sometimes in a large frontal arc around him, and sometimes he’ll just spew them out and have them scatter around him.\n![Wukong Sandgate 19.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2b/Wukong_Sandgate_19.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss battle in *Black Myth: Wukong* against a large frog-like creature named \"Lang-Li-Guhh-Baw.\" The frog is unleashing electrified attacks, with glowing energy resembling lightning spreading outward. This aligns with the following text, which describes the frog's electric abilities, including shooting electrified tadpoles. The player character is seen preparing to evade or counter the attack in a rocky, water-filled environment."
}