{
    "chunk_id": 807604895125,
    "source_file": "Field_of_Fire_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/06/Field_Fire_Walkthrough_%2832%29.png",
    "alt_text": "Field Fire Walkthrough \\(32\\).png",
    "position_desc": 28,
    "img_above_text": "![Field Fire Walkthrough \\(34\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/26/Field_Fire_Walkthrough_%2834%29.png)\nThe Mother of Flamlings, thankfully, won't move. She'll stay where she is and use ranged fireball attacks, very similar to the Flamlings. To combat this, get as close to her as possible and try to land a few attacks. The downside of this, however, is that she will try to whip you with her body. If you can dodge these, she'll smack herself into the ground and be temporarily stunned.",
    "img_below_text": "After hitting her a few times, she'll be frustrated and scream. This is when the Flamlings will emerge and begin to shoot fireballs immediately. You'll want to clear these out as fast as you can and use your Fireproof Mantle and Body-Cooling Powder to counter any fire damage you might experience.\nWhen you've cleared out the first round of Flamlings, she'll reappear. This round of attacks will repeat until she's been defeated, except she can reappear when Flamlings are still in the arena after the first round. Still, the priority should be to remove them first before focusing on her.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Field Fire Walkthrough \\(34\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/26/Field_Fire_Walkthrough_%2834%29.png)\nThe Mother of Flamlings, thankfully, won't move. She'll stay where she is and use ranged fireball attacks, very similar to the Flamlings. To combat this, get as close to her as possible and try to land a few attacks. The downside of this, however, is that she will try to whip you with her body. If you can dodge these, she'll smack herself into the ground and be temporarily stunned.\"\n        - Following Text: \"After hitting her a few times, she'll be frustrated and scream. This is when the Flamlings will emerge and begin to shoot fireballs immediately. You'll want to clear these out as fast as you can and use your Fireproof Mantle and Body-Cooling Powder to counter any fire damage you might experience.\nWhen you've cleared out the first round of Flamlings, she'll reappear. This round of attacks will repeat until she's been defeated, except she can reappear when Flamlings are still in the arena after the first round. Still, the priority should be to remove them first before focusing on her.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game *Black Myth: Wukong*, showing the player character facing off against fiery, centipede-like creatures called Flamlings in a desolate, volcanic environment. These enemies are part of the encounter with the \"Mother of Flamlings,\" as described in the walkthrough. The Flamlings emerge during the boss fight, attacking with fireballs, and must be cleared quickly to avoid damage. The player is advised to use fire-resistant items like the Fireproof Mantle and Body-Cooling Powder to mitigate fire damage during the battle."
}