{
    "chunk_id": 99020504041,
    "source_file": "Bitter_Lake_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b8/Wukong_Bitter_1.jpg",
    "alt_text": "Wukong Bitter 1.jpg",
    "position_desc": 37,
    "img_above_text": "Once you've had your fill of exploring the \"Turtle Island\", you can head to the front where the small Pig Guai stands waiting, and interact with him for the turtle to finally make its landing at the next part of the Bitter Lake.\n## North Shore of the Bitter Lake",
    "img_below_text": "Once you and Zhu Bajie drop down onto the shore of the lake, you'll find there are a couple different directions you can go in. Just ahead on the right you'll find the North Shore Shrine, with the shore extending in both directions for optional areas to explore with bosses. However, if you want to hurry ahead, you can also look for a frozen tunnel a little ways to the right and proceed in toward the Precept Corridor.\nSince there's a good deal of important optional stuff (including some that can be missed if you proceed too far!) we'll start off checking the left side of the shore when facing the away from the water.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Once you've had your fill of exploring the \"Turtle Island\", you can head to the front where the small Pig Guai stands waiting, and interact with him for the turtle to finally make its landing at the next part of the Bitter Lake.\n## North Shore of the Bitter Lake\"\n        - Following Text: \"Once you and Zhu Bajie drop down onto the shore of the lake, you'll find there are a couple different directions you can go in. Just ahead on the right you'll find the North Shore Shrine, with the shore extending in both directions for optional areas to explore with bosses. However, if you want to hurry ahead, you can also look for a frozen tunnel a little ways to the right and proceed in toward the Precept Corridor.\nSince there's a good deal of important optional stuff (including some that can be missed if you proceed too far!) we'll start off checking the left side of the shore when facing the away from the water.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts two characters, one resembling Zhu Bajie, standing on a snowy terrain. This scene follows their descent onto the North Shore of the Bitter Lake, where they are about to explore various paths, including optional areas with bosses and a frozen tunnel leading to the Precept Corridor. The image visually represents the beginning of their exploration on the North Shore."
}