{
    "chunk_id": 384410739832,
    "source_file": "Turtle_Treasure_Spirit.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/53/Turtle_Treasure_Spirit.png",
    "alt_text": "Turtle Treasure Spirit.png",
    "position_desc": 3,
    "img_above_text": "While fighting Turtle Treasure, you will want to make sure to look out for the mallet it swings at you. A Pluck of Many or Immobilize makes this fight a lot easier if you don't have the Gourd.\n## Turtle Treasure Spirit",
    "img_below_text": "* **Skyward**\n* Equipped Effect: Moderately increase Damage dealt by Heavy Attacks that cost 3 or 4 Focus Points.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"While fighting Turtle Treasure, you will want to make sure to look out for the mallet it swings at you. A Pluck of Many or Immobilize makes this fight a lot easier if you don't have the Gourd.\n## Turtle Treasure Spirit\"\n        - Following Text: \"* **Skyward**\n* Equipped Effect: Moderately increase Damage dealt by Heavy Attacks that cost 3 or 4 Focus Points.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "1. The image displays the \"Equipment\" menu from a video game, highlighting the \"Turtle Treasure\" Spirit. This Spirit is categorized as Rare, has a high Qi cost, and features the ability \"Skyward,\" which allows the player to ride an upside-down mallet, ignite powder to soar upward, and crush enemies upon landing. The equipped effect increases damage dealt by heavy attacks that consume 3 or 4 Focus Points.\n\n2. The image serves to showcase the Spirit's abilities, effects, and its role in combat, as well as to provide a visual demo of its usage."
}