{
    "chunk_id": 267715856862,
    "source_file": "Chapter_3_Secret_-_Mount_Mei_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2b/Mount_Mei_Walkthrough_%2814%29.png",
    "alt_text": "Mount Mei Walkthrough \\(14\\).png",
    "position_desc": 12,
    "img_above_text": "Thankfully after a huge battle against Erlang, The Sacred Divinity, the fight against the Four Heavenly Kings is much more straightforward. They share one health bar between them, and in your Stone Monkey transformation, you can use Primal Punch as your light attack, Earthshatter Slam as your heavy attack (this attack also heals), and Rock Solid to deflect their hits.\nUse Rock Solid when it's available and when one of the four giants will launch themselves at you. Other than that, you'll just want to keep using Primal Punch to build up Focus. When you've built your points, use Earthshatter Slam.",
    "img_below_text": "About halfway through the fight, you'll also be able to start using Ice Bath. When you use the Ice Bath Spell, the Stone Monkey's arms will be covered in frost, and when you punch, you'll inflict frost damage.\nThe Four Heavenly Kings",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Thankfully after a huge battle against Erlang, The Sacred Divinity, the fight against the Four Heavenly Kings is much more straightforward. They share one health bar between them, and in your Stone Monkey transformation, you can use Primal Punch as your light attack, Earthshatter Slam as your heavy attack (this attack also heals), and Rock Solid to deflect their hits.\nUse Rock Solid when it's available and when one of the four giants will launch themselves at you. Other than that, you'll just want to keep using Primal Punch to build up Focus. When you've built your points, use Earthshatter Slam.\"\n        - Following Text: \"About halfway through the fight, you'll also be able to start using Ice Bath. When you use the Ice Bath Spell, the Stone Monkey's arms will be covered in frost, and when you punch, you'll inflict frost damage.\nThe Four Heavenly Kings\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dramatic battle scene from a video game, showcasing the Stone Monkey character engaging in combat against one of the Four Heavenly Kings. The environment is filled with icy effects, likely representing the use of the Ice Bath spell, which enhances the Stone Monkey's attacks with frost damage. This visual aligns with the guide's description of the fight mechanics, emphasizing the use of abilities like Primal Punch, Earthshatter Slam, and Rock Solid during this encounter."
}