{
    "chunk_id": 525351765160,
    "source_file": "New_Thunderclap_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/82/Wukong_Thunderclap_41.jpg",
    "alt_text": "Wukong Thunderclap 41.jpg",
    "position_desc": 40,
    "img_above_text": "Head back to the main building and quickly dart inside to avoid the lightning strikes of the Thunder Rhino Masters on the balcony above.\nThe darkened room is small, and hides another Overseeing Monk, as well as stairs leading upward to the right.",
    "img_below_text": "Beware of more Overseeing Monks as you ascend, and try to stay patient using thrust attacks from out of their range to conserve your health from getting hit by their martial arts counters.\n![Wukong Thunderclap 42.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/cb/Wukong_Thunderclap_42.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Head back to the main building and quickly dart inside to avoid the lightning strikes of the Thunder Rhino Masters on the balcony above.\nThe darkened room is small, and hides another Overseeing Monk, as well as stairs leading upward to the right.\"\n        - Following Text: \"Beware of more Overseeing Monks as you ascend, and try to stay patient using thrust attacks from out of their range to conserve your health from getting hit by their martial arts counters.\n![Wukong Thunderclap 42.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/cb/Wukong_Thunderclap_42.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a gameplay moment from *Black Myth: Wukong*, showing the player character ascending a dimly lit staircase inside a wooden structure. An Overseeing Monk enemy is visible at the top of the stairs, preparing for combat. A large statue, possibly of a deity or monk, is positioned on the right side of the staircase, adding to the atmospheric setting. The image aligns with the preceding and following text, emphasizing caution while dealing with Overseeing Monks using ranged thrust attacks to avoid their counters. HUD elements, including health and abilities, are visible at the bottom of the screen."
}