{
    "chunk_id": 868747907889,
    "source_file": "How_to_Unlock_the_Chapter_2_Secret_Area.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/75/Chapter_2_Secret_Area_%285%29.png",
    "alt_text": "Chapter 2 Secret Area \\(5\\).png",
    "position_desc": 3,
    "img_above_text": "Smash through the fence and go straight ahead to find the Yellow-Robed Squire on the rock. Unfortunately, you won't get much out of him except for retching and mentions of jars from Windrest until you find a **key itemcalled the Sobering Stone**. There are two ways to get hold of the item, so here's what you need to know.\n## How to Get the Sobering Stone for the Yellow-Robed Squire - Method 1",
    "img_below_text": "The easiest way to get the Sobering Stone is through exploration and waiting until you reach the Yellow Sand Formation. The first place you'll come to is Windrest Bridge, which will take you up to Windrest Hamlet.\n![Chapter 2 Secret Area \\(3\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e3/Chapter_2_Secret_Area_%283%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Smash through the fence and go straight ahead to find the Yellow-Robed Squire on the rock. Unfortunately, you won't get much out of him except for retching and mentions of jars from Windrest until you find a **key itemcalled the Sobering Stone**. There are two ways to get hold of the item, so here's what you need to know.\n## How to Get the Sobering Stone for the Yellow-Robed Squire - Method 1\"\n        - Following Text: \"The easiest way to get the Sobering Stone is through exploration and waiting until you reach the Yellow Sand Formation. The first place you'll come to is Windrest Bridge, which will take you up to Windrest Hamlet.\n![Chapter 2 Secret Area \\(3\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e3/Chapter_2_Secret_Area_%283%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a gameplay moment where the player character, wielding a flaming weapon, is engaged in combat with an enemy near a dimly lit doorway. A red arrow highlights the doorway, suggesting it is a point of interest or a path to progress further in the game. This scene likely serves as part of the walkthrough's guidance on navigating towards the Sobering Stone or related objectives."
}