{
    "chunk_id": 491167166887,
    "source_file": "How_to_Increase_Gourd_Uses_and_Healing_Amount.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/64/Wukong_Shen2.jpg",
    "alt_text": "Wukong Shen2.jpg",
    "position_desc": 5,
    "img_above_text": "Follow the Shen Monkey into the cave after this, and speak to him. You’ll now have the option appear to Upgrade Gourds, Upgrade Drinks, and Brew. Whenever you want to upgrade your Gourd or the drink you’re using, you’ll need to return to the Shen Monkey.\n## How to Upgrade Gourds",
    "img_below_text": "Now that you have access to the Upgrade Gourds menu, you’ll be able to increase the number of uses. To do this, you’ll need to collect Luojia Fragrant Vine. Using these will not upgrade all your Gourds; you’ll need to improve each one individually.\nLooking for the locations of all Luojia Fragrant Vine? Collect every one of them with our guide here.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Follow the Shen Monkey into the cave after this, and speak to him. You’ll now have the option appear to Upgrade Gourds, Upgrade Drinks, and Brew. Whenever you want to upgrade your Gourd or the drink you’re using, you’ll need to return to the Shen Monkey.\n## How to Upgrade Gourds\"\n        - Following Text: \"Now that you have access to the Upgrade Gourds menu, you’ll be able to increase the number of uses. To do this, you’ll need to collect Luojia Fragrant Vine. Using these will not upgrade all your Gourds; you’ll need to improve each one individually.\nLooking for the locations of all Luojia Fragrant Vine? Collect every one of them with our guide here.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a tree adorned with glowing orange vines, likely representing the Luojia Fragrant Vine mentioned in the guide. These vines are essential for upgrading Gourds in the game, as explained in the preceding and following text. The setting appears to be a cave, aligning with the narrative of following the Shen Monkey into the cave to access upgrade options."
}