{
    "chunk_id": 431687788009,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e7/Wukong_Fright_40.jpg",
    "alt_text": "Wukong Fright 40.jpg",
    "position_desc": 39,
    "img_above_text": "![Wukong Fright 37.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/54/Wukong_Fright_37.jpg)\nTo the right when facing the shrine, you can spot stairs leading up past a wooden platform where a Blazebone will attack from its vantage point.",
    "img_below_text": "Up the stairs, a Spearbone with shield guards a spot with a large waterfall of sand. The Spearbone is tougher than average, because defeating him will allow you to claim the Spearbone Spirit to add to your arsenal of transformation attacks! Just beware of his roar that preludes a frenzied combo of spear swings and slams, and use your Immobilize or Cloud Step to skirt around his defenses and attack him instead of his shield.\n![Wukong Fright 41.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a1/Wukong_Fright_41.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Fright 37.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/54/Wukong_Fright_37.jpg)\nTo the right when facing the shrine, you can spot stairs leading up past a wooden platform where a Blazebone will attack from its vantage point.\"\n        - Following Text: \"Up the stairs, a Spearbone with shield guards a spot with a large waterfall of sand. The Spearbone is tougher than average, because defeating him will allow you to claim the Spearbone Spirit to add to your arsenal of transformation attacks! Just beware of his roar that preludes a frenzied combo of spear swings and slams, and use your Immobilize or Cloud Step to skirt around his defenses and attack him instead of his shield.\n![Wukong Fright 41.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a1/Wukong_Fright_41.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an intense combat scene from *Black Myth: Wukong*, showing the player character engaged in battle with a Spearbone enemy. The Spearbone, a heavily armored foe wielding a spear and shield, is highlighted by its glowing, fiery design. This encounter takes place in a rugged, arid environment and is part of a sequence where defeating the Spearbone rewards the player with the Spearbone Spirit, an upgrade for transformation attacks. The image emphasizes the challenge of the fight, requiring strategic maneuvers to bypass the enemy's defenses."
}