{
    "chunk_id": 425906528271,
    "source_file": "Valley_of_Ecstasy_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/88/Wukong_Brook_7.jpg",
    "alt_text": "Wukong Brook 7.jpg",
    "position_desc": 46,
    "img_above_text": "Be sure to cross the bridge to find the Brook of Bliss Shrine, and you can circle back to the top of the brook to find another Thunder Rhino Master patrolling near a Cyan Bat.\nBefore you check up the hill from the Shrine, head back across the bridge and follow the path down to the brook itself.",
    "img_below_text": "Here you'll find the lower part of the brook, where a Crow Diviner waits in a large pool of water by some falls. Unlike the earlier Crow Diviners, this one is not only empowered with a Spirit, but has even more deadly moves.\nIn addition to their quick dashing sword swings, Crow Diviners in the valley like this one can also blast out an icy chill your way while becoming nearly invisible aside from a purple glowing eye.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Be sure to cross the bridge to find the Brook of Bliss Shrine, and you can circle back to the top of the brook to find another Thunder Rhino Master patrolling near a Cyan Bat.\nBefore you check up the hill from the Shrine, head back across the bridge and follow the path down to the brook itself.\"\n        - Following Text: \"Here you'll find the lower part of the brook, where a Crow Diviner waits in a large pool of water by some falls. Unlike the earlier Crow Diviners, this one is not only empowered with a Spirit, but has even more deadly moves.\nIn addition to their quick dashing sword swings, Crow Diviners in the valley like this one can also blast out an icy chill your way while becoming nearly invisible aside from a purple glowing eye.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character standing in a shallow pool of water, armed with a polearm, facing an enemy in the distance near a small waterfall. The setting is a snowy, rocky valley, likely the lower part of the brook mentioned in the text. This scene aligns with the description of encountering a Crow Diviner, a challenging enemy empowered with a Spirit, in this area. The interface displays health, stamina, and ability icons, suggesting active combat preparation."
}