{
    "chunk_id": 359815083330,
    "source_file": "Gray-Bronze_Cart.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3c/Woods_Ember_Walkthrough_%2892%29.png",
    "alt_text": "Woods Ember Walkthrough \\(92\\).png",
    "position_desc": 1,
    "img_above_text": "Gray-Bronze Cart is a Yaoguai Chief boss fight that you'll go up against at the start of Chapter 5 in Black Myth: Wukong. Blocking the pathway to the Ashen Pass II, the cart is just one of the Five Element Carts you'll need to fight in this Chapter.\n## How to Find Gray-Bronze Cart",
    "img_below_text": "After the fight with Father of Stones, go through the door and follow the path. You'll come to a cave, which you'll need to pass through to go to the lower level of the valley.\n![Woods Ember Walkthrough \\(101\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/25/Woods_Ember_Walkthrough_%28101%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Gray-Bronze Cart is a Yaoguai Chief boss fight that you'll go up against at the start of Chapter 5 in Black Myth: Wukong. Blocking the pathway to the Ashen Pass II, the cart is just one of the Five Element Carts you'll need to fight in this Chapter.\n## How to Find Gray-Bronze Cart\"\n        - Following Text: \"After the fight with Father of Stones, go through the door and follow the path. You'll come to a cave, which you'll need to pass through to go to the lower level of the valley.\n![Woods Ember Walkthrough \\(101\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/25/Woods_Ember_Walkthrough_%28101%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from *Black Myth: Wukong*, showing the player's character standing near a large wooden door in a stone wall, with a red arrow pointing toward the door. This location appears to be the entrance to a path leading to the next area, as mentioned in the walkthrough, where players must proceed after defeating the \"Father of Stones\" boss. The setting is dark and atmospheric, with barren trees and rocky terrain, emphasizing the game's somber tone."
}