{
    "chunk_id": 559970358585,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/32/Wukong_Fright_21.jpg",
    "alt_text": "Wukong Fright 21.jpg",
    "position_desc": 22,
    "img_above_text": "At the end of the crevice, you’ll find an unusual looking stone. He’s actually a Man-in-Stone, and claims to have been trapped within the rock form. He’s betting on one of the rock guai in the large cave nearby to hold the secrets to reversing his fate, and asks you to seek it out.\n### The Fourth Buddha’s Eyeball",
    "img_below_text": "As you leave the crevice with the Man-in-Stone, stick to the left wall going up to find several paths leading toward the large cave. Halfway up this sloping path just above where the Man-in-Stone is in the crevice below, you’ll find another of the large stone heads chanting, and can claim it’s Buddha’s Eyeball.\n![Wukong Fright 22.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/21/Wukong_Fright_22.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"At the end of the crevice, you’ll find an unusual looking stone. He’s actually a Man-in-Stone, and claims to have been trapped within the rock form. He’s betting on one of the rock guai in the large cave nearby to hold the secrets to reversing his fate, and asks you to seek it out.\n### The Fourth Buddha’s Eyeball\"\n        - Following Text: \"As you leave the crevice with the Man-in-Stone, stick to the left wall going up to find several paths leading toward the large cave. Halfway up this sloping path just above where the Man-in-Stone is in the crevice below, you’ll find another of the large stone heads chanting, and can claim it’s Buddha’s Eyeball.\n![Wukong Fright 22.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/21/Wukong_Fright_22.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game *Black Myth: Wukong*, showing the protagonist navigating a rocky, grassy terrain. In the background, a large stone head with glowing eyes, likely significant to the quest, is visible. This aligns with the walkthrough's description of encountering a \"chanting\" stone head while ascending the path near the Man-in-Stone, where players can claim \"Buddha’s Eyeball.\" The image highlights the setting and a key narrative element of the quest."
}