{
    "chunk_id": 57148018668,
    "source_file": "Loongwreathe_Staff.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/50/Loongwreathe_Staff.jpg",
    "alt_text": "Loongwreathe Staff.jpg",
    "position_desc": 1,
    "img_above_text": "The Loongwreathe Staff is a Epic weapon in Black Myth: Wukong. It comes with great stats, damage, and a solid unique effect if you use the Pillar Stance. It is one of the best Weapons in the early-to-mid game.\nThe weapon comes with a respectable 70 damage, and the unique effect of increase the damage dealt by every attack while you are in Pillar Stance. Pillar Stance is the most specalized of the stances, but it can be useful for avoiding ground attacks or area-of-effect attacks.",
    "img_below_text": "## Black Myth: Wukong Loongwreathe Staff Location\nThe Loongwreathe Staff can be found in Chapter 1 - Black Wind Mountain upon defeating Red Loong or in Chapter 2 - Yellow Wind Ridge upon defeating Black Loong, or in Chapter 3 - The New West upon defeating Cyan Loong. Whenever you defeat any of these bosses, the weapon will be craftable from the Shrine menu.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Loongwreathe Staff is a Epic weapon in Black Myth: Wukong. It comes with great stats, damage, and a solid unique effect if you use the Pillar Stance. It is one of the best Weapons in the early-to-mid game.\nThe weapon comes with a respectable 70 damage, and the unique effect of increase the damage dealt by every attack while you are in Pillar Stance. Pillar Stance is the most specalized of the stances, but it can be useful for avoiding ground attacks or area-of-effect attacks.\"\n        - Following Text: \"## Black Myth: Wukong Loongwreathe Staff Location\nThe Loongwreathe Staff can be found in Chapter 1 - Black Wind Mountain upon defeating Red Loong or in Chapter 2 - Yellow Wind Ridge upon defeating Black Loong, or in Chapter 3 - The New West upon defeating Cyan Loong. Whenever you defeat any of these bosses, the weapon will be craftable from the Shrine menu.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image showcases the crafting menu for the Loongwreathe Staff, an Epic weapon in *Black Myth: Wukong*. The weapon has 70 base attack damage and a unique effect that moderately increases damage dealt in Pillar Stance. The crafting requirements include materials like Thunderbone and Refined Iron Sand, but the player currently has insufficient resources. The weapon is highlighted as a strong choice for early-to-mid game progression."
}