{
    "chunk_id": 764155736215,
    "source_file": "Kang-Jin_Loong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/66/Wukong_Snowhill_47.jpg",
    "alt_text": "Wukong Snowhill 47.jpg",
    "position_desc": 8,
    "img_above_text": "However, this is just part one of her attack, as after a delay she will slam down with her tail for a massive attack -- but it can be deflected with Rock Solid.\nAfter her tail slam, you'll have the opportunity to retaliate and hit her tail before the boss can re-orient her body, so make the most of these moments to use Spirit Attacks while its on the ground.",
    "img_below_text": "Another wild tail slam attack will come when the boss rapidly spins in a front circle while facing you, building up momentum from several rotations to finally slam their tail down from above.\n![Wukong Snowhill 42.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/44/Wukong_Snowhill_42.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"However, this is just part one of her attack, as after a delay she will slam down with her tail for a massive attack -- but it can be deflected with Rock Solid.\nAfter her tail slam, you'll have the opportunity to retaliate and hit her tail before the boss can re-orient her body, so make the most of these moments to use Spirit Attacks while its on the ground.\"\n        - Following Text: \"Another wild tail slam attack will come when the boss rapidly spins in a front circle while facing you, building up momentum from several rotations to finally slam their tail down from above.\n![Wukong Snowhill 42.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/44/Wukong_Snowhill_42.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss battle in *Black Myth: Wukong*, showcasing a dramatic moment where the serpent-like boss, Kang Jin Loong, performs a powerful tail slam attack in a snowy, frozen environment. The player character is seen preparing to counter the attack using the \"Rock Solid\" ability, as indicated in the preceding and following text. The interface displays consumable items and abilities available to the player, emphasizing strategic options during the fight."
}