{
    "chunk_id": 419114007453,
    "source_file": "Chapter_4_Secret_-_Purple_Cloud_Mountain_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/ae/Wukong_PurpleCloud_70.jpg",
    "alt_text": "Wukong PurpleCloud 70.jpg",
    "position_desc": 74,
    "img_above_text": "Once you know where and when his sword will appear, the rest of the fight will come down to waiting for openings after his big attack to hit him hard, using your Spirit Attacks and Transformation Spells in this phase to speed things up. With all of his attacks being fairly visible to spot coming, it shouldn't take too long to get the hang of and send this demon rooster to the abyss.\nThe Duskveil",
    "img_below_text": "After the Yaoguai King falls, Hong Yi the snake woman will appear to thank you for your part in putting The Duskveil to rest. The broken needle you pull out of Zhu Bajie will appear -- much to the surprise of Hong Yi -- who will offer to repair it, and grant you the **Weaver's Needle Vessel**.\nThis new Vessel can aid you greatly in defeating the final boss of Chapter 4's Temple of Yellow Flowers. You'll also gain a **Double-Combed Rooster Blood Soak** for your Gourd, and both Kun Steel and The Duskveil's Horn, which will finally allow you to complete both the Iron-Tough Armor Set, and craft the Golden Loong Staff!",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Once you know where and when his sword will appear, the rest of the fight will come down to waiting for openings after his big attack to hit him hard, using your Spirit Attacks and Transformation Spells in this phase to speed things up. With all of his attacks being fairly visible to spot coming, it shouldn't take too long to get the hang of and send this demon rooster to the abyss.\nThe Duskveil\"\n        - Following Text: \"After the Yaoguai King falls, Hong Yi the snake woman will appear to thank you for your part in putting The Duskveil to rest. The broken needle you pull out of Zhu Bajie will appear -- much to the surprise of Hong Yi -- who will offer to repair it, and grant you the **Weaver's Needle Vessel**.\nThis new Vessel can aid you greatly in defeating the final boss of Chapter 4's Temple of Yellow Flowers. You'll also gain a **Double-Combed Rooster Blood Soak** for your Gourd, and both Kun Steel and The Duskveil's Horn, which will finally allow you to complete both the Iron-Tough Armor Set, and craft the Golden Loong Staff!\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image likely depicts Hong Yi, the snake woman mentioned in the following text, who appears after the defeat of the Yaoguai King in the game. She plays a narrative role in repairing the broken needle pulled from Zhu Bajie, granting the **Weaver's Needle Vessel** and other rewards. The red-toned background and her attire suggest a dramatic or significant moment tied to the game's storyline, possibly within Chapter 4's Temple of Yellow Flowers."
}