{
    "chunk_id": 206879034299,
    "source_file": "Valley_of_Ecstasy_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4a/Wukong_Mindcliff_27.jpg",
    "alt_text": "Wukong Mindcliff 27.jpg",
    "position_desc": 26,
    "img_above_text": "Non-White\n**Warning** \\- Before you proceed, make sure you've defeated the Apramana Bat along the North Shore of the Bitter Lake, and also encountered the Treasure Hunter man before you proceed into the next area!",
    "img_below_text": "Beyond this arena, you can head through an archway to see the giant titular Valley of Ecstasy below you. It's a one-way slide, and the region is about to get a whole lot bigger and confusing.\n## Forest of Felicity",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Non-White\n**Warning** \\- Before you proceed, make sure you've defeated the Apramana Bat along the North Shore of the Bitter Lake, and also encountered the Treasure Hunter man before you proceed into the next area!\"\n        - Following Text: \"Beyond this arena, you can head through an archway to see the giant titular Valley of Ecstasy below you. It's a one-way slide, and the region is about to get a whole lot bigger and confusing.\n## Forest of Felicity\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image shows a character traversing a snowy, forested environment, likely preparing to enter the next area of the game. The preceding text emphasizes the importance of defeating a specific enemy and encountering a key NPC before progressing, while the following text suggests the character is approaching a significant transition point leading to the expansive and complex \"Valley of Ecstasy\" and the \"Forest of Felicity.\" The image visually represents this transitional moment in the game."
}