{
    "chunk_id": 898758906143,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b2/Wukong_Wolves_1.jpg",
    "alt_text": "Wukong Wolves 1.jpg",
    "position_desc": 9,
    "img_above_text": "# The Forest of Wolves\nWhile he may not be Sun Wukong, the Destined One is not above a bit of trickery and foolishness — as evidenced by luring some lesser Wolf Guais into trying to take a bite out of him disguised as a peach.",
    "img_below_text": "These basic enemies, the Wolf Scout and Wolf Swornsword, are perfect for getting a feel for some real combat. They tend to attack fairly slowly and draw out their sword slices giving you ample time to dodge even while using light combo attacks.\n![Wukong Wolves 2.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e6/Wukong_Wolves_2.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"# The Forest of Wolves\nWhile he may not be Sun Wukong, the Destined One is not above a bit of trickery and foolishness — as evidenced by luring some lesser Wolf Guais into trying to take a bite out of him disguised as a peach.\"\n        - Following Text: \"These basic enemies, the Wolf Scout and Wolf Swornsword, are perfect for getting a feel for some real combat. They tend to attack fairly slowly and draw out their sword slices giving you ample time to dodge even while using light combo attacks.\n![Wukong Wolves 2.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e6/Wukong_Wolves_2.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the game \"Black Myth: Wukong,\" where the protagonist, armed with a staff, faces off against two wolf-like enemies in a forest setting. These enemies, identified as the Wolf Scout and Wolf Swornsword, are introductory combat opponents designed to help players practice dodging and light combo attacks. The setting is part of \"The Forest of Wolves,\" emphasizing the game's atmospheric and strategic combat elements."
}