{
    "chunk_id": 858600526720,
    "source_file": "Captain_Wise-Voice.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/60/Wukong_Pagoda_89.jpg",
    "alt_text": "Wukong Pagoda 89.jpg",
    "position_desc": 12,
    "img_above_text": "Keep strafing, and wait for lasers to start hitting the ground near you to trigger incoming lightning strikes on your position. This is a great time to use Cloud Step to give it the slip, allowing you to conserve stamina for the final act.\nEventually, you'll see the entire floor light up with criss-crossing lines over almost every inch of the surface. Keep dodging the lightning strikes, and as soon as the floor glows red, hop onto your Pillar Stance to extend off the ground (the more stamina you have built up, the better).",
    "img_below_text": "With a massive blast, the ground will explode in color, dealing a ton of damage if you aren't grounded at the top of your staff, and then the sphere will return to the construct body.\n![Wukong Pagoda 90.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/6b/Wukong_Pagoda_90.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Keep strafing, and wait for lasers to start hitting the ground near you to trigger incoming lightning strikes on your position. This is a great time to use Cloud Step to give it the slip, allowing you to conserve stamina for the final act.\nEventually, you'll see the entire floor light up with criss-crossing lines over almost every inch of the surface. Keep dodging the lightning strikes, and as soon as the floor glows red, hop onto your Pillar Stance to extend off the ground (the more stamina you have built up, the better).\"\n        - Following Text: \"With a massive blast, the ground will explode in color, dealing a ton of damage if you aren't grounded at the top of your staff, and then the sphere will return to the construct body.\n![Wukong Pagoda 90.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/6b/Wukong_Pagoda_90.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a climactic moment in a boss fight from *Black Myth: Wukong*, where the player character, Wukong, is using the \"Pillar Stance\" ability to elevate off the ground and avoid a massive, glowing red area-of-effect (AoE) attack. The scene is filled with intense visual effects, including criss-crossing red energy lines and explosions, indicating the imminent high-damage blast described in the text. The health bar at the bottom identifies the boss as \"Captain Wise-Voice.\""
}