{
    "chunk_id": 766556179200,
    "source_file": "Valley_of_Ecstasy_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/27/Wukong_Karma_9.jpg",
    "alt_text": "Wukong Karma 9.jpg",
    "position_desc": 82,
    "img_above_text": "![Wukong Karma 8.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b1/Wukong_Karma_8.jpg)\nBack at the Towers of Karma Shrine, look ahead to find a large series of statues carved into a wall with a new enemy standing in front of them. This fearsome foe is a Dual-Blade Monk, and has a lot of health and damaging moves (but thankfully won't respawn).",
    "img_below_text": "Be ready for him to toss his blades at you as they boomerang back to him, and then dart up close to attack low with sweeping cuts from his blades. Though he can perform long combos that end in powerful uppercuts, he's not immune to being greatly staggered from a well time Rock Solid, so wait for a good moment to upset his attacks and punish him.\n![Wukong Karma 10.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/cf/Wukong_Karma_10.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Karma 8.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b1/Wukong_Karma_8.jpg)\nBack at the Towers of Karma Shrine, look ahead to find a large series of statues carved into a wall with a new enemy standing in front of them. This fearsome foe is a Dual-Blade Monk, and has a lot of health and damaging moves (but thankfully won't respawn).\"\n        - Following Text: \"Be ready for him to toss his blades at you as they boomerang back to him, and then dart up close to attack low with sweeping cuts from his blades. Though he can perform long combos that end in powerful uppercuts, he's not immune to being greatly staggered from a well time Rock Solid, so wait for a good moment to upset his attacks and punish him.\n![Wukong Karma 10.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/cf/Wukong_Karma_10.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an intense combat scene from *Black Myth: Wukong*, showcasing the player character engaging in battle with the Dual-Blade Monk. The player is utilizing the \"Rock Solid\" ability to block or counter the enemy's attack, as indicated by the glowing shield effect. The interface displays various consumables and abilities available to the player, emphasizing strategic resource management during the fight."
}