{
    "chunk_id": 894811581369,
    "source_file": "Elder_Amourworm.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2f/Wukong_MiddleHollow_8.jpg",
    "alt_text": "Wukong MiddleHollow 8.jpg",
    "position_desc": 2,
    "img_above_text": "![Wukong MiddleHollow 7.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/87/Wukong_MiddleHollow_7.jpg)\nThe Elder Amourworm sports a large creepy mask that you can see when it rears up, and it will use it to shoot out sticky threads in frontal arc. If you get caught, you'll have to mash to get out before being charged and attacked while unable to defend yourself.",
    "img_below_text": "If the sticky webs weren't bad enough, its other main trick is the ability to shoot out globs of poison, that will stay on the ground for a short duration even if it misses you. The Elder Amourworm can shoot out these poison globs when facing you, but also when you try to attack from its back, making it dangerous no matter which direction you fight from.\n![Wukong MiddleHollow 10.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/84/Wukong_MiddleHollow_10.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong MiddleHollow 7.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/87/Wukong_MiddleHollow_7.jpg)\nThe Elder Amourworm sports a large creepy mask that you can see when it rears up, and it will use it to shoot out sticky threads in frontal arc. If you get caught, you'll have to mash to get out before being charged and attacked while unable to defend yourself.\"\n        - Following Text: \"If the sticky webs weren't bad enough, its other main trick is the ability to shoot out globs of poison, that will stay on the ground for a short duration even if it misses you. The Elder Amourworm can shoot out these poison globs when facing you, but also when you try to attack from its back, making it dangerous no matter which direction you fight from.\n![Wukong MiddleHollow 10.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/84/Wukong_MiddleHollow_10.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a battle scene from *Black Myth: Wukong* featuring the Elder Amourworm, a large, grotesque enemy. The creature is shown releasing green poison globs, which align with its described ability to attack both from the front and rear, creating hazardous zones on the ground. The environment is dark and eerie, filled with skeletal remains and web-like structures, emphasizing the creature's dangerous nature and the challenging fight mechanics. The player's health and ability bars are visible, indicating active gameplay."
}