{
    "chunk_id": 218504010647,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bc/Furnace_Valley_Walkthrough_.png",
    "alt_text": "Furnace Valley Walkthrough .png",
    "position_desc": 22,
    "img_above_text": "Flint Chief\nFollow the lava path back up the archway, collecting more Fire Dates on the way, and be careful of Scorching and Searing-Fire enemies that will pop out along the way.",
    "img_below_text": "When you're back up to the arch, continue forward to the top of the slope. The path goes left and right here. Right is the main path, so for now, let's take a look at the left side. As you head over, you'll see an Earth Rakshasa waiting for you that guards a chest. It also has a Spirit for you to collect once you defeat it.\nAs soon as you pass by the torch, a Flamling will appear. Take down the Flamling and Rakshasa, then collect the Earth Rakshasa Spirit. After this, open the chest and collect Celestial Ribbon and a Mind Core.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Flint Chief\nFollow the lava path back up the archway, collecting more Fire Dates on the way, and be careful of Scorching and Searing-Fire enemies that will pop out along the way.\"\n        - Following Text: \"When you're back up to the arch, continue forward to the top of the slope. The path goes left and right here. Right is the main path, so for now, let's take a look at the left side. As you head over, you'll see an Earth Rakshasa waiting for you that guards a chest. It also has a Spirit for you to collect once you defeat it.\nAs soon as you pass by the torch, a Flamling will appear. Take down the Flamling and Rakshasa, then collect the Earth Rakshasa Spirit. After this, open the chest and collect Celestial Ribbon and a Mind Core.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character approaching an Earth Rakshasa enemy, highlighted with a red dashed circle for emphasis. The scene is set in a dark, rocky environment illuminated by lava and a decorative torch-like structure on the right. This encounter is part of the walkthrough's narrative, where the player must defeat the Earth Rakshasa to collect its Spirit and loot a nearby chest containing a Celestial Ribbon and a Mind Core."
}