{
    "chunk_id": 617166644213,
    "source_file": "Hundred-Eyed_Daoist_Master.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c2/Wukong_YellowFlower_84.jpg",
    "alt_text": "Wukong YellowFlower 84.jpg",
    "position_desc": 21,
    "img_above_text": "![Wukong YellowFlower 85.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bb/Wukong_YellowFlower_85.jpg)\nHe'll also constantly end his three electric talismans out to distract you. Sometimes he'll shoot them straight out with a punch to add damage with a blast, but he can also hold them in front of him to create an even bigger blast, or send it around his back to slam down with his tail.",
    "img_below_text": "These attacks can be followed up often by him raising up on his claws while holding his electric orb high. After a moment, he'll slam everything down to create a massive shockwave that you need to either run from, or dodge at just the right moment (your Pillar Stance won't save you here). The good news is this blast leaves him very vulnerable for several moments afterward, once you get the dodge timing down.\n![Wukong YellowFlower 83.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ee/Wukong_YellowFlower_83.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong YellowFlower 85.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bb/Wukong_YellowFlower_85.jpg)\nHe'll also constantly end his three electric talismans out to distract you. Sometimes he'll shoot them straight out with a punch to add damage with a blast, but he can also hold them in front of him to create an even bigger blast, or send it around his back to slam down with his tail.\"\n        - Following Text: \"These attacks can be followed up often by him raising up on his claws while holding his electric orb high. After a moment, he'll slam everything down to create a massive shockwave that you need to either run from, or dodge at just the right moment (your Pillar Stance won't save you here). The good news is this blast leaves him very vulnerable for several moments afterward, once you get the dodge timing down.\n![Wukong YellowFlower 83.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ee/Wukong_YellowFlower_83.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dramatic boss battle scene from *Black Myth: Wukong*, featuring the \"Hundred Eyed Daoist Master.\" The monstrous boss, resembling a centipede-like creature with humanoid features, is shown towering over the player character amidst a chaotic environment filled with glowing debris and floating rocks. This moment aligns with the guide's description of the boss's powerful electric attacks and shockwave mechanics, emphasizing the need for precise dodging and exploiting its vulnerability after the shockwave attack."
}