{
    "chunk_id": 781640370480,
    "source_file": "Valley_of_Ecstasy_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/cc/Wukong_Longevity_16.jpg",
    "alt_text": "Wukong Longevity 16.jpg",
    "position_desc": 112,
    "img_above_text": "Defeating the pair is no easy attacks when you consider their hit-and-run tactics, so you may need to even the odds with A Pluck of Many Spell, or use a combination of Cloud Step and Immobilize to isolate and focus fire one of the Falcons, and then take out the second.\nLongevity Road Luojia Fragrant Vine",
    "img_below_text": "Once you have the vine, take the upper path back toward the Longevity Road Shrine, where you'll encounter a two Crow Diviners - one up on a ledge to lure you, and a friend hiding in the bushes nearby.\n![Wukong Longevity 17.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2e/Wukong_Longevity_17.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Defeating the pair is no easy attacks when you consider their hit-and-run tactics, so you may need to even the odds with A Pluck of Many Spell, or use a combination of Cloud Step and Immobilize to isolate and focus fire one of the Falcons, and then take out the second.\nLongevity Road Luojia Fragrant Vine\"\n        - Following Text: \"Once you have the vine, take the upper path back toward the Longevity Road Shrine, where you'll encounter a two Crow Diviners - one up on a ledge to lure you, and a friend hiding in the bushes nearby.\n![Wukong Longevity 17.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2e/Wukong_Longevity_17.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a snowy forest setting from *Black Myth: Wukong*, where the player character, armed with a staff, faces an enemy positioned on a ledge. This scene aligns with the guide's description of encountering a Crow Diviner on a ledge, with another hidden nearby. The gameplay interface shows health, abilities, and \"Will\" resource, emphasizing preparation for combat in this challenging encounter."
}