{
    "chunk_id": 988539067964,
    "source_file": "Hundred-Eyed_Daoist_Master.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9f/Wukong_YellowFlower_80.jpg",
    "alt_text": "Wukong YellowFlower 80.jpg",
    "position_desc": 17,
    "img_above_text": "Despite this, the new phase won't actually begin until he grabs his sword again and charges at you, twisting his tail to slam down on you, and following up with two slow sword swings. Only then will a short cutscene play, and his true curse comes into play.\nAt this point, he'll no longer use his sword, focusing entirely on his electric fists and tail, and somehow dealing even more damage in the process. To make matters worse, he'll massively reduce your maximum stamina while in this golden dome.",
    "img_below_text": "To free yourself, you'll need to use the Weaver's Needle Vessel. It will take a moment to work so be prepared to dodge his next attack while the needle begins to shoot all around him.\n![Wukong YellowFlower 81.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/af/Wukong_YellowFlower_81.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Despite this, the new phase won't actually begin until he grabs his sword again and charges at you, twisting his tail to slam down on you, and following up with two slow sword swings. Only then will a short cutscene play, and his true curse comes into play.\nAt this point, he'll no longer use his sword, focusing entirely on his electric fists and tail, and somehow dealing even more damage in the process. To make matters worse, he'll massively reduce your maximum stamina while in this golden dome.\"\n        - Following Text: \"To free yourself, you'll need to use the Weaver's Needle Vessel. It will take a moment to work so be prepared to dodge his next attack while the needle begins to shoot all around him.\n![Wukong YellowFlower 81.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/af/Wukong_YellowFlower_81.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight scene from the game *Black Myth: Wukong*, where the player faces an enemy in a golden dome environment. The boss, now without its sword, is using electrically charged fists and tail attacks, significantly reducing the player's maximum stamina. The player must use the Weaver's Needle Vessel to counter the boss's curse while evading its powerful attacks. The HUD shows the player's health, stamina, and abilities, emphasizing the intense and strategic nature of the encounter."
}