{
    "chunk_id": 265645959954,
    "source_file": "Agate_Jar.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4b/Agate_Jar_2.jpg",
    "alt_text": "Agate Jar 2.jpg",
    "position_desc": 1,
    "img_above_text": "The Agate Jar is one of the Curios items you can find throughout Black Myth: Wukong. It is one of the strongest early-game Curios' thanks to its effect.\nWith the Agate Jar equipped, you will get a flat-out, moderate defense buff, which is incredibly useful early on in the game.",
    "img_below_text": "The Curios items in Black Myth: Wukong can't be upgraded, so you can't enhance their buffs in any way. Therefore, if you find a better item for your build, you will want to switch the items out as soon as you can.\n## Black Myth: Wukong Agate Jar Location",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Agate Jar is one of the Curios items you can find throughout Black Myth: Wukong. It is one of the strongest early-game Curios' thanks to its effect.\nWith the Agate Jar equipped, you will get a flat-out, moderate defense buff, which is incredibly useful early on in the game.\"\n        - Following Text: \"The Curios items in Black Myth: Wukong can't be upgraded, so you can't enhance their buffs in any way. Therefore, if you find a better item for your build, you will want to switch the items out as soon as you can.\n## Black Myth: Wukong Agate Jar Location\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image showcases the equipment menu in *Black Myth: Wukong*, highlighting the \"Agate Jar,\" a rare Curio item that moderately increases defense. The Agate Jar is described as a valuable early-game item due to its flat defense buff, aiding survivability. The menu also displays other Curios and character stats, emphasizing the item's role in enhancing gameplay strategy."
}