{
    "chunk_id": 850771384644,
    "source_file": "Valley_of_Ecstasy_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b5/Wukong_Longevity_27.jpg",
    "alt_text": "Wukong Longevity 27.jpg",
    "position_desc": 123,
    "img_above_text": "![Wukong Longevity 21.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c6/Wukong_Longevity_21.jpg)\nThe good news is Kalpa-Wave is extremely susceptible to getting knocked down. So long as you build up some focus points with light attacks where possible, you can use your Pillar Stance heavy attack with three focus points built up to send the boss crashing to the ground -- which is the perfect time to Immobilize him on the ground and go wild with Spirit Attacks and Transformations.",
    "img_below_text": "Beyond this, Kalpa-Wave doesn't have too many other variations on his moves, so as long as you avoid those blood pools, you'll be able to cut him down to size, and gain the Spirit of Captain Kalpa-Wave to add to your collection.\nCaptain Kalpa-Wave",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Longevity 21.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c6/Wukong_Longevity_21.jpg)\nThe good news is Kalpa-Wave is extremely susceptible to getting knocked down. So long as you build up some focus points with light attacks where possible, you can use your Pillar Stance heavy attack with three focus points built up to send the boss crashing to the ground -- which is the perfect time to Immobilize him on the ground and go wild with Spirit Attacks and Transformations.\"\n        - Following Text: \"Beyond this, Kalpa-Wave doesn't have too many other variations on his moves, so as long as you avoid those blood pools, you'll be able to cut him down to size, and gain the Spirit of Captain Kalpa-Wave to add to your collection.\nCaptain Kalpa-Wave\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game *Black Myth: Wukong*, where the protagonist, Wukong, stands in a snowy temple courtyard wielding a staff. A glowing golden energy and a red orb are floating mid-air, likely signifying a reward or interaction. The text overlay indicates the acquisition of a \"Mind Core\" material, which may be a collectible or crafting resource. This moment follows a battle with the boss \"Captain Kalpa-Wave,\" as described in the preceding and following text."
}