{
    "chunk_id": 60684720539,
    "source_file": "Webbed_Hollow_-_Lower_Hollow_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ef/Wukong_LowerHollow_55.jpg",
    "alt_text": "Wukong LowerHollow 55.jpg",
    "position_desc": 52,
    "img_above_text": "Fight carefully, and take note of which of his rake attacks swing fast, vs the ones that take time to swing around to dodge at the right times, or have a focus point in reserve to use a Thrust Stance varied combo and get out of his attack range.\nOnce you take off half his health bar, things will get real messy fast. Zhu Bajie will go back to his roots, in a sense, and transform into a giant boar that just can't wait to roll around in the mud with you.",
    "img_below_text": "In this form, he'll start by performing a series of charge attacks after stamping the ground to cause muddy geysers to erupt all around.\n![Wukong LowerHollow 56.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/85/Wukong_LowerHollow_56.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Fight carefully, and take note of which of his rake attacks swing fast, vs the ones that take time to swing around to dodge at the right times, or have a focus point in reserve to use a Thrust Stance varied combo and get out of his attack range.\nOnce you take off half his health bar, things will get real messy fast. Zhu Bajie will go back to his roots, in a sense, and transform into a giant boar that just can't wait to roll around in the mud with you.\"\n        - Following Text: \"In this form, he'll start by performing a series of charge attacks after stamping the ground to cause muddy geysers to erupt all around.\n![Wukong LowerHollow 56.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/85/Wukong_LowerHollow_56.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight scene from *Black Myth: Wukong*, showcasing Zhu Bajie in his transformed giant boar form. The player character is engaged in combat in a muddy battlefield, with Zhu Bajie causing muddy geysers to erupt through ground-stamping attacks. The image highlights the chaotic environment and the intensity of the encounter, with debris and mud flying as part of the boar's aggressive charge attacks."
}