{
    "chunk_id": 381559476234,
    "source_file": "Rat_Sage_Staff.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7f/Wukong_Yellow_56.jpg",
    "alt_text": "Wukong Yellow 56.jpg",
    "position_desc": 2,
    "img_above_text": "## Black Myth: Wukong Rat Sage Staff Location\nThe Rat Sage Staff can be found in Chapter 2 - Yellow Wind Ridge upon defeating Yellow Wind Sage at the end of the chapter. This is a mandatory boss that is at the end of the chapter, so you can't miss him.",
    "img_below_text": "Weapons can be crafted throughout the game from the Shrines throughout the game's six chapters. Crafting weapons will require Will and various Crafting Materials from the game's locales and enemies. To craft the Rat Sage Staff you will need:\n* 1 Samadhi Wind Agate",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Black Myth: Wukong Rat Sage Staff Location\nThe Rat Sage Staff can be found in Chapter 2 - Yellow Wind Ridge upon defeating Yellow Wind Sage at the end of the chapter. This is a mandatory boss that is at the end of the chapter, so you can't miss him.\"\n        - Following Text: \"Weapons can be crafted throughout the game from the Shrines throughout the game's six chapters. Crafting weapons will require Will and various Crafting Materials from the game's locales and enemies. To craft the Rat Sage Staff you will need:\n* 1 Samadhi Wind Agate\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss battle from *Black Myth: Wukong*, where the player character is engaged in combat with the \"Yellow Wind Sage,\" a mandatory boss encountered at the end of Chapter 2 - Yellow Wind Ridge. This fight is significant as defeating the Yellow Wind Sage rewards the player with the Rat Sage Staff, which can later be crafted using specific materials."
}