{
    "chunk_id": 99515454091,
    "source_file": "Crouching_Tiger_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/cb/Wukong_Tiger_7.jpg",
    "alt_text": "Wukong Tiger 7.jpg",
    "position_desc": 11,
    "img_above_text": "This leaping twisting fist slam attack can even come with little warning, as he’ll sometimes yell out while crouching before charging you and jumping into the move.\nHe may also abandon his martial arts stance to quickly dive to the side, and then pounce on you to follow up with two quick downward punches, and a heavy stomp afterwards. Don’t expect much room to fight back during this one unless you can Immobilize or get a charged strike ready to knock him off-balance.",
    "img_below_text": "One major trick the Tiger Vanguard has up his sleeve is the power to turn to stone. He’ll try and bait you into this when spreading his arms wide or crouching down, but try not to take the bait, and use the time to heal, use consumables, or ready a Transformation.\nAt the start, attacking him will prompt him to soak the blow and retaliate with a large punch when he comes out of his stone form. This time can be much better spent charging up your own heavy attack to hit him with the moment he comes out of the form and shakes off the dust.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"This leaping twisting fist slam attack can even come with little warning, as he’ll sometimes yell out while crouching before charging you and jumping into the move.\nHe may also abandon his martial arts stance to quickly dive to the side, and then pounce on you to follow up with two quick downward punches, and a heavy stomp afterwards. Don’t expect much room to fight back during this one unless you can Immobilize or get a charged strike ready to knock him off-balance.\"\n        - Following Text: \"One major trick the Tiger Vanguard has up his sleeve is the power to turn to stone. He’ll try and bait you into this when spreading his arms wide or crouching down, but try not to take the bait, and use the time to heal, use consumables, or ready a Transformation.\nAt the start, attacking him will prompt him to soak the blow and retaliate with a large punch when he comes out of his stone form. This time can be much better spent charging up your own heavy attack to hit him with the moment he comes out of the form and shakes off the dust.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight in a video game against the \"Tiger Vanguard,\" a large, muscular enemy wielding a sword on its back. The player character is engaged in combat in a blood-red pool, with the boss's health bar visible at the bottom of the screen. The context suggests the Tiger Vanguard uses aggressive melee attacks and a stone transformation ability, requiring strategic timing and careful counterattacks to defeat."
}