{
    "chunk_id": 684449938216,
    "source_file": "Secret_Bosses_in_Black_Myth_Wukong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a0/Wukong_Secrets_%281%29.png",
    "alt_text": "Wukong Secrets \\(1\\).png",
    "position_desc": 14,
    "img_above_text": "All of the secret bosses in Chapter 5 can be found in the secret area. This is revealed when the spiked iron ball stops terrorizing you along a path. When you head back along that same path, the flames will have disappeared, and instead, you can go down the Cooling Slope.\n## Mother of Flamlings",
    "img_below_text": "Mother of Flamlings is one of 3 bosses that will drop Samadhi Fire Crystals in Chapter 5. But getting mother's attention requires a delivery. She'll only accept payment in the form of 4 Flame Ores, so get to killing the Flamlings in the area. Once you've handed over the ores, she'll appear from the ground.\nMother of Flamlings",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"All of the secret bosses in Chapter 5 can be found in the secret area. This is revealed when the spiked iron ball stops terrorizing you along a path. When you head back along that same path, the flames will have disappeared, and instead, you can go down the Cooling Slope.\n## Mother of Flamlings\"\n        - Following Text: \"Mother of Flamlings is one of 3 bosses that will drop Samadhi Fire Crystals in Chapter 5. But getting mother's attention requires a delivery. She'll only accept payment in the form of 4 Flame Ores, so get to killing the Flamlings in the area. Once you've handed over the ores, she'll appear from the ground.\nMother of Flamlings\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the \"Mother of Flamlings,\" a boss character in a volcanic or fiery environment, likely encountered in Chapter 5 of the game. The surrounding terrain is rugged and glowing with lava-like heat, emphasizing the fiery theme. This boss is part of a secret area and requires players to deliver 4 Flame Ores to summon her, as mentioned in the guide."
}