{
    "chunk_id": 108311178279,
    "source_file": "Snowhill_Path_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f9/Wukong_Snowhill_29.jpg",
    "alt_text": "Wukong Snowhill 29.jpg",
    "position_desc": 28,
    "img_above_text": "Once he dies, he'll drop the Mountain Patroller Spirit for you to absorb and get all your gourd's health charges back. As an added bonus, you can inspect this other sealed building to find a **Treasure Chest** on the left side, which usually contains a Blood of the Iron Bull and other items.\nAside from a Ginsengling hiding in the ruins nearby, that's it for this route, so return back to the previous platform and head down the sloping path.",
    "img_below_text": "Look for an open covered platform to the left as you descend, and make a quick detour to inspect this area. A Cyan Bat is hiding in the rafters, and after luring it down and defeating it, you can loot one more **Treasure Chest** for an assortment of items.\n![Wukong Snowhill 30.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d3/Wukong_Snowhill_30.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Once he dies, he'll drop the Mountain Patroller Spirit for you to absorb and get all your gourd's health charges back. As an added bonus, you can inspect this other sealed building to find a **Treasure Chest** on the left side, which usually contains a Blood of the Iron Bull and other items.\nAside from a Ginsengling hiding in the ruins nearby, that's it for this route, so return back to the previous platform and head down the sloping path.\"\n        - Following Text: \"Look for an open covered platform to the left as you descend, and make a quick detour to inspect this area. A Cyan Bat is hiding in the rafters, and after luring it down and defeating it, you can loot one more **Treasure Chest** for an assortment of items.\n![Wukong Snowhill 30.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d3/Wukong_Snowhill_30.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a snowy environment in a video game, where the player character approaches a wooden platform with a highlighted **Treasure Chest** (marked with a red circle) on the left side. This area appears to be part of a sloping path, as described in the walkthrough, and is likely the location where players can loot items after defeating a hidden Cyan Bat in the rafters. The setting features detailed structures, such as wooden beams, stone pillars, and hanging bells, contributing to the atmospheric design of the game."
}