{
    "chunk_id": 737272663941,
    "source_file": "Green-Capped_Martialist.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4e/Wukong_Martial_9.jpg",
    "alt_text": "Wukong Martial 9.jpg",
    "position_desc": 15,
    "img_above_text": "![Wukong Martial 8.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/aa/Wukong_Martial_8.jpg)\nIf you see pretend to vanish but reappear in the same spot, be ready for two clones to appear on either side of him, and they'll all toss their chakram wheels at you all at once that can be difficult to evade quickly.",
    "img_below_text": "The Martialist can also deflect your blows if you attempt to hit him with an extended light attack combo, holding his weapon out in front of him, and will then vanish to appear to the side of you to counter (but you can also turn the tables on him by being ready with a Rock Solid of your own).\n![Wukong Martial 10.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/22/Wukong_Martial_10.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Martial 8.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/aa/Wukong_Martial_8.jpg)\nIf you see pretend to vanish but reappear in the same spot, be ready for two clones to appear on either side of him, and they'll all toss their chakram wheels at you all at once that can be difficult to evade quickly.\"\n        - Following Text: \"The Martialist can also deflect your blows if you attempt to hit him with an extended light attack combo, holding his weapon out in front of him, and will then vanish to appear to the side of you to counter (but you can also turn the tables on him by being ready with a Rock Solid of your own).\n![Wukong Martial 10.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/22/Wukong_Martial_10.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat encounter with the \"Green-Capped Martialist\" in *Black Myth: Wukong*. The enemy is shown wielding a large chakram-like weapon, likely mid-attack, surrounded by fiery effects. The preceding and following text describe the Martialist's combat tactics, including creating clones to throw chakram wheels simultaneously and deflecting extended light attack combos to counter. The image visually complements these descriptions by showcasing the Martialist in action during a challenging phase of the fight."
}