{
    "chunk_id": 188397477,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f0/Wukong_Fright_10.jpg",
    "alt_text": "Wukong Fright 10.jpg",
    "position_desc": 11,
    "img_above_text": "![Wukong Fright 9.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c4/Wukong_Fright_9.jpg)\nHead past the ranged attacker above (note the Aged Ginseng on the left is actually a Ginsengling), and go through a doorway to spy a large cave entrance up ahead. Stick to the right to find a sloping path back, and a new stony enemy variant will burrow out of the ground.",
    "img_below_text": "Palestones, like Pitstones, are durable bulky enemies who will try to spin and bash into you with their sharp quartz shells to deal a lot of damage. Even worse, they’ll shake violently to shoot quartz projectiles out around them, and then target you even at a distance. Luckily, a charged hardy smack can severely wound them, so keep your distance and strafe until charged to cut them down to size.\n![Wukong Fright 11.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9a/Wukong_Fright_11.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Fright 9.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c4/Wukong_Fright_9.jpg)\nHead past the ranged attacker above (note the Aged Ginseng on the left is actually a Ginsengling), and go through a doorway to spy a large cave entrance up ahead. Stick to the right to find a sloping path back, and a new stony enemy variant will burrow out of the ground.\"\n        - Following Text: \"Palestones, like Pitstones, are durable bulky enemies who will try to spin and bash into you with their sharp quartz shells to deal a lot of damage. Even worse, they’ll shake violently to shoot quartz projectiles out around them, and then target you even at a distance. Luckily, a charged hardy smack can severely wound them, so keep your distance and strafe until charged to cut them down to size.\n![Wukong Fright 11.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9a/Wukong_Fright_11.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat encounter in *Black Myth: Wukong*, showcasing the player character battling a stony enemy variant, likely a Palestone. The enemy has a bulky quartz-like shell and appears to be attacking with a spinning or bashing motion, while the player counters with a fiery weapon strike. This scene aligns with the guide's description of the Palestone's aggressive behavior and vulnerabilities, emphasizing the importance of charged attacks to defeat them."
}