{
    "chunk_id": 371512143286,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0f/Furnace_Valley_Walkthrough_%2819%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(19\\).png",
    "position_desc": 8,
    "img_above_text": "### A Note on Flamlings\nFlamings will drop Flame Ores, which are an important item needed for a secret boss later on in the Chapter, so be sure to tackle each Flamling you find.",
    "img_below_text": "Go for the one on the left first, then continue straight up. Another Flamling will emerge as you tackle this first one, so head for this one straight after. If you keep pushing forward, another batch of Flamlings will emerge, so we'd recommend taking them all down before you head over to the left side of the room and hop into the stream of lava.\n![Furnace Valley Walkthrough \\(22\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a5/Furnace_Valley_Walkthrough_%2822%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"### A Note on Flamlings\nFlamings will drop Flame Ores, which are an important item needed for a secret boss later on in the Chapter, so be sure to tackle each Flamling you find.\"\n        - Following Text: \"Go for the one on the left first, then continue straight up. Another Flamling will emerge as you tackle this first one, so head for this one straight after. If you keep pushing forward, another batch of Flamlings will emerge, so we'd recommend taking them all down before you head over to the left side of the room and hop into the stream of lava.\n![Furnace Valley Walkthrough \\(22\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a5/Furnace_Valley_Walkthrough_%2822%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a section of a volcanic environment, likely from the \"Furnace Valley\" area in the game. It highlights a path through a lava-filled terrain with a red-dashed circle marking the location of a Flamling enemy and a red arrow indicating the direction to proceed. The image serves as a visual aid to guide players in tackling Flamlings and navigating the area, as described in the accompanying walkthrough text."
}