{
    "chunk_id": 904708534212,
    "source_file": "New_Thunderclap_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f1/Wukong_Thunderclap_70.jpg",
    "alt_text": "Wukong Thunderclap 70.jpg",
    "position_desc": 69,
    "img_above_text": "Even his single attack can deal big damage if you aren't ready for their relatively fast speed. He may feint his blade in an upward swing, before launching himself high into the air and crash down with an overhand swing.\nWatch his movements carefully to see if he goes back to his default positioning. If he comes out of the jump attack by pulling his blade around with him, he'll follow up with two spinning slashes that need to be avoided to deflected to stop him in his tracks.",
    "img_below_text": "The one thing his powered up gauntlet isn't great at deflecting is Transformation attacks -- both from Spirits and Spells. The Ashen Slumber in particular is a good bet, as the Rat Captain has a very long evasive dash, and you can breath fire on him that can't be blocked, nor can your Fiery Burst detonation.\nTime your attacks well to find the gaps in his defenses, and remember to cultivate your Spirits and upgrade your Transformation Spell abilities as needed. When Non-Pure is finally defeated, you'll be able to absorb the last disciples spirit, the Non-Pure Spirit.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Even his single attack can deal big damage if you aren't ready for their relatively fast speed. He may feint his blade in an upward swing, before launching himself high into the air and crash down with an overhand swing.\nWatch his movements carefully to see if he goes back to his default positioning. If he comes out of the jump attack by pulling his blade around with him, he'll follow up with two spinning slashes that need to be avoided to deflected to stop him in his tracks.\"\n        - Following Text: \"The one thing his powered up gauntlet isn't great at deflecting is Transformation attacks -- both from Spirits and Spells. The Ashen Slumber in particular is a good bet, as the Rat Captain has a very long evasive dash, and you can breath fire on him that can't be blocked, nor can your Fiery Burst detonation.\nTime your attacks well to find the gaps in his defenses, and remember to cultivate your Spirits and upgrade your Transformation Spell abilities as needed. When Non-Pure is finally defeated, you'll be able to absorb the last disciples spirit, the Non-Pure Spirit.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat scene from a video game where the player is battling an enemy named \"Non-Pure.\" The enemy is engulfed in flames, likely from the player's use of the \"Fiery Burst\" spell, which deals area damage and triggers a de-transformation. The text on the left outlines the player's available attacks, including \"Chop Wood,\" \"Blow Fire,\" and \"Fiery Burst,\" emphasizing the strategic use of fire-based abilities. This encounter highlights the importance of timing attacks and exploiting gaps in the enemy's defenses, as described in the preceding and following text."
}