{
    "chunk_id": 207736259434,
    "source_file": "Crouching_Tiger_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/38/Wukong_Tiger_1.jpg",
    "alt_text": "Wukong Tiger 1.jpg",
    "position_desc": 2,
    "img_above_text": "Exiting the tunnels of the Valley of Despair and fending off a few Swift Bats, you’ll spot the imposing Crouching Tiger Temple down a narrow canyon. There’s some **Aged Ginseng** and **Licorice** to harvest along the path, but beyond that there isn’t much to worry about in terms of enemies.\n### Temple Entrance",
    "img_below_text": "After resting at the Shrine at the foot the temple, head up its foreboding steps into the temple’s front gate. The path is strewn with the meat of many a Rat Guai sacrifice — a sacrifice to whom you’ll soon find out.\n![Wukong Tiger 2.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/96/Wukong_Tiger_2.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Exiting the tunnels of the Valley of Despair and fending off a few Swift Bats, you’ll spot the imposing Crouching Tiger Temple down a narrow canyon. There’s some **Aged Ginseng** and **Licorice** to harvest along the path, but beyond that there isn’t much to worry about in terms of enemies.\n### Temple Entrance\"\n        - Following Text: \"After resting at the Shrine at the foot the temple, head up its foreboding steps into the temple’s front gate. The path is strewn with the meat of many a Rat Guai sacrifice — a sacrifice to whom you’ll soon find out.\n![Wukong Tiger 2.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/96/Wukong_Tiger_2.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the entrance to the Crouching Tiger Temple, a key location in the game. The scene features two imposing tiger-like statues flanking a stone staircase that leads into the temple, with the player character holding a staff in the foreground. The dim lighting and worn architecture emphasize the temple's ancient and foreboding atmosphere, aligning with the narrative's buildup to an encounter with a mysterious entity inside."
}