{
    "chunk_id": 792184231035,
    "source_file": "Lang-Li-Guhh-Baw.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fe/Wukong_Sandgate_14.jpg",
    "alt_text": "Wukong Sandgate 14.jpg",
    "position_desc": 2,
    "img_above_text": "### Lang-Li-Guhh-Baw Mini-Boss Fight and Guide\nThe frog in question is the one you may have seen from the pond earlier, down in a large flooded pit nearby. While he has much in common with the other optional frog boss from Black Wind Mountain, he’s got a few new attacks you’ll need to prepare for.",
    "img_below_text": "This particular boss is infused with the power of lightning, and like the Rat Governor you faced, he’ll try to shock you repeatedly until you suffer from a debuff that increases all your damage taken. Luckily, the Shrine’s shop sells a few Shock-Quelling Powder if you find yourself struggling to survive from these attacks.\n![Wukong Sandgate 15.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/89/Wukong_Sandgate_15.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"### Lang-Li-Guhh-Baw Mini-Boss Fight and Guide\nThe frog in question is the one you may have seen from the pond earlier, down in a large flooded pit nearby. While he has much in common with the other optional frog boss from Black Wind Mountain, he’s got a few new attacks you’ll need to prepare for.\"\n        - Following Text: \"This particular boss is infused with the power of lightning, and like the Rat Governor you faced, he’ll try to shock you repeatedly until you suffer from a debuff that increases all your damage taken. Luckily, the Shrine’s shop sells a few Shock-Quelling Powder if you find yourself struggling to survive from these attacks.\n![Wukong Sandgate 15.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/89/Wukong_Sandgate_15.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character standing on a wooden platform overlooking a fenced area near a shallow pond, where the Lang-Li-Guhh-Baw mini-boss, a large frog-like creature, is visible. The setting appears to be a rocky, arid environment, and the text overlay warns the player about the dangers of the area, emphasizing the need for preparation, such as carrying healing items. This scene sets the stage for the upcoming boss fight described in the guide."
}