{
    "chunk_id": 554734229660,
    "source_file": "Bitter_Lake_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/31/Wukong_Turtle_36.jpg",
    "alt_text": "Wukong Turtle 36.jpg",
    "position_desc": 34,
    "img_above_text": "Several of his moves have also been improved. His electric palm strike for instance now causes several lightning strikes in front of him, up from just a single blast, requiring you to dodge around to his sides instead of backward.\nIf he begins to hold his sword back while pointing at you, the air will crackle around him preventing you from getting close, and his two-handed sword swing will also unleash an electric projectile slash you'll need to evade.",
    "img_below_text": "The good news is that his blade won't stay enchanted forever, often ending with the previously mentioned attack. Once you no longer see electricity crackling along his blade, that's your cue to go back to pressing the attack by getting in staggering blows.\n![Wukong Turtle 34.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/75/Wukong_Turtle_34.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Several of his moves have also been improved. His electric palm strike for instance now causes several lightning strikes in front of him, up from just a single blast, requiring you to dodge around to his sides instead of backward.\nIf he begins to hold his sword back while pointing at you, the air will crackle around him preventing you from getting close, and his two-handed sword swing will also unleash an electric projectile slash you'll need to evade.\"\n        - Following Text: \"The good news is that his blade won't stay enchanted forever, often ending with the previously mentioned attack. Once you no longer see electricity crackling along his blade, that's your cue to go back to pressing the attack by getting in staggering blows.\n![Wukong Turtle 34.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/75/Wukong_Turtle_34.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dramatic moment from the game *Black Myth: Wukong*, showcasing the protagonist facing off against an enemy named \"Cyan Loong\" in a snowy battlefield. The enemy appears to unleash a powerful electric projectile slash, as described in the preceding text, which aligns with the visual of a glowing, wide-reaching energy attack. This highlights the need for players to evade such attacks strategically, as suggested in the guide."
}