{
    "chunk_id": 548290025289,
    "source_file": "Chapter_2_Secret_-_Kingdom_of_Sahali_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1e/Wukong_Sahali_22.jpg",
    "alt_text": "Wukong Sahali 22.jpg",
    "position_desc": 22,
    "img_above_text": "Tiger Vanguard (Kingdom of Sahali)\n## Sandgate Bound",
    "img_below_text": "Past the Tiger Vanguard, you’ll find a pretty staggeringly big open desert landscape for a Secret Area. There’s not as much to do as it may look like, but there are a few secrets worth picking up before talking to the big guy on the cliff.\n![Wukong Sahali 23.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/ca/Wukong_Sahali_23.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Tiger Vanguard (Kingdom of Sahali)\n## Sandgate Bound\"\n        - Following Text: \"Past the Tiger Vanguard, you’ll find a pretty staggeringly big open desert landscape for a Secret Area. There’s not as much to do as it may look like, but there are a few secrets worth picking up before talking to the big guy on the cliff.\n![Wukong Sahali 23.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/ca/Wukong_Sahali_23.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a character standing in a vast desert landscape within the Kingdom of Sahali, as referenced in the preceding and following text. A towering pagoda-like structure is visible in the distance, along with a large statue in the foreground. The scene sets the stage for exploration in a secret area, where players can uncover hidden items before interacting with a significant NPC located on a cliff."
}