{
    "chunk_id": 387107043018,
    "source_file": "Webbed_Hollow_-_Lower_Hollow_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f9/Wukong_LowerHollow_3.jpg",
    "alt_text": "Wukong LowerHollow 3.jpg",
    "position_desc": 3,
    "img_above_text": "Before you drop down the ledge after crossing the corpse of the boss, look for a little ledge leading left, leading to a small cliff area with a small golden pot that contains a **Celestial Taiyi Pill** , increasing your maximum mana.\nThe Webbed Hollow Taiyi Pill",
    "img_below_text": "Now drop down from the body to reach a lower level, where right away you'll be presented with two paths: To the right is a rock bridge lined with a few stone lanterns that leads to the heart of the Lower Hollow, and the main boss. However, there's also a ledge to drop down on the left, which will take you to an optional and lucrative area across a rope bridge, and it helpfully loops back around to drop you back off at this spot.\n![Wukong LowerHollow 4.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/72/Wukong_LowerHollow_4.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Before you drop down the ledge after crossing the corpse of the boss, look for a little ledge leading left, leading to a small cliff area with a small golden pot that contains a **Celestial Taiyi Pill** , increasing your maximum mana.\nThe Webbed Hollow Taiyi Pill\"\n        - Following Text: \"Now drop down from the body to reach a lower level, where right away you'll be presented with two paths: To the right is a rock bridge lined with a few stone lanterns that leads to the heart of the Lower Hollow, and the main boss. However, there's also a ledge to drop down on the left, which will take you to an optional and lucrative area across a rope bridge, and it helpfully loops back around to drop you back off at this spot.\n![Wukong LowerHollow 4.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/72/Wukong_LowerHollow_4.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character navigating a web-covered cavern in *Black Myth: Wukong*. Two red arrows highlight diverging paths: one leading downward to a lower level on the left, and another heading forward to the right. This scene corresponds to the guide's description of a choice between progressing toward the main boss via a rock bridge or exploring an optional area across a rope bridge. The setting emphasizes exploration and decision-making in the game's Lower Hollow region."
}