{
    "chunk_id": 69897336521,
    "source_file": "Field_of_Fire_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/24/Field_Fire_Walkthrough_%288%29.png",
    "alt_text": "Field Fire Walkthrough \\(8\\).png",
    "position_desc": 7,
    "img_above_text": "Once you've beaten him, be sure to collect the Nine-Capped Lingzhi Guai Spirit that he leaves behind.\nNine-Capped Lingzhi Guai",
    "img_below_text": "Just beyond the clearing where you'll fight the Nine-Capped Lingzhi Guai, you'll also find The Crag Meditation Spot. You can get this before or after the fight. Just before it, there's another Purple Lingzhi that can be harvested -- don't worry, this won't be another enemy.\nThe Crag, Ashen Pass III Meditation Spot",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Once you've beaten him, be sure to collect the Nine-Capped Lingzhi Guai Spirit that he leaves behind.\nNine-Capped Lingzhi Guai\"\n        - Following Text: \"Just beyond the clearing where you'll fight the Nine-Capped Lingzhi Guai, you'll also find The Crag Meditation Spot. You can get this before or after the fight. Just before it, there's another Purple Lingzhi that can be harvested -- don't worry, this won't be another enemy.\nThe Crag, Ashen Pass III Meditation Spot\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a rocky, desolate area with a player character approaching a glowing marker in the distance, likely indicating \"The Crag Meditation Spot\" mentioned in the following text. In the foreground, a large red mushroom-like object, possibly the \"Purple Lingzhi,\" is visible and can be harvested. This scene appears to guide players on their next objectives after defeating the Nine-Capped Lingzhi Guai."
}