{
    "chunk_id": 571351213115,
    "source_file": "Tiger_Vanguard.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/59/Wukong_Tiger_21.jpg",
    "alt_text": "Wukong Tiger 21.jpg",
    "position_desc": 19,
    "img_above_text": "![Wukong Tiger 20.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bc/Wukong_Tiger_20.jpg)\nWhen at last the Tiger Vanguard is finally beaten by your attacks, he’ll turn to stone and crumble away. The headless musician will reappear, and return Sun Wukong’s legendary stone form back to the Destined One, giving you the **Rock Solid Spell**! This is your one big defensive parry, taking the place of Cloud Step to completely negate and incoming attack when timed right, and will stagger the enemy to open them up for attack.",
    "img_below_text": "Defeating the Tiger Vanguard will award you a Mind Core, and the Keeness of Tiger, the second Key Item needed along with the Sterness of Stone to finally open the big stone doors in this chapter that lead to the final boss. In fact, there’s one of those tallies in this very arena that can open up a secret path!",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Tiger 20.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bc/Wukong_Tiger_20.jpg)\nWhen at last the Tiger Vanguard is finally beaten by your attacks, he’ll turn to stone and crumble away. The headless musician will reappear, and return Sun Wukong’s legendary stone form back to the Destined One, giving you the **Rock Solid Spell**! This is your one big defensive parry, taking the place of Cloud Step to completely negate and incoming attack when timed right, and will stagger the enemy to open them up for attack.\"\n        - Following Text: \"Defeating the Tiger Vanguard will award you a Mind Core, and the Keeness of Tiger, the second Key Item needed along with the Sterness of Stone to finally open the big stone doors in this chapter that lead to the final boss. In fact, there’s one of those tallies in this very arena that can open up a secret path!\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game *Black Myth: Wukong*, where the player character stands before a large stone structure with intricate carvings, preparing to interact with a statue or pedestal labeled \"Examine.\" This moment likely follows the defeat of the Tiger Vanguard and the acquisition of key items, as described in the preceding and following text, and may involve progressing the narrative or unlocking a new path. The on-screen notification indicates that a \"New Yaoguai King Anecdote\" has been recorded, suggesting additional lore or story content."
}