{
    "chunk_id": 842476713417,
    "source_file": "Secret_Bosses_in_Black_Myth_Wukong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fd/How_to_Unlock_Purple_Magic_Seals_%288%29.png",
    "alt_text": "How to Unlock Purple Magic Seals \\(8\\).png",
    "position_desc": 5,
    "img_above_text": "Chapter 3 will have you finding secret areas, bringing together NPCs and continuing to take down the Loongs. Here are all the secret bosses you can encounter.\n## Captain Lotus-Vision",
    "img_below_text": "When you get to the Pagoda Realm, you'll climb the pagoda to reach the top. Opposite the Upper Pagoda Shrine, you can drop down into a pit to find Captain Lotus-Vision. Beating the Captain is essential if you want to unlock those purple seals.\nCaptain Lotus-Vision",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Chapter 3 will have you finding secret areas, bringing together NPCs and continuing to take down the Loongs. Here are all the secret bosses you can encounter.\n## Captain Lotus-Vision\"\n        - Following Text: \"When you get to the Pagoda Realm, you'll climb the pagoda to reach the top. Opposite the Upper Pagoda Shrine, you can drop down into a pit to find Captain Lotus-Vision. Beating the Captain is essential if you want to unlock those purple seals.\nCaptain Lotus-Vision\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts Captain Lotus-Vision, a secret boss in Chapter 3 of a video game. The character is surrounded by glowing purple energy and appears in a dark, ornate setting with statues in the background. According to the context, Captain Lotus-Vision can be found in the Pagoda Realm by dropping into a pit near the Upper Pagoda Shrine. Defeating this boss is crucial for unlocking purple seals in the game."
}