{
    "chunk_id": 352493248553,
    "source_file": "Pagoda_Realm_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f7/Wukong_Pagoda_112.jpg",
    "alt_text": "Wukong Pagoda 112.jpg",
    "position_desc": 108,
    "img_above_text": "![Wukong Pagoda 111.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f9/Wukong_Pagoda_111.jpg)\nAs you head up the right side of this field just past where the Yaksha Patroller was, be ready for another Falcon enemy to swoop down between two small gnarled trees. Like the one at the top of the Mani Wheel, he'll attack at range with projectile slices, divebomb you with forward spins, or create tornado gusts to keep you at bay.",
    "img_below_text": "Another Falcon Guai will appear not far up on the left side between two much larger trees, but apart from these enemies the rest of this sloping forest is largely devoid of enemies. Be sure to check behind the trees where he appeared to absorb another green Wisp.\nYou can find a path continuing at the top of the slope off to the right, past another Golden Lotus Guai.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Pagoda 111.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f9/Wukong_Pagoda_111.jpg)\nAs you head up the right side of this field just past where the Yaksha Patroller was, be ready for another Falcon enemy to swoop down between two small gnarled trees. Like the one at the top of the Mani Wheel, he'll attack at range with projectile slices, divebomb you with forward spins, or create tornado gusts to keep you at bay.\"\n        - Following Text: \"Another Falcon Guai will appear not far up on the left side between two much larger trees, but apart from these enemies the rest of this sloping forest is largely devoid of enemies. Be sure to check behind the trees where he appeared to absorb another green Wisp.\nYou can find a path continuing at the top of the slope off to the right, past another Golden Lotus Guai.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a snowy forest environment from the game *Black Myth: Wukong*. The player character, armed with a staff, is engaged in combat with a Falcon enemy swooping down from above. The Falcon Guai is highlighted with a health bar, indicating it as a hostile entity. The scene aligns with the preceding and following text, which describes encounters with Falcon enemies in this sloping forest area, emphasizing their ranged and aerial attacks. The image serves to illustrate this specific combat scenario and the game's atmospheric setting."
}