{
    "chunk_id": 700030332035,
    "source_file": "Chapter_2_Secret_-_Kingdom_of_Sahali_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c1/Wukong_Fright_34.jpg",
    "alt_text": "Wukong Fright 34.jpg",
    "position_desc": 3,
    "img_above_text": "In this large open field, you’ll find a friendly boar-like Guai resting on a rock. He’s apparently extremely inebriated, and needs you to help him find something to sober him up. He’ll mention “Windrest” if you talk to him again, providing a clue to where you can find such an ingredient.\nThere are two ways to get the item required:",
    "img_below_text": "* If you complete the Man-in-Stone’s questline, you’ll find that the Man-in-Stone sells a **Sobering Stone** if you don’t want to explore.\n![Wukong Yellow 10.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/13/Wukong_Yellow_10.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"In this large open field, you’ll find a friendly boar-like Guai resting on a rock. He’s apparently extremely inebriated, and needs you to help him find something to sober him up. He’ll mention “Windrest” if you talk to him again, providing a clue to where you can find such an ingredient.\nThere are two ways to get the item required:\"\n        - Following Text: \"* If you complete the Man-in-Stone’s questline, you’ll find that the Man-in-Stone sells a **Sobering Stone** if you don’t want to explore.\n![Wukong Yellow 10.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/13/Wukong_Yellow_10.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game *Black Myth: Wukong*, showing the protagonist holding a staff and standing in a rocky area with tall grass, near a glowing blue object resembling a treasure. In the background, a lit brazier and carved statues are visible. The text overlay reads, \"Ye are surely a gullible one! I’ve finally got me hands on the treasure!\" This suggests a narrative moment involving deception or trickery, possibly tied to the questline mentioned in the preceding text about helping the inebriated Guai."
}