{
    "chunk_id": 556717315436,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a1/Wukong_Fright_41.jpg",
    "alt_text": "Wukong Fright 41.jpg",
    "position_desc": 40,
    "img_above_text": "![Wukong Fright 40.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e7/Wukong_Fright_40.jpg)\nUp the stairs, a Spearbone with shield guards a spot with a large waterfall of sand. The Spearbone is tougher than average, because defeating him will allow you to claim the Spearbone Spirit to add to your arsenal of transformation attacks! Just beware of his roar that preludes a frenzied combo of spear swings and slams, and use your Immobilize or Cloud Step to skirt around his defenses and attack him instead of his shield.",
    "img_below_text": "Taking a closer look at the sandfall behind this enemy, you’ll find that its actually a magic barrier that can be dispelled, but only if you were able to crack the wall near the First Prince of Flowing Sand and find the Loong Scales. Once you have them, you’ll be able to interact with the sandfall and remove it, opening a door to a very tough secret boss fight - the Black Loong. Due to its difficulty, and some ways to make the fight easier you’ll unlock later, we recommend saving him for later.\n![Wukong Fright 39.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7e/Wukong_Fright_39.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Fright 40.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e7/Wukong_Fright_40.jpg)\nUp the stairs, a Spearbone with shield guards a spot with a large waterfall of sand. The Spearbone is tougher than average, because defeating him will allow you to claim the Spearbone Spirit to add to your arsenal of transformation attacks! Just beware of his roar that preludes a frenzied combo of spear swings and slams, and use your Immobilize or Cloud Step to skirt around his defenses and attack him instead of his shield.\"\n        - Following Text: \"Taking a closer look at the sandfall behind this enemy, you’ll find that its actually a magic barrier that can be dispelled, but only if you were able to crack the wall near the First Prince of Flowing Sand and find the Loong Scales. Once you have them, you’ll be able to interact with the sandfall and remove it, opening a door to a very tough secret boss fight - the Black Loong. Due to its difficulty, and some ways to make the fight easier you’ll unlock later, we recommend saving him for later.\n![Wukong Fright 39.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7e/Wukong_Fright_39.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a large sandfall, which serves as a magical barrier in *Black Myth: Wukong*. This barrier is located behind a Spearbone enemy and blocks access to a secret area. To dispel the sandfall, players must first locate the Loong Scales by breaking a wall near the First Prince of Flowing Sand. Removing the barrier reveals a hidden door leading to a challenging secret boss fight, the Black Loong."
}