{
    "chunk_id": 604522424136,
    "source_file": "Best_Spirits_to_Use.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a3/Best_Spirits_%281%29.png",
    "alt_text": "Best Spirits \\(1\\).png",
    "position_desc": 5,
    "img_above_text": "It's a fairly simple attack that the Tiger's Acolyte offers, but Sharp Edge is a quick hack-and-slash move that can deal a chunk of damage. In addition to the move, you'll also gain a moderate increase in Critical Damage, so using it at the right time can be a powerful attack. As another added bonus, the Qi cost of using Tiger's Acolyte is moderate, while most others are high.\n### Blade Monk",
    "img_below_text": "The Slaughter attack the Blade Monk can pull out allows you to swing a huge greatsword twice and then smash it down on a foe. You'll also get a moderate attack buff as soon as you've taken down an enemy.\n### Non-White",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"It's a fairly simple attack that the Tiger's Acolyte offers, but Sharp Edge is a quick hack-and-slash move that can deal a chunk of damage. In addition to the move, you'll also gain a moderate increase in Critical Damage, so using it at the right time can be a powerful attack. As another added bonus, the Qi cost of using Tiger's Acolyte is moderate, while most others are high.\n### Blade Monk\"\n        - Following Text: \"The Slaughter attack the Blade Monk can pull out allows you to swing a huge greatsword twice and then smash it down on a foe. You'll also get a moderate attack buff as soon as you've taken down an enemy.\n### Non-White\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an in-game character from a video game, displayed in the \"Equipment\" menu interface. The character appears to be equipped with a weapon, likely relevant to the combat abilities described in the preceding and following text, such as \"Sharp Edge\" for the Tiger's Acolyte or \"Slaughter\" for the Blade Monk. The interface includes navigation options like \"Self-Advance,\" \"Relics,\" \"Inventory,\" \"Journal,\" and \"Settings,\" suggesting this is part of the player's customization or preparation screen. The character's design aligns with the game's focus on unique combat styles and abilities."
}