{
    "chunk_id": 590830934576,
    "source_file": "Sweet_Ice.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/78/Wukong_Thunderclap_28.jpg",
    "alt_text": "Wukong Thunderclap 28.jpg",
    "position_desc": 2,
    "img_above_text": "![Wukong Thunderclap 29.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ec/Wukong_Thunderclap_29.jpg)\nBehind this building, you can find the Soak within a gazebo.",
    "img_below_text": "Soaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Thunderclap 29.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ec/Wukong_Thunderclap_29.jpg)\nBehind this building, you can find the Soak within a gazebo.\"\n        - Following Text: \"Soaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from *Black Myth: Wukong*, showing the player character in a snowy environment near a gazebo-like structure. A highlighted item, likely the \"Soak\" mentioned in the preceding text, is marked within the gazebo. The player has also acquired a \"Bronze Buddha Pendant,\" categorized as a Curio, and their current \"Will\" resource is displayed. The image serves to illustrate the location of collectible items and resources, aiding players in navigating the game and enhancing their healing potential."
}