{
    "chunk_id": 531449602161,
    "source_file": "New_Thunderclap_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/80/Wukong_Thunderclap_56.jpg",
    "alt_text": "Wukong Thunderclap 56.jpg",
    "position_desc": 56,
    "img_above_text": "![Wukong Thunderclap 55.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/02/Wukong_Thunderclap_55.jpg)\nExiting Non-Void's temple room, head back down the stairs and take a left to find a large bamboo garden area. A large frozen river snakes through the middle of this area, and there are many assorted enemies to watch out for here.",
    "img_below_text": "Head along the outer path past a Supporter Monk to a far building past the frozen waterfall. You can find a small gold pot at the base of the frozen falls here, but there are two Guardian Wolves overlooking it that you'll need to lure out and take care of first. Be wary you don't pull too far back down the frozen river and alert a Thunder Rhino Master on top of some rocks. After defeating them, open the pot to find a **Celestial Nonary Pill** to increase your stamina.\nThe New West Celestial Nonary Pill",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Thunderclap 55.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/02/Wukong_Thunderclap_55.jpg)\nExiting Non-Void's temple room, head back down the stairs and take a left to find a large bamboo garden area. A large frozen river snakes through the middle of this area, and there are many assorted enemies to watch out for here.\"\n        - Following Text: \"Head along the outer path past a Supporter Monk to a far building past the frozen waterfall. You can find a small gold pot at the base of the frozen falls here, but there are two Guardian Wolves overlooking it that you'll need to lure out and take care of first. Be wary you don't pull too far back down the frozen river and alert a Thunder Rhino Master on top of some rocks. After defeating them, open the pot to find a **Celestial Nonary Pill** to increase your stamina.\nThe New West Celestial Nonary Pill\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a snowy area near a frozen river in the game *Black Myth: Wukong*. The player character is positioned on a rock, observing a small gold pot highlighted with a red circle near the riverbank. Surrounding the pot are enemies, including two Guardian Wolves and other hostile figures in the background. This scene aligns with the walkthrough's description of a challenging encounter where players must defeat the wolves to access the pot, which contains a **Celestial Nonary Pill** to boost stamina."
}