{
    "chunk_id": 898674772569,
    "source_file": "Centipede_Set.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ee/Wukong_YellowFlower_83.jpg",
    "alt_text": "Wukong YellowFlower 83.jpg",
    "position_desc": 1,
    "img_above_text": "* Significantly increases attack while suffering from Poisoned State (4 pieces)\nThe full Centipede Set of Armor and Gear is located within Chapter 4 - The Webbed Hollow. It is craftable at any Shrine upon finishing the chapter. Simply rest at the next Shrine to unlock it in the crafting menu.",
    "img_below_text": "The Centipede Set of Armor and Gear can be crafted, as it is the only way to get it. To craft it you need the following:\n* 4 Cold Iron Leaves, 2 Fine Gold Thread, 7,500 Will - headgear",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"* Significantly increases attack while suffering from Poisoned State (4 pieces)\nThe full Centipede Set of Armor and Gear is located within Chapter 4 - The Webbed Hollow. It is craftable at any Shrine upon finishing the chapter. Simply rest at the next Shrine to unlock it in the crafting menu.\"\n        - Following Text: \"The Centipede Set of Armor and Gear can be crafted, as it is the only way to get it. To craft it you need the following:\n* 4 Cold Iron Leaves, 2 Fine Gold Thread, 7,500 Will - headgear\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight in a lush, open field environment, featuring a large centipede-like creature and a humanoid opponent labeled \"Hundred-Eyed Daoist Master.\" The preceding and following text suggests this encounter is part of Chapter 4 - The Webbed Hollow, where players can obtain materials to craft the Centipede Armor Set after defeating this boss and progressing to the next Shrine. The image highlights the challenging nature of the fight and its significance in the game's progression."
}