{
    "chunk_id": 851119615889,
    "source_file": "Non-White.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c9/Wukong_Mindcliff_20.jpg",
    "alt_text": "Wukong Mindcliff 20.jpg",
    "position_desc": 10,
    "img_above_text": "He'll now also swap his stance to pivot and look back at you over his shoulder, before leaping over with a quick slash and then jumping up to hang in the air a moment as his blade charges before making an extremely fast dash across the room with his frost sword.\nSince you'll need to fully defeat him this round, it's more than likely that you'll end up smashing through the defense from his weapon and removing the bar entirely. Unfortunately, this isn't necessarily a good thing.",
    "img_below_text": "Non-White will quickly perform his own type of Cloud Step to evade you and retreat, replacing his longer frozen sword with two smaller poison blades, and will have a whole new attack set during this temporary phase. While it does mean he can no longer block you until his frost blade regenerates, you'll need to be wary of taking too much poison damage.\n![Wukong Mindcliff 21.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0a/Wukong_Mindcliff_21.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"He'll now also swap his stance to pivot and look back at you over his shoulder, before leaping over with a quick slash and then jumping up to hang in the air a moment as his blade charges before making an extremely fast dash across the room with his frost sword.\nSince you'll need to fully defeat him this round, it's more than likely that you'll end up smashing through the defense from his weapon and removing the bar entirely. Unfortunately, this isn't necessarily a good thing.\"\n        - Following Text: \"Non-White will quickly perform his own type of Cloud Step to evade you and retreat, replacing his longer frozen sword with two smaller poison blades, and will have a whole new attack set during this temporary phase. While it does mean he can no longer block you until his frost blade regenerates, you'll need to be wary of taking too much poison damage.\n![Wukong Mindcliff 21.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0a/Wukong_Mindcliff_21.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an intense combat sequence from *Black Myth: Wukong*, showcasing the player character engaging in battle with an enemy named \"Non-White.\" The enemy appears mid-action, transitioning into a new attack phase. The interface highlights two available moves for the player: \"Moon Dance\" (light attack) and \"Moon Chase\" (heavy attack), emphasizing slashing and dash mechanics. The preceding and following text suggests this is part of a challenging boss fight where \"Non-White\" changes weapons and tactics, requiring the player to adapt to poison-based attacks after breaking through the frost sword defense."
}