{
    "chunk_id": 182406803209,
    "source_file": "Chapter_3_Secret_-_Mount_Mei_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/76/Mount_Mei_Walkthrough_%2815%29.png",
    "alt_text": "Mount Mei Walkthrough \\(15\\).png",
    "position_desc": 11,
    "img_above_text": "After crash landing back on Mount Mei, two giants will emerge. This is the Destined One's Stone Monkey form and Erlang Shen. When Erlang is thrown off into the distance, you'll be thrown into a fight against the Four Heavenly Kings.\n### The Four Heavenly Kings",
    "img_below_text": "Thankfully after a huge battle against Erlang, The Sacred Divinity, the fight against the Four Heavenly Kings is much more straightforward. They share one health bar between them, and in your Stone Monkey transformation, you can use Primal Punch as your light attack, Earthshatter Slam as your heavy attack (this attack also heals), and Rock Solid to deflect their hits.\nUse Rock Solid when it's available and when one of the four giants will launch themselves at you. Other than that, you'll just want to keep using Primal Punch to build up Focus. When you've built your points, use Earthshatter Slam.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"After crash landing back on Mount Mei, two giants will emerge. This is the Destined One's Stone Monkey form and Erlang Shen. When Erlang is thrown off into the distance, you'll be thrown into a fight against the Four Heavenly Kings.\n### The Four Heavenly Kings\"\n        - Following Text: \"Thankfully after a huge battle against Erlang, The Sacred Divinity, the fight against the Four Heavenly Kings is much more straightforward. They share one health bar between them, and in your Stone Monkey transformation, you can use Primal Punch as your light attack, Earthshatter Slam as your heavy attack (this attack also heals), and Rock Solid to deflect their hits.\nUse Rock Solid when it's available and when one of the four giants will launch themselves at you. Other than that, you'll just want to keep using Primal Punch to build up Focus. When you've built your points, use Earthshatter Slam.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the protagonist, in their Stone Monkey transformation, facing the Four Heavenly Kings in a misty, mountainous battlefield. This scene occurs after Erlang Shen is thrown off, initiating a fight against the Four Heavenly Kings. The guide emphasizes using specific attacks—Primal Punch, Earthshatter Slam, and Rock Solid—to defeat the Kings, who share a single health bar."
}