{
    "chunk_id": 721366012627,
    "source_file": "New_Thunderclap_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1e/Wukong_Thunderclap_34.jpg",
    "alt_text": "Wukong Thunderclap 34.jpg",
    "position_desc": 33,
    "img_above_text": "![Wukong Thunderclap 33.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1d/Wukong_Thunderclap_33.jpg)\nIf you check to the side of the stairs first, you can find a green Wisp to absorb in a large pot, but you'll need to watch out for a Wolf Guardian standing on a wooden platform above looking to ambush you.",
    "img_below_text": "At the top of the stairs, you can look left to find the two sets of stairs back down to the Temple Entrance's main path where four Thunder Rhino Masters have gathered -- attacking them from the back will allow you to ambush them one by one.\nIt's worth noting that this area only has two real Shrines, and the other is up near the boss room past two Dark-faced Overlords. Given there's more optional bosses and enemies to face, it's not a bad idea to go back and rest at the entrance before making a beeline through the side path to return to the main plaza.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Thunderclap 33.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1d/Wukong_Thunderclap_33.jpg)\nIf you check to the side of the stairs first, you can find a green Wisp to absorb in a large pot, but you'll need to watch out for a Wolf Guardian standing on a wooden platform above looking to ambush you.\"\n        - Following Text: \"At the top of the stairs, you can look left to find the two sets of stairs back down to the Temple Entrance's main path where four Thunder Rhino Masters have gathered -- attacking them from the back will allow you to ambush them one by one.\nIt's worth noting that this area only has two real Shrines, and the other is up near the boss room past two Dark-faced Overlords. Given there's more optional bosses and enemies to face, it's not a bad idea to go back and rest at the entrance before making a beeline through the side path to return to the main plaza.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat encounter in a snowy temple environment from the game *Black Myth: Wukong*. The player character is engaged in battle with an enemy wielding a large weapon, while ascending a staircase. This scene aligns with the preceding text, which mentions a Wolf Guardian ambushing players near stairs, and the following text, which describes the path leading to the Temple Entrance and additional enemies. The interface elements suggest active gameplay, with health, abilities, and controls visible."
}