{
    "chunk_id": 6613815044,
    "source_file": "Valley_of_Ecstasy_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/35/Wukong_Longevity_7.jpg",
    "alt_text": "Wukong Longevity 7.jpg",
    "position_desc": 102,
    "img_above_text": "In the opposite direction, there's another large rock below a tower up above that you can't reach, but you can search the rock for another Lesser Apramana Bat, and nearby you can find a second **Treasure Chest** under a large tree.\nThe most interesting thing around here is just up the small hill past the tower. You'll find a large corpse of some kind at the base of a statue built into the cliffs ahead.",
    "img_below_text": "This is actually one of the four Captains that the Pagoda Realm Prisoner spoke of, but it looks like someone beat you to putting this captain out of their misery. You can still interact with the body to claim the Spirit of Captain Void-Illusion. And hey, since they still count as a Yaoguai Chief in the journal, that's one less boss to worry about!\nCaptain Void-Illusion",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"In the opposite direction, there's another large rock below a tower up above that you can't reach, but you can search the rock for another Lesser Apramana Bat, and nearby you can find a second **Treasure Chest** under a large tree.\nThe most interesting thing around here is just up the small hill past the tower. You'll find a large corpse of some kind at the base of a statue built into the cliffs ahead.\"\n        - Following Text: \"This is actually one of the four Captains that the Pagoda Realm Prisoner spoke of, but it looks like someone beat you to putting this captain out of their misery. You can still interact with the body to claim the Spirit of Captain Void-Illusion. And hey, since they still count as a Yaoguai Chief in the journal, that's one less boss to worry about!\nCaptain Void-Illusion\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a snowy environment where a character approaches a large, fallen corpse near a statue built into the cliffside. This scene aligns with the narrative context of discovering one of the four Captains, specifically Captain Void-Illusion, whose spirit can be claimed by interacting with the body. The setting emphasizes the somber and mysterious atmosphere of the encounter."
}