{
    "chunk_id": 143282715216,
    "source_file": "Violet_Spider.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a0/Wukong_LowerHollow_83.jpg",
    "alt_text": "Wukong LowerHollow 83.jpg",
    "position_desc": 12,
    "img_above_text": "![Wukong LowerHollow 82.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c3/Wukong_LowerHollow_82.jpg)\nAt this point, her eyes will start to glow, signifying her second phase. Things will get very scary if her eyes start to glow even brighter and mesmerize you.",
    "img_below_text": "If this happens, you'll suddenly be transported to an illusory realm where you're on a bed of webs instead of solid ground. This can get extremely bad as the more you move around, the more you'll be slowed until eventually you'll be exposed as you try and break free of the webbing.\nExpect the Violet Spider to absolutely take advantage of your vulnerability in these moments, attacking with both her talons and a large jump slam attack that even staggers her for a bit. You'll need to stand your ground and use Rock Solid to knock away her blasts if you're unable to dodge them in time.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong LowerHollow 82.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c3/Wukong_LowerHollow_82.jpg)\nAt this point, her eyes will start to glow, signifying her second phase. Things will get very scary if her eyes start to glow even brighter and mesmerize you.\"\n        - Following Text: \"If this happens, you'll suddenly be transported to an illusory realm where you're on a bed of webs instead of solid ground. This can get extremely bad as the more you move around, the more you'll be slowed until eventually you'll be exposed as you try and break free of the webbing.\nExpect the Violet Spider to absolutely take advantage of your vulnerability in these moments, attacking with both her talons and a large jump slam attack that even staggers her for a bit. You'll need to stand your ground and use Rock Solid to knock away her blasts if you're unable to dodge them in time.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight against the Violet Spider in *Black Myth: Wukong*. The player character is shown facing the spider in a web-covered arena, with the spider's glowing eyes indicating its second phase. The preceding and following text describe the spider's ability to transport the player to an illusory realm of webs, where movement becomes restricted, increasing vulnerability to its attacks. The player must use defensive strategies like \"Rock Solid\" to counter its powerful moves."
}