{
    "chunk_id": 252302483852,
    "source_file": "Crow_Diviner_Spirit.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c7/Crow_Diviner_Power.png",
    "alt_text": "Crow Diviner Power.png",
    "position_desc": 3,
    "img_above_text": "The Crow Diviner fights with a sword and deals frost damage. He also uses a skill that renders him almost invisible, making him blend into the white snow around the area. He's not completely invisible while using this move. You can still make out his outline just like you can still see yourself while using the Cloud Step spell, but it definitely complicates things all the same. Lock onto him so you don't lose him when he is using this skill.\n## Crow Diviner Spirit",
    "img_below_text": "* **Frigid Fragrance**\n* Equipped Effect: Moderately increases Chill Resistance.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Crow Diviner fights with a sword and deals frost damage. He also uses a skill that renders him almost invisible, making him blend into the white snow around the area. He's not completely invisible while using this move. You can still make out his outline just like you can still see yourself while using the Cloud Step spell, but it definitely complicates things all the same. Lock onto him so you don't lose him when he is using this skill.\n## Crow Diviner Spirit\"\n        - Following Text: \"* **Frigid Fragrance**\n* Equipped Effect: Moderately increases Chill Resistance.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image is a screenshot from a video game showing the equipment menu, specifically highlighting the \"Crow Diviner\" spirit. This spirit has a skill called \"Frigid Fragrance,\" which allows the player to scatter Frigid Dust, applying Frost Bane to both the player and enemies. The equipped effect of this spirit is a moderate increase in Chill Resistance. The preceding text describes the Crow Diviner's combat abilities, while the following text details the benefits of the Frigid Fragrance skill."
}