{
    "chunk_id": 230877082492,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/cc/Wukong_Wolves_31.jpg",
    "alt_text": "Wukong Wolves 31.jpg",
    "position_desc": 38,
    "img_above_text": "![Wukong Wolves 30.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/16/Wukong_Wolves_30.jpg)\nThe bridge is guarded by a lone Wolf Archer, and a great time to test out the Destined One’s staff twirl ability. By holding down the L2/LT button, you can move your staff quickly to deflect incoming arrows. The Wolf will usually begin with a barrage of quick arrow shots, so be sure to keep holding the button down rather than tapping it until he stops. The move costs stamina to maintain so you can’t block shots forever — as soon as the arrows stop flying, dash across and defeat him before he finds more arrows.",
    "img_below_text": "There are many paths to go from here - either continuing to the far side of the stream, or heading back to keep exploring the previous side, including a path up to a high plateau with some **Aged Ginseng**. On the slope leading back down to the stream, another ginseng plant hides a surprise, as an earthen elemental Ginsengling Yaoguai will uncover itself with the ginseng growing from its head.\nThese monsters are surprisingly tough, and can slam their hands into the ground to grow poison roots that spread outward — so don’t be afraid to reposition yourself to fight somewhere else. Defeating them will earn you much more crafting materials than picking normal plants.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Wolves 30.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/16/Wukong_Wolves_30.jpg)\nThe bridge is guarded by a lone Wolf Archer, and a great time to test out the Destined One’s staff twirl ability. By holding down the L2/LT button, you can move your staff quickly to deflect incoming arrows. The Wolf will usually begin with a barrage of quick arrow shots, so be sure to keep holding the button down rather than tapping it until he stops. The move costs stamina to maintain so you can’t block shots forever — as soon as the arrows stop flying, dash across and defeat him before he finds more arrows.\"\n        - Following Text: \"There are many paths to go from here - either continuing to the far side of the stream, or heading back to keep exploring the previous side, including a path up to a high plateau with some **Aged Ginseng**. On the slope leading back down to the stream, another ginseng plant hides a surprise, as an earthen elemental Ginsengling Yaoguai will uncover itself with the ginseng growing from its head.\nThese monsters are surprisingly tough, and can slam their hands into the ground to grow poison roots that spread outward — so don’t be afraid to reposition yourself to fight somewhere else. Defeating them will earn you much more crafting materials than picking normal plants.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game \"Black Myth: Wukong,\" where the player character is engaged in combat with an earthen elemental creature known as Ginsengling Yaoguai. This creature has a ginseng plant growing from its head and is capable of creating poison roots by slamming its hands into the ground. The image illustrates the challenging nature of the encounter, highlighting the need for strategic repositioning to avoid the creature's attacks and earn valuable crafting materials upon defeating it."
}