{
    "chunk_id": 281359438986,
    "source_file": "How_to_Find_All_Purple_Talisman_Altars_in_Chapter_4.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3d/Purple_Talismans_Chapter_4.png",
    "alt_text": "Purple Talismans Chapter 4.png",
    "position_desc": 1,
    "img_above_text": "Chapter 4 of Black Myth: Wukong has plenty of secrets to discover and one of these involves collecting the purple talismans you can find hanging from altars in the Webbed Hollow and Temple of the Yellow Flowers. Collecting them all will prompt cutscenes and a meeting with a hidden boss, so here's everything you need to do to uncover this extra content.\n## How to Find the Purple Talismans in the Webbed Hollow",
    "img_below_text": "There are 4 Purple Talismans to find. You can pick up 3 of them throughout the Webbed Hollow, and the last one is collected from the Temple of the Yellow Flowers. You'll find a detailed walkthrough below of where to get each one.\n### Important Note!",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Chapter 4 of Black Myth: Wukong has plenty of secrets to discover and one of these involves collecting the purple talismans you can find hanging from altars in the Webbed Hollow and Temple of the Yellow Flowers. Collecting them all will prompt cutscenes and a meeting with a hidden boss, so here's everything you need to do to uncover this extra content.\n## How to Find the Purple Talismans in the Webbed Hollow\"\n        - Following Text: \"There are 4 Purple Talismans to find. You can pick up 3 of them throughout the Webbed Hollow, and the last one is collected from the Temple of the Yellow Flowers. You'll find a detailed walkthrough below of where to get each one.\n### Important Note!\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an altar-like structure in a dimly lit, cavernous environment with intricate details and glowing purple particles, likely representing one of the locations where players can find a Purple Talisman in the Webbed Hollow area of *Black Myth: Wukong*. This setting aligns with the walkthrough's guidance for uncovering secrets and progressing toward a hidden boss encounter in Chapter 4."
}