{
    "chunk_id": 504310586085,
    "source_file": "Webbed_Hollow_-_Middle_Hollow_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5b/Wukong_MiddleHollow_6.jpg",
    "alt_text": "Wukong MiddleHollow 6.jpg",
    "position_desc": 6,
    "img_above_text": "As you cross the small bridge, you can find a small archway on the right, with two talking lanterns that appear to be shouting \"big day!\"\nAs you approach, a mysterious woman (the same one that killed the yaoguai at the start of the chapter) will silence the lanterns, before offering up that there's a supposed treasure beyond the archway.",
    "img_below_text": "Since she seems like a trustworthy sort, head on inside, and you'll indeed find a literal trove of **Treasure Chests**!\nLooting them all, you'll be able to obtain a Xiang River Goddess Gourd, Enhanced Ginseng Pellet Formula, Gold Ridge Beast, and Purple-Veined Peach Pit Soak, plus several materials like Fine Gold Thread!",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"As you cross the small bridge, you can find a small archway on the right, with two talking lanterns that appear to be shouting \"big day!\"\nAs you approach, a mysterious woman (the same one that killed the yaoguai at the start of the chapter) will silence the lanterns, before offering up that there's a supposed treasure beyond the archway.\"\n        - Following Text: \"Since she seems like a trustworthy sort, head on inside, and you'll indeed find a literal trove of **Treasure Chests**!\nLooting them all, you'll be able to obtain a Xiang River Goddess Gourd, Enhanced Ginseng Pellet Formula, Gold Ridge Beast, and Purple-Veined Peach Pit Soak, plus several materials like Fine Gold Thread!\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dark, web-covered cavern with several glowing treasure chests marked by red arrows. A character, armed with a large weapon, is exploring the area. This scene aligns with the preceding and following text, where the player is guided to enter an archway to discover a trove of treasure chests containing valuable items, such as the Xiang River Goddess Gourd and other materials. The image serves to illustrate the location and contents of the treasure in the walkthrough."
}