{
    "chunk_id": 976924177696,
    "source_file": "Pagoda_Realm_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0c/Wukong_Pagoda_58.jpg",
    "alt_text": "Wukong Pagoda 58.jpg",
    "position_desc": 56,
    "img_above_text": "![Wukong Pagoda 59.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/80/Wukong_Pagoda_59.jpg)\nHe's much stronger than any plant Guai you've encountered, and summons poison pools all around him. He can also shoot out several poison projectiles at you from all sides, and stab the ground repeatedly to cause poison explosions.",
    "img_below_text": "Watch out for his extended spinning attack with his weapon, and wait for him to get dizzy before launching a counter attack and Immobilizing him to extend his downtime. If he floats into the air, be ready for him to crash his weapon into the ground as he lands.\nWhen defeated, you'll earn his Fungiman Spirit to add to your collection. Not far past where the Fungiman was hiding you can spot the stairway up to Level 4, but there's a bit more to explore here first.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Pagoda 59.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/80/Wukong_Pagoda_59.jpg)\nHe's much stronger than any plant Guai you've encountered, and summons poison pools all around him. He can also shoot out several poison projectiles at you from all sides, and stab the ground repeatedly to cause poison explosions.\"\n        - Following Text: \"Watch out for his extended spinning attack with his weapon, and wait for him to get dizzy before launching a counter attack and Immobilizing him to extend his downtime. If he floats into the air, be ready for him to crash his weapon into the ground as he lands.\nWhen defeated, you'll earn his Fungiman Spirit to add to your collection. Not far past where the Fungiman was hiding you can spot the stairway up to Level 4, but there's a bit more to explore here first.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a battle scene from the game *Black Myth: Wukong*, showcasing the player character engaged in combat with the \"Fungiman,\" a challenging enemy. The Fungiman, a plant-like creature with glowing fungal growths, is surrounded by poison effects, emphasizing its toxic abilities. The HUD displays the player's health, abilities, and items, indicating an active fight. This encounter is part of the walkthrough's guidance on defeating the Fungiman and progressing to the next area."
}