{
    "chunk_id": 155336289461,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8b/Furnace_Valley_Walkthrough_%2867%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(67\\).png",
    "position_desc": 33,
    "img_above_text": "Open the giant door at the top of the stairs. Go straight ahead and activate the Rakshasa Palace Keeper's Shrine.\n## Rakshasa Palace",
    "img_below_text": "Just beyond the shrine, there's a small area for you to explore. As you step toward the Keeper's Shrine, you'll likely see the golden box on the log just behind it. Go here to pick up a Celestial Taiyi Pill.\nFlaming Mountains Celestial Taiyi Pill",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Open the giant door at the top of the stairs. Go straight ahead and activate the Rakshasa Palace Keeper's Shrine.\n## Rakshasa Palace\"\n        - Following Text: \"Just beyond the shrine, there's a small area for you to explore. As you step toward the Keeper's Shrine, you'll likely see the golden box on the log just behind it. Go here to pick up a Celestial Taiyi Pill.\nFlaming Mountains Celestial Taiyi Pill\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character standing near the Rakshasa Palace Keeper's Shrine, a key location in the game. The shrine, illuminated with flames, is situated to the right, while the entrance to the palace looms in the background. Two red-circled areas highlight points of interest, likely indicating collectible items or interactive objects. This scene aligns with the walkthrough's guidance to activate the shrine and explore the area for items such as the Celestial Taiyi Pill."
}