{
    "chunk_id": 151942717936,
    "source_file": "Blood_of_the_Iron_Bull.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/28/Blood_of_the_Iron_Bull_-_Specific_Location_Fright_Cliff_Rock_Clash_Platform_Slope_Down.jpg",
    "alt_text": "Blood of the Iron Bull - Specific Location Fright Cliff Rock Clash Platform Slope Down.jpg",
    "position_desc": 12,
    "img_above_text": "A little further on, after you defeat the Stone Vanguard  <meta /> in Yellow Wind Ridge, you will slide down a slope from the Fright Cliff \\- Rock Clash Platform Shrine. Halfway down the slope is a statue on the left and a chest with the Blood of the Iron Bull.\nThe easiest way to get this is to jump and shimmy your way on the slope right at the beginning, towards the left side of it.",
    "img_below_text": "That way you can jump on the cliff-face and down towards the statue and chest.\n![Blood of the Iron Bull - Specific Location Fright Cliff Rock Clash Platform Slope Down 2.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1d/Blood_of_the_Iron_Bull_-_Specific_Location_Fright_Cliff_Rock_Clash_Platform_Slope_Down_2.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"A little further on, after you defeat the Stone Vanguard  <meta /> in Yellow Wind Ridge, you will slide down a slope from the Fright Cliff \\- Rock Clash Platform Shrine. Halfway down the slope is a statue on the left and a chest with the Blood of the Iron Bull.\nThe easiest way to get this is to jump and shimmy your way on the slope right at the beginning, towards the left side of it.\"\n        - Following Text: \"That way you can jump on the cliff-face and down towards the statue and chest.\n![Blood of the Iron Bull - Specific Location Fright Cliff Rock Clash Platform Slope Down 2.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1d/Blood_of_the_Iron_Bull_-_Specific_Location_Fright_Cliff_Rock_Clash_Platform_Slope_Down_2.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player-controlled character sliding down a sandy slope in a desert-like environment, as part of a sequence in the game. This section is tied to locating a statue and a chest containing the \"Blood of the Iron Bull\" item, which can be accessed by navigating carefully along the slope's left side. The gameplay interface shows health and ability indicators, suggesting an active exploration or combat scenario."
}