{
    "chunk_id": 412998557383,
    "source_file": "Woods_of_Ember_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3a/Woods_Ember_Walkthrough_%2828%29.png",
    "alt_text": "Woods Ember Walkthrough \\(28\\).png",
    "position_desc": 14,
    "img_above_text": "When his dialogue begins to repeat, resume your exploration of the area. First, go over to where there are four chests by the wall (opposite where you first entered the area). Two of the chests are already open, but there are two more to loot. Inside these, you'll find Cold Iron Leaves, Will, a Mind Core, and a Gold Tree Core.\nNow facing away from the chests, go right and up the stairs to begin your ascent of the mountain.",
    "img_below_text": "At the top of the stairs, you'll have another set of steps immediately to the left. But first, go to the treasure chests on the right. There's just one here to be looted, which will give you some gold to sell. Then, directly opposite the stairs, you can find another Fire Bellflower to be harvested.\n![Woods Ember Walkthrough \\(30\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/75/Woods_Ember_Walkthrough_%2830%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"When his dialogue begins to repeat, resume your exploration of the area. First, go over to where there are four chests by the wall (opposite where you first entered the area). Two of the chests are already open, but there are two more to loot. Inside these, you'll find Cold Iron Leaves, Will, a Mind Core, and a Gold Tree Core.\nNow facing away from the chests, go right and up the stairs to begin your ascent of the mountain.\"\n        - Following Text: \"At the top of the stairs, you'll have another set of steps immediately to the left. But first, go to the treasure chests on the right. There's just one here to be looted, which will give you some gold to sell. Then, directly opposite the stairs, you can find another Fire Bellflower to be harvested.\n![Woods Ember Walkthrough \\(30\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/75/Woods_Ember_Walkthrough_%2830%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dark, desolate area with barren trees and scattered ruins, highlighting two points of interest marked with red indicators. These likely correspond to treasure chests mentioned in the preceding and following text, containing items such as Cold Iron Leaves, Will, a Mind Core, and gold. The scene serves as part of the player's exploration before ascending the mountain, emphasizing loot collection and progression in the game."
}