{
    "chunk_id": 227097196607,
    "source_file": "Captain_Lotus-Vision.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f3/Wukong_Pagoda_38.jpg",
    "alt_text": "Wukong Pagoda 38.jpg",
    "position_desc": 8,
    "img_above_text": "Because of the difficulty of this section (and that you may also be at half health from the chanting curse), we highly recommend using Cloud Step so at your decoy can draw fire for a large portion of this attack.\nAfter the four circles all emit their laser blasts, they'll float away from Captain Lotus-Vision to take up spots in each corner of the room. Each circle will emit a continuous laser that borders the room, and will slowly pan them around to cross over the floor and each other.",
    "img_below_text": "Dodging them will be extremely difficult, so instead swap to your Pillar Stance and extend off the floor (preferably in range of the Captain) and start charging up as you evade the floor lasers. Once they perform a second sweep, launch your attack the captain.\n![Wukong Pagoda 40.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/46/Wukong_Pagoda_40.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Because of the difficulty of this section (and that you may also be at half health from the chanting curse), we highly recommend using Cloud Step so at your decoy can draw fire for a large portion of this attack.\nAfter the four circles all emit their laser blasts, they'll float away from Captain Lotus-Vision to take up spots in each corner of the room. Each circle will emit a continuous laser that borders the room, and will slowly pan them around to cross over the floor and each other.\"\n        - Following Text: \"Dodging them will be extremely difficult, so instead swap to your Pillar Stance and extend off the floor (preferably in range of the Captain) and start charging up as you evade the floor lasers. Once they perform a second sweep, launch your attack the captain.\n![Wukong Pagoda 40.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/46/Wukong_Pagoda_40.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight in *Black Myth: Wukong* against \"Captain Lotus-Vision.\" The boss is surrounded by a glowing, mystical barrier, with purple lasers crisscrossing the floor, creating a challenging environment for the player. The player character is positioned in the foreground, seemingly evading the lasers while preparing for an attack. The context suggests this is a critical moment where strategic use of abilities like Cloud Step and Pillar Stance is essential to avoid damage and counterattack effectively."
}