{
    "chunk_id": 102621971162,
    "source_file": "New_Thunderclap_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/95/Wukong_Thunderclap_25.jpg",
    "alt_text": "Wukong Thunderclap 25.jpg",
    "position_desc": 24,
    "img_above_text": "Defeating this Yaoguai Chief will boast an unexpected reward: Hoarfrost. With this, you'll be able to utilize a new Transformation Spell to become a Monk from the Sea, and inflict your own frost damage on enemies to chill them!\nMonk from the Sea",
    "img_below_text": "Now that you've dealt with the Yaoguai Chief, you can explore this large size plaza. Up ahead, you'll find several Overseeing Monks praying to a Turtle General statue and three more practicing punching a large tree (you can sidestep them and keep on the main path if you wish since they won't notice you unless you draw close).\n![Wukong Thunderclap 26.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e8/Wukong_Thunderclap_26.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Defeating this Yaoguai Chief will boast an unexpected reward: Hoarfrost. With this, you'll be able to utilize a new Transformation Spell to become a Monk from the Sea, and inflict your own frost damage on enemies to chill them!\nMonk from the Sea\"\n        - Following Text: \"Now that you've dealt with the Yaoguai Chief, you can explore this large size plaza. Up ahead, you'll find several Overseeing Monks praying to a Turtle General statue and three more practicing punching a large tree (you can sidestep them and keep on the main path if you wish since they won't notice you unless you draw close).\n![Wukong Thunderclap 26.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e8/Wukong_Thunderclap_26.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a snowy plaza in *Black Myth: Wukong*, where the player character, armed with a staff, crouches stealthily while approaching a group of enemies. In the background, several monks are visible, including one praying near a large Turtle General statue and others further away. The scene aligns with the walkthrough's description of exploring the area after defeating the Yaoguai Chief, with the option to engage or avoid the monks."
}