{
    "chunk_id": 153999570959,
    "source_file": "Yellow_Sand_Formation_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/05/Wukong_Yellow_58.jpg",
    "alt_text": "Wukong Yellow 58.jpg",
    "position_desc": 65,
    "img_above_text": "![Wukong Yellow 56.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7f/Wukong_Yellow_56.jpg)\nHe can also do a very quick jab with the butt of his trident that comes after the end of the weapon glows for a moment, and he’ll soon follow it with a stomp that’ll be hard to dodge if staggered by the first attack. If you spot the other end of his spear glowing, you should have enough time to parry it with Rock Solid when he jabs, and interrupt his follow up attack!",
    "img_below_text": "Once you’ve carved out around a third of the Yellow Wind Sage’s health bar, things will get a little more scary. He’ll suddenly toss the head into the sky, and begin to sweep his spear around him to create a giant sandstorm — the power of the Samahdi Winds. Stay very clear of his repeated swings when this happens, as he’ll end the move with a giant whirling spin attack.\n![Wukong Yellow 62.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bb/Wukong_Yellow_62.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Yellow 56.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7f/Wukong_Yellow_56.jpg)\nHe can also do a very quick jab with the butt of his trident that comes after the end of the weapon glows for a moment, and he’ll soon follow it with a stomp that’ll be hard to dodge if staggered by the first attack. If you spot the other end of his spear glowing, you should have enough time to parry it with Rock Solid when he jabs, and interrupt his follow up attack!\"\n        - Following Text: \"Once you’ve carved out around a third of the Yellow Wind Sage’s health bar, things will get a little more scary. He’ll suddenly toss the head into the sky, and begin to sweep his spear around him to create a giant sandstorm — the power of the Samahdi Winds. Stay very clear of his repeated swings when this happens, as he’ll end the move with a giant whirling spin attack.\n![Wukong Yellow 62.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bb/Wukong_Yellow_62.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight in *Black Myth: Wukong* against the Yellow Wind Sage. The boss, wielding a spear, is shown mid-attack, surrounded by a sandstorm, which aligns with the description of his Samahdi Winds ability. The player character is seen evading the attack, with the boss's health bar visible at the bottom. The scene emphasizes the intensity and danger of this phase of the battle."
}