{
    "chunk_id": 362782772883,
    "source_file": "Luojia_Fragrant_Vine_Locations.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2c/Windseal_Gate_Luojia_Fragrant_Vine.jpg",
    "alt_text": "Windseal Gate Luojia Fragrant Vine.jpg",
    "position_desc": 3,
    "img_above_text": "### Windseal Gate Luojia Fragrant Vine\nWindseal Gate Luojia Fragrant Vine",
    "img_below_text": "The Windseal Gate Luojia Fragrant Vine can be found after defeating both the Stone Vanguard and Tiger Vanguard bosses. After defeating them, return to the area where you fought the King of Flowing Sands and Second Rat Price and place the Keenness of Tiger and Keenness of Stone items into the receptacle by the large stone door. Open the door, head down the hill and over the bridge to reach an open cave area with a statue carved into the rock face. The Vine is guarded by the Gore-Eye Daoist Spirit.\n## The New West Luojia Fragrant Vines",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"### Windseal Gate Luojia Fragrant Vine\nWindseal Gate Luojia Fragrant Vine\"\n        - Following Text: \"The Windseal Gate Luojia Fragrant Vine can be found after defeating both the Stone Vanguard and Tiger Vanguard bosses. After defeating them, return to the area where you fought the King of Flowing Sands and Second Rat Price and place the Keenness of Tiger and Keenness of Stone items into the receptacle by the large stone door. Open the door, head down the hill and over the bridge to reach an open cave area with a statue carved into the rock face. The Vine is guarded by the Gore-Eye Daoist Spirit.\n## The New West Luojia Fragrant Vines\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character standing before a large, intricately carved statue embedded in a rock face, with a glowing tree adorned with orange flowers or fruits in the foreground. This scene is part of the \"Windseal Gate Luojia Fragrant Vine\" area in the game, where players must progress after defeating specific bosses and unlocking a stone door. The glowing tree and statue appear to be key environmental features, possibly marking the location of the Windseal Gate Luojia Fragrant Vine, which is guarded by the Gore-Eye Daoist Spirit."
}