{
    "chunk_id": 974910454307,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/92/Wukong_Wolves_12.jpg",
    "alt_text": "Wukong Wolves 12.jpg",
    "position_desc": 20,
    "img_above_text": "These are essentially Skill Points, which you can begin investing in a large number of different Skill Trees. These can include general skills, or ones that relate to specific combat stances. Your Smash stance has already been unlocked, but you can also unlock two other stances that have unique heavy attacks by investing skill points in them.\nWhen the path leads down, you’ll be able to head right to proceed to a mini-boss, or go left along the stream leading back to the bridge you crossed earlier.",
    "img_below_text": "Going left should lead you to another Wolf Swordsworn behind a rock sculpture, and a **Gentian** plant near him that you can harvest.\n![Wukong Wolves 13.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/02/Wukong_Wolves_13.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"These are essentially Skill Points, which you can begin investing in a large number of different Skill Trees. These can include general skills, or ones that relate to specific combat stances. Your Smash stance has already been unlocked, but you can also unlock two other stances that have unique heavy attacks by investing skill points in them.\nWhen the path leads down, you’ll be able to head right to proceed to a mini-boss, or go left along the stream leading back to the bridge you crossed earlier.\"\n        - Following Text: \"Going left should lead you to another Wolf Swordsworn behind a rock sculpture, and a **Gentian** plant near him that you can harvest.\n![Wukong Wolves 13.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/02/Wukong_Wolves_13.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the protagonist of *Black Myth: Wukong* interacting with a **Gentian plant**, which can be harvested as mentioned in the following text. The lush forest environment includes rocks, trees, and vegetation, aligning with the game's exploration and resource-gathering mechanics. In the background, a **Wolf Swordsworn** enemy is partially visible near a rock sculpture, hinting at an upcoming encounter. The image serves to illustrate the gameplay elements of harvesting and combat preparation in this area."
}