{
    "chunk_id": 118452218003,
    "source_file": "Temple_of_Yellow_Flowers_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d9/Wukong_YellowFlower_17.jpg",
    "alt_text": "Wukong YellowFlower 17.jpg",
    "position_desc": 15,
    "img_above_text": "## Yaoguai Chief Miniboss Battle - Commander Beetle\nThe Commander Beetle would be a fairly straightforward miniboss fight, if not for the six Sword Daoists he's currently training in the large courtyard where you'll find him just past the Forest of Ferocity. Unfortunately, these enemies will respawn until you defeat the Commander, so you won't be able to get him alone so easily.",
    "img_below_text": "Knowing that the Daoists don't have a whole lot of heath, there are two things you have on your side: large area-of-effect Spirit Attacks, and your Pluck of Many Spell. The Pluck of Many is a great bet for disorienting the group as you attack, though results can vary, and you'll likely have to jump in an finish off a few Daoists yourself. One is even likely to drop the **Fruit of Dao Soak** for your Gourd!\nThis can get tricky, as the Commander Beetle won't just wait around patiently while you defeat his students. He can employ huge strikes that cleave the very ground in a line where he strikes, and if you aren't paying attention, you can usually get hit by the tremors before you know what's going on.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Yaoguai Chief Miniboss Battle - Commander Beetle\nThe Commander Beetle would be a fairly straightforward miniboss fight, if not for the six Sword Daoists he's currently training in the large courtyard where you'll find him just past the Forest of Ferocity. Unfortunately, these enemies will respawn until you defeat the Commander, so you won't be able to get him alone so easily.\"\n        - Following Text: \"Knowing that the Daoists don't have a whole lot of heath, there are two things you have on your side: large area-of-effect Spirit Attacks, and your Pluck of Many Spell. The Pluck of Many is a great bet for disorienting the group as you attack, though results can vary, and you'll likely have to jump in an finish off a few Daoists yourself. One is even likely to drop the **Fruit of Dao Soak** for your Gourd!\nThis can get tricky, as the Commander Beetle won't just wait around patiently while you defeat his students. He can employ huge strikes that cleave the very ground in a line where he strikes, and if you aren't paying attention, you can usually get hit by the tremors before you know what's going on.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a gameplay scene from a video game where the player is engaged in combat with the miniboss Commander Beetle and his group of Sword Daoists in a courtyard setting. The player character, wielding a glowing weapon, is surrounded by multiple enemies, with health bars visible above their heads. The HUD displays various abilities, resources, and stats, such as \"Will\" and skill icons, emphasizing the strategic and action-packed nature of the battle. This scene aligns with the guide's description of a challenging fight requiring area-of-effect attacks and careful management of the respawning enemies."
}