{
    "chunk_id": 348723509391,
    "source_file": "Pagoda_Realm_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e9/Wukong_Pagoda_98.jpg",
    "alt_text": "Wukong Pagoda 98.jpg",
    "position_desc": 94,
    "img_above_text": "This will lead to the bottom of a giant frozen waterfall, and guarding it is a strange type of Abomination enemy. This foe sports two tentacle-like appendages growing over his shoulder that he can use to attack with, alternating lashes with both sides before bringing them both upward.\nHe can also spin in place while using his appendages to grab a snow-covered rock out of the ground, using his momentum to slam it down on you for a startling amount of damage, requiring you to dodge quickly to avoid taking damage.",
    "img_below_text": "He can also lure you in and open his robe, revealing even more tentacles along his chest to strike you with, so attack cautiously, and don't be afraid to go all in with your spells and Spirit Attacks to keep him staggered.\n![Wukong Pagoda 99.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/49/Wukong_Pagoda_99.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"This will lead to the bottom of a giant frozen waterfall, and guarding it is a strange type of Abomination enemy. This foe sports two tentacle-like appendages growing over his shoulder that he can use to attack with, alternating lashes with both sides before bringing them both upward.\nHe can also spin in place while using his appendages to grab a snow-covered rock out of the ground, using his momentum to slam it down on you for a startling amount of damage, requiring you to dodge quickly to avoid taking damage.\"\n        - Following Text: \"He can also lure you in and open his robe, revealing even more tentacles along his chest to strike you with, so attack cautiously, and don't be afraid to go all in with your spells and Spirit Attacks to keep him staggered.\n![Wukong Pagoda 99.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/49/Wukong_Pagoda_99.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat scene from a video game, where the player character, resembling a monkey-like figure, is engaged in battle with a large Abomination enemy near a frozen waterfall. The Abomination is attacking with its tentacle-like appendages, as described in the preceding text. The snowy environment and additional hostile figures in the background suggest a challenging encounter. The HUD elements display player stats, abilities, and earned rewards, such as \"Will.\""
}