{
    "chunk_id": 220593044823,
    "source_file": "Pagoda_Realm_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/47/Wukong_Pagoda_96.jpg",
    "alt_text": "Wukong Pagoda 96.jpg",
    "position_desc": 92,
    "img_above_text": "Absorb the green Wisp in a small tunnel you can pass through, and on the other side you'll see a few stone lanterns marking an area with a small gold pot. Open it, and you'll find a **Celestial Taiyi Pill** inside to boost your maximum mana.\nThe New West Celestial Taiyi Pill",
    "img_below_text": "Before continuing along the main path, break open the wooden fence behind the pill containers, and you'll find an alternate path.\n![Wukong Pagoda 97.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/87/Wukong_Pagoda_97.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Absorb the green Wisp in a small tunnel you can pass through, and on the other side you'll see a few stone lanterns marking an area with a small gold pot. Open it, and you'll find a **Celestial Taiyi Pill** inside to boost your maximum mana.\nThe New West Celestial Taiyi Pill\"\n        - Following Text: \"Before continuing along the main path, break open the wooden fence behind the pill containers, and you'll find an alternate path.\n![Wukong Pagoda 97.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/87/Wukong_Pagoda_97.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game *Black Myth: Wukong*, showing the protagonist, Sun Wukong, leaping over a wooden fence in a snowy, mountainous area. The fence appears to block access to an alternate path, as suggested by the following text. Nearby, a lit candle and a golden pot are visible, possibly indicating a point of interest or a previously opened container. This moment aligns with the guide's instructions to explore beyond the pill containers for hidden paths or items."
}