{
    "chunk_id": 620347589676,
    "source_file": "Webbed_Hollow_-_Middle_Hollow_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9a/Wukong_MiddleHollow_3.jpg",
    "alt_text": "Wukong MiddleHollow 3.jpg",
    "position_desc": 2,
    "img_above_text": "Now that you've dropped down from the Upper Hollow using one of the two paths to reach the Shrine below, you'll find yourself in the large middle portion of the Hollow. Similar to the Upper Hollow, there's a few diverging paths -- some that lead to optional areas and bosses, and some that reconnect back to the main path down to the Lower Hollow.\nYou can look out among the cliffs to spy other large platforms in the distance, but the only way forward for the moment is by going right along a twisting root bridge.",
    "img_below_text": "A Grasshopper Guai will spring out of a cocoon as you cross, and defeating it will drop the **Locust Antennae Mask** (if you don't get it, you may have to defeat the other Grasshoppers trapped in cocoons back in the Upper Hollow).\n![Wukong MiddleHollow 2.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d0/Wukong_MiddleHollow_2.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Now that you've dropped down from the Upper Hollow using one of the two paths to reach the Shrine below, you'll find yourself in the large middle portion of the Hollow. Similar to the Upper Hollow, there's a few diverging paths -- some that lead to optional areas and bosses, and some that reconnect back to the main path down to the Lower Hollow.\nYou can look out among the cliffs to spy other large platforms in the distance, but the only way forward for the moment is by going right along a twisting root bridge.\"\n        - Following Text: \"A Grasshopper Guai will spring out of a cocoon as you cross, and defeating it will drop the **Locust Antennae Mask** (if you don't get it, you may have to defeat the other Grasshoppers trapped in cocoons back in the Upper Hollow).\n![Wukong MiddleHollow 2.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d0/Wukong_MiddleHollow_2.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character in **Black Myth: Wukong** battling a Grasshopper Guai enemy in the Middle Hollow area. The defeated enemy drops the **Locust Antennae Mask**, a headgear item, as indicated by the glowing loot notification on the right side of the screen. This scene aligns with the walkthrough's description of encountering Grasshopper Guai while crossing a twisting root bridge in the Middle Hollow."
}