{
    "chunk_id": 760370515079,
    "source_file": "Luojia_Fragrant_Vine_Locations.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/96/Middle_Hollow_Luojia_Fragrant_Vine.jpg",
    "alt_text": "Middle Hollow Luojia Fragrant Vine.jpg",
    "position_desc": 7,
    "img_above_text": "### Middle Hollow Luojia Fragrant Vine\nMiddle Hollow Luojia Fragrant Vine",
    "img_below_text": "This Luojia Fragrant Vine can be found in the center of the settlement in the Middle of the Hollow. It is guarded by the Scorpion Prince, so take him down and absorb his Spirit before picking up the vine.\n### Temple of the Yellow Flowers Luojia Fragrant Vine",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"### Middle Hollow Luojia Fragrant Vine\nMiddle Hollow Luojia Fragrant Vine\"\n        - Following Text: \"This Luojia Fragrant Vine can be found in the center of the settlement in the Middle of the Hollow. It is guarded by the Scorpion Prince, so take him down and absorb his Spirit before picking up the vine.\n### Temple of the Yellow Flowers Luojia Fragrant Vine\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character standing near the Middle Hollow Luojia Fragrant Vine, a glowing plant entwined around a tree. The setting is dark and atmospheric, with the vine emitting a soft yellow light. This location is part of a video game walkthrough, where the vine is found in the center of a settlement and is guarded by the Scorpion Prince, as mentioned in the preceding text. The image likely serves to visually guide players to identify the vine's location."
}