{
    "chunk_id": 60038519842,
    "source_file": "Village_of_Lanxi_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/38/Wukong_Lanxi_31.jpg",
    "alt_text": "Wukong Lanxi 31.jpg",
    "position_desc": 29,
    "img_above_text": "The Estate of the Zhu Awaken Wine Worm\nYou can find some Fragrant Jade Flower to harvest in the corner of the arena, as well as another large area to the right with two **Treasure Chests** stashed away in opposite corners, and then follow your ally into the next area.",
    "img_below_text": "There's a large pit in the middle of this courtyard, but before you follow Zhu Bajie down, check the large altar on the other side of the pit, and you'll be able to claim a **Celestial Jade Lotus Pill** to increase your maximum health!\nThe Webbed Hollow Celestial Jade Lotus Pill",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Estate of the Zhu Awaken Wine Worm\nYou can find some Fragrant Jade Flower to harvest in the corner of the arena, as well as another large area to the right with two **Treasure Chests** stashed away in opposite corners, and then follow your ally into the next area.\"\n        - Following Text: \"There's a large pit in the middle of this courtyard, but before you follow Zhu Bajie down, check the large altar on the other side of the pit, and you'll be able to claim a **Celestial Jade Lotus Pill** to increase your maximum health!\nThe Webbed Hollow Celestial Jade Lotus Pill\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image shows a player character in a dark, overgrown area with cobwebs and ancient architecture, approaching a large, circular, web-covered object highlighted by a red marker. This scene likely represents a key moment in the walkthrough, where the player is navigating through the \"Estate of the Zhu Awaken Wine Worm\" area, possibly leading to an interaction or event tied to the narrative. The surrounding UI indicates the player's health, abilities, and items, suggesting preparation for potential combat or exploration."
}