{
    "chunk_id": 952106705323,
    "source_file": "Chapter_2_Secret_-_Kingdom_of_Sahali_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f2/Wukong_Sahali_20.jpg",
    "alt_text": "Wukong Sahali 20.jpg",
    "position_desc": 14,
    "img_above_text": "This Tiger happens to be a big fan of lunging attacks, and will almost always start the fight by leaping at you low to the ground, clawing at you with his free hand as he comes to a stop. He’ll follow this with a slash from his sword rather quickly, and let the momentum carry him along the ground in a spin to perform a quick secondary overhead slash from his low position.\nIt will take him a moment to get to his feet afterward, but you’ll want to react fast and retaliate, and possibly Immobilize him, or there’s a good chance he’ll leap away and retreat before his next attack.",
    "img_below_text": "Other times, his lunging attack will be just one big leaping sword slice while low to the ground, which is easier to dodge as it has no follow up most of the time, though he will turn to this move instead of finishing some of his combo attacks to throw you off your guard.\nEvery so often, he’ll decline the lunge, and simply swing his sword up to send a projectile slash your way. The good news is it's rare and just a single slash, moving slow enough that it can be dodged reliably well.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"This Tiger happens to be a big fan of lunging attacks, and will almost always start the fight by leaping at you low to the ground, clawing at you with his free hand as he comes to a stop. He’ll follow this with a slash from his sword rather quickly, and let the momentum carry him along the ground in a spin to perform a quick secondary overhead slash from his low position.\nIt will take him a moment to get to his feet afterward, but you’ll want to react fast and retaliate, and possibly Immobilize him, or there’s a good chance he’ll leap away and retreat before his next attack.\"\n        - Following Text: \"Other times, his lunging attack will be just one big leaping sword slice while low to the ground, which is easier to dodge as it has no follow up most of the time, though he will turn to this move instead of finishing some of his combo attacks to throw you off your guard.\nEvery so often, he’ll decline the lunge, and simply swing his sword up to send a projectile slash your way. The good news is it's rare and just a single slash, moving slow enough that it can be dodged reliably well.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight in a video game, featuring a player character facing off against an enemy named \"Tiger Vanguard.\" The scene shows the Tiger Vanguard mid-lunge, a signature attack described in the accompanying text. The environment is an outdoor, rocky area with ruins in the background. The player's HUD displays health, abilities, and other combat-related information, emphasizing the strategic nature of the encounter. This image highlights the dynamic and aggressive combat style of the Tiger Vanguard, as detailed in the guide."
}