{
    "chunk_id": 392644021409,
    "source_file": "Nine-Capped_Lingzhi_Guai_Spirit.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/15/Nine-Capped_Linzhi_Guai_Spirit.jpg",
    "alt_text": "Nine-Capped Linzhi Guai Spirit.jpg",
    "position_desc": 3,
    "img_above_text": "Once defeated, the Nine-Capped Lingzhi Guai provides both its Spirit and the Earth Spirit Cap. The Earth Spirit Cap saps your health but greatly increases the effectiveness of your Gourd.\n## Nine-Capped Lingzhi Guai Spirit",
    "img_below_text": "* **Emergence**\n* Equipped Effect: Moderately reduces the Mana cost of Mysticism Spells.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Once defeated, the Nine-Capped Lingzhi Guai provides both its Spirit and the Earth Spirit Cap. The Earth Spirit Cap saps your health but greatly increases the effectiveness of your Gourd.\n## Nine-Capped Lingzhi Guai Spirit\"\n        - Following Text: \"* **Emergence**\n* Equipped Effect: Moderately reduces the Mana cost of Mysticism Spells.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "1. **Summary**: The image showcases the \"Nine-Capped Lingzhi Guai Spirit,\" an epic spirit in the game's equipment menu. Its ability, \"Emergence,\" allows the player to transform into the spirit, causing poison damage to nearby foes. When equipped, it moderately reduces the mana cost of Mysticism spells. The Earth Spirit Cap enhances the effectiveness of the player's Gourd but drains health.  \n\n2. **Purpose/Narrative Role**: The spirit serves as a strategic tool for poison-based attacks and mana efficiency, adding depth to combat and spellcasting mechanics."
}