{
    "chunk_id": 435156488632,
    "source_file": "Non-White.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b0/Wukong_MindCliff_4.jpg",
    "alt_text": "Wukong MindCliff 4.jpg",
    "position_desc": 4,
    "img_above_text": "![Wukong MindCliff 7.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e3/Wukong_MindCliff_7.jpg)\nWith a bit of practice you'll be able to get the rhythm down for evading this attack, but that's only half the problem. Non-White will follow this attack by slowly moving his weapon in front of him, during which time he'll be able to easily block any retaliating attack you might have. If you want to get past his defenses, try Immobilizing him first and then hitting him from the back where he can't defend himself.",
    "img_below_text": "Another of his dangerous combo moves will start with a quick shout and an upward thrust of his blade followed by a quick jab. He'll then adopt a strange pose by lifting a leg up, only to dash at you with extreme speed for a final two-hit strike that can be dodged or deflected to get him off-balance.\n![Wukong MindCliff 6.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fe/Wukong_MindCliff_6.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong MindCliff 7.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e3/Wukong_MindCliff_7.jpg)\nWith a bit of practice you'll be able to get the rhythm down for evading this attack, but that's only half the problem. Non-White will follow this attack by slowly moving his weapon in front of him, during which time he'll be able to easily block any retaliating attack you might have. If you want to get past his defenses, try Immobilizing him first and then hitting him from the back where he can't defend himself.\"\n        - Following Text: \"Another of his dangerous combo moves will start with a quick shout and an upward thrust of his blade followed by a quick jab. He'll then adopt a strange pose by lifting a leg up, only to dash at you with extreme speed for a final two-hit strike that can be dodged or deflected to get him off-balance.\n![Wukong MindCliff 6.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fe/Wukong_MindCliff_6.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat encounter in *Black Myth: Wukong*, showcasing the player character facing off against an enemy named \"Non-White\" in a rocky, open area. The player appears to be evading or preparing a defensive maneuver while the enemy wields a glowing weapon and advances. The preceding and following text provides strategies for dealing with the enemy's attacks, emphasizing timing, evasion, and exploiting vulnerabilities such as immobilizing the enemy or deflecting their moves to create openings."
}