{
    "chunk_id": 693670715960,
    "source_file": "Fungiwoman_Spirit.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/03/Fungiwoman_Power.jpg",
    "alt_text": "Fungiwoman Power.jpg",
    "position_desc": 3,
    "img_above_text": "This is bad enough already, but she also has an attack where she shoots spores out over the arena that target and hurt you. These spores replenish the Fungiwoman's health. The trick here is to fight aggressively so she doesn't have time to replenish much HP. Otherwise, it can drag on for a very long time.\n## Fungiwoman Spirit",
    "img_below_text": "* **Aloft**\n* Equipped Effect: Significantly increases Maximum Health but considerably reduces Maximum Stamina.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"This is bad enough already, but she also has an attack where she shoots spores out over the arena that target and hurt you. These spores replenish the Fungiwoman's health. The trick here is to fight aggressively so she doesn't have time to replenish much HP. Otherwise, it can drag on for a very long time.\n## Fungiwoman Spirit\"\n        - Following Text: \"* **Aloft**\n* Equipped Effect: Significantly increases Maximum Health but considerably reduces Maximum Stamina.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "1. **Summary**: The image displays the \"Fungiwoman Spirit\" in the Equipment menu of a video game. This spirit allows the player to transform into Fungiwoman, enabling airborne movement and spore-based attacks that damage enemies and can restore health. The equipped effect, \"Aloft,\" significantly increases maximum health at the cost of reduced stamina. A demo of the ability is also available for viewing.  \n\n2. **Purpose**: The image highlights the functionality and strategic use of the Fungiwoman Spirit, emphasizing its offensive and healing capabilities, as well as its trade-offs in stamina."
}