{
    "chunk_id": 138424728670,
    "source_file": "Drunken_Boar_Questline.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b9/Wukong_Sahali_7.jpg",
    "alt_text": "Wukong Sahali 7.jpg",
    "position_desc": 12,
    "img_above_text": "He’ll often start the fight by hurling dust in front of him, and then performing a fast charge attack to gore you with his tusks, but you can shut him down with a well timed Rock Solid deflection.\nOne of his main combos will begin with another “pocket sand” attack, followed by two quick swipes from his extended claws, and then a delayed jump attack to finish the combo, which can send up tremors from where he impacts.",
    "img_below_text": "Other times, his third attack will have him extend his clawed hand back and charge up, before performing a dashing impaling thrust attack that covers a lot of ground quickly, so be ready to react when he lunges at you.\n![Wukong Sahali 4.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/01/Wukong_Sahali_4.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"He’ll often start the fight by hurling dust in front of him, and then performing a fast charge attack to gore you with his tusks, but you can shut him down with a well timed Rock Solid deflection.\nOne of his main combos will begin with another “pocket sand” attack, followed by two quick swipes from his extended claws, and then a delayed jump attack to finish the combo, which can send up tremors from where he impacts.\"\n        - Following Text: \"Other times, his third attack will have him extend his clawed hand back and charge up, before performing a dashing impaling thrust attack that covers a lot of ground quickly, so be ready to react when he lunges at you.\n![Wukong Sahali 4.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/01/Wukong_Sahali_4.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat scene from the video game *Black Myth: Wukong*. It shows the \"Yellow-Robed Squire,\" a boss character, executing an attack with extended claws, likely part of his described combo involving \"pocket sand\" and claw swipes. The player character is on the ground, seemingly hit by the attack, while the environment is filled with dust, emphasizing the chaotic nature of the battle. The health bar and UI elements indicate active gameplay."
}