{
    "chunk_id": 936175072512,
    "source_file": "Yellow_Loong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/6d/Wukong_YellowLoong_20.jpg",
    "alt_text": "Wukong YellowLoong 20.jpg",
    "position_desc": 23,
    "img_above_text": "![Wukong YellowLoong 10.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f5/Wukong_YellowLoong_10.jpg)\nOne of the more annoying new moves he'll employ is his own ability to \"Cloud Step\" to evade some of your moves. One of these he'll often perform at the end of a combo attack, ducking to the side, and then performing a jump where he stabs the ground with his polearm, and flips over to slam his tail down for a two-hit strike.",
    "img_below_text": "The other move is even more aggravating, as he can Cloud Step without warning even when standing around between moves if you try to attack, and can completely waste a fully charged strike. He'll dash backward while intangible, then quickly race forward to strike -- though you can turn that tables by deflecting his counter-attack.\n![Wukong YellowLoong 19.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/13/Wukong_YellowLoong_19.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong YellowLoong 10.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f5/Wukong_YellowLoong_10.jpg)\nOne of the more annoying new moves he'll employ is his own ability to \"Cloud Step\" to evade some of your moves. One of these he'll often perform at the end of a combo attack, ducking to the side, and then performing a jump where he stabs the ground with his polearm, and flips over to slam his tail down for a two-hit strike.\"\n        - Following Text: \"The other move is even more aggravating, as he can Cloud Step without warning even when standing around between moves if you try to attack, and can completely waste a fully charged strike. He'll dash backward while intangible, then quickly race forward to strike -- though you can turn that tables by deflecting his counter-attack.\n![Wukong YellowLoong 19.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/13/Wukong_YellowLoong_19.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat scene from *Black Myth: Wukong*, showing the player character engaged in a battle against the boss \"Yellow Loong.\" The boss appears to be using its \"Cloud Step\" ability, creating a dynamic visual effect as it evades or counters an attack. The glowing particles and motion blur emphasize the agility and power of the boss's movement. The interface displays the boss's health bar, player abilities, and status indicators, highlighting the intensity of the encounter."
}