{
    "chunk_id": 695156237530,
    "source_file": "Yellow-Robed_Squire.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/94/Wukong_Sandgate_71.jpg",
    "alt_text": "Wukong Sandgate 71.jpg",
    "position_desc": 4,
    "img_above_text": "![Wukong Yellow 34.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4f/Wukong_Yellow_34.jpg)\nAfter sobering up, the Drunken Boar will then head to the Crouching Tiger Temple, and there request that you get him some tasty Jade Lotus -- which can be harvested in most pools of water.",
    "img_below_text": "Finally, the Yellow-Robed Squire will return to near where you first met him, looking for a missing Gold Piece held by one of the Rat Princes. You can find this by defeating the First Prince of Flowing Sands in the Valley of Despair, and obtaning the Arhat Gold Piece from him. Return to Rockrest Flat, and the boar will fight you for the gold.\n## Yellow-Robed Squire Boss Fight and Guide",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Yellow 34.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4f/Wukong_Yellow_34.jpg)\nAfter sobering up, the Drunken Boar will then head to the Crouching Tiger Temple, and there request that you get him some tasty Jade Lotus -- which can be harvested in most pools of water.\"\n        - Following Text: \"Finally, the Yellow-Robed Squire will return to near where you first met him, looking for a missing Gold Piece held by one of the Rat Princes. You can find this by defeating the First Prince of Flowing Sands in the Valley of Despair, and obtaning the Arhat Gold Piece from him. Return to Rockrest Flat, and the boar will fight you for the gold.\n## Yellow-Robed Squire Boss Fight and Guide\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the Drunken Boar, a character from *Black Myth: Wukong*, likely in a cinematic or gameplay moment. The preceding text describes the boar's request for Jade Lotus at the Crouching Tiger Temple, while the following text mentions his return to Rockrest Flat for a confrontation over the Arhat Gold Piece. This scene may represent a key narrative or boss encounter involving the Drunken Boar."
}