{
    "chunk_id": 815849449263,
    "source_file": "Top_Takes_Bottom,_Bottom_Takes_Top_Spirit.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/90/Top_Takes_Bottom_Spirit.jpg",
    "alt_text": "Top Takes Bottom Spirit.jpg",
    "position_desc": 3,
    "img_above_text": "The foes will also use each half of the iron ball as a shield of sorts. You will not do any damage to them by hitting this shield, so try to get behind them whenever they are shielding themselves. They are both armed with weapons as well as the dangerous ball, so keep an eye out for their swings and watch your back for the other enemy at all times.\n## Top Takes Bottom, Bottom Takes Top Spirit",
    "img_below_text": "* **Two in One**\n* Equipped Effect: Significantly increases Defense, but moderately reduces Attack.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The foes will also use each half of the iron ball as a shield of sorts. You will not do any damage to them by hitting this shield, so try to get behind them whenever they are shielding themselves. They are both armed with weapons as well as the dangerous ball, so keep an eye out for their swings and watch your back for the other enemy at all times.\n## Top Takes Bottom, Bottom Takes Top Spirit\"\n        - Following Text: \"* **Two in One**\n* Equipped Effect: Significantly increases Defense, but moderately reduces Attack.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image showcases the \"Equipment\" menu in a video game, specifically highlighting a spirit named \"Top Takes Bottom, Bottom Takes Top.\" This spirit has an epic rarity and a high Qi cost. Its ability, \"Two in One,\" allows it to transform into an iron ball that bounces and slams down, striking enemies three times. The equipped effect significantly increases defense but moderately reduces attack. The menu also provides options to equip the spirit, view a demo of its ability, and examine its details."
}