{
    "chunk_id": 106007467296,
    "source_file": "New_Thunderclap_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1c/Wukong_Thunderclap_43.jpg",
    "alt_text": "Wukong Thunderclap 43.jpg",
    "position_desc": 42,
    "img_above_text": "Once at the top of the building, be ready for another Overseeing Monk to ambush you, and then head out to the balcony to deal with the lightning mages.\nBefore heading through the doors behind the two mages, look instead for another path along the balcony leading to a large bridge.",
    "img_below_text": "Take this bridge path up to find a massive statue altar at the far end. Standing next to a pillar nearby, you'll have your third meeting with the friendly Horse Guai. It seems he's quite bewitched by Yellowbrow and has lost the will to continue his quest.\nWhile there's nothing you can do to resolve his dilemma (other than beat up Yellowbrow yourself), you can keep talking to him and he'll give you the **Trailblazer's Scarlet Gourd** , a new gourd bottle you can try that grants a full heal on the first swig!",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Once at the top of the building, be ready for another Overseeing Monk to ambush you, and then head out to the balcony to deal with the lightning mages.\nBefore heading through the doors behind the two mages, look instead for another path along the balcony leading to a large bridge.\"\n        - Following Text: \"Take this bridge path up to find a massive statue altar at the far end. Standing next to a pillar nearby, you'll have your third meeting with the friendly Horse Guai. It seems he's quite bewitched by Yellowbrow and has lost the will to continue his quest.\nWhile there's nothing you can do to resolve his dilemma (other than beat up Yellowbrow yourself), you can keep talking to him and he'll give you the **Trailblazer's Scarlet Gourd** , a new gourd bottle you can try that grants a full heal on the first swig!\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from a video game where the player character, armed with a spear, confronts a large, armored humanoid creature resembling a Horse Guai on a snowy wooden balcony. This encounter aligns with the narrative context, where the player is directed to a bridge path leading to a statue altar and a meeting with the Horse Guai. The image likely illustrates the moment of interaction or confrontation with this character, who plays a role in the story's progression."
}