{
    "chunk_id": 660413886005,
    "source_file": "Snowhill_Path_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/96/Wukong_Snowhill_6.jpg",
    "alt_text": "Wukong Snowhill 6.jpg",
    "position_desc": 5,
    "img_above_text": "Head upwards to a break in the cave as the snowy wind billows down, and prepare for the low visibility to mask another Cyan Bat hiding around the corner.\n## Frost-Clad Path",
    "img_below_text": "Grab the green Wisp and absorb it as you head up the final tunnel section of this cave, which will bring you at last to a large field of Snowhill Path. You can find some Gentian plants around here as you exit, and up ahead you can find the Frost-Clad Path Shrine.\nLike the previous chapters, this shrine has a whole new store for you to browse, and you'll also be able to start investing in crafting the Ochre Armor Set and Rat Sage Staff (or possibly the Loongwreathe Staff as well if you defeated the Red Loong and Black Loong in the previous chapters). These weapons will cost a fair amount of Will and other materials, so check your inventory often for when you have enough to upgrade, and also look into stocking up on new items:",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Head upwards to a break in the cave as the snowy wind billows down, and prepare for the low visibility to mask another Cyan Bat hiding around the corner.\n## Frost-Clad Path\"\n        - Following Text: \"Grab the green Wisp and absorb it as you head up the final tunnel section of this cave, which will bring you at last to a large field of Snowhill Path. You can find some Gentian plants around here as you exit, and up ahead you can find the Frost-Clad Path Shrine.\nLike the previous chapters, this shrine has a whole new store for you to browse, and you'll also be able to start investing in crafting the Ochre Armor Set and Rat Sage Staff (or possibly the Loongwreathe Staff as well if you defeated the Red Loong and Black Loong in the previous chapters). These weapons will cost a fair amount of Will and other materials, so check your inventory often for when you have enough to upgrade, and also look into stocking up on new items:\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a snowy, rugged landscape with a lone character, armed with a staff, overlooking a field surrounded by sparse trees and rocky terrain. This scene likely represents the transition from the cave to the Snowhill Path, as described in the text. The setting emphasizes the harsh, low-visibility conditions and hints at the upcoming Frost-Clad Path Shrine, where players can craft new gear and upgrade items."
}