{
    "chunk_id": 251822796060,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/59/Furnace_Valley_Walkthrough_%2833%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(33\\).png",
    "position_desc": 14,
    "img_above_text": "Right at the end of this path, you'll find a Turtle Treasure guarding a chest. This Turtle Treasure holds a Spirit for you to collect once you've beaten it. After grabbing the Turtle Treasure Spirit, open the chest to collect Kun Steel, Knot of Voidness, and Medicines.\nTurtle Treasure Spirit",
    "img_below_text": "Backtrack on yourself and go straight up through the path on the left between the rocks. Head for the lava stream running from the ceiling straight up ahead but stop to kill the last Flamling on the right, just behind the rock, and harvest the Fire Date from the tree on the right.\n![Furnace Valley Walkthrough \\(35\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a7/Furnace_Valley_Walkthrough_%2835%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Right at the end of this path, you'll find a Turtle Treasure guarding a chest. This Turtle Treasure holds a Spirit for you to collect once you've beaten it. After grabbing the Turtle Treasure Spirit, open the chest to collect Kun Steel, Knot of Voidness, and Medicines.\nTurtle Treasure Spirit\"\n        - Following Text: \"Backtrack on yourself and go straight up through the path on the left between the rocks. Head for the lava stream running from the ceiling straight up ahead but stop to kill the last Flamling on the right, just behind the rock, and harvest the Fire Date from the tree on the right.\n![Furnace Valley Walkthrough \\(35\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a7/Furnace_Valley_Walkthrough_%2835%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a fiery, lava-filled environment with a player character standing in the foreground, holding a staff-like weapon. Two red arrows indicate possible paths forward through the rocky terrain. This scene aligns with the walkthrough's instructions to navigate toward a lava stream running from the ceiling while encountering enemies and collecting resources, such as the Fire Date from a nearby tree."
}