{
    "chunk_id": 394694271598,
    "source_file": "Valley_of_Ecstasy_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/78/Wukong_Felicity_1.jpg",
    "alt_text": "Wukong Felicity 1.jpg",
    "position_desc": 27,
    "img_above_text": "Beyond this arena, you can head through an archway to see the giant titular Valley of Ecstasy below you. It's a one-way slide, and the region is about to get a whole lot bigger and confusing.\n## Forest of Felicity",
    "img_below_text": "As you slide into the Valley of Ecstasy proper and watch the familiar Apramana Bat fly past you (provided you fought him at the Bitter Lake), you may notice you're entering a sizeable region. Luckily there's a Shrine near your landing spot, but it can be easy to get turned around and lost in this expansive valley, so we'll break it down for you:\n![Wukong Felicity 2.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b1/Wukong_Felicity_2.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Beyond this arena, you can head through an archway to see the giant titular Valley of Ecstasy below you. It's a one-way slide, and the region is about to get a whole lot bigger and confusing.\n## Forest of Felicity\"\n        - Following Text: \"As you slide into the Valley of Ecstasy proper and watch the familiar Apramana Bat fly past you (provided you fought him at the Bitter Lake), you may notice you're entering a sizeable region. Luckily there's a Shrine near your landing spot, but it can be easy to get turned around and lost in this expansive valley, so we'll break it down for you:\n![Wukong Felicity 2.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b1/Wukong_Felicity_2.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a snowy, forested slope where a character, likely the protagonist, is sliding downhill amidst scattered debris and snow. The scene aligns with the walkthrough's description of entering the Valley of Ecstasy via a one-way slide, emphasizing the transition into a larger, more complex region. This moment sets the stage for exploration and potential disorientation in the expansive valley ahead."
}