{
    "chunk_id": 441916635328,
    "source_file": "Bluebridge_Romance.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/28/Wukong_Bitter_27.jpg",
    "alt_text": "Wukong Bitter 27.jpg",
    "position_desc": 1,
    "img_above_text": "## Black Myth: Wukong Bluebridge Romance Location\nThe Bluebridge Romance Drink can be found in Chapter 3 - The New West. From the North Shore of the Bitter Lake Shrine in the Bitter Lake, follow the coast along the left. Eventually, you will pass through a red gate. Walk all the way to the back of the area to the house in the distance to find the Bluebridge Romance Drink sitting in on the side of the lake to the left of the house.",
    "img_below_text": "There aren't too many Drinks in the game compared to the Soaks, so be sure to keep your eye out for them. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Black Myth: Wukong Bluebridge Romance Location\nThe Bluebridge Romance Drink can be found in Chapter 3 - The New West. From the North Shore of the Bitter Lake Shrine in the Bitter Lake, follow the coast along the left. Eventually, you will pass through a red gate. Walk all the way to the back of the area to the house in the distance to find the Bluebridge Romance Drink sitting in on the side of the lake to the left of the house.\"\n        - Following Text: \"There aren't too many Drinks in the game compared to the Soaks, so be sure to keep your eye out for them. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game \"Black Myth: Wukong\" where the player character is approaching a specific location by a lake. The red arrow and circle highlight the path and the target area where the Bluebridge Romance Drink can be found, as described in the preceding text. This guide image is intended to help players locate the drink in Chapter 3 - The New West, near the Bitter Lake Shrine."
}