{
    "chunk_id": 879726234495,
    "source_file": "New_Thunderclap_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d5/Wukong_Thunderclap_31.jpg",
    "alt_text": "Wukong Thunderclap 31.jpg",
    "position_desc": 30,
    "img_above_text": "![Wukong Thunderclap 30.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/6f/Wukong_Thunderclap_30.jpg)\nThe four-legged creatures can emit fire from several places -- using a large opening on its chest to emit a huge flamethrower you'll need to Immobilize to shut down or stay well away from.",
    "img_below_text": "The creatures also has little mouths on each of its kneecaps that can also emit flames, and while they don't travel as far, the monster will constantly spin around to shoot fire on all sides.\nIt will often follow up these attacks by utilizing it's spear to charge forward in a thrust attack, or slam it into the ground, pivot, and pull it out again with a wide slash while also breathing fire from its knees. If you see the monster draw in power, be ready for a torrent of a fireball that will shoot your way and cannot be deflected with a staff spin, requiring you to dodge instead.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Thunderclap 30.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/6f/Wukong_Thunderclap_30.jpg)\nThe four-legged creatures can emit fire from several places -- using a large opening on its chest to emit a huge flamethrower you'll need to Immobilize to shut down or stay well away from.\"\n        - Following Text: \"The creatures also has little mouths on each of its kneecaps that can also emit flames, and while they don't travel as far, the monster will constantly spin around to shoot fire on all sides.\nIt will often follow up these attacks by utilizing it's spear to charge forward in a thrust attack, or slam it into the ground, pivot, and pull it out again with a wide slash while also breathing fire from its knees. If you see the monster draw in power, be ready for a torrent of a fireball that will shoot your way and cannot be deflected with a staff spin, requiring you to dodge instead.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat encounter in *Black Myth: Wukong*, showcasing a large, four-legged creature emitting flames from multiple points, including its chest and knees. The player character, positioned in the foreground, appears to be preparing to engage the fiery enemy in a snowy, temple-like environment. The preceding and following text describe the creature's fire-based attacks, including flamethrowers, spinning flame bursts, and spear strikes, emphasizing the need for strategic dodging and immobilization to survive."
}