{
    "chunk_id": 771671956063,
    "source_file": "Mother_of_Stones.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/63/Wukong_Fright_28.jpg",
    "alt_text": "Wukong Fright 28.jpg",
    "position_desc": 1,
    "img_above_text": "Once inside the Fright Cliff region, head past the Squall Hideout Shrine and keep left to enter a large cave area, and take a left turn to find the unresponsive boss.\n### Mother of Stones Boss Fight",
    "img_below_text": "This boss battle is an interesting one, simply because the giant crystal-embedded statue known as the Mother of Stones doesn’t actually fight you. It doesn’t really move at all, but it has a lot of health to slowly chip through.\nWhat will fight you, however, is the army of Palestones you can spot embedded in the ground and walls all around you. Make no mistake, this will be an endurance battle, as you’ll need to survive repeated encounters with more and more Palestones.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Once inside the Fright Cliff region, head past the Squall Hideout Shrine and keep left to enter a large cave area, and take a left turn to find the unresponsive boss.\n### Mother of Stones Boss Fight\"\n        - Following Text: \"This boss battle is an interesting one, simply because the giant crystal-embedded statue known as the Mother of Stones doesn’t actually fight you. It doesn’t really move at all, but it has a lot of health to slowly chip through.\nWhat will fight you, however, is the army of Palestones you can spot embedded in the ground and walls all around you. Make no mistake, this will be an endurance battle, as you’ll need to survive repeated encounters with more and more Palestones.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the \"Mother of Stones\" boss fight from a video game. The scene shows the player engaging with the crystal-embedded statue-like boss, which remains stationary and has a health bar displayed at the bottom of the screen. Bright crystal effects and projectiles are visible, suggesting combat activity. The preceding and following text explain that while the boss itself does not attack, the fight involves surviving waves of hostile enemies called Palestones embedded in the environment. This is described as an endurance battle requiring sustained effort to chip away at the boss's health while managing incoming threats."
}