{
    "chunk_id": 183392074139,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7a/Wukong_Wolves_6.jpg",
    "alt_text": "Wukong Wolves 6.jpg",
    "position_desc": 14,
    "img_above_text": "![Wukong Wolves 5.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/dd/Wukong_Wolves_5.jpg)\nThe route on the left leads down to a Wolf Scout guarding a small gold chest, which contains 5 **Tiny Piece of Gold** \\- an item that can be sold at shops to earn more Will.",
    "img_below_text": "Taking the path to the right leads to a stronger Wolf Stalwart. armed with a large axe. He’s built a bit tougher than the others, and has some hard-hitting and long reaching swings with his axe, as well as a quick shove attack that’s hard to anticipate and dodge before he follows it with a chop.\nIf you take a few hits, remember that you have a gourd of healing drink that you can use (LB/L1) to replenish a bit of your health, but it can only be used a few times.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Wolves 5.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/dd/Wukong_Wolves_5.jpg)\nThe route on the left leads down to a Wolf Scout guarding a small gold chest, which contains 5 **Tiny Piece of Gold** \\- an item that can be sold at shops to earn more Will.\"\n        - Following Text: \"Taking the path to the right leads to a stronger Wolf Stalwart. armed with a large axe. He’s built a bit tougher than the others, and has some hard-hitting and long reaching swings with his axe, as well as a quick shove attack that’s hard to anticipate and dodge before he follows it with a chop.\nIf you take a few hits, remember that you have a gourd of healing drink that you can use (LB/L1) to replenish a bit of your health, but it can only be used a few times.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an in-game combat sequence from *Black Myth: Wukong*. The player character is engaged in a fight with a Wolf Scout, a humanoid wolf enemy wielding a weapon. Sparks and motion blur suggest an active attack or block during the encounter. This scene aligns with the preceding text, which describes a Wolf Scout guarding a small gold chest, and the following text, which warns of a tougher enemy on an alternate path. The image highlights the dynamic combat and environmental detail of the game."
}