{
    "chunk_id": 890454585960,
    "source_file": "Frostsprout_Twig.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/ac/Frostspout_Twig_1.jpg",
    "alt_text": "Frostspout Twig 1.jpg",
    "position_desc": 2,
    "img_above_text": "## Black Myth: Wukong Frostsprout Twig Location\nThe Frostsprout Twig can be obtained by defeating Captain Lotus-Vision in the Pagoda Realm within The New West. From the Upper Pagoda Shrine, jump down in the gap behind the Shrine (inside the cave, not near the outer platforms) and defeat Captain Lotus-Vision to obtain the Curios. It is quite a difficult fight, but our boss breakdown and guide has tons of tips to help you out.",
    "img_below_text": "For even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Black Myth: Wukong Frostsprout Twig Location\nThe Frostsprout Twig can be obtained by defeating Captain Lotus-Vision in the Pagoda Realm within The New West. From the Upper Pagoda Shrine, jump down in the gap behind the Shrine (inside the cave, not near the outer platforms) and defeat Captain Lotus-Vision to obtain the Curios. It is quite a difficult fight, but our boss breakdown and guide has tons of tips to help you out.\"\n        - Following Text: \"For even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image shows a gameplay scene from *Black Myth: Wukong*, where the player character stands on a ledge overlooking a cave area. This location is likely part of the walkthrough for finding the Frostsprout Twig, as mentioned in the preceding text. The player appears to be preparing to descend into the cave to face Captain Lotus-Vision, a boss required to obtain the item."
}