{
    "chunk_id": 279362712535,
    "source_file": "Yellow_Sand_Formation_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b5/Wukong_Yellow_21.jpg",
    "alt_text": "Wukong Yellow 21.jpg",
    "position_desc": 21,
    "img_above_text": "### Yaoguai Chief Mini-Boss Fight - Tiger’s Acolyte\nA follower of the Tiger Vanguard, the strange man will call out for his missing son before violently attacking you. And just like his master, he’s incredibly ferocious, and it can be hard to anticipate his attacks, let alone whether he’ll attack with his very long sword or very long claws.",
    "img_below_text": "The battle will often begin with him lowering his sword, only to leap forward at blinding speed to attack with both sword and claw at once, rolling past you as he does, and then performing a follow up slash as he finishes his roll. This means you’ll want to dodge past him as he approaches, so you can safely distance yourself from the following slash and then attack him back.\n![Wukong Yellow 22.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/24/Wukong_Yellow_22.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"### Yaoguai Chief Mini-Boss Fight - Tiger’s Acolyte\nA follower of the Tiger Vanguard, the strange man will call out for his missing son before violently attacking you. And just like his master, he’s incredibly ferocious, and it can be hard to anticipate his attacks, let alone whether he’ll attack with his very long sword or very long claws.\"\n        - Following Text: \"The battle will often begin with him lowering his sword, only to leap forward at blinding speed to attack with both sword and claw at once, rolling past you as he does, and then performing a follow up slash as he finishes his roll. This means you’ll want to dodge past him as he approaches, so you can safely distance yourself from the following slash and then attack him back.\n![Wukong Yellow 22.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/24/Wukong_Yellow_22.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from a video game where the player character is engaged in a mini-boss fight against the \"Tiger's Acolyte.\" The acolyte, who is searching for his missing son, is shown charging towards the player with a long sword and claws, indicating the start of a fierce battle. The setting appears to be an ancient, weathered stone bridge with decorative pillars. The image serves to illustrate the intense combat encounter described in the surrounding text."
}