{
    "chunk_id": 642886930231,
    "source_file": "Yellow_Sand_Formation_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bc/Wukong_Yellow_11.jpg",
    "alt_text": "Wukong Yellow 11.jpg",
    "position_desc": 11,
    "img_above_text": "The Boar’s Sobering StoneAfter killing the Blazebone in this courtyard, look around for an open shack across from a Fire Bellflower, and you’ll find a small glowing jar. Break it open and you’ll receive a **Sobering Stone** \\- the exact kind of item the drunk boar in the yellow robe needs to sober up back at the Fright Cliff.\nExit the large building to the side to find a larger open center of the village, where a Spearbone patrols near a few more Blazebones. If you stick to the left wall, you can find a walkway up to a group of ruined shacks. Here you’ll find a Rat Governor looking over a chest, but beware, he’s got several Rat Archers backing him up in the corners.",
    "img_below_text": "You can either try to lure them out by dashing around the corner, or use something like Cloud Step or Pluck of Many to confuse and draw their fire to take out the archers, and then the Governor. Once they’ve been defeated, help yourself to the spoils in the chest for 1 **Small Piece of Gold** and 3 **Tiny Piece of Gold**.\n![Wukong Yellow 12.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/54/Wukong_Yellow_12.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Boar’s Sobering StoneAfter killing the Blazebone in this courtyard, look around for an open shack across from a Fire Bellflower, and you’ll find a small glowing jar. Break it open and you’ll receive a **Sobering Stone** \\- the exact kind of item the drunk boar in the yellow robe needs to sober up back at the Fright Cliff.\nExit the large building to the side to find a larger open center of the village, where a Spearbone patrols near a few more Blazebones. If you stick to the left wall, you can find a walkway up to a group of ruined shacks. Here you’ll find a Rat Governor looking over a chest, but beware, he’s got several Rat Archers backing him up in the corners.\"\n        - Following Text: \"You can either try to lure them out by dashing around the corner, or use something like Cloud Step or Pluck of Many to confuse and draw their fire to take out the archers, and then the Governor. Once they’ve been defeated, help yourself to the spoils in the chest for 1 **Small Piece of Gold** and 3 **Tiny Piece of Gold**.\n![Wukong Yellow 12.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/54/Wukong_Yellow_12.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from a video game where the player character is approaching a chest guarded by a Rat Governor and Rat Archers in a ruined village setting. The chest, highlighted with a red dashed circle, contains loot including 1 **Small Piece of Gold** and 3 **Tiny Piece of Gold**. The preceding and following text suggests strategies to defeat the enemies, such as luring them out or using abilities like **Cloud Step** or **Pluck of Many**, before claiming the rewards."
}