{
    "chunk_id": 3509511221,
    "source_file": "How_to_Defeat_the_Stone_Vanguard_With_Another_Boss.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e5/30_CrouchingTigerTemple_1.mp4.00_10_00_46.Still012.jpg",
    "alt_text": "30 CrouchingTigerTemple 1.mp4.00 10 00 46.Still012.jpg",
    "position_desc": 5,
    "img_above_text": "If you try interacting with it early, you'll find an inscription about how this rock is actually the Shigandang Yaoguai King Boss, sealed away with six items of divinity, which you can use to release him.\n## How to Summon the Shigandang Boss",
    "img_below_text": "In order to release the Shigandang from his prison, you'll need to search the Fright Cliff for six Buddha statue heads, and claim all six Buddha Eyeballs from them. You can find a detailed guide for All Buddha Eyeball Locations here, or check see the quick list below:\n1. Located on the path up to the Squall Hideout Shrine.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"If you try interacting with it early, you'll find an inscription about how this rock is actually the Shigandang Yaoguai King Boss, sealed away with six items of divinity, which you can use to release him.\n## How to Summon the Shigandang Boss\"\n        - Following Text: \"In order to release the Shigandang from his prison, you'll need to search the Fright Cliff for six Buddha statue heads, and claim all six Buddha Eyeballs from them. You can find a detailed guide for All Buddha Eyeball Locations here, or check see the quick list below:\n1. Located on the path up to the Squall Hideout Shrine.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a character interacting with an object, possibly related to the process of summoning the Shigandang Yaoguai King Boss. Based on the context, the interaction may involve collecting or activating one of the six Buddha statue heads or Buddha Eyeballs required to release the boss from its sealed state. The glowing effect suggests an action or event tied to the game's narrative progression."
}