{
    "chunk_id": 548588434253,
    "source_file": "Yellow_Sand_Formation_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/ae/Wukong_Sahali_1.jpg",
    "alt_text": "Wukong Sahali 1.jpg",
    "position_desc": 37,
    "img_above_text": "Give it to him, and he’ll give you a cryptic message about the Realm of Gold located where the sun sets, but it’s not a lot to go on. He also mentions the Yellow Wind Guai said “our senior brother gave me a piece of gold. I’ll need it here when the time’s right.” The Boar thinks the time is right to try it now.\nIt’s a bit of a riddle, but the “senior brother” was the First Prince of Flowing Sand that you fought in the Valley of Despair, who just happened to drop the Arhat Gold Piece. All that’s left is to bring it to the right place, which happens to be back where you first encountered the Boar Guai.",
    "img_below_text": "However, when you approach the field, you’ll find him off to the right on the stairs leading to the large door. He’ll become angry that you have the gold, and try to fight you for it.\n![Wukong Sahali 10.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7b/Wukong_Sahali_10.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Give it to him, and he’ll give you a cryptic message about the Realm of Gold located where the sun sets, but it’s not a lot to go on. He also mentions the Yellow Wind Guai said “our senior brother gave me a piece of gold. I’ll need it here when the time’s right.” The Boar thinks the time is right to try it now.\nIt’s a bit of a riddle, but the “senior brother” was the First Prince of Flowing Sand that you fought in the Valley of Despair, who just happened to drop the Arhat Gold Piece. All that’s left is to bring it to the right place, which happens to be back where you first encountered the Boar Guai.\"\n        - Following Text: \"However, when you approach the field, you’ll find him off to the right on the stairs leading to the large door. He’ll become angry that you have the gold, and try to fight you for it.\n![Wukong Sahali 10.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7b/Wukong_Sahali_10.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from *Black Myth: Wukong*, showcasing a rugged, desolate area with ancient, weathered structures and scaffolding built into rocky cliffs. In the foreground, a character is engaged in combat, wielding a staff, while another figure resembling a boar-like creature stands on stairs leading to a large door in the background. This setting aligns with the narrative where the Boar Guai becomes hostile over the possession of the Arhat Gold Piece, initiating a confrontation near the location where players first encountered him."
}