{
    "chunk_id": 295565409548,
    "source_file": "Thunderbolt_Horn.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fc/Thunderbolt_Horn_2.jpg",
    "alt_text": "Thunderbolt Horn 2.jpg",
    "position_desc": 1,
    "img_above_text": "The Thunderbolt Horn is one of the Uncommon Soaks for your Gourds in Black Myth: Wukong. It offers a rather specialized buff to your Gourd, compared to some of the flat-out damage negation buffs or health boosts some of the Soaks offer.\nWhen using the Gourd with the Thunderbolt Horn equipped, it will moderately increase Shock resistance for a short duration, which can be great against enemies or bosses that deal Shock damage.",
    "img_below_text": "Your Soaks can't be upgraded. Unlike the Drinks and the Gourd itself, which can be upgraded. Therefore, you can't enhance the effect of the Thunderbolt Horn. If you want to switch to a different Soak, be sure to visit the Shen Monkey Vendor throughout your game to continue equipping new ones.\n## Black Myth: Wukong Thunderbolt Horn Location",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Thunderbolt Horn is one of the Uncommon Soaks for your Gourds in Black Myth: Wukong. It offers a rather specialized buff to your Gourd, compared to some of the flat-out damage negation buffs or health boosts some of the Soaks offer.\nWhen using the Gourd with the Thunderbolt Horn equipped, it will moderately increase Shock resistance for a short duration, which can be great against enemies or bosses that deal Shock damage.\"\n        - Following Text: \"Your Soaks can't be upgraded. Unlike the Drinks and the Gourd itself, which can be upgraded. Therefore, you can't enhance the effect of the Thunderbolt Horn. If you want to switch to a different Soak, be sure to visit the Shen Monkey Vendor throughout your game to continue equipping new ones.\n## Black Myth: Wukong Thunderbolt Horn Location\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image showcases the inventory screen from *Black Myth: Wukong*, highlighting the \"Thunderbolt Horn,\" an Uncommon Soak item. The item description explains that equipping it to the Gourd grants a moderate increase in Shock resistance for a short duration. The screen also provides a visual of the Thunderbolt Horn and its lore text, emphasizing its utility against Shock damage-dealing enemies or bosses."
}