{
    "chunk_id": 142123558687,
    "source_file": "Non-Able.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/42/Wukong_Brook_23.jpg",
    "alt_text": "Wukong Brook 23.jpg",
    "position_desc": 16,
    "img_above_text": "![Wukong Brook 29.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c6/Wukong_Brook_29.jpg)\nHowever, he can vary up his moves to keep you guessing. Sometimes after the aforementioned stance, he can also abandon his palm blast for a quick sliding spin kick, so keep an eye on his movements and don't get comfortable in predicting his movements.",
    "img_below_text": "That's not the only martial arts stance he can adopt, either. If you see him flex both arms vertically below his face, he'll do a variation on the three-hit palm strike. Only in these cases, he'll often follow up his third attack with a delayed final hit, spinning his body to backhand you with his glowing right hand that can decimate your health bar.\n![Wukong Brook 25.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a5/Wukong_Brook_25.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Brook 29.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c6/Wukong_Brook_29.jpg)\nHowever, he can vary up his moves to keep you guessing. Sometimes after the aforementioned stance, he can also abandon his palm blast for a quick sliding spin kick, so keep an eye on his movements and don't get comfortable in predicting his movements.\"\n        - Following Text: \"That's not the only martial arts stance he can adopt, either. If you see him flex both arms vertically below his face, he'll do a variation on the three-hit palm strike. Only in these cases, he'll often follow up his third attack with a delayed final hit, spinning his body to backhand you with his glowing right hand that can decimate your health bar.\n![Wukong Brook 25.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a5/Wukong_Brook_25.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an intense combat scene from *Black Myth: Wukong*, showcasing an enemy performing a sliding spin kick attack in a snowy environment. This move is described in the preceding text as one of the variations the enemy uses to keep players guessing during battle. The glowing effect on the enemy's hand highlights the impact of the attack, emphasizing its potential danger to the player's health bar."
}