{
    "chunk_id": 412522203818,
    "source_file": "Webbed_Hollow_-_Upper_Hollow_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/36/Wukong_UpperHollow_44.jpg",
    "alt_text": "Wukong UpperHollow 44.jpg",
    "position_desc": 46,
    "img_above_text": "Venom Daoist (Webbed Hollow)\nWith everything cleared on the top floor of the Webbed Hollow, it's time to make your way down.",
    "img_below_text": "Head back to the Pool of Shattered Jade Shrine, and look back to the path where the Scorpion Prince was to spot a large wooden scaffold bridge. Be sure to check around the left side first for a green Wisp, then cross the two-tiered bridge to drop down a level.\n![Wukong UpperHollow 45.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/16/Wukong_UpperHollow_45.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Venom Daoist (Webbed Hollow)\nWith everything cleared on the top floor of the Webbed Hollow, it's time to make your way down.\"\n        - Following Text: \"Head back to the Pool of Shattered Jade Shrine, and look back to the path where the Scorpion Prince was to spot a large wooden scaffold bridge. Be sure to check around the left side first for a green Wisp, then cross the two-tiered bridge to drop down a level.\n![Wukong UpperHollow 45.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/16/Wukong_UpperHollow_45.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from *Black Myth: Wukong* showing the player character, Wukong, standing on a grassy ledge overlooking a dimly lit cavern with wooden scaffold bridges and hanging torches. A red-circled green Wisp is visible in the distance, indicating an item or collectible. The setting aligns with the guide's instructions to explore the area near the Pool of Shattered Jade Shrine and cross the scaffold bridge. The HUD displays the equipped item, \"Evil Repelling Medicament,\" and various abilities."
}