{
    "chunk_id": 257429762120,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/df/Wukong_Fright_24.jpg",
    "alt_text": "Wukong Fright 24.jpg",
    "position_desc": 25,
    "img_above_text": "![Wukong Fright 23.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/68/Wukong_Fright_23.jpg)\nAdvance cautiously to spy a Poisestone and two Bladebones on some scaffolding awaiting your arrival. Use Cloudstep to ambush the weaker enemies first, then slam into the Poisestone with a charged hit to put it down.",
    "img_below_text": "Near this defensive outpost is another tunnel exit, and you can step out quickly to find a Spearbone with a shield, who guards the outdoor path that connects back down to the crevice. Back in the cave, you can check the left wall to find another green Wisp to absorb, and note the golden trail of a nearby Shrine at another tunnel exit up ahead. It’s not a bad idea to activate and rest at this **Rockrest Flat Shrine** first, considering the quest we still have to finish the cave first that can be tough.\n![Wukong Fright 25.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/dd/Wukong_Fright_25.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Fright 23.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/68/Wukong_Fright_23.jpg)\nAdvance cautiously to spy a Poisestone and two Bladebones on some scaffolding awaiting your arrival. Use Cloudstep to ambush the weaker enemies first, then slam into the Poisestone with a charged hit to put it down.\"\n        - Following Text: \"Near this defensive outpost is another tunnel exit, and you can step out quickly to find a Spearbone with a shield, who guards the outdoor path that connects back down to the crevice. Back in the cave, you can check the left wall to find another green Wisp to absorb, and note the golden trail of a nearby Shrine at another tunnel exit up ahead. It’s not a bad idea to activate and rest at this **Rockrest Flat Shrine** first, considering the quest we still have to finish the cave first that can be tough.\n![Wukong Fright 25.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/dd/Wukong_Fright_25.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the player character in *Black Myth: Wukong* advancing cautiously through a rocky, outdoor environment with scattered scaffolding and enemies ahead. This scene aligns with the preceding text, where the player is advised to use stealth and the Cloudstep ability to ambush weaker enemies and eliminate a Poisestone. The setting transitions to an area near a defensive outpost and a tunnel exit, as described in the following text."
}