{
    "chunk_id": 935491027940,
    "source_file": "Centipede_Guai.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d8/Wukong_MiddleHollow_39.jpg",
    "alt_text": "Wukong MiddleHollow 39.jpg",
    "position_desc": 4,
    "img_above_text": "![Wukong MiddleHollow 42.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/25/Wukong_MiddleHollow_42.jpg)\nIt can also rear back while still crouched on the ground, and extend its head to lunge at you up to two times in a row with reaching claw swipes.",
    "img_below_text": "However, when you see the Centipede Guai stand up on its two legs, back off your attack immediately. It will start spewing poison down below its body as it staggers around, hoping to catch you unaware.\nOften times when it returns to crawl on the ground, it will take a few moments to pause and groom itself, giving you a huge window to attack, just watch your spacing or use a Pillar Stance to get out of the poison goo on the ground.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong MiddleHollow 42.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/25/Wukong_MiddleHollow_42.jpg)\nIt can also rear back while still crouched on the ground, and extend its head to lunge at you up to two times in a row with reaching claw swipes.\"\n        - Following Text: \"However, when you see the Centipede Guai stand up on its two legs, back off your attack immediately. It will start spewing poison down below its body as it staggers around, hoping to catch you unaware.\nOften times when it returns to crawl on the ground, it will take a few moments to pause and groom itself, giving you a huge window to attack, just watch your spacing or use a Pillar Stance to get out of the poison goo on the ground.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a battle scene from the video game \"Black Myth: Wukong,\" featuring the player character confronting a large, menacing creature known as the Centipede Guai. The creature is shown spewing poison as it stands on its two legs, a dangerous attack that players are advised to avoid by backing off. The surrounding environment is dark and filled with skeletal remains, emphasizing the perilous nature of the encounter. The image serves to illustrate the creature's attack patterns and the hazardous conditions players must navigate during this boss fight."
}