{
    "chunk_id": 982697793624,
    "source_file": "How_to_Unlock_the_Zodiac_Village_and_Upgrade_Armor_.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a9/Zodiac_Village_%2837%29.png",
    "alt_text": "Zodiac Village \\(37\\).png",
    "position_desc": 10,
    "img_above_text": "You'll need to wait a little while before new medicines are available, but you'll know when they are if the red dot next to Request Medicines appears.\n## How to Use Seeds and Harvest Ingredients",
    "img_below_text": "If you've acquired any seeds so far in your journey, you can give them to Chen Loong. He sits behind the Shen Monkey and Xu Dog, up the stairs. Just before the stairs, you can find baskets where you can harvest ingredients, or you can speak to him and the option to harvest the ingredients will appear.\n### Happy Harvest!",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"You'll need to wait a little while before new medicines are available, but you'll know when they are if the red dot next to Request Medicines appears.\n## How to Use Seeds and Harvest Ingredients\"\n        - Following Text: \"If you've acquired any seeds so far in your journey, you can give them to Chen Loong. He sits behind the Shen Monkey and Xu Dog, up the stairs. Just before the stairs, you can find baskets where you can harvest ingredients, or you can speak to him and the option to harvest the ingredients will appear.\n### Happy Harvest!\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a character standing near baskets filled with glowing ingredients, likely part of a harvesting mechanic in the game. This scene aligns with the following text, which explains how players can use seeds to grow and harvest ingredients from baskets near Chen Loong's location. The glowing baskets suggest they contain harvestable items, reinforcing the narrative role of gathering resources for crafting or progression."
}