{
    "chunk_id": 904957807985,
    "source_file": "Foothills_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3d/Foothills_Walkthrough_%2863%29.png",
    "alt_text": "Foothills Walkthrough \\(63\\).png",
    "position_desc": 59,
    "img_above_text": "![Foothills Walkthrough \\(51\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/18/Foothills_Walkthrough_%2851%29.png)\nIn this phase, you'll need to avoid the pools of blood. There are also some projectiles, where little orbs of blood will float up in the air and then hone in on you. Thankfully, you'll have a little bit of help with this one, as Zhu Bajie will appear in the second phase to give you a hand.",
    "img_below_text": "This part of the fight is more about managing how long you can stand in the blood for, and jumping back out when you're about to be completely poisoned. Try to bait the deer to run out of the patches of blood, and into the ice where you can attack it freely. You can also use the Wind Vessel in this phase to down the deer temporarily.\nCloudtreading Deer",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Foothills Walkthrough \\(51\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/18/Foothills_Walkthrough_%2851%29.png)\nIn this phase, you'll need to avoid the pools of blood. There are also some projectiles, where little orbs of blood will float up in the air and then hone in on you. Thankfully, you'll have a little bit of help with this one, as Zhu Bajie will appear in the second phase to give you a hand.\"\n        - Following Text: \"This part of the fight is more about managing how long you can stand in the blood for, and jumping back out when you're about to be completely poisoned. Try to bait the deer to run out of the patches of blood, and into the ice where you can attack it freely. You can also use the Wind Vessel in this phase to down the deer temporarily.\nCloudtreading Deer\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a snowy battlefield with pools of blood scattered across the ground, featuring a grotesque, skeletal deer-like creature in the center. This scene is part of a boss fight in *Black Myth: Wukong*, where players must avoid the blood pools to prevent poisoning and strategically lure the creature onto safer terrain for attack. The preceding and following text suggests that Zhu Bajie assists during this phase, and players can use the Wind Vessel to temporarily incapacitate the creature."
}