{
    "chunk_id": 337169936399,
    "source_file": "Yellow_Sand_Formation_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/74/Wukong_Yellow_31.jpg",
    "alt_text": "Wukong Yellow 31.jpg",
    "position_desc": 32,
    "img_above_text": "![Wukong Yellow 30.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/48/Wukong_Yellow_30.jpg)\nHead back to the bridge where you fought the Tiger’s Acolyte, and cross to the far side. You’ll enter a large cave here, and a few Swift Bats will appear to harass you.",
    "img_below_text": "After taking them out, look for an opening in the cave wall where a large column is, and at its base will be a small chest near a Blazebone firing projectiles at you. Loot the chest after defeating it to gain a new Curio - the **Glazed Reliquary**.\nJust past the box, you can find stairs down to a path leading out the cave, putting you on a ledge right above where you fought the Stone Vanguard in the Fright Cliff!",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Yellow 30.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/48/Wukong_Yellow_30.jpg)\nHead back to the bridge where you fought the Tiger’s Acolyte, and cross to the far side. You’ll enter a large cave here, and a few Swift Bats will appear to harass you.\"\n        - Following Text: \"After taking them out, look for an opening in the cave wall where a large column is, and at its base will be a small chest near a Blazebone firing projectiles at you. Loot the chest after defeating it to gain a new Curio - the **Glazed Reliquary**.\nJust past the box, you can find stairs down to a path leading out the cave, putting you on a ledge right above where you fought the Stone Vanguard in the Fright Cliff!\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from a video game where the player character is navigating a cave environment. The focus is on a small chest located at the base of a large column, which is marked with a red circle. This chest is near a Blazebone enemy that fires projectiles at the player. The image is part of a guide that instructs players to defeat the Blazebone and loot the chest to obtain a new item, the Glazed Reliquary, before proceeding further into the cave."
}