{
    "chunk_id": 453851680165,
    "source_file": "Webbed_Hollow_-_Lower_Hollow_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/30/Wukong_LowerHollow_7.jpg",
    "alt_text": "Wukong LowerHollow 7.jpg",
    "position_desc": 7,
    "img_above_text": "![Wukong LowerHollow 6.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/36/Wukong_LowerHollow_6.jpg)\nTo make matters worse, there's no invisible walls to stop you from falling to your death when crossing the bridge, which the Clawed Cocoons AND Dragonfly Guai archer at the far end will absolutely use to their advantage to knock you around as you try to cross. While you can use the Thrust Stance to safely poke a few early cocoons, the strategy won't hold very long, and it's almost impossible to target the actual enemies and not the regular cocoons.",
    "img_below_text": "The easiest way to bamboozle the enemies here and get across without falling is with a bit of subterfuge: Cloud Step. Cast it near the start of the rope bridge, and then sprint all the way to the other end, and don't try to staff spin if any arrows come your way, or you're likely to walk off the side by accident.\n## Relief of the Fallen Loong",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong LowerHollow 6.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/36/Wukong_LowerHollow_6.jpg)\nTo make matters worse, there's no invisible walls to stop you from falling to your death when crossing the bridge, which the Clawed Cocoons AND Dragonfly Guai archer at the far end will absolutely use to their advantage to knock you around as you try to cross. While you can use the Thrust Stance to safely poke a few early cocoons, the strategy won't hold very long, and it's almost impossible to target the actual enemies and not the regular cocoons.\"\n        - Following Text: \"The easiest way to bamboozle the enemies here and get across without falling is with a bit of subterfuge: Cloud Step. Cast it near the start of the rope bridge, and then sprint all the way to the other end, and don't try to staff spin if any arrows come your way, or you're likely to walk off the side by accident.\n## Relief of the Fallen Loong\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a treacherous rope bridge surrounded by large webbed cocoons in a dark, cavernous environment, likely from the game *Black Myth: Wukong*. A glowing enemy or target is visible at the far end of the bridge, marked with a red circle. The preceding and following text explain the challenge of crossing the bridge while avoiding attacks from Clawed Cocoons and a Dragonfly Guai archer, emphasizing the use of strategic movement and abilities like \"Cloud Step\" to safely navigate this hazardous area."
}