{
    "chunk_id": 382215326720,
    "source_file": "Woods_of_Ember_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/91/Woods_Ember_Walkthrough_%2840%29.png",
    "alt_text": "Woods Ember Walkthrough \\(40\\).png",
    "position_desc": 21,
    "img_above_text": "### Tip!\nWhen Revenant Charbones explode, it's not just you that they damage - other enemies will be affected as well. Whenever you see them, focus on attacking one and luring it closer to other enemies, to take advantage of their explosive abilities. When they're in groups, and each one has a low health bar, this can sometimes cause a chain of explosions as they knock each other out one by one.",
    "img_below_text": "Exit the little cave and continue on, where you'll see two more Revenant Charbones with a larger figure (a Revenant Charface) straight ahead. Clear these out first, and be careful of the fast slashing attacks from the Revenant Charface, which also continues once you've killed it.\nWhen it's safe, turn back on yourself. The Fire Bellflower that was on the left as you exited the small cave will now be on the right, and you'll see a path on the right that leads to the next section.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"### Tip!\nWhen Revenant Charbones explode, it's not just you that they damage - other enemies will be affected as well. Whenever you see them, focus on attacking one and luring it closer to other enemies, to take advantage of their explosive abilities. When they're in groups, and each one has a low health bar, this can sometimes cause a chain of explosions as they knock each other out one by one.\"\n        - Following Text: \"Exit the little cave and continue on, where you'll see two more Revenant Charbones with a larger figure (a Revenant Charface) straight ahead. Clear these out first, and be careful of the fast slashing attacks from the Revenant Charface, which also continues once you've killed it.\nWhen it's safe, turn back on yourself. The Fire Bellflower that was on the left as you exited the small cave will now be on the right, and you'll see a path on the right that leads to the next section.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dark, rocky outdoor environment with barren trees and a path leading forward. Highlighted elements include a Fire Bellflower (circled in red) on the left side of the scene, and a group of enemies ahead, including two smaller Revenant Charbones and a larger Revenant Charface. The image serves as a visual aid for the walkthrough, guiding players to interact with the Fire Bellflower and prepare for combat with the enemies while following the described strategy for dealing with Revenant Charbones and Charface."
}