{
    "chunk_id": 844498104226,
    "source_file": "Secrets_in_Black_Myth_Wukong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d1/Secrets_Wukong_%286%29.png",
    "alt_text": "Secrets Wukong \\(6\\).png",
    "position_desc": 24,
    "img_above_text": "Getting the Samadhi Fire Crystals will allow you to craft the Staff of Blazing Karma.\n## Baw-Lang-Lang",
    "img_below_text": "When you've beaten the five carts and cracked through the ice to get into the cave, you're not quite yet in the Bishui Cave realm. To do this, you need to step toward the center of the room. However, if you take a left first and go to the open zone, you can find another of the frog bosses\n## Bishui Cave - Top Takes Bottom, Bottom Takes Top",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Getting the Samadhi Fire Crystals will allow you to craft the Staff of Blazing Karma.\n## Baw-Lang-Lang\"\n        - Following Text: \"When you've beaten the five carts and cracked through the ice to get into the cave, you're not quite yet in the Bishui Cave realm. To do this, you need to step toward the center of the room. However, if you take a left first and go to the open zone, you can find another of the frog bosses\n## Bishui Cave - Top Takes Bottom, Bottom Takes Top\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a frog-like boss character in a dark, rocky environment, likely encountered in the context of progressing through the Bishui Cave area in the game. The preceding and following text suggests this boss is part of a sequence where players must defeat carts and navigate icy terrain to access the cave, with an optional detour to face additional frog bosses."
}