{
    "chunk_id": 882773248284,
    "source_file": "Village_of_Lanxi_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bc/Wukong_Lanxi_14.jpg",
    "alt_text": "Wukong Lanxi 14.jpg",
    "position_desc": 13,
    "img_above_text": "From here, look around to find two paths to take: A narrow walkway over a stream below, and another open path past a building to the right.\nTake the path on the right first, but first look for a small building next to the narrow path where you'll find another **Treasure Chest** inside, guarded by more Stone Spiders that will burrow up to ambush you.",
    "img_below_text": "Head down the sloping street and grab a green Wisp along the way, and you'll find yourself crossing a small bridge to a clearing with a shack covered in webs. Standing our front are two Grasshopper Guai that can strike extremely quickly, but aren't as durable as the Beetle Captain.\nClear them out with Zhu Bajie's help, and you'll find they were guarding a large **Treasure Chest** holding several consumables, which may include a Loong Aura Amplification Pellet, as well as a Knot of Voidness and Blood of the Iron Bull.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"From here, look around to find two paths to take: A narrow walkway over a stream below, and another open path past a building to the right.\nTake the path on the right first, but first look for a small building next to the narrow path where you'll find another **Treasure Chest** inside, guarded by more Stone Spiders that will burrow up to ambush you.\"\n        - Following Text: \"Head down the sloping street and grab a green Wisp along the way, and you'll find yourself crossing a small bridge to a clearing with a shack covered in webs. Standing our front are two Grasshopper Guai that can strike extremely quickly, but aren't as durable as the Beetle Captain.\nClear them out with Zhu Bajie's help, and you'll find they were guarding a large **Treasure Chest** holding several consumables, which may include a Loong Aura Amplification Pellet, as well as a Knot of Voidness and Blood of the Iron Bull.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character approaching a web-covered shack in a forested area, with two hostile creatures nearby. A red circle highlights a potential point of interest, likely a **Treasure Chest** mentioned in the preceding text. The scene aligns with the walkthrough's guidance to explore the area for loot while dealing with ambushing enemies. The dialogue at the bottom suggests narrative progression or interaction."
}