{
    "chunk_id": 203385488473,
    "source_file": "The_Second_Sister.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/12/Wukong_Lanxi_29.jpg",
    "alt_text": "Wukong Lanxi 29.jpg",
    "position_desc": 9,
    "img_above_text": "![Wukong Lanxi 28.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/77/Wukong_Lanxi_28.jpg)\nFinally, she can also perform a small leap and extend her front legs forward like spears as she lands, which may cause you to try and backpedal, only for her to follow up by shooting a quick projectile at you immediately afterward, which is both hard to spot and dodge.",
    "img_below_text": "Her moves can get even more unpredictable when she's low on health, often peppering in quick poison projectiles from her mouth, or somersaulting forward to slash at you. Continue to use the Thrust Stance to keep her talons at bay, and when having trouble, always look for when her front legs subtly shift their shape to become more distinct blades to know when the attack is coming.\nWith Zhu Bajie backing you up (and you can always fall back to let him heal you), The Second Sister won't be able to stand against the two of you for long. After she's been defeated, she'll make a mad dash to flee, but not before flinging something at Zhu Bajie, who shrugs it off, and then runs ahead to chase her down.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Lanxi 28.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/77/Wukong_Lanxi_28.jpg)\nFinally, she can also perform a small leap and extend her front legs forward like spears as she lands, which may cause you to try and backpedal, only for her to follow up by shooting a quick projectile at you immediately afterward, which is both hard to spot and dodge.\"\n        - Following Text: \"Her moves can get even more unpredictable when she's low on health, often peppering in quick poison projectiles from her mouth, or somersaulting forward to slash at you. Continue to use the Thrust Stance to keep her talons at bay, and when having trouble, always look for when her front legs subtly shift their shape to become more distinct blades to know when the attack is coming.\nWith Zhu Bajie backing you up (and you can always fall back to let him heal you), The Second Sister won't be able to stand against the two of you for long. After she's been defeated, she'll make a mad dash to flee, but not before flinging something at Zhu Bajie, who shrugs it off, and then runs ahead to chase her down.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight against \"The Second Sister,\" a spider-like enemy in *Black Myth: Wukong*. The scene shows the creature mid-attack, surrounded by a dark, forested environment with cobweb-covered structures in the background. The player character and an ally, Zhu Bajie, are engaged in combat, with health bars and ability icons visible on the screen. The preceding and following text describe the boss's unpredictable moves, including poison projectiles and somersault attacks, and provide strategies for defeating her using the Thrust Stance and Zhu Bajie's support."
}