{
    "chunk_id": 90377885856,
    "source_file": "Things_Black_Myth_Wukong_Doesn%27t_Tell_You.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/ca/Wukong_KeeperUpdate.jpg",
    "alt_text": "Wukong KeeperUpdate.jpg",
    "position_desc": 1,
    "img_above_text": "* 13\\. Get Permanent Upgrades with Celestial Medicines\n### 1\\. Keepers Shrines Will Keep Expanding",
    "img_below_text": "The Keeper Shrines where you place your incense are more than just a place to rest and recover. Though they’re limited at the start of the game, they’ll soon expand as you continue to progress. Not only will you be able to purchase items from a variety of stores depending on your location, but you’ll also eventually be able to craft Weapons and Armor directly from the shrines.\n![Wukong BlackWind 7.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/55/Wukong_BlackWind_7.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"* 13\\. Get Permanent Upgrades with Celestial Medicines\n### 1\\. Keepers Shrines Will Keep Expanding\"\n        - Following Text: \"The Keeper Shrines where you place your incense are more than just a place to rest and recover. Though they’re limited at the start of the game, they’ll soon expand as you continue to progress. Not only will you be able to purchase items from a variety of stores depending on your location, but you’ll also eventually be able to craft Weapons and Armor directly from the shrines.\n![Wukong BlackWind 7.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/55/Wukong_BlackWind_7.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a menu screen from a video game, specifically from a location called the \"Grand Chamber\" within the \"Ancient Guanyin Temple.\" The menu options include actions like resting, traveling, self-advancing, crafting, brewing, making medicines, and accessing a store where players can buy and sell items. This screen is part of a guide explaining the expanding functionality of Keeper Shrines, which serve as places to rest, recover, and eventually craft weapons and armor as players progress in the game."
}