{
    "chunk_id": 30030482859,
    "source_file": "Gold_Armored_Rhino.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0b/Foothills_Walkthrough_%2826%29.png",
    "alt_text": "Foothills Walkthrough \\(26\\).png",
    "position_desc": 2,
    "img_above_text": "Once you've completed the stamina and health test from the Feng-Tail General, drop down from it and activate the nearby Keeper's Shrine. You'll see a field straight in front of you that's strewn with soldiers and fire.\n### Gold Armored Rhino Boss Fight and Guide",
    "img_below_text": "The key to making this fight as easy as possible is to break the Rhino's horn. You want to do this as quickly as possible, so we'd recommend going in with the Wandering Wight Spirit equipped. Speed is essential here, as you'll need to hit the Rhino head-on to break the horn.\n![Foothills Walkthrough \\(27\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b2/Foothills_Walkthrough_%2827%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Once you've completed the stamina and health test from the Feng-Tail General, drop down from it and activate the nearby Keeper's Shrine. You'll see a field straight in front of you that's strewn with soldiers and fire.\n### Gold Armored Rhino Boss Fight and Guide\"\n        - Following Text: \"The key to making this fight as easy as possible is to break the Rhino's horn. You want to do this as quickly as possible, so we'd recommend going in with the Wandering Wight Spirit equipped. Speed is essential here, as you'll need to hit the Rhino head-on to break the horn.\n![Foothills Walkthrough \\(27\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b2/Foothills_Walkthrough_%2827%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dramatic moment from the Gold Armored Rhino boss fight in *Black Myth: Wukong*. The player character, armed and ready, faces off against the massive Rhino in a fiery battlefield surrounded by scorched terrain and lightning-filled skies. The preceding and following text suggests the goal is to break the Rhino's horn quickly, emphasizing speed and strategic use of the Wandering Wight Spirit for an advantage."
}