{
    "chunk_id": 121744891108,
    "source_file": "Webbed_Hollow_-_Lower_Hollow_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/33/Wukong_LowerHollow_61.jpg",
    "alt_text": "Wukong LowerHollow 61.jpg",
    "position_desc": 59,
    "img_above_text": "Once he's out of the mud and on the surface, he'll transform again, this time into a large rhino, and begin to charge at you. If this wasn't bad enough, he'll summon two copies to charge just behind him on either side, making dodging extremely risky.\nThe only good news is that the copies don't seem to alter their path once they start the charge, but Zhu Bajie will, so you'll need to be careful about timing your dodges and not rolling into a path of a copy. Rock Solid will only move you backward, and won't be too much help if it traps you in front of him.",
    "img_below_text": "Once he charges for a third time, he'll lose the clones, and then transform back into a fish for a moment. Wait for him to dive through the air past you, and he'll then rocket toward you as a giant glob of mud.\nDodge or deflect if you can't move fast enough, and be ready for his boar form to reappear dazed and winded from the phase. This is your big opportunity to hit him with all the focus points you've stored up, as well as any powerful Spirit Attacks you can unleash.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Once he's out of the mud and on the surface, he'll transform again, this time into a large rhino, and begin to charge at you. If this wasn't bad enough, he'll summon two copies to charge just behind him on either side, making dodging extremely risky.\nThe only good news is that the copies don't seem to alter their path once they start the charge, but Zhu Bajie will, so you'll need to be careful about timing your dodges and not rolling into a path of a copy. Rock Solid will only move you backward, and won't be too much help if it traps you in front of him.\"\n        - Following Text: \"Once he charges for a third time, he'll lose the clones, and then transform back into a fish for a moment. Wait for him to dive through the air past you, and he'll then rocket toward you as a giant glob of mud.\nDodge or deflect if you can't move fast enough, and be ready for his boar form to reappear dazed and winded from the phase. This is your big opportunity to hit him with all the focus points you've stored up, as well as any powerful Spirit Attacks you can unleash.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss battle against Zhu Bajie in a muddy environment, as part of a video game. The player character is shown facing Zhu Bajie, who appears to be in a large, mud-covered form, likely mid-charge. The health bar at the bottom indicates the ongoing fight, while the preceding and following text explains Zhu Bajie's transformations and attack patterns, emphasizing the need for precise dodging and timing to avoid his charges and clones. The scene highlights a critical phase of the encounter where strategy and awareness are key."
}