{
    "chunk_id": 252917132344,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/34/Wukong_Fright_47.jpg",
    "alt_text": "Wukong Fright 47.jpg",
    "position_desc": 51,
    "img_above_text": "![Wukong Fright 45.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a8/Wukong_Fright_45.jpg)\nIt’s these major slamming attacks you’ll need to be extra careful, and watch closely for when its front arms begin to glow. These types of attacks mean his arms will soon have a delayed detonation, and are designed to bait you into countering early and getting caught in the blast. Instead, hang back and use the Thrust Stance if possible to unleash a charged hit from a safe distance to the side, as the detonation will also trigger rocks to rip upwards in front of him.",
    "img_below_text": "While the explosion and rocky spikes can be dodged with good timing — it’s also possible to negate the effect by using your charged Pillar Stance. When done at a reasonable distance, you’ll simply ignore the tremor below you, and can follow up with a charged strike that often staggers the monster. However, if you try to create a pillar too close to his hands, the explosion can send you tumbling, though it usually absorbs the damage.\n![Wukong Fright 44.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/13/Wukong_Fright_44.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Fright 45.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a8/Wukong_Fright_45.jpg)\nIt’s these major slamming attacks you’ll need to be extra careful, and watch closely for when its front arms begin to glow. These types of attacks mean his arms will soon have a delayed detonation, and are designed to bait you into countering early and getting caught in the blast. Instead, hang back and use the Thrust Stance if possible to unleash a charged hit from a safe distance to the side, as the detonation will also trigger rocks to rip upwards in front of him.\"\n        - Following Text: \"While the explosion and rocky spikes can be dodged with good timing — it’s also possible to negate the effect by using your charged Pillar Stance. When done at a reasonable distance, you’ll simply ignore the tremor below you, and can follow up with a charged strike that often staggers the monster. However, if you try to create a pillar too close to his hands, the explosion can send you tumbling, though it usually absorbs the damage.\n![Wukong Fright 44.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/13/Wukong_Fright_44.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat encounter in *Black Myth: Wukong* against the \"Stone Vanguard,\" a large, rock-like monster. The scene shows the monster performing a glowing-arm attack, which is described in the preceding text as a delayed detonation designed to bait players into countering prematurely. The following text explains strategies to avoid or negate the explosion and rocky spikes, such as dodging with good timing or using the charged Pillar Stance from a safe distance. The image visually reinforces the guide's advice on dealing with this challenging attack."
}