{
    "chunk_id": 649610941410,
    "source_file": "The_Great_Sage%27s_Broken_Shell.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a6/Water_Curtain_Cave_Walkthrough_%2859%29.png",
    "alt_text": "Water Curtain Cave Walkthrough \\(59\\).png",
    "position_desc": 2,
    "img_above_text": "### The Great Sage's Broken Shell Phase One\nThe Great Sage's Broken Shell will start this phase by dodging your attacks each time you try to complete combos. As these are perfect dodges, you'll see multiple illusions left behind in its wake, which will explode after a few seconds. To counter this, you'll want to land a few hits, and then jump back to avoid the explosions, but continue to follow up and complete the combos for a heavy attack.",
    "img_below_text": "We'd suggest throwing out the Plantain Fan as soon as the fight starts, to knock him back, and allow you to whittle his health down quickly before he even gets a chance to start. In terms of Transformations and Spirits, we found that Ebon Flow was useful for deflecting his attacks and quickly building might to perform a powerful finisher, and the Wandering Wight Spirit was able to take down a chunk of his health in one go.\nYou'll see the Great Sage's Broken Shell's version of a heavy attack, as the staff glows gold and he jumps up with his staff to smash it down on you. These moves can also be evaded, to help build up your own focus for a counterattack. Again, you'll want to take advantage of Wukong's arm and staff in this fight, by using the fourth focus point for heavy attacks, and making use of the increased Critical Hit Chance.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"### The Great Sage's Broken Shell Phase One\nThe Great Sage's Broken Shell will start this phase by dodging your attacks each time you try to complete combos. As these are perfect dodges, you'll see multiple illusions left behind in its wake, which will explode after a few seconds. To counter this, you'll want to land a few hits, and then jump back to avoid the explosions, but continue to follow up and complete the combos for a heavy attack.\"\n        - Following Text: \"We'd suggest throwing out the Plantain Fan as soon as the fight starts, to knock him back, and allow you to whittle his health down quickly before he even gets a chance to start. In terms of Transformations and Spirits, we found that Ebon Flow was useful for deflecting his attacks and quickly building might to perform a powerful finisher, and the Wandering Wight Spirit was able to take down a chunk of his health in one go.\nYou'll see the Great Sage's Broken Shell's version of a heavy attack, as the staff glows gold and he jumps up with his staff to smash it down on you. These moves can also be evaded, to help build up your own focus for a counterattack. Again, you'll want to take advantage of Wukong's arm and staff in this fight, by using the fourth focus point for heavy attacks, and making use of the increased Critical Hit Chance.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an intense moment from a boss fight in a video game, specifically against \"The Great Sage's Broken Shell.\" The player character, wielding a staff, is engaged in combat in a watery, open environment with rocky terrain and a large, ominous structure in the background. The scene aligns with the guide's description of dodging the boss's explosive illusions and preparing for heavy attacks, emphasizing strategic movement and timing during the encounter."
}