{
    "chunk_id": 413251079605,
    "source_file": "Chapter_4_Secret_-_Purple_Cloud_Mountain_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5e/Wukong_PurpleCloud_19.jpg",
    "alt_text": "Wukong PurpleCloud 19.jpg",
    "position_desc": 25,
    "img_above_text": "![Wukong PurpleCloud 23.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/43/Wukong_PurpleCloud_23.jpg)\nOnce you've dealt a fair amount of damage, he can also drive his tail deep into the ground. Poison will start welling up in multiple spots all around you, and explode with small geysers after a moment. The area is quite large, and you may want to quickly swap to the Pillar Stance to avoid the explosions and retaliate quickly with a charged hit.",
    "img_below_text": "He can also run toward you and dive into the ground, forcing you to lose your lock on as he waits below ground for a moment before busting out to attack as he erupts forth. Don't get greedy after he appears, as he will usually follow his re-entry with a quick tail swipe that can turn into a grab if it connects, and immediately inject a large dose of poison into you while also dealing massive damage.\n![Wukong PurpleCloud 18.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/04/Wukong_PurpleCloud_18.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong PurpleCloud 23.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/43/Wukong_PurpleCloud_23.jpg)\nOnce you've dealt a fair amount of damage, he can also drive his tail deep into the ground. Poison will start welling up in multiple spots all around you, and explode with small geysers after a moment. The area is quite large, and you may want to quickly swap to the Pillar Stance to avoid the explosions and retaliate quickly with a charged hit.\"\n        - Following Text: \"He can also run toward you and dive into the ground, forcing you to lose your lock on as he waits below ground for a moment before busting out to attack as he erupts forth. Don't get greedy after he appears, as he will usually follow his re-entry with a quick tail swipe that can turn into a grab if it connects, and immediately inject a large dose of poison into you while also dealing massive damage.\n![Wukong PurpleCloud 18.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/04/Wukong_PurpleCloud_18.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss battle against \"The Scorpionlord\" in *Black Myth: Wukong*. The scene shows the Scorpionlord performing an attack, creating a large dust cloud as it moves aggressively in an autumn forest setting near a traditional building. The preceding and following text describe the Scorpionlord's poison-based attacks, including tail strikes and underground dives, emphasizing the need for strategic movement and stance changes to avoid damage and retaliate effectively."
}