{
    "chunk_id": 675800573246,
    "source_file": "Crouching_Tiger_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3f/Wukong_Tiger_4.jpg",
    "alt_text": "Wukong Tiger 4.jpg",
    "position_desc": 5,
    "img_above_text": "Keep heading up, and look left before reaching the top of the stairs. This time, you’ll find a **Meditation Spot** around the corner at the foot of a large tiger statue, and resting at it will award you a free Spark Skill Point.\nThe Sculpture, Crouching Tiger Temple Meditation Spot",
    "img_below_text": "Once you reach the top, you’ll come face to bloody face with the Tiger Vanguard, who looks like he just found his next meal.\n## Yaoguai King Boss Fight - Tiger Vanguard",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Keep heading up, and look left before reaching the top of the stairs. This time, you’ll find a **Meditation Spot** around the corner at the foot of a large tiger statue, and resting at it will award you a free Spark Skill Point.\nThe Sculpture, Crouching Tiger Temple Meditation Spot\"\n        - Following Text: \"Once you reach the top, you’ll come face to bloody face with the Tiger Vanguard, who looks like he just found his next meal.\n## Yaoguai King Boss Fight - Tiger Vanguard\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character approaching a large tiger statue, which is likely the **Crouching Tiger Temple Meditation Spot** mentioned in the preceding text. The area is bathed in sunlight, with visible architectural details and statues, creating a serene yet foreboding atmosphere. This location serves as a pivotal moment in the walkthrough, offering a chance to rest and gain a free Spark Skill Point before progressing to the Tiger Vanguard boss fight described in the following text."
}