{
    "chunk_id": 92052528608,
    "source_file": "Sandgate_Village_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a0/Wukong_Sandgate_7.jpg",
    "alt_text": "Wukong Sandgate 7.jpg",
    "position_desc": 6,
    "img_above_text": "![Wukong Sandgate 5.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c6/Wukong_Sandgate_5.jpg)\nA large stone arch behind the archers has a new violet Licorice plant you can harvest, and the stone stairs beyond lead to an altar with a special **Lambbrew Drink** for your Gourd. Unlike the instant heal of the Coconut Wine, it will heal a small amount at first, but a larger portion of your health bar over time. However, you’ll also find that it can only be upgraded once, compared to the multiple tiers of health increase that you can invest in the other drink.",
    "img_below_text": "Head back down to the pond, and you’ll find the waterway leads on a bit past several Croaky frog enemies, as well as a new kind of Rat standing by the shore. This Rat Governor wields an electric staff, which he can charge up and zap you from a distance with after a flourish, or perform a backwards jump to zap you in mid-air. If you take enough shock damage, you’ll reach a state where all incoming damage is doubled, so avoid these blasts at all costs and shut him down with Immobilize.\n![Wukong Sandgate 8.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a4/Wukong_Sandgate_8.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Sandgate 5.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c6/Wukong_Sandgate_5.jpg)\nA large stone arch behind the archers has a new violet Licorice plant you can harvest, and the stone stairs beyond lead to an altar with a special **Lambbrew Drink** for your Gourd. Unlike the instant heal of the Coconut Wine, it will heal a small amount at first, but a larger portion of your health bar over time. However, you’ll also find that it can only be upgraded once, compared to the multiple tiers of health increase that you can invest in the other drink.\"\n        - Following Text: \"Head back down to the pond, and you’ll find the waterway leads on a bit past several Croaky frog enemies, as well as a new kind of Rat standing by the shore. This Rat Governor wields an electric staff, which he can charge up and zap you from a distance with after a flourish, or perform a backwards jump to zap you in mid-air. If you take enough shock damage, you’ll reach a state where all incoming damage is doubled, so avoid these blasts at all costs and shut him down with Immobilize.\n![Wukong Sandgate 8.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a4/Wukong_Sandgate_8.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an intense combat scene from *Black Myth: Wukong*, where the player character is engaged in battle with the Rat Governor, an enemy wielding an electric staff. The Rat Governor is using a charged electric attack, visible as bright yellow lightning striking the player. The surrounding environment features a desolate, rocky landscape with dry vegetation, emphasizing the game's atmospheric setting. The interface displays health and ability icons, highlighting the player's current status and available actions."
}