{
    "chunk_id": 967835757366,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/46/Wukong_Wolves_36.jpg",
    "alt_text": "Wukong Wolves 36.jpg",
    "position_desc": 43,
    "img_above_text": "![Wukong Wolves 35.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1f/Wukong_Wolves_35.jpg)\nIf he starts to whirl his fiery blade in circles around him, be ready but don’t panic as his attack is yet to come — wait for him to raise the blade and twirl it high before swinging it from side to side in two slower hits.",
    "img_below_text": "Another scary move that may take a bit of practice to understand is his pogo jump: Watch for him to raise his weapon high and vertical over his head before slamming it down, and then somersaulting forward in quick succession to bounce off the ground off his weapon. After a short pause, he’ll leap up to slam down for a third attack, and then even higher up for one last pogo slam explosion. With the last two attacks being spaced out, stand your ground to wait for the drop to dodge around, and cast Immobilize once he’s grounded to pin him down while you unleash your attacks.\n![Wukong Wolves 38.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/76/Wukong_Wolves_38.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Wolves 35.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1f/Wukong_Wolves_35.jpg)\nIf he starts to whirl his fiery blade in circles around him, be ready but don’t panic as his attack is yet to come — wait for him to raise the blade and twirl it high before swinging it from side to side in two slower hits.\"\n        - Following Text: \"Another scary move that may take a bit of practice to understand is his pogo jump: Watch for him to raise his weapon high and vertical over his head before slamming it down, and then somersaulting forward in quick succession to bounce off the ground off his weapon. After a short pause, he’ll leap up to slam down for a third attack, and then even higher up for one last pogo slam explosion. With the last two attacks being spaced out, stand your ground to wait for the drop to dodge around, and cast Immobilize once he’s grounded to pin him down while you unleash your attacks.\n![Wukong Wolves 38.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/76/Wukong_Wolves_38.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat sequence from *Black Myth: Wukong*, showcasing a fiery attack by the boss \"Guangzhi.\" Sparks and flames surround the scene as Guangzhi, wielding a fiery blade, executes a powerful move while the player character dodges to avoid damage. This visual aligns with the preceding text's description of Guangzhi's blade twirling attack and the following text's mention of his pogo jump, emphasizing the dynamic and challenging nature of the encounter."
}