{
    "chunk_id": 304606810581,
    "source_file": "Baw-Li-Guhh-Baw.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/21/Wukong_LowerHollow_33.jpg",
    "alt_text": "Wukong LowerHollow 33.jpg",
    "position_desc": 7,
    "img_above_text": "![Wukong LowerHollow 31.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1b/Wukong_LowerHollow_31.jpg)\nHe can also wave the tongue-hand around in a haphazard fashion, making it weave in a large arc from side to side as it swipes at you three times, before rising high up to slam down at you (but you can use Rock Solid to send him tumbling back in surprise).",
    "img_below_text": "The most devious attack of all doesn't even start with his tongue. If you've studied his regular attacks, his hand slaps almost always start with his right hand (to your left) when not performing a large leap. However, if you see him quickly raise his left hand while hopping close (to your right) dodge immediately, or you'll be grabbed.\n![Wukong LowerHollow 34.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/6a/Wukong_LowerHollow_34.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong LowerHollow 31.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1b/Wukong_LowerHollow_31.jpg)\nHe can also wave the tongue-hand around in a haphazard fashion, making it weave in a large arc from side to side as it swipes at you three times, before rising high up to slam down at you (but you can use Rock Solid to send him tumbling back in surprise).\"\n        - Following Text: \"The most devious attack of all doesn't even start with his tongue. If you've studied his regular attacks, his hand slaps almost always start with his right hand (to your left) when not performing a large leap. However, if you see him quickly raise his left hand while hopping close (to your right) dodge immediately, or you'll be grabbed.\n![Wukong LowerHollow 34.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/6a/Wukong_LowerHollow_34.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss battle in *Black Myth: Wukong* against a large, frog-like creature named \"Baw-Li-Guhh-Baw.\" The player character is shown in combat, wielding a staff while facing the boss in a dimly lit, water-filled cavern. The UI displays various abilities and items, including \"Rock Solid,\" which is mentioned in the preceding text as a counter to the boss's tongue-hand slam attack. The following text highlights the boss's deceptive attack patterns, emphasizing the importance of dodging its grabs."
}