{
    "chunk_id": 663412067733,
    "source_file": "Woods_of_Ember_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e7/Woods_Ember_Walkthrough_%2835%29.png",
    "alt_text": "Woods Ember Walkthrough \\(35\\).png",
    "position_desc": 18,
    "img_above_text": "Brown-Iron Cart\nWith the first of the five element carts down, go and activate the Camp of Seasons Keeper's Shrine. Rest here, then go back on yourself to see the Pale-Axe Stalwart again.",
    "img_below_text": "Instead of finding him wherever you left him kneeling, you'll now see him by the edge of the cliff. As you come back down the stairs to the area where you fought him, you'll see a small set opposite with two Buddha statues on either side. Go up these and to the left, to find him overlooking the mountain. Talk to him and exhaust any new dialogue.\n## Camp of Seasons",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Brown-Iron Cart\nWith the first of the five element carts down, go and activate the Camp of Seasons Keeper's Shrine. Rest here, then go back on yourself to see the Pale-Axe Stalwart again.\"\n        - Following Text: \"Instead of finding him wherever you left him kneeling, you'll now see him by the edge of the cliff. As you come back down the stairs to the area where you fought him, you'll see a small set opposite with two Buddha statues on either side. Go up these and to the left, to find him overlooking the mountain. Talk to him and exhaust any new dialogue.\n## Camp of Seasons\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a somber, desolate area with a central focus on a kneeling figure (highlighted in red) near the edge of a cliff. The environment features barren trees, stone statues, and remnants of structures, suggesting a setting of decay and abandonment. This scene aligns with the walkthrough's narrative, where the player is instructed to revisit the location to find the Pale-Axe Stalwart, now positioned near the cliff, as part of progressing the story or dialogue."
}