{
    "chunk_id": 859694148927,
    "source_file": "Best_Skills_to_Unlock.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/54/Best_Skills_to_Unlock_%283%29.png",
    "alt_text": "Best Skills to Unlock \\(3\\).png",
    "position_desc": 4,
    "img_above_text": "Alteration applies to spells like Cloud Step and Rock Solid and will improve the health of your decoy, movement speed, and unlock the chance to deflect attacks with a parry.\nThe Transformations menu applies to any Transformation spells you collect and you'll find skills to improve might recovery, maximum health when transformed, increased defense, and more.",
    "img_below_text": "Finally, in the Strand menu, you'll find the spell A Pluck of Many, where you can send out multiple Duplicates to help you. The skills you can unlock here will increase the health of your Duplicates, along with their attack power, and more.\n### Best Foundation Skills to Unlock",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Alteration applies to spells like Cloud Step and Rock Solid and will improve the health of your decoy, movement speed, and unlock the chance to deflect attacks with a parry.\nThe Transformations menu applies to any Transformation spells you collect and you'll find skills to improve might recovery, maximum health when transformed, increased defense, and more.\"\n        - Following Text: \"Finally, in the Strand menu, you'll find the spell A Pluck of Many, where you can send out multiple Duplicates to help you. The skills you can unlock here will increase the health of your Duplicates, along with their attack power, and more.\n### Best Foundation Skills to Unlock\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image showcases the \"Strand\" menu from a video game, focusing on the spell \"A Pluck of Many.\" This spell allows players to create multiple Duplicates that can engage enemies or assist in escaping. The skill tree displayed offers upgrades to enhance the spell's effectiveness, such as improving Duplicate health and attack power. The preceding and following text highlights the broader context of skill menus and their role in enhancing gameplay mechanics, including defense, movement, and transformation abilities."
}