{
    "chunk_id": 701916837290,
    "source_file": "Chapter_4_Secret_-_Purple_Cloud_Mountain_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/43/Wukong_PurpleCloud_23.jpg",
    "alt_text": "Wukong PurpleCloud 23.jpg",
    "position_desc": 24,
    "img_above_text": "![Wukong PurpleCloud 21.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c1/Wukong_PurpleCloud_21.jpg)\nHe'll then launch into a series of quick and relentless tail swipes, starting with an upward slash, a downward slam, followed by a quick low sweep, and then a final extremely damaging thrust from behind his back. The timing of these strikes can be challenging to time correctly, and he'll punctuate three of the four strikes as he shouts \"Taste my... deathsting!\" Due to how powerful this move is, you'll need to practice timing your dodges perfectly to avoid getting hit and poisoned by his strikes.",
    "img_below_text": "Once you've dealt a fair amount of damage, he can also drive his tail deep into the ground. Poison will start welling up in multiple spots all around you, and explode with small geysers after a moment. The area is quite large, and you may want to quickly swap to the Pillar Stance to avoid the explosions and retaliate quickly with a charged hit.\n![Wukong PurpleCloud 19.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5e/Wukong_PurpleCloud_19.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong PurpleCloud 21.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c1/Wukong_PurpleCloud_21.jpg)\nHe'll then launch into a series of quick and relentless tail swipes, starting with an upward slash, a downward slam, followed by a quick low sweep, and then a final extremely damaging thrust from behind his back. The timing of these strikes can be challenging to time correctly, and he'll punctuate three of the four strikes as he shouts \"Taste my... deathsting!\" Due to how powerful this move is, you'll need to practice timing your dodges perfectly to avoid getting hit and poisoned by his strikes.\"\n        - Following Text: \"Once you've dealt a fair amount of damage, he can also drive his tail deep into the ground. Poison will start welling up in multiple spots all around you, and explode with small geysers after a moment. The area is quite large, and you may want to quickly swap to the Pillar Stance to avoid the explosions and retaliate quickly with a charged hit.\n![Wukong PurpleCloud 19.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5e/Wukong_PurpleCloud_19.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight against \"The Scorpionlord\" in *Black Myth: Wukong*. The scene shows the player character amidst a hazardous environment filled with green poison geysers erupting from the ground, a mechanic described in the following text. The setting features a large tree and a traditional structure, emphasizing the atmospheric tension of the encounter. The player's health and status effects, including poison, are visible, highlighting the need for precise movement and strategy to avoid damage."
}