{
    "chunk_id": 733927764888,
    "source_file": "Valley_of_Ecstasy_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5c/Wukong_Felicity_3.jpg",
    "alt_text": "Wukong Felicity 3.jpg",
    "position_desc": 29,
    "img_above_text": "Of course, you're free to explore as much (or as little) of these sub-regions of the valley as you'd like, but with the amount of questlines and yaoguai chiefs to find in each spot, we'll be covering each of them.\n### The Snow Fox's Quest",
    "img_below_text": "Not far from the Forest Shrine, look for a small arch along the main path, and you'll find a unique corpse sitting along the wood posts that looks different from the rest. You can interact to hear a voice -- coming not from the body, but from the fox pelt around its neck. Apparently that story about the snow fox and the human you saw after completing Chapter 2 actually happened, and the fox guai wants revenge.\nShe'll gift you the Snow Fox Brush, allowing you to take the form of the Snow Fox and seek out the human scholar who resides in New Thunderclap Temple.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Of course, you're free to explore as much (or as little) of these sub-regions of the valley as you'd like, but with the amount of questlines and yaoguai chiefs to find in each spot, we'll be covering each of them.\n### The Snow Fox's Quest\"\n        - Following Text: \"Not far from the Forest Shrine, look for a small arch along the main path, and you'll find a unique corpse sitting along the wood posts that looks different from the rest. You can interact to hear a voice -- coming not from the body, but from the fox pelt around its neck. Apparently that story about the snow fox and the human you saw after completing Chapter 2 actually happened, and the fox guai wants revenge.\nShe'll gift you the Snow Fox Brush, allowing you to take the form of the Snow Fox and seek out the human scholar who resides in New Thunderclap Temple.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a unique corpse seated in a snowy forest, adorned with a fox pelt and beads. The text at the bottom reveals the corpse's plea to the player: \"I beg you, sir, to take my fur and wear my form. Confront him and calm my sorrowful heart.\" This scene introduces \"The Snow Fox's Quest,\" where interacting with the corpse and its fox pelt initiates a storyline involving transformation into the Snow Fox and seeking revenge on a human scholar."
}