{
    "chunk_id": 36115073015,
    "source_file": "Yellow_Sand_Formation_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e9/Wukong_Yellow_64.jpg",
    "alt_text": "Wukong Yellow 64.jpg",
    "position_desc": 70,
    "img_above_text": "![Wukong Yellow 63.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/09/Wukong_Yellow_63.jpg)\nIn this new phase, he’ll have a few new moves to contend with, and they can get pretty nasty. He has a lot more kicking and stomping attacks, often raising his foot for a moment or even jumping off the ground to hang low to the ground, and then bringing it down hard. If his hand or foot begin to glow, it often means he’ll raise up more spears soon after, so be ready.",
    "img_below_text": "The most annoying move will lock you into an extended grab if you get hit, and has little warning. You’ll need to watch for him to stop and growl, going into a slight crouch before running toward you. He’ll then try and punt you with his right foot, and if connects, you’ll sail into the air only to be pinned down into the ground by his trident, where he’ll give you another stomp for good measure before tossing your body aside, dealing major damage through the whole process.\n![Wukong Yellow 67.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/01/Wukong_Yellow_67.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Yellow 63.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/09/Wukong_Yellow_63.jpg)\nIn this new phase, he’ll have a few new moves to contend with, and they can get pretty nasty. He has a lot more kicking and stomping attacks, often raising his foot for a moment or even jumping off the ground to hang low to the ground, and then bringing it down hard. If his hand or foot begin to glow, it often means he’ll raise up more spears soon after, so be ready.\"\n        - Following Text: \"The most annoying move will lock you into an extended grab if you get hit, and has little warning. You’ll need to watch for him to stop and growl, going into a slight crouch before running toward you. He’ll then try and punt you with his right foot, and if connects, you’ll sail into the air only to be pinned down into the ground by his trident, where he’ll give you another stomp for good measure before tossing your body aside, dealing major damage through the whole process.\n![Wukong Yellow 67.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/01/Wukong_Yellow_67.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an intense boss battle against the \"Yellow Wind Sage\" in *Black Myth: Wukong*. The boss, a large, menacing creature, is shown mid-attack with a glowing trident, emphasizing its aggressive and dynamic combat style. The sandy environment and motion blur highlight the fast-paced action. The HUD displays the boss's health bar, player abilities, and status, indicating this is a critical moment in the fight."
}