{
    "chunk_id": 649182302543,
    "source_file": "Valley_of_Ecstasy_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f0/Wukong_Longevity_3.jpg",
    "alt_text": "Wukong Longevity 3.jpg",
    "position_desc": 99,
    "img_above_text": "At range, he can also tear up a huge rock from the ground and throw your way, making him a threat even at a distance (though the rock flies pretty slow).\nDeal enough damage, and the giant will eventually fall to the ground. Use this time to build up several focus points by attacking his head, and Spirit attacks to take more health away.",
    "img_below_text": "As he struggles to rise, unleash a heavy attack using your Pillar Stance on his head and he'll likely topple back to the ground giving you a bit more time to defeat him.\n![Wukong Longevity 4.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f7/Wukong_Longevity_4.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"At range, he can also tear up a huge rock from the ground and throw your way, making him a threat even at a distance (though the rock flies pretty slow).\nDeal enough damage, and the giant will eventually fall to the ground. Use this time to build up several focus points by attacking his head, and Spirit attacks to take more health away.\"\n        - Following Text: \"As he struggles to rise, unleash a heavy attack using your Pillar Stance on his head and he'll likely topple back to the ground giving you a bit more time to defeat him.\n![Wukong Longevity 4.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f7/Wukong_Longevity_4.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a large humanoid enemy in a snowy environment, bent over and seemingly incapacitated, with a glowing weak point on its head being attacked. This aligns with the preceding and following text, which describe a strategy to exploit the enemy's vulnerable state by targeting its head to deal significant damage and gain an advantage in the fight."
}