{
    "chunk_id": 13146084616,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9d/Wukong_Wolves_26.jpg",
    "alt_text": "Wukong Wolves 26.jpg",
    "position_desc": 34,
    "img_above_text": "You’ll be transformed into a small Golden Cicada, which will allow you to fly around the next area to get a look at the dangers to come before you face them yourself. However, your flight time will be limited by the meter slowly fading in the bottom left, and whenever you run out of juice (or manually de-transform) you may find yourself in hot water, so how much you actually want to explore in this form is up to you.\nThe main path through is area is a very straightforward one, as you can simply follow the straight path past the first two Wolf guards near the Shrine, to a axe-wielding Wolf Stalwart by a small bridge over a stream, and then straight through a tunnel that’s guarded by an extremely tough (and very optional) mini-boss with a giant head.",
    "img_below_text": "In fact, this Wandering Wight is tougher than most things you’ll face in the whole chapter, so don’t feel like you need to stop and contend with this foe if you’d rather get stronger and gain access to more abilities first. Be sure to check out our guide on How to Defeat the Wandering Wight when you do.\n![Wukong Wolves 28.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f9/Wukong_Wolves_28.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"You’ll be transformed into a small Golden Cicada, which will allow you to fly around the next area to get a look at the dangers to come before you face them yourself. However, your flight time will be limited by the meter slowly fading in the bottom left, and whenever you run out of juice (or manually de-transform) you may find yourself in hot water, so how much you actually want to explore in this form is up to you.\nThe main path through is area is a very straightforward one, as you can simply follow the straight path past the first two Wolf guards near the Shrine, to a axe-wielding Wolf Stalwart by a small bridge over a stream, and then straight through a tunnel that’s guarded by an extremely tough (and very optional) mini-boss with a giant head.\"\n        - Following Text: \"In fact, this Wandering Wight is tougher than most things you’ll face in the whole chapter, so don’t feel like you need to stop and contend with this foe if you’d rather get stronger and gain access to more abilities first. Be sure to check out our guide on How to Defeat the Wandering Wight when you do.\n![Wukong Wolves 28.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f9/Wukong_Wolves_28.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a tense encounter in *Black Myth: Wukong* with the \"Wandering Wight,\" a challenging optional mini-boss described as tougher than most enemies in the chapter. The player character is shown mid-combat in a forested area, facing the towering foe, with the boss's health bar visible at the bottom of the screen. This scene highlights the danger and optional nature of the fight, as mentioned in the guide."
}