{
    "chunk_id": 411345362688,
    "source_file": "New_Thunderclap_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/92/Wukong_Thunderclap_98.jpg",
    "alt_text": "Wukong Thunderclap 98.jpg",
    "position_desc": 97,
    "img_above_text": "The good news in all of this is you'll be pretty unstoppable in this mode. Your light attacks will unleash a flurry of wide sweep attacks, and your heavy strike will perform his spinning slash move.\nKeep defeating any disciple that stands in your path, and move along the platforms and descend to the bottom.",
    "img_below_text": "One you reach a Clay Vajra, you'll be infused with even more power, and your standard slashes will now cast small projectiles blades out in front of you.\n![Wukong Thunderclap 99.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/01/Wukong_Thunderclap_99.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The good news in all of this is you'll be pretty unstoppable in this mode. Your light attacks will unleash a flurry of wide sweep attacks, and your heavy strike will perform his spinning slash move.\nKeep defeating any disciple that stands in your path, and move along the platforms and descend to the bottom.\"\n        - Following Text: \"One you reach a Clay Vajra, you'll be infused with even more power, and your standard slashes will now cast small projectiles blades out in front of you.\n![Wukong Thunderclap 99.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/01/Wukong_Thunderclap_99.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an intense combat sequence in *Black Myth: Wukong*, showcasing the protagonist unleashing wide, sweeping light attacks with glowing red energy trails against enemies in a richly detailed, temple-like environment. The scene aligns with the preceding text, emphasizing the player's powerful attacks and progression through platforms while defeating disciples. The caption at the bottom, \"Such enlightenment surely would grant you Buddhahood!\", suggests a thematic connection to spiritual ascension or transformation within the narrative."
}