{
    "chunk_id": 23794107377,
    "source_file": "Chapter_4_Secret_-_Purple_Cloud_Mountain_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/82/Wukong_PurpleCloud_11.jpg",
    "alt_text": "Wukong PurpleCloud 11.jpg",
    "position_desc": 15,
    "img_above_text": "Purple Mountain Luojia Fragrant Vine\n## Bounds of Deity's Abode",
    "img_below_text": "Look for a path to the left to where a small archway gate is guarded by a lone Snake Herbalist, and past it you'll find a Shrine.\nA very tough boss awaits you just up the path, so this is a good time to make sure you're properly stocked up on supplies have and crafted or upgraded (and make use of the Shrine's store to buy extra anti-miasma powder!).",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Purple Mountain Luojia Fragrant Vine\n## Bounds of Deity's Abode\"\n        - Following Text: \"Look for a path to the left to where a small archway gate is guarded by a lone Snake Herbalist, and past it you'll find a Shrine.\nA very tough boss awaits you just up the path, so this is a good time to make sure you're properly stocked up on supplies have and crafted or upgraded (and make use of the Shrine's store to buy extra anti-miasma powder!).\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character standing near a stone archway in a forested area, with a red arrow indicating a path leading up a staircase. This scene serves as a visual guide to help players locate the path to a small archway gate guarded by a Snake Herbalist, which leads to a Shrine. The context suggests players should prepare for an upcoming tough boss encounter by stocking up on supplies and using the Shrine's store."
}