{
    "chunk_id": 284060593428,
    "source_file": "Chapter_2_Secret_-_Kingdom_of_Sahali_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5b/Wukong_Sahali_43.jpg",
    "alt_text": "Wukong Sahali 43.jpg",
    "position_desc": 43,
    "img_above_text": "That’s your cue to rush in and hit Fuban’s exposed area with your biggest hits, using charged strikes, Spirit Attacks, and Transformation Spells to unload on the beetle before he can rise up.\nWhen following this strategy, you’ll quickly burn through the rest of Fuban’s health bar, and between you and the Yellow Wind Sage, the beetle will stand little chance. He can still repeatedly slam his head in the ground to create shockwaves, and finally pull up with a massive explosion. Again, the Pillar Stance can be useful for dodging these blasts, so long as you have a bit of distance away from him too.",
    "img_below_text": "When he’s finally out of health, the battle will be won, and the Yellow Wind Sage will valiantly land the final blow. It’s a shame we’ll have to beat him up in the future. For your part in the battle, you’ll earn a Sky-Piercing Horn weapon material, and a new Vessel: The Wind Tamer!\nFuban",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"That’s your cue to rush in and hit Fuban’s exposed area with your biggest hits, using charged strikes, Spirit Attacks, and Transformation Spells to unload on the beetle before he can rise up.\nWhen following this strategy, you’ll quickly burn through the rest of Fuban’s health bar, and between you and the Yellow Wind Sage, the beetle will stand little chance. He can still repeatedly slam his head in the ground to create shockwaves, and finally pull up with a massive explosion. Again, the Pillar Stance can be useful for dodging these blasts, so long as you have a bit of distance away from him too.\"\n        - Following Text: \"When he’s finally out of health, the battle will be won, and the Yellow Wind Sage will valiantly land the final blow. It’s a shame we’ll have to beat him up in the future. For your part in the battle, you’ll earn a Sky-Piercing Horn weapon material, and a new Vessel: The Wind Tamer!\nFuban\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an intense moment from a boss battle in a video game, featuring a large beetle-like creature, Fuban, and a player character engaging in combat. The scene highlights the chaotic environment with debris flying, emphasizing the beetle's powerful attacks. This moment aligns with the guide's strategy to exploit Fuban's vulnerabilities and defeat him, leading to rewards such as the Sky-Piercing Horn and the Wind Tamer Vessel."
}