{
    "chunk_id": 193418626439,
    "source_file": "How_to_Unlock_the_Secret_Loong_Dragon_Bosses.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d9/Secret_Loong_Bosses_%2817%29.png",
    "alt_text": "Secret Loong Bosses \\(17\\).png",
    "position_desc": 9,
    "img_above_text": "Red Loong\n## How to Find Black Loong - Chapter 2 Secret Boss",
    "img_below_text": "For Chapter 2, you'll want to wait until you've got to the Rockrest Flat Keeper's Shrine in Yellow Wind Ridge. If you're facing the Keeper's Shrine, turn to the right and head all the way up the stairs. If you haven't already collected it, you'll be able to fight a Spearbone here for a Spirit.\n![Secret Loong Bosses \\(14\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/41/Secret_Loong_Bosses_%2814%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Red Loong\n## How to Find Black Loong - Chapter 2 Secret Boss\"\n        - Following Text: \"For Chapter 2, you'll want to wait until you've got to the Rockrest Flat Keeper's Shrine in Yellow Wind Ridge. If you're facing the Keeper's Shrine, turn to the right and head all the way up the stairs. If you haven't already collected it, you'll be able to fight a Spearbone here for a Spirit.\n![Secret Loong Bosses \\(14\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/41/Secret_Loong_Bosses_%2814%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game \"Black Myth: Wukong,\" showing the location near the Rockrest Flat Keeper's Shrine in Yellow Wind Ridge. The character is positioned in front of a rocky and mountainous terrain, with an arrow indicating the direction to proceed up the stairs to encounter a Spearbone for a Spirit. This image is part of a walkthrough guiding players on how to find the secret boss, Black Loong, in Chapter 2."
}