{
    "chunk_id": 370928299509,
    "source_file": "Water-Wood_Beast.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8f/Foothills_Walkthrough_%2868%29.png",
    "alt_text": "Foothills Walkthrough \\(68\\).png",
    "position_desc": 2,
    "img_above_text": "As you approach it, you should see a small lot of bubbles coming up from the center of it. When you get closer to it, the Water-Wood Beast will appear.\n## Water-Wood Beast Boss Fight and Guide",
    "img_below_text": "In general, you want to stick behind the beast as much as you can. It will try to lunge and bite at you if you face it head-on, so this removes some of the problem of dodging those attacks. Immobilize will also help you out here, as similar to the rhino, it will move around and you'll want to be able to take advantage of those frozen moments as much as possible. Though you will want to watch out for it bucking and kicking back.\n![Foothills Walkthrough \\(69\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/50/Foothills_Walkthrough_%2869%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"As you approach it, you should see a small lot of bubbles coming up from the center of it. When you get closer to it, the Water-Wood Beast will appear.\n## Water-Wood Beast Boss Fight and Guide\"\n        - Following Text: \"In general, you want to stick behind the beast as much as you can. It will try to lunge and bite at you if you face it head-on, so this removes some of the problem of dodging those attacks. Immobilize will also help you out here, as similar to the rhino, it will move around and you'll want to be able to take advantage of those frozen moments as much as possible. Though you will want to watch out for it bucking and kicking back.\n![Foothills Walkthrough \\(69\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/50/Foothills_Walkthrough_%2869%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the Water-Wood Beast, a large, tree-like creature with moss, vines, and foliage growing on its body, emerging from a watery area in a lush, forested environment. This scene is part of a boss fight in the game, where players are advised to attack from behind to avoid its lunging and biting attacks. The image complements the walkthrough by visually introducing the boss and its setting."
}