{
    "chunk_id": 119887767278,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/45/Wukong_Wolves_3.jpg",
    "alt_text": "Wukong Wolves 3.jpg",
    "position_desc": 11,
    "img_above_text": "Since the Destined One can dodge mid-attack, you should press your offense while dealing with these foes, and watch their movements to find the right time to leap out of the way. Your light combo attack comes in four sustained attacks, culminating in a strong overhead slam when performed uninterrupted.\nDefeating each of them will earn you a fair bit of Experience - seen by the yellow bar in the top right corner, as well as a bit of “**Will** ”, which serves as a form of currency. Given that you’ll need both to succeed in your adventure, it’s usually best to take on enemies you encounter rather than running past them.",
    "img_below_text": "A voice will call out as you defeat the first two enemies, and we’ll be meeting the owner of this voice soon enough. For now, head straight up the woodland path, and you should spot a red plant to the right. Pluck it to gain some **Aged Ginseng** \\- a crafting material that we won’t be able to make use of until Chapter 2, but there’s no reason you can’t start stocking up on them now!\n![Wukong Wolves 4.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d8/Wukong_Wolves_4.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Since the Destined One can dodge mid-attack, you should press your offense while dealing with these foes, and watch their movements to find the right time to leap out of the way. Your light combo attack comes in four sustained attacks, culminating in a strong overhead slam when performed uninterrupted.\nDefeating each of them will earn you a fair bit of Experience - seen by the yellow bar in the top right corner, as well as a bit of “**Will** ”, which serves as a form of currency. Given that you’ll need both to succeed in your adventure, it’s usually best to take on enemies you encounter rather than running past them.\"\n        - Following Text: \"A voice will call out as you defeat the first two enemies, and we’ll be meeting the owner of this voice soon enough. For now, head straight up the woodland path, and you should spot a red plant to the right. Pluck it to gain some **Aged Ginseng** \\- a crafting material that we won’t be able to make use of until Chapter 2, but there’s no reason you can’t start stocking up on them now!\n![Wukong Wolves 4.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d8/Wukong_Wolves_4.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a woodland path in *Black Myth: Wukong*, where the player character is shown mid-action, preparing to gather a red plant labeled **Aged Ginseng**. This crafting material, found to the right of the path, can be collected using the \"RT\" button prompt, though it won’t be usable until Chapter 2. The scene emphasizes exploration and resource collection as part of the gameplay, following a combat encounter with enemies that reward Experience and **Will**."
}