{
    "chunk_id": 408324132522,
    "source_file": "Mind_Core.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3a/Mind_Core_-_Windrest_Hamlet.jpg",
    "alt_text": "Mind Core - Windrest Hamlet.jpg",
    "position_desc": 11,
    "img_above_text": "The next Mind Core is at the Windrest Hamlet in Yellow Sand Formation in Yellow Wind Ridge. This can be accessed from the Valley of Despair Shrine in Sandgate Village.\nWhen you reach the inner hamlet, you will come across a Spearbone on the bridge. Defeating it will give you a Mind Core.",
    "img_below_text": "### Mind Core Location 9\nThe next Mind Core is actually obtained by speaking with Xu Dog in the Crouching Tiger Temple \\- Cellar Shrine area.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The next Mind Core is at the Windrest Hamlet in Yellow Sand Formation in Yellow Wind Ridge. This can be accessed from the Valley of Despair Shrine in Sandgate Village.\nWhen you reach the inner hamlet, you will come across a Spearbone on the bridge. Defeating it will give you a Mind Core.\"\n        - Following Text: \"### Mind Core Location 9\nThe next Mind Core is actually obtained by speaking with Xu Dog in the Crouching Tiger Temple \\- Cellar Shrine area.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character facing off against a Spearbone enemy on a sandy path near a bridge in Windrest Hamlet, part of the Yellow Sand Formation in Yellow Wind Ridge. This encounter is part of the process to obtain a Mind Core, as defeating the Spearbone rewards the player with this item. The setting features a rugged, desolate environment with dilapidated structures in the background, aligning with the walkthrough's guidance for locating Mind Core 8."
}