{
    "chunk_id": 967682453682,
    "source_file": "Kang-Jin_Staff.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9a/Wukong_Snowhill_36.jpg",
    "alt_text": "Wukong Snowhill 36.jpg",
    "position_desc": 2,
    "img_above_text": "## Black Myth: Wukong Kang-Jin Staff Location\nThe Kang-Jin Staff can be found in Chapter 3 in The New West, upon defeating Kang-JIn Loong. This is a mandatory boss.",
    "img_below_text": "Weapons can be crafted throughout the game from the Shrines throughout the game's six chapters. Crafting weapons will require Will and various Crafting Materials from the game's locales and enemies. To craft the Kang-Jin Staff you will need:\n* 1 Starlit Cloud-Bidden Antler",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Black Myth: Wukong Kang-Jin Staff Location\nThe Kang-Jin Staff can be found in Chapter 3 in The New West, upon defeating Kang-JIn Loong. This is a mandatory boss.\"\n        - Following Text: \"Weapons can be crafted throughout the game from the Shrines throughout the game's six chapters. Crafting weapons will require Will and various Crafting Materials from the game's locales and enemies. To craft the Kang-Jin Staff you will need:\n* 1 Starlit Cloud-Bidden Antler\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dramatic encounter in *Black Myth: Wukong*, showcasing the player character facing off against Kang-Jin Loong, a serpentine boss in a snowy environment. This battle is significant as defeating Kang-Jin Loong is mandatory to obtain the Kang-Jin Staff in Chapter 3, \"The New West.\" The staff can later be crafted using specific materials, including the Starlit Cloud-Bidden Antler."
}