{
    "chunk_id": 316863267524,
    "source_file": "Foothills_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7c/Foothills_Walkthrough_%28113%29.png",
    "alt_text": "Foothills Walkthrough \\(113\\).png",
    "position_desc": 24,
    "img_above_text": "You only need to kill one Poison Chief to unlock the journal entry, but there are four in the area, so we’ve included information on how to find each one below.\nIf you're not using a general build, be sure to equip gear, curios, and spirits that give you Poison Resistance. Though this is another boss with a limited moveset, it can be easy to die to the Poison Chiefs if you're not careful.",
    "img_below_text": "You can expect it to throw out little orbs of poison continuously, covering the surrounding area and inflicting Poison Damage. Equip Antimiasma Powder so you can quickly use it if you get caught in one too many attacks.\n![Foothills Walkthrough \\(116\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/db/Foothills_Walkthrough_%28116%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"You only need to kill one Poison Chief to unlock the journal entry, but there are four in the area, so we’ve included information on how to find each one below.\nIf you're not using a general build, be sure to equip gear, curios, and spirits that give you Poison Resistance. Though this is another boss with a limited moveset, it can be easy to die to the Poison Chiefs if you're not careful.\"\n        - Following Text: \"You can expect it to throw out little orbs of poison continuously, covering the surrounding area and inflicting Poison Damage. Equip Antimiasma Powder so you can quickly use it if you get caught in one too many attacks.\n![Foothills Walkthrough \\(116\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/db/Foothills_Walkthrough_%28116%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a battle scene from a video game where the player character is engaged in combat with a large, tree-like rock creature emitting green poison gas. The context suggests this is one of the Poison Chiefs mentioned in the walkthrough, and players are advised to equip Poison Resistance gear and Antimiasma Powder to mitigate the creature's poison-based attacks. The lush, forested environment serves as the backdrop for this encounter."
}