{
    "chunk_id": 963676345762,
    "source_file": "How_to_Find_All_Purple_Talisman_Altars_in_Chapter_4.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/00/Purple_Talismans_Chapter_4_%283%29.png",
    "alt_text": "Purple Talismans Chapter 4 \\(3\\).png",
    "position_desc": 6,
    "img_above_text": "As you approach, a cutscene will begin. You'll be able to take the Talisman from the altar straight after.\n### Purple Talisman 2 - Cliff of Oblivion",
    "img_below_text": "This one is just to the right of the Cliff of Oblivion Keeper's Shrine (when you're facing it). You'll find the Altar in the water.\n### Purple Talisman 3 - Relief of the Fallen Loong",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"As you approach, a cutscene will begin. You'll be able to take the Talisman from the altar straight after.\n### Purple Talisman 2 - Cliff of Oblivion\"\n        - Following Text: \"This one is just to the right of the Cliff of Oblivion Keeper's Shrine (when you're facing it). You'll find the Altar in the water.\n### Purple Talisman 3 - Relief of the Fallen Loong\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image illustrates a player's location in a dark, cave-like environment, highlighting two key points of interest with red dashed circles and an arrow. The first point appears to be an altar surrounded by statues and candles, likely where the Purple Talisman 2 can be obtained. The arrow directs attention to another area further in the cave, possibly the next objective or location to explore. This aligns with the guide's instructions for progressing through the \"Cliff of Oblivion\" section."
}