{
    "chunk_id": 344491811575,
    "source_file": "Bishui_Beast_Staff.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7b/Bishui_Cave_Walkthrough_%2844%29.png",
    "alt_text": "Bishui Cave Walkthrough \\(44\\).png",
    "position_desc": 1,
    "img_above_text": "## Black Myth: Wukong Bishui Beast Staff Location\nThe Bishui Beast Staff can be found in Chapter 5 - Flaming Mountains, upon defeating the Bishui Golden-Eyed Beast in the Bishui Cave.",
    "img_below_text": "Weapons can be crafted throughout the game from the Shrines throughout the game's six chapters. Crafting weapons will require Will and various Crafting Materials from the game's locales and enemies. To craft the Bishui Beast Staff you will need:\n* 1 Bishui Beast Bit",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Black Myth: Wukong Bishui Beast Staff Location\nThe Bishui Beast Staff can be found in Chapter 5 - Flaming Mountains, upon defeating the Bishui Golden-Eyed Beast in the Bishui Cave.\"\n        - Following Text: \"Weapons can be crafted throughout the game from the Shrines throughout the game's six chapters. Crafting weapons will require Will and various Crafting Materials from the game's locales and enemies. To craft the Bishui Beast Staff you will need:\n* 1 Bishui Beast Bit\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dramatic battle scene from the video game *Black Myth: Wukong*, showing the player character confronting the Bishui Golden-Eyed Beast in the Bishui Cave. This encounter is significant as defeating the beast is necessary to acquire the Bishui Beast Staff, a key weapon in Chapter 5 - Flaming Mountains. The dark, atmospheric cave setting and the intense action highlight the challenge of this boss fight."
}