{
    "chunk_id": 847549346251,
    "source_file": "Nine-Capped_Lingzhi_Guai.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d3/Field_Fire_Walkthrough_%284%29.png",
    "alt_text": "Field Fire Walkthrough \\(4\\).png",
    "position_desc": 4,
    "img_above_text": "He uses a spiked mace to attack and generally will perform a series of combos where he'll swing the mace, or leap up in the air and smash it down.\nThough these are fairly standard attacks, in the sense that they can be dodged and evaded, the problem with them is the small red mushrooms that appear with each one.",
    "img_below_text": "These tiny red mushrooms will appear in any area that his attack lands -- including on you. If they start to grow on you, they'll reduce your movement significantly. This doesn't affect dodging, however, just walking. The biggest problem with this is that as you move around, the red mushrooms will appear on the floor around you and continue to explode, so you'll need to keep moving.\nWhen they land in areas of the clearing, they will explode into a red mist. This is poisonous, so you'll want to evade the direct blows from the mace and the fungi to avoid poison buildup. Be sure to have Antimiasma Powder equipped to help with any poison buildup during this fight.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"He uses a spiked mace to attack and generally will perform a series of combos where he'll swing the mace, or leap up in the air and smash it down.\nThough these are fairly standard attacks, in the sense that they can be dodged and evaded, the problem with them is the small red mushrooms that appear with each one.\"\n        - Following Text: \"These tiny red mushrooms will appear in any area that his attack lands -- including on you. If they start to grow on you, they'll reduce your movement significantly. This doesn't affect dodging, however, just walking. The biggest problem with this is that as you move around, the red mushrooms will appear on the floor around you and continue to explode, so you'll need to keep moving.\nWhen they land in areas of the clearing, they will explode into a red mist. This is poisonous, so you'll want to evade the direct blows from the mace and the fungi to avoid poison buildup. Be sure to have Antimiasma Powder equipped to help with any poison buildup during this fight.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a hostile creature wielding a spiked mace in a dark, rocky environment. The creature appears to be surrounded by red mushrooms and a red mist, which aligns with the description of its attacks in the text. These mushrooms grow where its mace strikes and can hinder movement or cause poison buildup. The visual reinforces the gameplay mechanics and hazards described, emphasizing the need for evasion and preparation with items like Antimiasma Powder during this encounter."
}