{
    "chunk_id": 833870226494,
    "source_file": "Nine-Capped_Lingzhi_Guai.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4a/Field_Fire_Walkthrough_%282%29.png",
    "alt_text": "Field Fire Walkthrough \\(2\\).png",
    "position_desc": 2,
    "img_above_text": "Before you continue along the path, face the Ashen Pass III Keeper's Shrine and turn to the right. You'll see a Purple Lingzhi to harvest and another mushroom in the center of the clearing. When you pull this second one, you'll be confronted by the Nine-Capped Lingzhi Guai, which is an optional boss.\n## Nine-Capped Lingzhi Guai Boss Fight and Guide",
    "img_below_text": "The huge Nine-Capped Lingzhi Guai will emerge as soon as you attempt to harvest the mushroom. Immediately, he'll leap up and try to hit you.\n![Field Fire Walkthrough \\(3\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e9/Field_Fire_Walkthrough_%283%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Before you continue along the path, face the Ashen Pass III Keeper's Shrine and turn to the right. You'll see a Purple Lingzhi to harvest and another mushroom in the center of the clearing. When you pull this second one, you'll be confronted by the Nine-Capped Lingzhi Guai, which is an optional boss.\n## Nine-Capped Lingzhi Guai Boss Fight and Guide\"\n        - Following Text: \"The huge Nine-Capped Lingzhi Guai will emerge as soon as you attempt to harvest the mushroom. Immediately, he'll leap up and try to hit you.\n![Field Fire Walkthrough \\(3\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e9/Field_Fire_Walkthrough_%283%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight scene from a video game, where the player character, equipped with a weapon and wearing a traditional hat, faces off against the Nine-Capped Lingzhi Guai, a large, humanoid mushroom-like creature. The setting is a rocky, desolate area, and the boss appears to be mid-attack, leaping toward the player. This encounter occurs after attempting to harvest a mushroom in the clearing, as described in the walkthrough."
}