{
    "chunk_id": 762559118554,
    "source_file": "Temple_of_Yellow_Flowers_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7f/Wukong_YellowFlower_6.jpg",
    "alt_text": "Wukong YellowFlower 6.jpg",
    "position_desc": 6,
    "img_above_text": "![Wukong YellowFlower 5.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/87/Wukong_YellowFlower_5.jpg)\nHeading up the steps to a large balcony, defeat another Fly-Whisk Daoist to find a small turtle-shaped **Treasure Chest** that holds a **Bee Mountain Stone Soak** for your Gourd.",
    "img_below_text": "Near the balcony, you'll find a large plaza where two Spear Daoists guard a building with a green Wisp, while a Snake Herbalist patrols the main path to the left. You'll find he strikes similarly to the Snake Patrollers in Black Wind Mountain, only he can use the poison pot on his back to toss out even more splashes of poison.\nFollow the blood trail that leads to the left and through a dark shaded corridor, and then up to another large open area.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong YellowFlower 5.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/87/Wukong_YellowFlower_5.jpg)\nHeading up the steps to a large balcony, defeat another Fly-Whisk Daoist to find a small turtle-shaped **Treasure Chest** that holds a **Bee Mountain Stone Soak** for your Gourd.\"\n        - Following Text: \"Near the balcony, you'll find a large plaza where two Spear Daoists guard a building with a green Wisp, while a Snake Herbalist patrols the main path to the left. You'll find he strikes similarly to the Snake Patrollers in Black Wind Mountain, only he can use the poison pot on his back to toss out even more splashes of poison.\nFollow the blood trail that leads to the left and through a dark shaded corridor, and then up to another large open area.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat scene from *Black Myth: Wukong*, showing the player character engaging a large, insect-like enemy with a glowing green core. The player wields a fiery weapon while their health and abilities are displayed on the screen. In the background, two yellow-robed enemies stand near a building, likely guarding the area mentioned in the preceding and following text. This scene appears to occur near the balcony and plaza described, advancing the narrative through exploration and combat challenges."
}