{
    "chunk_id": 688954434389,
    "source_file": "Black_Loong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fa/Wukong_BlackLoong_4.jpg",
    "alt_text": "Wukong BlackLoong 4.jpg",
    "position_desc": 9,
    "img_above_text": "The Black Loong is a fearsome dragon standing on two legs and wielding a pair of giant maces imbued with his electricity, which he can employ to create different kinds of shockwaves that deal incredible damage. Though you can face him early on in Chapter 2 once you find the Loong Scales, it’s recommended you wait until you’ve completed Chapter 2 or even started Chapter 3 before taking him on.\nIn particular, it’s a good idea to stock up on medicine to increase your shock resistance, and buy the Thunderbolt Horn Soak from the Shen Monkey as well.",
    "img_below_text": "Any time you see the Black Loong’s weapons flare to life and crackle, you can expect them to detonate with massive electrical explosions whenever they slam into the ground. In particular, he can use a large leaping slam to cause a sizable explosion you’ll need to avoid with a well-timed dodge. He’ll often end this slam by dragging his weapons around to his sides, so try to evade backwards or get around to his back before retaliating.\nHe also has a variety of melee swings - sometimes swinging both weapons in slow arcs to slam in the ground one after the other before a third and final electrical slam. Other times he’ll alternate slamming the ground with each weapon while it’s imbued on either side of his body.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Black Loong is a fearsome dragon standing on two legs and wielding a pair of giant maces imbued with his electricity, which he can employ to create different kinds of shockwaves that deal incredible damage. Though you can face him early on in Chapter 2 once you find the Loong Scales, it’s recommended you wait until you’ve completed Chapter 2 or even started Chapter 3 before taking him on.\nIn particular, it’s a good idea to stock up on medicine to increase your shock resistance, and buy the Thunderbolt Horn Soak from the Shen Monkey as well.\"\n        - Following Text: \"Any time you see the Black Loong’s weapons flare to life and crackle, you can expect them to detonate with massive electrical explosions whenever they slam into the ground. In particular, he can use a large leaping slam to cause a sizable explosion you’ll need to avoid with a well-timed dodge. He’ll often end this slam by dragging his weapons around to his sides, so try to evade backwards or get around to his back before retaliating.\nHe also has a variety of melee swings - sometimes swinging both weapons in slow arcs to slam in the ground one after the other before a third and final electrical slam. Other times he’ll alternate slamming the ground with each weapon while it’s imbued on either side of his body.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the Black Loong, a powerful dragon boss in the game, mid-attack during a battle. He is shown slamming his electrically charged maces into the ground, creating shockwaves and crackling explosions. The surrounding environment is fractured, glowing with electrical energy and fiery cracks, emphasizing the destructive force of his attack. The health bar labeled \"Black Loong\" and the player interface suggest this is a critical moment in the fight, requiring precise dodging and strategic positioning to avoid damage."
}