{
    "chunk_id": 529123059859,
    "source_file": "Bamboo_Grove_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/29/Wukong_Bamboo_25.jpg",
    "alt_text": "Wukong Bamboo 25.jpg",
    "position_desc": 26,
    "img_above_text": "![Wukong Bamboo 24.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d3/Wukong_Bamboo_24.jpg)\nHis other main projectile attack comes out much faster, as he levitates off the ground for a moment before shooting out a line of the spells in front of him. They don’t track you like the others, but they will shoot rapidly downward and into the ground in front of him.",
    "img_below_text": "When he’s got some range on you, listen up for some of his call-outs. If he yells “Storm forth!” he’ll soon create a gusty orb surrounded by leaves that will slowly float toward you. This one can’t be deflected since it won’t do damage on its own. Once it reaches your position, the gust will issue forth and in a moment become a small violent tornado that will knock you down!\n![Wukong Bamboo 29.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c5/Wukong_Bamboo_29.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Bamboo 24.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d3/Wukong_Bamboo_24.jpg)\nHis other main projectile attack comes out much faster, as he levitates off the ground for a moment before shooting out a line of the spells in front of him. They don’t track you like the others, but they will shoot rapidly downward and into the ground in front of him.\"\n        - Following Text: \"When he’s got some range on you, listen up for some of his call-outs. If he yells “Storm forth!” he’ll soon create a gusty orb surrounded by leaves that will slowly float toward you. This one can’t be deflected since it won’t do damage on its own. Once it reaches your position, the gust will issue forth and in a moment become a small violent tornado that will knock you down!\n![Wukong Bamboo 29.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c5/Wukong_Bamboo_29.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat scene from *Black Myth: Wukong*, where the player character faces off against an enemy named Guangmou in a lush bamboo forest setting. The player is positioned in a defensive stance, with visible health and ability icons on the HUD, while the enemy is seen in the distance near a rocky area. This moment aligns with the preceding and following text, which describe the enemy's projectile and area-based attacks, emphasizing the need for strategic movement and awareness during the fight."
}