{
    "chunk_id": 460752678922,
    "source_file": "Chapter_4_Secret_-_Purple_Cloud_Mountain_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/6f/Wukong_PurpleCloud_33.jpg",
    "alt_text": "Wukong PurpleCloud 33.jpg",
    "position_desc": 37,
    "img_above_text": "![Wukong PurpleCloud 32.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a8/Wukong_PurpleCloud_32.jpg)\nAfter resting at the Petalfall Hamlet Shrine, head up the path and across a small bridge to enter the small village. It's now overrun by various Daoists, which shouldn't prove too much of a problem if you take them out one at a time.",
    "img_below_text": "However, after climbing some stairs, you'll come across a special Sword Daoist playing a flute, and does not appear hostile. He'll actually ask a favor of you, noting that his fellow Daoists have all been partaking of Amourworm eggs, turning them into undying husks. He'll ask you to seek one out and return it to him.\nWhile it may sound like he's asking you to seek out a Worm Practitioner, in reality any of the Daoists you defeat in this hamlet has a chance to drop the item he seeks. We'll clear the village out before returning to him, but you may also need to rest and respawn them if you don't find one.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong PurpleCloud 32.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a8/Wukong_PurpleCloud_32.jpg)\nAfter resting at the Petalfall Hamlet Shrine, head up the path and across a small bridge to enter the small village. It's now overrun by various Daoists, which shouldn't prove too much of a problem if you take them out one at a time.\"\n        - Following Text: \"However, after climbing some stairs, you'll come across a special Sword Daoist playing a flute, and does not appear hostile. He'll actually ask a favor of you, noting that his fellow Daoists have all been partaking of Amourworm eggs, turning them into undying husks. He'll ask you to seek one out and return it to him.\nWhile it may sound like he's asking you to seek out a Worm Practitioner, in reality any of the Daoists you defeat in this hamlet has a chance to drop the item he seeks. We'll clear the village out before returning to him, but you may also need to rest and respawn them if you don't find one.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from *Black Myth: Wukong* where the player character, wielding a glowing staff, approaches a Daoist NPC standing outside a traditional building in a grassy, autumnal setting. A glowing green marker inside the building (highlighted with a red circle) suggests an interactable object or point of interest. The caption at the bottom reads, \"It's been long since any soul has trodden these hidden bounds,\" adding to the narrative atmosphere. This moment occurs in the Petalfall Hamlet, where the player encounters Daoists and progresses through the village."
}