{
    "chunk_id": 929967093895,
    "source_file": "Enslaved_Yaksha_Spirit.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/55/Enslaved_yaksha.png",
    "alt_text": "Enslaved yaksha.png",
    "position_desc": 3,
    "img_above_text": "The Enslaved Yaksha is armed with a massive metal spike, and he's not afraid to use it. The sheer size of the spike means the Enslaved Yaksha has a lot of reach. Use Immobilize to freeze him in place so you can wail on him safely and watch out for the other enemies that lurk in the cell with him.\n## Enslaved Yaksha Spirit",
    "img_below_text": "* **Mutilate**\n* Equipped Effect: Grants a moderate amount of Focus when hit.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Enslaved Yaksha is armed with a massive metal spike, and he's not afraid to use it. The sheer size of the spike means the Enslaved Yaksha has a lot of reach. Use Immobilize to freeze him in place so you can wail on him safely and watch out for the other enemies that lurk in the cell with him.\n## Enslaved Yaksha Spirit\"\n        - Following Text: \"* **Mutilate**\n* Equipped Effect: Grants a moderate amount of Focus when hit.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "1. **Summary**:  \nThe image showcases the \"Equipment\" menu from a video game, specifically highlighting the \"Enslaved Yaksha Spirit,\" a rare item with high Qi cost. Its ability, \"Mutilate,\" allows the player to take the form of the Enslaved Yaksha and use a long blade to stagger enemies by stabbing them in the heart. The equipped effect grants a moderate amount of Focus when hit. The menu also includes a demonstration option and the ability to equip the spirit.\n\n2. **Purpose/Narrative Role**:  \nThe Enslaved Yaksha Spirit serves as a combat tool, enabling players to temporarily adopt its form and utilize its powerful abilities for strategic advantages in battles."
}