{
    "chunk_id": 976707894422,
    "source_file": "Celestial_Nonary_Pill_Locations.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/18/Yellow_Wind_Nonary.jpg",
    "alt_text": "Yellow Wind Nonary.jpg",
    "position_desc": 2,
    "img_above_text": "## Yellow Wind Ridge Celestial Nonary Pill\nYellow Wind Ridge Celestial Nonary Pill",
    "img_below_text": "The Yellow Wind Ridge Celestial Nonary Pill is hidden in a secret area near the First Prince of Flowing Sands. Take out the enemies near the wooden plank opposite the arena and follow the path to a crack in the wall. Squeeze through the crack, take out the Swift Bat, absorb its Spirit, and pass through the door at the end of the room. Head to the back of the rock alcove to find the Celestial Nonary Pill.\n## Xu-Dog Celestial Nonary Pill",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Yellow Wind Ridge Celestial Nonary Pill\nYellow Wind Ridge Celestial Nonary Pill\"\n        - Following Text: \"The Yellow Wind Ridge Celestial Nonary Pill is hidden in a secret area near the First Prince of Flowing Sands. Take out the enemies near the wooden plank opposite the arena and follow the path to a crack in the wall. Squeeze through the crack, take out the Swift Bat, absorb its Spirit, and pass through the door at the end of the room. Head to the back of the rock alcove to find the Celestial Nonary Pill.\n## Xu-Dog Celestial Nonary Pill\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character standing in front of a glowing object on a pedestal within a dimly lit cave-like environment. The object appears to be interactable, as indicated by the \"RT Open\" prompt on the screen. This scene aligns with the preceding and following text, which describe locating the Yellow Wind Ridge Celestial Nonary Pill in a hidden area. The image likely represents the moment when the player discovers and prepares to collect the pill after navigating through the described path and defeating enemies."
}