{
    "chunk_id": 513137771095,
    "source_file": "Hundred-Eyed_Daoist_Master.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/68/Wukong_YellowFlower_74.jpg",
    "alt_text": "Wukong YellowFlower 74.jpg",
    "position_desc": 10,
    "img_above_text": "![Wukong YellowFlower 73.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/50/Wukong_YellowFlower_73.jpg)\nHis other burrowing attack is equally damaging, though it comes less often. He'll start by tossing his sword at you, which will continue to spin wildly in a small circle near your position. As soon as you dodge it, immediately sprint away, as his tail will burst forth around the sword, spraying poison in nearly every direction.",
    "img_below_text": "The attack won't stop there, as once he re-burrows, you'll need to keep your eyes and ears peeled. After a brief moment, his electrified sword will come hurtling in from a corner of the arena with a small lightning strike noise, and you'll need to dodge it as it embeds itself in the ground. Stay clear of the impact site, as the boss will then burrow out to grab it and perform a quick double slash with the electrified blade before spinning about (at which you should then hop in and attack).\n![Wukong YellowFlower 75.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/dc/Wukong_YellowFlower_75.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong YellowFlower 73.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/50/Wukong_YellowFlower_73.jpg)\nHis other burrowing attack is equally damaging, though it comes less often. He'll start by tossing his sword at you, which will continue to spin wildly in a small circle near your position. As soon as you dodge it, immediately sprint away, as his tail will burst forth around the sword, spraying poison in nearly every direction.\"\n        - Following Text: \"The attack won't stop there, as once he re-burrows, you'll need to keep your eyes and ears peeled. After a brief moment, his electrified sword will come hurtling in from a corner of the arena with a small lightning strike noise, and you'll need to dodge it as it embeds itself in the ground. Stay clear of the impact site, as the boss will then burrow out to grab it and perform a quick double slash with the electrified blade before spinning about (at which you should then hop in and attack).\n![Wukong YellowFlower 75.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/dc/Wukong_YellowFlower_75.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a gameplay moment from *Black Myth: Wukong*, showcasing the protagonist in a vibrant field of yellow flowers during a boss fight against the \"Hundred Eyed Daoist Master.\" The red arrow highlights a key visual cue, likely indicating the incoming electrified sword attack described in the text. This attack is part of the boss's sequence, requiring players to dodge the sword and avoid the impact site before countering the boss's follow-up moves."
}