{
    "chunk_id": 733469901061,
    "source_file": "Thunderbone.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c8/Thunderbone-2.jpg",
    "alt_text": "Thunderbone-2.jpg",
    "position_desc": 1,
    "img_above_text": "Thunderbone is one of the unique materials in Black Myth: Wukong. It is used for weapon and armor crafting to craft unique gear unlocked upon defeating a boss.\nThe Thunderbone can be used to craft the Loongwreathe Staff from the Shrine.",
    "img_below_text": "To obtain the Thunderbone, you need to defeat Black Loong in Fright Cliff in Rockrest Flat in Yellow Wind Ridge. You need the Loong Scales to be able to trigger this fight.\n![Wukong Fright 41.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a1/Wukong_Fright_41.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Thunderbone is one of the unique materials in Black Myth: Wukong. It is used for weapon and armor crafting to craft unique gear unlocked upon defeating a boss.\nThe Thunderbone can be used to craft the Loongwreathe Staff from the Shrine.\"\n        - Following Text: \"To obtain the Thunderbone, you need to defeat Black Loong in Fright Cliff in Rockrest Flat in Yellow Wind Ridge. You need the Loong Scales to be able to trigger this fight.\n![Wukong Fright 41.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a1/Wukong_Fright_41.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image shows the inventory screen from the game *Black Myth: Wukong*, highlighting the \"Thunderbone,\" an epic special crafting material. The item description notes that it emits lightning and holds mysterious potential for future use. The Thunderbone is used for crafting unique gear, such as the Loongwreathe Staff, and is obtained by defeating the Black Loong boss in the game."
}