{
    "chunk_id": 571750957355,
    "source_file": "Old_Ginseng_Guai.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2a/Wukong_Karma_11.jpg",
    "alt_text": "Wukong Karma 11.jpg",
    "position_desc": 2,
    "img_above_text": "This hulking brute isn't as deadly as the Non-Able boss fight, but he does has a few tricks up his sleeve. As you might expect, he can deal a lot of damage with poisonous roots much like the lesser Ginsengling, so having antimiasma medicine on hand is a good strategy.\nMany of the Old Ginseng Guai's attacks are slow and hard-hitting, and the guai himself moves at a fairly slow pace, making him the perfect target for hit and run attacks as needed.",
    "img_below_text": "He can perform a variety of lurching stomp attacks, many of which will create a small area of poisonous roots. Like the ice frog, you'll want to take back control of the battlefield by reorienting yourself, and use the Thrust Stance to hit him with charged strikes while staying out of the poison.\n![Wukong Karma 13.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8e/Wukong_Karma_13.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"This hulking brute isn't as deadly as the Non-Able boss fight, but he does has a few tricks up his sleeve. As you might expect, he can deal a lot of damage with poisonous roots much like the lesser Ginsengling, so having antimiasma medicine on hand is a good strategy.\nMany of the Old Ginseng Guai's attacks are slow and hard-hitting, and the guai himself moves at a fairly slow pace, making him the perfect target for hit and run attacks as needed.\"\n        - Following Text: \"He can perform a variety of lurching stomp attacks, many of which will create a small area of poisonous roots. Like the ice frog, you'll want to take back control of the battlefield by reorienting yourself, and use the Thrust Stance to hit him with charged strikes while staying out of the poison.\n![Wukong Karma 13.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8e/Wukong_Karma_13.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a battle scene from the video game *Black Myth: Wukong*, showcasing the player character engaging in combat against the \"Old Ginseng Guai\" boss. The player is wielding a fiery staff and appears to be executing a dodge or attack maneuver while the boss, a large plant-like creature, is surrounded by poisonous roots. The snowy environment and detailed UI elements, including health bars and abilities, emphasize the strategic nature of the fight. The preceding and following text highlights the boss's slow, hard-hitting attacks and poisonous area effects, suggesting a hit-and-run strategy with the use of Thrust Stance and antimiasma medicine."
}