{
    "chunk_id": 930008781968,
    "source_file": "Bamboo_Grove_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3d/Wukong_Bamboo_21.jpg",
    "alt_text": "Wukong Bamboo 21.jpg",
    "position_desc": 20,
    "img_above_text": "![Wukong Bamboo 20.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5f/Wukong_Bamboo_20.jpg)\nFrom the mini-boss lair, you can head past where the toad emerged from to the right to find a path with a green wisp Spirit you can absorb for a decent amount of Will. Past this is a Snake-Head Mushroom, and a ledge that will lead down to a larger central area that the main path also leads to.",
    "img_below_text": "This bamboo forest is full of various Snake Patrollers, and a great amount of Skeletal Snake bones lying in wait and just waiting to ambush you as the bones awaken. Because of this, it’s best to proceed slowly through this region and alert the snakes one by one, defeating them as they come alive, and luring the living Snake Patrollers backward so your fights don’t attract more attention.\n![Wukong Bamboo 22.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3f/Wukong_Bamboo_22.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Bamboo 20.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5f/Wukong_Bamboo_20.jpg)\nFrom the mini-boss lair, you can head past where the toad emerged from to the right to find a path with a green wisp Spirit you can absorb for a decent amount of Will. Past this is a Snake-Head Mushroom, and a ledge that will lead down to a larger central area that the main path also leads to.\"\n        - Following Text: \"This bamboo forest is full of various Snake Patrollers, and a great amount of Skeletal Snake bones lying in wait and just waiting to ambush you as the bones awaken. Because of this, it’s best to proceed slowly through this region and alert the snakes one by one, defeating them as they come alive, and luring the living Snake Patrollers backward so your fights don’t attract more attention.\n![Wukong Bamboo 22.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3f/Wukong_Bamboo_22.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a tense encounter within a bamboo forest in *Black Myth: Wukong*. The player character is engaging an armored enemy wielding a spear, while navigating through dense vegetation. The preceding and following text suggests this area is dangerous, filled with ambushes from skeletal snake enemies and patrolling snakes, requiring cautious progression to avoid attracting multiple foes. The setting is atmospheric, with dim lighting and environmental details like a distant fire."
}