{
    "chunk_id": 94062312795,
    "source_file": "Tiger_Relic.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/31/Wukong_Tiger_29.jpg",
    "alt_text": "Wukong Tiger 29.jpg",
    "position_desc": 2,
    "img_above_text": "![Keeness of Tiger 3.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d2/Keeness_of_Tiger_3.jpg)\nAt the end of the pathway, you will reach a slope leading down. As you step on the slope, jump to reach the platform above, which has the Soak.",
    "img_below_text": "Soaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Keeness of Tiger 3.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d2/Keeness_of_Tiger_3.jpg)\nAt the end of the pathway, you will reach a slope leading down. As you step on the slope, jump to reach the platform above, which has the Soak.\"\n        - Following Text: \"Soaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a gameplay moment from *Black Myth: Wukong*, showing the player character mid-jump towards a higher platform. This action is part of a guide instructing players to jump onto the platform to collect a \"Soak,\" an in-game item used for healing. The red arrow highlights the intended direction of movement."
}