{
    "chunk_id": 142889428848,
    "source_file": "Celestial_Jade_Lotus_Pill_Locations.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d0/The_New_West_Jade_Lotus.jpg",
    "alt_text": "The New West Jade Lotus.jpg",
    "position_desc": 4,
    "img_above_text": "## The New West Celestial Jade Lotus Pill\nThe New West Celestial Jade Lotus Pill",
    "img_below_text": "The New West Celestial Jade Lotus Pill is hiding on Turtle Island. From the Turtle Island Keeper's Shrine, turn left and run off the edge of the first cliff. The Celestial Jade Lotus Pill is sitting in a golden chest by the rock wall.\n## The Webbed Hollow Celestial Jade Lotus Pill",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## The New West Celestial Jade Lotus Pill\nThe New West Celestial Jade Lotus Pill\"\n        - Following Text: \"The New West Celestial Jade Lotus Pill is hiding on Turtle Island. From the Turtle Island Keeper's Shrine, turn left and run off the edge of the first cliff. The Celestial Jade Lotus Pill is sitting in a golden chest by the rock wall.\n## The Webbed Hollow Celestial Jade Lotus Pill\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a snowy environment with a shrine-like structure featuring lit lanterns and a golden chest. A character dressed in traditional attire is interacting with the chest, indicated by the \"RT Open\" prompt. This scene aligns with the preceding and following text, suggesting the image is part of a video game guide detailing the location of the \"New West Celestial Jade Lotus Pill\" on Turtle Island. The chest likely contains the item mentioned in the walkthrough."
}