{
    "chunk_id": 870998356464,
    "source_file": "Secrets_in_Black_Myth_Wukong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b7/How_To_Find_Yellow_Loong_%284%29.png",
    "alt_text": "How To Find Yellow Loong \\(4\\).png",
    "position_desc": 15,
    "img_above_text": "The Skandha of Choice can be found in Chapter 4. Go right from The Purifying Spring Keeper's Choice and up the stairs and through the gap in the wall. Follow this path along to the right, and cross the bridge. Then turn left and look for the white sacs that block a path going down. Smash through these and go down here to find a Buddha head, where the monkey from previous chapters will be sitting. Once the monkey has run off, take the Skandha of Choice from the Buddha's head.\n## Yellow Loong and Transformation Spell: Golden Lining",
    "img_below_text": "As you might've guessed by this point of the game, the Loong bosses can be found in various chapters hidden away. To find Yellow Loong, you'll need to wait until Chapter 4. As you make your way through the Webbed Hollow, you'll start to work toward the bottom of the area, past the Cliff of Oblivion. This is where you can find the Relief of the Fallen Loong, with the boss battle taking place nearby.\nDefeating him will reward you with a powerful Transformation Spell called Golden Lining, where you can become Yellow Loong and use his shock-infused long combo attacks.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Skandha of Choice can be found in Chapter 4. Go right from The Purifying Spring Keeper's Choice and up the stairs and through the gap in the wall. Follow this path along to the right, and cross the bridge. Then turn left and look for the white sacs that block a path going down. Smash through these and go down here to find a Buddha head, where the monkey from previous chapters will be sitting. Once the monkey has run off, take the Skandha of Choice from the Buddha's head.\n## Yellow Loong and Transformation Spell: Golden Lining\"\n        - Following Text: \"As you might've guessed by this point of the game, the Loong bosses can be found in various chapters hidden away. To find Yellow Loong, you'll need to wait until Chapter 4. As you make your way through the Webbed Hollow, you'll start to work toward the bottom of the area, past the Cliff of Oblivion. This is where you can find the Relief of the Fallen Loong, with the boss battle taking place nearby.\nDefeating him will reward you with a powerful Transformation Spell called Golden Lining, where you can become Yellow Loong and use his shock-infused long combo attacks.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a character in a video game, likely a boss or significant adversary, standing in a dimly lit, forested area with a weapon in hand. The character, wearing a horned mask and yellow attire, delivers the line, \"I'll kill you to unbind our destinies,\" suggesting a pivotal confrontation. This scene may be related to the \"Yellow Loong\" boss mentioned in the following text, encountered in Chapter 4 near the Webbed Hollow and Cliff of Oblivion."
}