{
    "chunk_id": 805631293200,
    "source_file": "Crouching_Tiger_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/31/Wukong_Tiger_18.jpg",
    "alt_text": "Wukong Tiger 18.jpg",
    "position_desc": 16,
    "img_above_text": "The last hit he’ll try to throw you off by spinning in place before the swing, so don’t be fooled! While there’s a chance he’ll perform a flourish and sheathe his sword after this, it’s more likely he’ll try to fool you again before starting up a second combo, which comes in three quick slashes with no delay at the end.\nIf you try to retreat from the second combo, be warned that he can slice the bloody water to form waves of force as projectile slices with three hits, so you’ll need to keep dodging either way.",
    "img_below_text": "There’s also the chance he can start the sword combo while doing a spinning retreating jump, sneakily taking out the blade in a reverse grip in the process. He’ll retaliate with a quick reverse slash, before getting a proper grip on the blade for two more quick slices, and then begin the normal combo attack.\n![Wukong Tiger 17.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a5/Wukong_Tiger_17.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The last hit he’ll try to throw you off by spinning in place before the swing, so don’t be fooled! While there’s a chance he’ll perform a flourish and sheathe his sword after this, it’s more likely he’ll try to fool you again before starting up a second combo, which comes in three quick slashes with no delay at the end.\nIf you try to retreat from the second combo, be warned that he can slice the bloody water to form waves of force as projectile slices with three hits, so you’ll need to keep dodging either way.\"\n        - Following Text: \"There’s also the chance he can start the sword combo while doing a spinning retreating jump, sneakily taking out the blade in a reverse grip in the process. He’ll retaliate with a quick reverse slash, before getting a proper grip on the blade for two more quick slices, and then begin the normal combo attack.\n![Wukong Tiger 17.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a5/Wukong_Tiger_17.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a fierce battle scene from *Black Myth: Wukong*, showcasing the \"Tiger Vanguard\" boss. The tiger-like creature is engaged in combat with the player character, surrounded by blood-red water. The preceding and following text describe the boss's attack patterns, including spinning moves, projectile slices, and reverse grip slashes, emphasizing the need for precise dodging and countering during the fight. The image visually complements the guide's explanation of the boss's challenging and dynamic combat mechanics."
}