{
    "chunk_id": 16436770806,
    "source_file": "Yarn.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/28/Yarn.jpg",
    "alt_text": "Yarn.jpg",
    "position_desc": 1,
    "img_above_text": "# Yarn\nYarn is one of the uncommon Crafting Materials in Black Myth: Wukong. It is primarily used to upgrade your Armor and Gear and unlock new sets as you make your way through the game. Compared to many of the other materials in the game, including Silk, which is also needed to upgrade your armor and gear, it is quite common.",
    "img_below_text": "Even still, below, on this page, we will go over the most common places to find Yarn throughout the game. In addition to Silk, the other main materials you will need to find while playing are some of the main boss materials which drop upon killing them. Most mandatory bosses and side bosses will drop one of these Crafting Materials which you can use to get new weapons alongside your new armor sets.\n## Black Myth: Wukong Yarn Locations",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"# Yarn\nYarn is one of the uncommon Crafting Materials in Black Myth: Wukong. It is primarily used to upgrade your Armor and Gear and unlock new sets as you make your way through the game. Compared to many of the other materials in the game, including Silk, which is also needed to upgrade your armor and gear, it is quite common.\"\n        - Following Text: \"Even still, below, on this page, we will go over the most common places to find Yarn throughout the game. In addition to Silk, the other main materials you will need to find while playing are some of the main boss materials which drop upon killing them. Most mandatory bosses and side bosses will drop one of these Crafting Materials which you can use to get new weapons alongside your new armor sets.\n## Black Myth: Wukong Yarn Locations\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image displays the inventory screen from *Black Myth: Wukong*, showcasing \"Yarn,\" an uncommon crafting material used to upgrade armor and gear. The description highlights its lore, mentioning that lesser guais spin yarns at night, and emphasizes its utility in crafting armor. This ties into the preceding and following text, which discusses Yarn's role as a key material for progression and its relative availability compared to other crafting items like Silk and boss drops."
}