{
    "chunk_id": 885206398396,
    "source_file": "Valley_of_Ecstasy_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/01/Wukong_Brook_32.jpg",
    "alt_text": "Wukong Brook 32.jpg",
    "position_desc": 73,
    "img_above_text": "Once you have finally defeated Non-Able, you'll be able to obtain the Non-Able Spirit, which has a pretty intense effect for raising your stats while lowering your mana.\nNon-Able",
    "img_below_text": "There's not much else to loot around the large stone pagoda where you fought Non-Able, so now is a good time to head back to the Forest of Felicity Shrine, and make your way through the canyon where the Frog Guai boss was to enter the next optional area.\n## Towers of Karma",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Once you have finally defeated Non-Able, you'll be able to obtain the Non-Able Spirit, which has a pretty intense effect for raising your stats while lowering your mana.\nNon-Able\"\n        - Following Text: \"There's not much else to loot around the large stone pagoda where you fought Non-Able, so now is a good time to head back to the Forest of Felicity Shrine, and make your way through the canyon where the Frog Guai boss was to enter the next optional area.\n## Towers of Karma\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a snowy canyon environment with a player character engaged in combat or exploration, wielding a glowing weapon and surrounded by visual effects. This scene likely follows the defeat of the Non-Able boss, as mentioned in the preceding text, and serves as a transition area before heading back to the Forest of Felicity Shrine or progressing toward the next optional area, the Towers of Karma. The HUD displays stats, abilities, and resources relevant to gameplay."
}