{
    "chunk_id": 988109116332,
    "source_file": "Black_Wind_King.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4d/Wukong_BlackWind_6.jpg",
    "alt_text": "Wukong BlackWind 6.jpg",
    "position_desc": 1,
    "img_above_text": "* **Rewards:** Cloud Step Spell, Yarn x3, 1049 Experience, 688 Will\n## Where to Find the Black Wind King",
    "img_below_text": "As a required boss, you won't be able to miss running into the Black Wind King. Once you reach the Black Wind Cave area, simply head through the tunnel, take out any Wolf Assassins that may appear, and keep to the right when you spot a Meditation Spot to continue through the darkened passages to reach the Cave Interior Shrine, where the King waits beyond the nearby doors.\n## Black Wind King Boss Fight and Guide",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"* **Rewards:** Cloud Step Spell, Yarn x3, 1049 Experience, 688 Will\n## Where to Find the Black Wind King\"\n        - Following Text: \"As a required boss, you won't be able to miss running into the Black Wind King. Once you reach the Black Wind Cave area, simply head through the tunnel, take out any Wolf Assassins that may appear, and keep to the right when you spot a Meditation Spot to continue through the darkened passages to reach the Cave Interior Shrine, where the King waits beyond the nearby doors.\n## Black Wind King Boss Fight and Guide\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts gameplay from a video game walkthrough, showing a player character navigating a lush, forested area while engaging an enemy. The interface displays health and ability icons, alongside a notification indicating the collection of \"Jade Lotus x2.\" This scene likely occurs during the journey to confront the Black Wind King, as described in the preceding and following text, where players progress through darkened passages and encounter enemies like Wolf Assassins en route to the boss fight."
}