{
    "chunk_id": 486620852710,
    "source_file": "Pagoda_Realm_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/86/Wukong_Pagoda_55.jpg",
    "alt_text": "Wukong Pagoda 55.jpg",
    "position_desc": 52,
    "img_above_text": "If you survive the fall, make sure to use the Incense Trail Talisman to quickly warp back to the Shrine instead of having to make the climb yet again.\nThere are a few strategies to try if you're having trouble here. Since trying to move while staff-spinning will just send you over the edge, you should instead try to use Cloud Step to evade their arrows and try to kill the archer on the platform quickly (he won't respawn) and then run from the Cyan Bat.",
    "img_below_text": "You can also try launching yourself to the archer in the window, by jumping and using a midair heavy attack to give yourself a boost over to the window... but do note that he's not alone.\n![Wukong Pagoda 56.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/60/Wukong_Pagoda_56.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"If you survive the fall, make sure to use the Incense Trail Talisman to quickly warp back to the Shrine instead of having to make the climb yet again.\nThere are a few strategies to try if you're having trouble here. Since trying to move while staff-spinning will just send you over the edge, you should instead try to use Cloud Step to evade their arrows and try to kill the archer on the platform quickly (he won't respawn) and then run from the Cyan Bat.\"\n        - Following Text: \"You can also try launching yourself to the archer in the window, by jumping and using a midair heavy attack to give yourself a boost over to the window... but do note that he's not alone.\n![Wukong Pagoda 56.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/60/Wukong_Pagoda_56.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a gameplay moment from *Black Myth: Wukong*, showing the player character mid-air near a ledge, seemingly attempting to reach an archer positioned in a window. The scene highlights a precarious platforming challenge, with a chained wooden bridge visible below and a treasure chest on a nearby platform. The preceding and following text suggests strategies for dealing with the archer and navigating this area, emphasizing evasion, combat tactics, and traversal techniques like using midair heavy attacks for movement boosts."
}