{
    "chunk_id": 764368624494,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f4/Wukong_Fright_2.jpg",
    "alt_text": "Wukong Fright 2.jpg",
    "position_desc": 3,
    "img_above_text": "![Wukong Fright 1.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/97/Wukong_Fright_1.jpg)\nAs you cross the bridge, you can harvest some Licorice on the other side, and look to the left to spot a large archway in the distance, with a whirling black tornado even further left in a canyon separating the Fright Cliffs from the Crouching Tiger Temple.",
    "img_below_text": "Heading toward the archway in the distance, you can find a green Wisp to absorb on the left side of the broken rock pathway, and on the right is a new type of enemy that will try to ambush you. This Pitstone is a mass of rock and skulls on legs, and will try to use its weight to jump down on you, and perform somersaults to use its momentum to slam into you. If they prove to be a problem to evade, consider using the Thrust Stance to charge up attacks from a distance and shatter them.\n![Wukong Fright 3.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/df/Wukong_Fright_3.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Fright 1.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/97/Wukong_Fright_1.jpg)\nAs you cross the bridge, you can harvest some Licorice on the other side, and look to the left to spot a large archway in the distance, with a whirling black tornado even further left in a canyon separating the Fright Cliffs from the Crouching Tiger Temple.\"\n        - Following Text: \"Heading toward the archway in the distance, you can find a green Wisp to absorb on the left side of the broken rock pathway, and on the right is a new type of enemy that will try to ambush you. This Pitstone is a mass of rock and skulls on legs, and will try to use its weight to jump down on you, and perform somersaults to use its momentum to slam into you. If they prove to be a problem to evade, consider using the Thrust Stance to charge up attacks from a distance and shatter them.\n![Wukong Fright 3.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/df/Wukong_Fright_3.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat scene from *Black Myth: Wukong*, where the player character is engaging a Pitstone enemy, a creature composed of rock and skulls. The Pitstone appears to be mid-attack, with debris flying from the impact of its movement. The player is wielding a staff and seems to be evading or countering the enemy's assault. The interface shows health bars, abilities, and controls, emphasizing the tactical nature of the encounter described in the guide."
}