{
    "chunk_id": 193678443046,
    "source_file": "Captain_Kalpa-Wave.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b8/Wukong_Longevity_24.jpg",
    "alt_text": "Wukong Longevity 24.jpg",
    "position_desc": 5,
    "img_above_text": "![Wukong Longevity 22.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/72/Wukong_Longevity_22.jpg)\nOther times he'll mix up his blood projectiles by also creating more blood, which include a stomp attack (or bending down to tilt the wings on its back) that generates a trail of blood heading in your direction. Dodge the blood trails, or they'll burst into a bloody lotus flowers that damage you as they erupt.",
    "img_below_text": "The real danger isn't the lotus itself, its what it leaves behind. Similar to that Frog Guai's ice attacks coating the area in frost, many of Kalpa-Wave's attacks (including stomps!) will leave behind large pools of blood. Stepping into any of these pools for a second will start to drain your health, so you'll need to steer clear of them at all costs!\n![Wukong Longevity 25.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/93/Wukong_Longevity_25.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Longevity 22.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/72/Wukong_Longevity_22.jpg)\nOther times he'll mix up his blood projectiles by also creating more blood, which include a stomp attack (or bending down to tilt the wings on its back) that generates a trail of blood heading in your direction. Dodge the blood trails, or they'll burst into a bloody lotus flowers that damage you as they erupt.\"\n        - Following Text: \"The real danger isn't the lotus itself, its what it leaves behind. Similar to that Frog Guai's ice attacks coating the area in frost, many of Kalpa-Wave's attacks (including stomps!) will leave behind large pools of blood. Stepping into any of these pools for a second will start to drain your health, so you'll need to steer clear of them at all costs!\n![Wukong Longevity 25.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/93/Wukong_Longevity_25.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight against \"Captain Kalpa-Wave\" in *Black Myth: Wukong*. The player character is shown facing the grotesque, blood-covered creature in a snowy, mountainous environment. The ground is stained with blood, which ties into the preceding and following text describing Kalpa-Wave's attacks that generate blood trails and pools, posing a hazard to the player. The image emphasizes the boss's intimidating presence and the dangerous battlefield mechanics."
}