{
    "chunk_id": 411995249895,
    "source_file": "Chapter_2_Secret_-_Kingdom_of_Sahali_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/43/Wukong_Sahali_27.jpg",
    "alt_text": "Wukong Sahali 27.jpg",
    "position_desc": 28,
    "img_above_text": "The yellow-furred rat is at an impasse, as the scarab’s magic is preventing him from engaging the monster directly. This is where you come on. The Yellow Rat Sage will agree to pound the drums to force the scarab to the surface, allowing you to engage the behemoth directly and find whatever vessel is giving it its power.\n## Yaoguai King Boss Fight - Fuban",
    "img_below_text": "Once you make your way down either of the slopes into the large sandy dunes where the giant Scarab Yaoguai called Fuban has emerged, you’ll be in for a battle against a juggernaut of a scarab beetle.\nDon’t let its imposing size scare you too much - this battle isn’t as hard as many others in Chapter 2 despite being a secret boss, as long as you know when and where to attack.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The yellow-furred rat is at an impasse, as the scarab’s magic is preventing him from engaging the monster directly. This is where you come on. The Yellow Rat Sage will agree to pound the drums to force the scarab to the surface, allowing you to engage the behemoth directly and find whatever vessel is giving it its power.\n## Yaoguai King Boss Fight - Fuban\"\n        - Following Text: \"Once you make your way down either of the slopes into the large sandy dunes where the giant Scarab Yaoguai called Fuban has emerged, you’ll be in for a battle against a juggernaut of a scarab beetle.\nDon’t let its imposing size scare you too much - this battle isn’t as hard as many others in Chapter 2 despite being a secret boss, as long as you know when and where to attack.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts Fuban, a giant scarab beetle, emerging from sandy dunes in a video game. This scene is part of the Yaoguai King Boss Fight, where players must battle this imposing creature. Despite its size, the fight is manageable if players know when and where to attack."
}