{
    "chunk_id": 648087617356,
    "source_file": "Field_of_Fire_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/64/Field_Fire_Walkthrough_%2842%29.png",
    "alt_text": "Field Fire Walkthrough \\(42\\).png",
    "position_desc": 31,
    "img_above_text": "![Field Fire Walkthrough \\(40\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/db/Field_Fire_Walkthrough_%2840%29.png)\nProceed past this, and look to the left to find a Tenner guarding a chest. Take the enemy down, open the chest to collect Fine Gold Thread and a Mind Core, and continue down the slope.",
    "img_below_text": "Go past the lone Searing-Fire rock and you'll reach the Cooling Slope Keeper's Shrine. Keep going forward past the Keeper's Shrine and look to the right. You'll see an icy archway, and a clear just before it. Head over here, past the Scorching-Fire rocks, and you'll come face to face with the final of the Five Element Carts.\n### Yaoguai Chief - Rusty-Gold Cart",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Field Fire Walkthrough \\(40\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/db/Field_Fire_Walkthrough_%2840%29.png)\nProceed past this, and look to the left to find a Tenner guarding a chest. Take the enemy down, open the chest to collect Fine Gold Thread and a Mind Core, and continue down the slope.\"\n        - Following Text: \"Go past the lone Searing-Fire rock and you'll reach the Cooling Slope Keeper's Shrine. Keep going forward past the Keeper's Shrine and look to the right. You'll see an icy archway, and a clear just before it. Head over here, past the Scorching-Fire rocks, and you'll come face to face with the final of the Five Element Carts.\n### Yaoguai Chief - Rusty-Gold Cart\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a rocky, dark terrain with a clear path marked by red arrows leading toward a distant shrine-like structure. The setting appears to be part of a volcanic or fiery environment, as suggested by the glowing red areas in the background. This scene likely serves as a visual guide for navigating the area described in the walkthrough, where players are instructed to proceed past enemies and landmarks to progress toward the next objective."
}