{
    "chunk_id": 545908058621,
    "source_file": "Macaque_Chief.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ed/Wukong_Thunderclap_87.jpg",
    "alt_text": "Wukong Thunderclap 87.jpg",
    "position_desc": 11,
    "img_above_text": "Macaque Chief (Warding Temple)\n### Final Encounter - Mahavira Hall",
    "img_below_text": "For this last bout with the Macaque Chief, your friend Zhu Bajie will be here to help, but will warn you that the sack's magic draws out evil to empower this foe beyond his normal limits.\nEven though you'll have the help of a friend, don't expect this to be an easy fight, as the Macaque Chief hits harder than ever with his evil sword. On the plus side, your health, mana, and gourd will be fully replenished after the Yellowbrow fight, and if you are defeated here, you can re-enter the temple to skip the first fight and pick up where you left off.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Macaque Chief (Warding Temple)\n### Final Encounter - Mahavira Hall\"\n        - Following Text: \"For this last bout with the Macaque Chief, your friend Zhu Bajie will be here to help, but will warn you that the sack's magic draws out evil to empower this foe beyond his normal limits.\nEven though you'll have the help of a friend, don't expect this to be an easy fight, as the Macaque Chief hits harder than ever with his evil sword. On the plus side, your health, mana, and gourd will be fully replenished after the Yellowbrow fight, and if you are defeated here, you can re-enter the temple to skip the first fight and pick up where you left off.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the final encounter with the Macaque Chief in Mahavira Hall, where the protagonist is joined by Zhu Bajie to fight the empowered foe. The scene is set in a red-hued environment, emphasizing the intensity of the battle. The text \"Join me, let's fight our way out!\" suggests cooperation and determination in facing the challenging enemy."
}