{
    "chunk_id": 164004743213,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/19/Wukong_Wolves_49.jpg",
    "alt_text": "Wukong Wolves 49.jpg",
    "position_desc": 57,
    "img_above_text": "![Wukong Wolves 48.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bf/Wukong_Wolves_48.jpg)\nSometimes, Lingxuzi can dive at you face first, moving his open jaws up before biting down. You need only dodge his face, meaning you can dodge right into his arms and keep attacking.",
    "img_below_text": "His most threatening attack comes when he disengages from the fight and jump to a nearby rooftop. He’ll jump around a bit, and then leap high into the air to bellyflop onto you, causing a large shockwave that you’ll need to time well and dodge or take a ton of damage.\nHe also has an uppercut grab he can sometimes employ after a dashing strike that’s hard to see coming, which can launch you into the air for a multi-hit attack that can deal a scary amount of damage. This move comes when he’s hunched over and growls, but he won’t raise his claw until it’s too late to dodge!",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Wolves 48.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bf/Wukong_Wolves_48.jpg)\nSometimes, Lingxuzi can dive at you face first, moving his open jaws up before biting down. You need only dodge his face, meaning you can dodge right into his arms and keep attacking.\"\n        - Following Text: \"His most threatening attack comes when he disengages from the fight and jump to a nearby rooftop. He’ll jump around a bit, and then leap high into the air to bellyflop onto you, causing a large shockwave that you’ll need to time well and dodge or take a ton of damage.\nHe also has an uppercut grab he can sometimes employ after a dashing strike that’s hard to see coming, which can launch you into the air for a multi-hit attack that can deal a scary amount of damage. This move comes when he’s hunched over and growls, but he won’t raise his claw until it’s too late to dodge!\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dramatic moment from the video game *Black Myth: Wukong*, featuring the boss Lingxuzi mid-air during an attack. Lingxuzi, a large, menacing creature with glowing red eyes, is leaping toward the player character, creating a tense and action-packed scene. The preceding and following text describe Lingxuzi's attack patterns, including diving face-first and performing a rooftop bellyflop, emphasizing the player's need to dodge effectively to avoid significant damage. The image visually complements the guide's explanation of Lingxuzi's combat behavior."
}