{
    "chunk_id": 347326465233,
    "source_file": "Pagoda_Realm_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/24/Wukong_Pagoda_32.jpg",
    "alt_text": "Wukong Pagoda 32.jpg",
    "position_desc": 33,
    "img_above_text": "### Yaoguai Chief Mini-Boss Fight - Captain Lotus-Vision\nOne of four Captains of the Pagoda Realm, Captain Lotus-Vision is responsible for sealing many of the prison cells, and must be defeated before you can unlock them. He is a strange Yaoguai Chief, and doesn't really have any melee attacks to speak of, instead opting for a series of projectiles and lasers to attack you with. With that in mind, it's highly recommended that you equip the Cloud Step Spell over Rock Solid for help evading some of his attacks.",
    "img_below_text": "You'll find find Captain Lotus-Vision in front of a large group of kneeling corpses, which he can randomly imbue with magic to create a Withered Corpse that will come to life and attack you. These are nothing more than a distraction, but should still be dealt with immediately so they don't hamstring you later.\nLuckily, he'll get rid of all the corpses later in the fight, and they won't respawn for future attempts.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"### Yaoguai Chief Mini-Boss Fight - Captain Lotus-Vision\nOne of four Captains of the Pagoda Realm, Captain Lotus-Vision is responsible for sealing many of the prison cells, and must be defeated before you can unlock them. He is a strange Yaoguai Chief, and doesn't really have any melee attacks to speak of, instead opting for a series of projectiles and lasers to attack you with. With that in mind, it's highly recommended that you equip the Cloud Step Spell over Rock Solid for help evading some of his attacks.\"\n        - Following Text: \"You'll find find Captain Lotus-Vision in front of a large group of kneeling corpses, which he can randomly imbue with magic to create a Withered Corpse that will come to life and attack you. These are nothing more than a distraction, but should still be dealt with immediately so they don't hamstring you later.\nLuckily, he'll get rid of all the corpses later in the fight, and they won't respawn for future attempts.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight against Captain Lotus-Vision, a mini-boss in the Pagoda Realm. The scene shows the player character engaging the floating Captain Lotus-Vision, who is surrounded by kneeling corpses and uses magic-based attacks. The environment features dark, ominous surroundings with intricate statues in the background. The player interface displays health, abilities, and other combat-related elements, emphasizing the strategic nature of the encounter."
}