{
    "chunk_id": 809029719077,
    "source_file": "Chapter_4_Secret_-_Purple_Cloud_Mountain_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/84/Wukong_PurpleCloud_13.jpg",
    "alt_text": "Wukong PurpleCloud 13.jpg",
    "position_desc": 17,
    "img_above_text": "Though he's not the final boss of Purple Cloud Mountain, the Scorpionlord is as tough as they come, owing to the massive amount of damage he can perform with either his giant claw or venomous tail. You'll need a a lot of armor to withstand his hits, and plenty of poison defense to boot, which means using the Gall Soak, and poison-resistant curios to help you out.\nIf you recall your fights with the three Scorpion Princes in the Webbed Hollow, you may find more than a few of the Scorpionlord's attacks familiar, but don't be lulled into thinking you have him figured out: all of his moves strike faster, hit harder, and will evolve into longer combos as the fight drags on. Much of this fight will be learning his basic combos early, but being ready to adapt when he tricks you with extended attacks when you may otherwise think you have an opening.",
    "img_below_text": "While your initial fight will start with him crouching down before launching a very long piercing tail strike, all subsequent attempts will begin with him whirling away from you, only to leap toward you fairly fast.\nJust like the Scorpion Prince, he'll slash at you with his claw while still airborne in front of you, but quickly follow up with a tailswipe to quickly spin about, letting him slam down with his claw for a third hit. As you can see, he'll be very tricky in alternating between his claw and tail, and you'll only have a second to see either appendage glow to know where his attack is coming from and react.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Though he's not the final boss of Purple Cloud Mountain, the Scorpionlord is as tough as they come, owing to the massive amount of damage he can perform with either his giant claw or venomous tail. You'll need a a lot of armor to withstand his hits, and plenty of poison defense to boot, which means using the Gall Soak, and poison-resistant curios to help you out.\nIf you recall your fights with the three Scorpion Princes in the Webbed Hollow, you may find more than a few of the Scorpionlord's attacks familiar, but don't be lulled into thinking you have him figured out: all of his moves strike faster, hit harder, and will evolve into longer combos as the fight drags on. Much of this fight will be learning his basic combos early, but being ready to adapt when he tricks you with extended attacks when you may otherwise think you have an opening.\"\n        - Following Text: \"While your initial fight will start with him crouching down before launching a very long piercing tail strike, all subsequent attempts will begin with him whirling away from you, only to leap toward you fairly fast.\nJust like the Scorpion Prince, he'll slash at you with his claw while still airborne in front of you, but quickly follow up with a tailswipe to quickly spin about, letting him slam down with his claw for a third hit. As you can see, he'll be very tricky in alternating between his claw and tail, and you'll only have a second to see either appendage glow to know where his attack is coming from and react.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a gameplay moment from a video game, showcasing a battle against the Scorpionlord, a challenging boss in the Purple Cloud Mountain area. The player character is engaged in combat with the Scorpionlord, who is a large, menacing creature with a venomous tail and giant claw. The interface displays various consumables and abilities, such as poison-resistant items like Antimiasma Powder and Enhanced Tiger Subduing Pellets, which are crucial for surviving the boss's powerful poison attacks. The text at the bottom of the screen indicates dialogue from the Scorpionlord, adding narrative depth to the encounter. This scene emphasizes preparation, adaptability, and strategic use of defensive tools to counter the boss's fast, evolving attack patterns."
}