{
    "chunk_id": 485575564382,
    "source_file": "Blade_Monk_Spirit.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/eb/Blade_Monk_Power.png",
    "alt_text": "Blade Monk Power.png",
    "position_desc": 3,
    "img_above_text": "The Blade Monk fights like all other enemies of his kind with a massive sword. This sword hits hard, but the plus side is that it appears to be extremely heavy. Dodge each hit of the Blade Monk's combo and take the opportunity to land your own while he's recovering and gearing up for the next one.\n## Blade Monk Spirit",
    "img_below_text": "* **Slaughter**\n* Equipped Effect: Moderately increases Attack for a short duration after defeating an enemy.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Blade Monk fights like all other enemies of his kind with a massive sword. This sword hits hard, but the plus side is that it appears to be extremely heavy. Dodge each hit of the Blade Monk's combo and take the opportunity to land your own while he's recovering and gearing up for the next one.\n## Blade Monk Spirit\"\n        - Following Text: \"* **Slaughter**\n* Equipped Effect: Moderately increases Attack for a short duration after defeating an enemy.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "1. **Summary**: The image showcases the \"Blade Monk Spirit\" in the game's equipment menu. This rare spirit allows the player to take the form of the Blade Monk, performing a powerful two-swing attack followed by a downward cleave. Its equipped effect moderately boosts attack for a short duration after defeating an enemy. Players can equip the spirit, view its demo, and use it in combat by pressing the designated key.\n\n2. **Purpose**: The image highlights the Blade Monk Spirit's abilities and effects, serving as a guide for players to understand its combat role and strategic value in the game."
}