{
    "chunk_id": 556607489468,
    "source_file": "How_to_Unlock_the_Secret_Loong_Dragon_Bosses.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/ce/How_To_Find_Yellow_Loong_%281%29.png",
    "alt_text": "How To Find Yellow Loong \\(1\\).png",
    "position_desc": 15,
    "img_above_text": "After this fight, the hand will become a bridge that you can use to get down to the lower levels. Go across the hand and the insect body attached to it, then drop down from the wooden path.\nFollow the path around to the right and continue following it as it loops. You'll come to a point where you see a wooden path going off to the left, with a bridge, or the path continues to the right.",
    "img_below_text": "Drop down to the left and head toward the bridge, crossing it to get to the other side. Go up the stairs and through the corridor filled with webs. Up ahead, you'll see a light and cocoons hanging from the ceiling.\n![How To Find Yellow Loong .png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/37/How_To_Find_Yellow_Loong_.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"After this fight, the hand will become a bridge that you can use to get down to the lower levels. Go across the hand and the insect body attached to it, then drop down from the wooden path.\nFollow the path around to the right and continue following it as it loops. You'll come to a point where you see a wooden path going off to the left, with a bridge, or the path continues to the right.\"\n        - Following Text: \"Drop down to the left and head toward the bridge, crossing it to get to the other side. Go up the stairs and through the corridor filled with webs. Up ahead, you'll see a light and cocoons hanging from the ceiling.\n![How To Find Yellow Loong .png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/37/How_To_Find_Yellow_Loong_.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dark, cavernous environment with a wooden bridge leading deeper into the area. Red arrows highlight two potential paths: one leading across the bridge and another veering to the left. A character clad in ornate armor and wielding a staff stands in the foreground, suggesting exploration or preparation for combat. The preceding and following text indicates this scene is part of a guided path in the game, where players navigate through bridges, wooden paths, and corridors filled with webs to progress toward a specific objective."
}