{
    "chunk_id": 205938288681,
    "source_file": "Valley_of_Ecstasy_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a2/Wukong_Longevity_15.jpg",
    "alt_text": "Wukong Longevity 15.jpg",
    "position_desc": 111,
    "img_above_text": "![Wukong Longevity 14.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a3/Wukong_Longevity_14.jpg)\nIf you want something to pair with that worm, keep moving along the lower path as it goes up some stairs, and you'll eventually reach the end of this loop, where a small tree stands at the end of a large field with a Luojia Fragrant Vine. However, you'll need to defeat not one but two Falcon Fan-Makers to claim it!",
    "img_below_text": "Defeating the pair is no easy attacks when you consider their hit-and-run tactics, so you may need to even the odds with A Pluck of Many Spell, or use a combination of Cloud Step and Immobilize to isolate and focus fire one of the Falcons, and then take out the second.\nLongevity Road Luojia Fragrant Vine",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Longevity 14.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a3/Wukong_Longevity_14.jpg)\nIf you want something to pair with that worm, keep moving along the lower path as it goes up some stairs, and you'll eventually reach the end of this loop, where a small tree stands at the end of a large field with a Luojia Fragrant Vine. However, you'll need to defeat not one but two Falcon Fan-Makers to claim it!\"\n        - Following Text: \"Defeating the pair is no easy attacks when you consider their hit-and-run tactics, so you may need to even the odds with A Pluck of Many Spell, or use a combination of Cloud Step and Immobilize to isolate and focus fire one of the Falcons, and then take out the second.\nLongevity Road Luojia Fragrant Vine\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat scene from the video game \"Black Myth: Wukong,\" where the player character is engaged in battle with two Falcon Fan-Makers. This encounter is crucial for obtaining the Luojia Fragrant Vine located at the end of a path. The text suggests using strategic spells and maneuvers, like A Pluck of Many Spell and Cloud Step, to overcome the enemies' hit-and-run tactics."
}