{
    "chunk_id": 821933948134,
    "source_file": "Captain_Lotus-Vision.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/32/Wukong_Pagoda_33.jpg",
    "alt_text": "Wukong Pagoda 33.jpg",
    "position_desc": 5,
    "img_above_text": "For each of these attacks, be ready with your Staff-Spin counter, and consider investing in skills to keep this move going and to attack out of it once you've deflected all the projectiles heading your way. A lot of this fight will come down to finding the right opportunities to strike after surviving his attacks, and you'll need all the boosts you can get.\nOther times, he may trigger a bunch of explosions on the floor, which only give you a moment's notice to dodge them, so stay mobile and roll around for a better chance of not getting hit.",
    "img_below_text": "Things will get more difficult any time you see the crystal on his staff flare brighter. These brief flashes indicate a laser beam blast that you'll only have a moment to dodge or take considerable damage, and you'll have to deal with even more as time goes on. Early on, watch for a laser to shoot out as he creates projectiles rings before you start spinning your staff.\n![Wukong Pagoda 36.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5a/Wukong_Pagoda_36.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"For each of these attacks, be ready with your Staff-Spin counter, and consider investing in skills to keep this move going and to attack out of it once you've deflected all the projectiles heading your way. A lot of this fight will come down to finding the right opportunities to strike after surviving his attacks, and you'll need all the boosts you can get.\nOther times, he may trigger a bunch of explosions on the floor, which only give you a moment's notice to dodge them, so stay mobile and roll around for a better chance of not getting hit.\"\n        - Following Text: \"Things will get more difficult any time you see the crystal on his staff flare brighter. These brief flashes indicate a laser beam blast that you'll only have a moment to dodge or take considerable damage, and you'll have to deal with even more as time goes on. Early on, watch for a laser to shoot out as he creates projectiles rings before you start spinning your staff.\n![Wukong Pagoda 36.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5a/Wukong_Pagoda_36.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game \"Black Myth: Wukong,\" showing a character engaged in a battle against an enemy named \"Captain Lotus-Vision.\" The enemy is preparing a powerful attack, indicated by a glowing purple projectile, which aligns with the preceding and following text describing the need to dodge laser beam blasts and projectiles. The player character is poised to counter with a staff, emphasizing the strategic combat elements mentioned in the text."
}