{
    "chunk_id": 741165071932,
    "source_file": "Mad_Tiger_Spirit.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/50/Mad_Tiger_Spirit.jpg",
    "alt_text": "Mad Tiger Spirit.jpg",
    "position_desc": 8,
    "img_above_text": "Stock up on all medicines before heading into the fight to boost your stats, and don't hold back on your spells because the Mad Tiger certainly isn't going to hold back on you!\n## Mad Tiger Spirit",
    "img_below_text": "* **Boulder Smash**\n* Equipped Effect: Moderately increases Attack, but massively reduces Maximum Health.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Stock up on all medicines before heading into the fight to boost your stats, and don't hold back on your spells because the Mad Tiger certainly isn't going to hold back on you!\n## Mad Tiger Spirit\"\n        - Following Text: \"* **Boulder Smash**\n* Equipped Effect: Moderately increases Attack, but massively reduces Maximum Health.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "1. **Summary**: The image showcases the \"Mad Tiger Spirit\" in the Equipment menu of a video game. This spirit features the ability \"Boulder Smash,\" which transforms the player into the Mad Tiger to deal area damage and shock enemies. It has a high Qi cost and provides an equipped effect that moderately boosts Attack but significantly reduces Maximum Health. The player's stats, including Health, Mana, and Attack, are displayed alongside resistance values.\n\n2. **Purpose/Narrative Role**: The Mad Tiger Spirit is a powerful combat tool designed for high-risk, high-reward gameplay, emphasizing offensive capabilities at the expense of survivability. It is recommended for a challenging fight, as noted in the preceding text."
}