{
    "chunk_id": 461458494057,
    "source_file": "Sandgate_Village_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4a/Wukong_Sandgate_1.jpg",
    "alt_text": "Wukong Sandgate 1.jpg",
    "position_desc": 1,
    "img_above_text": "* **Valley of Despair**\n* Yaoguai Chief - First Prince of Flowing Sands",
    "img_below_text": "In Black Myth Wukong’s second chapter, you’ll leave behind the forests of Black Wind Mountain for the dry sands of the Yellow Wind Ridge. An energetic (yet headless) man playing a Chinese lute (known as a sanxian) will set the stage for this realm, and helpfully revive our Destined One from becoming a pincushion full of arrows.\n## Yellow Wind Ridge",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"* **Valley of Despair**\n* Yaoguai Chief - First Prince of Flowing Sands\"\n        - Following Text: \"In Black Myth Wukong’s second chapter, you’ll leave behind the forests of Black Wind Mountain for the dry sands of the Yellow Wind Ridge. An energetic (yet headless) man playing a Chinese lute (known as a sanxian) will set the stage for this realm, and helpfully revive our Destined One from becoming a pincushion full of arrows.\n## Yellow Wind Ridge\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game \"Black Myth Wukong,\" specifically from the second chapter set in Yellow Wind Ridge. It shows a headless man playing a Chinese lute (sanxian) in a desolate, dry landscape. In the foreground, a character, likely the protagonist referred to as the Destined One, is seen lying on the ground, pierced with multiple arrows. This scene appears to illustrate the moment when the headless man revives the protagonist, setting the stage for the events in this new realm."
}