{
    "chunk_id": 333750325068,
    "source_file": "Copper_Pill.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/25/Copper_Pill_1.jpg",
    "alt_text": "Copper Pill 1.jpg",
    "position_desc": 2,
    "img_above_text": "## Black Myth: Wukong Copper Pill Location\nThe Copper Pill Soak can be found by a statue on the hill after the Tiger Vanguard fight at Crouching Tiger Temple \\- Temple Entrance in Yellow Wind Ridge. Simply follow the hill and inside a small box on the Shrine, you can find the Soak.",
    "img_below_text": "This location is along the main story path through this chapter, so the chances of you missing it, unlike some of the other secrets in the game, are incredibly low.\nSoaks are far more plentiful than the Drinks for your Gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Black Myth: Wukong Copper Pill Location\nThe Copper Pill Soak can be found by a statue on the hill after the Tiger Vanguard fight at Crouching Tiger Temple \\- Temple Entrance in Yellow Wind Ridge. Simply follow the hill and inside a small box on the Shrine, you can find the Soak.\"\n        - Following Text: \"This location is along the main story path through this chapter, so the chances of you missing it, unlike some of the other secrets in the game, are incredibly low.\nSoaks are far more plentiful than the Drinks for your Gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from *Black Myth: Wukong* where the player character stands near a shrine-like area, with a statue carved into the rocky hill in the background. This location is identified as the spot to find the Copper Pill Soak, which is inside a small box on the shrine. The setting aligns with the guide's description of the Crouching Tiger Temple entrance in Yellow Wind Ridge, following the Tiger Vanguard fight."
}