{
    "chunk_id": 376192207343,
    "source_file": "Yaksha_King.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/30/Field_Fire_Walkthrough_%2856%29.png",
    "alt_text": "Field Fire Walkthrough \\(56\\).png",
    "position_desc": 1,
    "img_above_text": "This fight will begin immediately after finishing the fight against Red Boy.\n## Yaksha King Boss Fight and Guide",
    "img_below_text": "The Yaksha King will draw two blades from his elbows, which will be angled behind him for the fight. These will glow brightly, and he'll use them traditionally as blades, but also be able to throw our circular projectiles from them.\n![Field Fire Walkthrough \\(57\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bf/Field_Fire_Walkthrough_%2857%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"This fight will begin immediately after finishing the fight against Red Boy.\n## Yaksha King Boss Fight and Guide\"\n        - Following Text: \"The Yaksha King will draw two blades from his elbows, which will be angled behind him for the fight. These will glow brightly, and he'll use them traditionally as blades, but also be able to throw our circular projectiles from them.\n![Field Fire Walkthrough \\(57\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bf/Field_Fire_Walkthrough_%2857%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the Yaksha King, a boss character in the video game, showcasing its menacing and grotesque appearance. The creature has a demonic form with red, textured skin, elongated horns, and a skeletal face, emphasizing its intimidating presence. This visual accompanies the walkthrough section detailing the Yaksha King boss fight, highlighting its introduction and setting the tone for the upcoming battle."
}