{
    "chunk_id": 795994493818,
    "source_file": "Crouching_Tiger_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/05/Wukong_Tiger_8.jpg",
    "alt_text": "Wukong Tiger 8.jpg",
    "position_desc": 14,
    "img_above_text": "![Wukong Tiger 9.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/33/Wukong_Tiger_9.jpg)\nThe first instance is the easiest to spot, as he’ll assume a new stance putting two fingers in front of his face while his other hand rests on the handle of his sword. After a shout, he’ll unleash a single slashing attack that hits hard enough to launch its own projectile slash. Caught unaware, and it’ll easily take off more than half your health bar! It’s also the easiest one to punish, as he’ll usually take the time to put the blade back before starting his next attack, giving you a lot of time to strike back.",
    "img_below_text": "The other attack can come extremely quickly and unfortunately has a few variants. The most common one starts as the Tiger Vanguard approaches with a spin ending in a downward kick. As soon as he finishes his kick, he’ll seamlessly unsheathe his sword as he performs a downward swing to catch you off guard. This will be followed by a quick upward slash in the same direction, and then a large arcing spinning slash finale.\n![Wukong Tiger 16.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/79/Wukong_Tiger_16.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Tiger 9.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/33/Wukong_Tiger_9.jpg)\nThe first instance is the easiest to spot, as he’ll assume a new stance putting two fingers in front of his face while his other hand rests on the handle of his sword. After a shout, he’ll unleash a single slashing attack that hits hard enough to launch its own projectile slash. Caught unaware, and it’ll easily take off more than half your health bar! It’s also the easiest one to punish, as he’ll usually take the time to put the blade back before starting his next attack, giving you a lot of time to strike back.\"\n        - Following Text: \"The other attack can come extremely quickly and unfortunately has a few variants. The most common one starts as the Tiger Vanguard approaches with a spin ending in a downward kick. As soon as he finishes his kick, he’ll seamlessly unsheathe his sword as he performs a downward swing to catch you off guard. This will be followed by a quick upward slash in the same direction, and then a large arcing spinning slash finale.\n![Wukong Tiger 16.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/79/Wukong_Tiger_16.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dynamic combat scene from *Black Myth: Wukong*, showcasing the player battling the \"Tiger Vanguard\" boss. The environment is intense and chaotic, with vivid red and orange hues suggesting a high-energy attack or ability in progress. The boss, a large tiger-like figure, dominates the frame, while the player character is seen engaging in the fight. The HUD elements, including health bars and abilities, indicate an ongoing boss fight, aligning with the guide's description of the Tiger Vanguard's powerful and punishing attack patterns."
}