{
    "chunk_id": 333990196473,
    "source_file": "Puppet_Tick_Spirit.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/05/Puppet_Tick_SPirit.png",
    "alt_text": "Puppet Tick SPirit.png",
    "position_desc": 3,
    "img_above_text": "The Puppet Tick fights with its staff like all other enemies of its type. There are a few other enemies to contend with at the same time, so cast Immobilize or A Pluck of Many to help deal with the others so you can focus on the Puppet Tick.\n## Puppet Tick Spirit",
    "img_below_text": "* **Bursting Spiders**\n* Equipped Effect: Considerably reduces the Mana cost for A Pluck of Many.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Puppet Tick fights with its staff like all other enemies of its type. There are a few other enemies to contend with at the same time, so cast Immobilize or A Pluck of Many to help deal with the others so you can focus on the Puppet Tick.\n## Puppet Tick Spirit\"\n        - Following Text: \"* **Bursting Spiders**\n* Equipped Effect: Considerably reduces the Mana cost for A Pluck of Many.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "1. The image displays the \"Puppet Tick\" Spirit in the Equipment menu of a video game. It is a Rare Spirit with the ability \"Bursting Spiders,\" which summons venomous Stone Spiders to attack foes and poison nearby enemies upon their destruction. The equipped effect reduces the Mana cost for the ability \"A Pluck of Many.\" A demo of the Spirit's ability is shown in the inset.  \n\n2. The image serves to explain the Puppet Tick Spirit's abilities and effects, complementing the preceding text's combat strategy and the following text's focus on its Mana efficiency."
}