{
    "chunk_id": 630518920038,
    "source_file": "Bishui_Golden-Eyed_Beast.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/44/Bishui_Cave_Walkthrough_%2833%29.png",
    "alt_text": "Bishui Cave Walkthrough \\(33\\).png",
    "position_desc": 6,
    "img_above_text": "One move to watch out for that has a wider area of attack is when it scraps its fist along the floor and flings an arc of fire toward you. These will stay on the ground for a while, and the beast can create multiple of them at once. This is when you'll want to have the Body-Cooling Powder and Fireproof Mantle on hand, as it becomes harder to dodge these the more they build up.\nBesides this, it will also charge at you leaving a trail of fire behind it. When it's charging, it's best to dodge the attacks and aim to build up Focus. The heavier you can attack, the better, because you'll want to stun the beast as often as possible.",
    "img_below_text": "When you enter the arena, on the other side, you'll see another frozen-over archway. You can actually bait the beast to break this down and escape inside of it. While he's still trying to attack you, you can use Thrust Stance to get him.\n![Bishui Cave Walkthrough \\(41\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/ab/Bishui_Cave_Walkthrough_%2841%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"One move to watch out for that has a wider area of attack is when it scraps its fist along the floor and flings an arc of fire toward you. These will stay on the ground for a while, and the beast can create multiple of them at once. This is when you'll want to have the Body-Cooling Powder and Fireproof Mantle on hand, as it becomes harder to dodge these the more they build up.\nBesides this, it will also charge at you leaving a trail of fire behind it. When it's charging, it's best to dodge the attacks and aim to build up Focus. The heavier you can attack, the better, because you'll want to stun the beast as often as possible.\"\n        - Following Text: \"When you enter the arena, on the other side, you'll see another frozen-over archway. You can actually bait the beast to break this down and escape inside of it. While he's still trying to attack you, you can use Thrust Stance to get him.\n![Bishui Cave Walkthrough \\(41\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/ab/Bishui_Cave_Walkthrough_%2841%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game \"Black Myth: Wukong,\" showing a player character standing near a fiery, lava-covered area and a frozen archway in the distance. The red arrow points toward the frozen archway, suggesting it can be broken by baiting the beast mentioned in the preceding and following text. This action allows the player to escape into the area beyond the archway while continuing the fight. The image serves to visually guide players on how to progress during this specific encounter."
}