{
    "chunk_id": 743678848621,
    "source_file": "Yellow_Sand_Formation_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0a/Wukong_Yellow_68.jpg",
    "alt_text": "Wukong Yellow 68.jpg",
    "position_desc": 74,
    "img_above_text": "![Wukong Yellow 66.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ef/Wukong_Yellow_66.jpg)\nHe can now also perform huge retreating slashes, jumping over you and slashing downward as he flees to the other side of the arena. Don’t bother trying to parry the move or Immobilize him since you won’t be able to retaliate, and be ready for him to come back with a spinning air slash.",
    "img_below_text": "He can also create a glow in his hand before throwing it into the ground. He’ll then stab the spot with his spear, and cause a giant tremor all around him when he rips the spear out. The time it takes for this move is a bit lengthy, so if you’re feeling gutsy you can try to interrupt him with a big charged hit or Spirit Attack, Immobilize him, or even use the Pillar Stance charge attack to rise above the tremor and smack him after evading it.\n![Wukong Yellow 69.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b5/Wukong_Yellow_69.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Yellow 66.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ef/Wukong_Yellow_66.jpg)\nHe can now also perform huge retreating slashes, jumping over you and slashing downward as he flees to the other side of the arena. Don’t bother trying to parry the move or Immobilize him since you won’t be able to retaliate, and be ready for him to come back with a spinning air slash.\"\n        - Following Text: \"He can also create a glow in his hand before throwing it into the ground. He’ll then stab the spot with his spear, and cause a giant tremor all around him when he rips the spear out. The time it takes for this move is a bit lengthy, so if you’re feeling gutsy you can try to interrupt him with a big charged hit or Spirit Attack, Immobilize him, or even use the Pillar Stance charge attack to rise above the tremor and smack him after evading it.\n![Wukong Yellow 69.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b5/Wukong_Yellow_69.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an intense moment from a boss fight in *Black Myth: Wukong* against the \"Yellow Wind Sage.\" The boss is shown performing a powerful attack, likely the described retreating slash or a tremor-causing spear move. The dynamic action highlights the boss's agility and strength, with the player character evading or preparing to counter. The HUD elements indicate the player's health, abilities, and the boss's health bar, emphasizing the high-stakes nature of the encounter."
}