{
    "chunk_id": 974533930756,
    "source_file": "Non-White.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/00/Wukong_MindCliff_2.jpg",
    "alt_text": "Wukong MindCliff 2.jpg",
    "position_desc": 1,
    "img_above_text": "Non-White will attempt to ambush you early into your exploration for the entrance to the Valley of Ecstasy after you climb up from the Bitter Lake in The New West. Upon reaching the Mindfullness Cliff, you'll encounter him at the top platform in an outdoor area circling a large pit.\n### Non-White Miniboss Fight and Guide",
    "img_below_text": "Non-White is a peculiar foe who attacks in haphazard fashion with his large thin blade. The most important thing to note is the smaller bar above his health bar: Non-White can use his blade to repeatedly block and parry your attacks, which can at times effectively give him a second health bar. Finding the right times to strike can be useful in circumventing his defenses, but you'll want to be wary of his frost and poison attacks. Stock up on both Antimiasma and Body-Warming medicine to deal with both scenarios should they arise.\n![Wukong MindCliff 3.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/38/Wukong_MindCliff_3.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Non-White will attempt to ambush you early into your exploration for the entrance to the Valley of Ecstasy after you climb up from the Bitter Lake in The New West. Upon reaching the Mindfullness Cliff, you'll encounter him at the top platform in an outdoor area circling a large pit.\n### Non-White Miniboss Fight and Guide\"\n        - Following Text: \"Non-White is a peculiar foe who attacks in haphazard fashion with his large thin blade. The most important thing to note is the smaller bar above his health bar: Non-White can use his blade to repeatedly block and parry your attacks, which can at times effectively give him a second health bar. Finding the right times to strike can be useful in circumventing his defenses, but you'll want to be wary of his frost and poison attacks. Stock up on both Antimiasma and Body-Warming medicine to deal with both scenarios should they arise.\n![Wukong MindCliff 3.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/38/Wukong_MindCliff_3.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the miniboss \"Non-White\" from *Black Myth: Wukong*, encountered at the Mindfulness Cliff after climbing up from the Bitter Lake in The New West. The character is shown in a rocky outdoor setting, wielding a large thin blade and adorned with intricate armor and accessories. This miniboss is described as attacking unpredictably and utilizing parries and blocks that can act as a secondary health bar. Players are advised to prepare for frost and poison attacks by stocking up on Antimiasma and Body-Warming medicine."
}