{
    "chunk_id": 445043202164,
    "source_file": "Guangzhi.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c8/Wukong_Wolves_34.jpg",
    "alt_text": "Wukong Wolves 34.jpg",
    "position_desc": 3,
    "img_above_text": "### Guangzhi Mini-Boss Fight and Guide\nThis Yaoguai Chief is a lot more intimidating than the Bullguard, but thankfully much more approachable than the Wandering Wight nearby, even with his fearsome looking fiery twinblade. Remember that you can purchase some Cooling Powder should you find yourself being lit on fire too much, as well as Evil Repelling Medicant to boost your damage absorption.",
    "img_below_text": "The flashing of his fiery weapon may seem impossible to dodge, but the key to this fight is understanding exactly when his attacks actually land so that you can dodge around them. Guangzhi usually starts by charging forth for a combo attack, but each attack will cause him to jump into the air with a flourish before actually attacking with downward swings. Wait to dodge all three swing attacks and then hit him with some of your own while he tries to recover.\n![Wukong Wolves 35.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1f/Wukong_Wolves_35.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"### Guangzhi Mini-Boss Fight and Guide\nThis Yaoguai Chief is a lot more intimidating than the Bullguard, but thankfully much more approachable than the Wandering Wight nearby, even with his fearsome looking fiery twinblade. Remember that you can purchase some Cooling Powder should you find yourself being lit on fire too much, as well as Evil Repelling Medicant to boost your damage absorption.\"\n        - Following Text: \"The flashing of his fiery weapon may seem impossible to dodge, but the key to this fight is understanding exactly when his attacks actually land so that you can dodge around them. Guangzhi usually starts by charging forth for a combo attack, but each attack will cause him to jump into the air with a flourish before actually attacking with downward swings. Wait to dodge all three swing attacks and then hit him with some of your own while he tries to recover.\n![Wukong Wolves 35.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1f/Wukong_Wolves_35.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the Guangzhi mini-boss fight from *Black Myth: Wukong*. Guangzhi, wielding a fiery twinblade, is shown mid-attack, creating a trail of flames in a lush forest environment. The player’s health and stamina bars are visible, along with icons for consumable items like Cooling Powder and Evil Repelling Medicant, which are recommended for this encounter. The guide emphasizes timing dodges during Guangzhi's aerial flourishes and counterattacking after his combo swings."
}