{
    "chunk_id": 741248216629,
    "source_file": "Pagoda_Realm_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fe/Wukong_Pagoda_22.jpg",
    "alt_text": "Wukong Pagoda 22.jpg",
    "position_desc": 23,
    "img_above_text": "![Wukong Pagoda 21.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c1/Wukong_Pagoda_21.jpg)\nContinue past the next open area with a Frozen Corpse and Cyan Bat hiding nearby, and you'll pass another cell with a purple seal that holds a strong enemy with a Spirit inside. There's another Cyan Bat guarding this door, and an Abomination not far ahead waiting to lunge at you.",
    "img_below_text": "You'll need to cross a thin wooden beam next, and to make matters worse, a Yaksha Archer will be posted at the far end to harass you. Resist the urge to perform a mobile Staff Spin, as walking while spinning seems to automatically make you lurch to the side, and you'll plummet to your death.\nInstead, either stop moving to deflect, or take the blows and race to the other side -- but do take a moment to glance to the right at a large purple-lit chamber you can spy ominously through the bars.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Pagoda 21.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c1/Wukong_Pagoda_21.jpg)\nContinue past the next open area with a Frozen Corpse and Cyan Bat hiding nearby, and you'll pass another cell with a purple seal that holds a strong enemy with a Spirit inside. There's another Cyan Bat guarding this door, and an Abomination not far ahead waiting to lunge at you.\"\n        - Following Text: \"You'll need to cross a thin wooden beam next, and to make matters worse, a Yaksha Archer will be posted at the far end to harass you. Resist the urge to perform a mobile Staff Spin, as walking while spinning seems to automatically make you lurch to the side, and you'll plummet to your death.\nInstead, either stop moving to deflect, or take the blows and race to the other side -- but do take a moment to glance to the right at a large purple-lit chamber you can spy ominously through the bars.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a moment from the video game *Black Myth: Wukong*, where the player character is crossing a narrow wooden beam while performing a spinning staff attack. The setting is a rocky, dimly lit area with intricate carvings and a dangerous drop below. This scene aligns with the guide's description of a challenging traversal section, where the player must navigate carefully while under threat from enemies, such as a Yaksha Archer positioned at the far end. The image highlights the precarious environment and the potential for combat or missteps."
}