{
    "chunk_id": 259717751285,
    "source_file": "Old_Rattle-Drum.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a0/Old_Rattle-Drum_2.jpg",
    "alt_text": "Old Rattle-Drum 2.jpg",
    "position_desc": 1,
    "img_above_text": "# Old Rattle-Drum\nThe Old Rattle-Drum is one of the more well-hidden Key Items in Black Myth: Wukong. However, it is one of the more important optional ones, as it unlocks a secret area, a hidden boss, and one of the Gourds in the game.",
    "img_below_text": "You will have to venture off to find it, and figuring out where to use it is even harder. But, below, you can find details on its location and the three spots in the game where you can shake it, to unlock the secret area.\n## Black Myth: Wukong Old Rattle-Drum Location",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"# Old Rattle-Drum\nThe Old Rattle-Drum is one of the more well-hidden Key Items in Black Myth: Wukong. However, it is one of the more important optional ones, as it unlocks a secret area, a hidden boss, and one of the Gourds in the game.\"\n        - Following Text: \"You will have to venture off to find it, and figuring out where to use it is even harder. But, below, you can find details on its location and the three spots in the game where you can shake it, to unlock the secret area.\n## Black Myth: Wukong Old Rattle-Drum Location\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image shows the in-game inventory screen from *Black Myth: Wukong*, highlighting the \"Old Rattle-Drum,\" a Legendary Key Item. The item's description notes its worn condition but emphasizes its lively sound when shaken. This item plays a crucial role in unlocking a secret area, a hidden boss, and one of the game's Gourds, as mentioned in the surrounding text."
}