{
    "chunk_id": 487579588536,
    "source_file": "How_to_Increase_Gourd_Uses_and_Healing_Amount.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0f/Wukong_Shen1.jpg",
    "alt_text": "Wukong Shen1.jpg",
    "position_desc": 4,
    "img_above_text": "The good news is the Gourd can be upgraded from Chapter 1 but you’ll need to wait until you reach Bamboo Grove. When you reach this section, continue on until you reach the Marsh of the White Mist Keeper’s Shrine. Before you proceed, look opposite the shrine to find a tree, where a golden vine hangs down. This is Luojia Fragrant Vine, which is an essential item for upgrading the Gourd.\nAfter collecting the Luojia Fragrant Vine, the next step is to continue to the bridge. As you step onto it, a lone snake will be waiting for you and someone will begin to talk to you, asking for help. This is the Shen Monkey, and once you’ve dealt with the enemy, a cutscene will play.",
    "img_below_text": "Follow the Shen Monkey into the cave after this, and speak to him. You’ll now have the option appear to Upgrade Gourds, Upgrade Drinks, and Brew. Whenever you want to upgrade your Gourd or the drink you’re using, you’ll need to return to the Shen Monkey.\n## How to Upgrade Gourds",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The good news is the Gourd can be upgraded from Chapter 1 but you’ll need to wait until you reach Bamboo Grove. When you reach this section, continue on until you reach the Marsh of the White Mist Keeper’s Shrine. Before you proceed, look opposite the shrine to find a tree, where a golden vine hangs down. This is Luojia Fragrant Vine, which is an essential item for upgrading the Gourd.\nAfter collecting the Luojia Fragrant Vine, the next step is to continue to the bridge. As you step onto it, a lone snake will be waiting for you and someone will begin to talk to you, asking for help. This is the Shen Monkey, and once you’ve dealt with the enemy, a cutscene will play.\"\n        - Following Text: \"Follow the Shen Monkey into the cave after this, and speak to him. You’ll now have the option appear to Upgrade Gourds, Upgrade Drinks, and Brew. Whenever you want to upgrade your Gourd or the drink you’re using, you’ll need to return to the Shen Monkey.\n## How to Upgrade Gourds\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the Shen Monkey, a key character in the game, sitting on a mat near jars and foliage. This scene occurs after the player encounters the Shen Monkey on a bridge and defeats an enemy. The Shen Monkey plays an important role by offering options to upgrade Gourds, upgrade drinks, and brew items, as described in the walkthrough."
}