{
    "chunk_id": 595608285691,
    "source_file": "Webbed_Hollow_-_Lower_Hollow_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/83/Wukong_LowerHollow_68.jpg",
    "alt_text": "Wukong LowerHollow 68.jpg",
    "position_desc": 64,
    "img_above_text": "Exit the cave and grab a green Wisp as you do, and you'll find yourself at the bottom of a large gorge with a spring in the middle, and a winding path up the cliff walls to the top. There's another green Wisp overlooking the pool of water, and scattered Skeletal Snakes all about.\nHead to the far side of the spring where you can find a Lantern Holder patrolling by some cocoons, and a path beyond him leads up to a high ledge guarded by a Dragonfly Guai.",
    "img_below_text": "However, if you look to the left up the sloping path, there's another wooden platform leading to a small alcove by the edge of the water, where the small rat you've been seeing in almost every chapter is sitting atop another statue head. Once he flees, inspect it to find your fourth Skandha: The **Skandha of Choice**.\n![Wukong LowerHollow 69.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4f/Wukong_LowerHollow_69.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Exit the cave and grab a green Wisp as you do, and you'll find yourself at the bottom of a large gorge with a spring in the middle, and a winding path up the cliff walls to the top. There's another green Wisp overlooking the pool of water, and scattered Skeletal Snakes all about.\nHead to the far side of the spring where you can find a Lantern Holder patrolling by some cocoons, and a path beyond him leads up to a high ledge guarded by a Dragonfly Guai.\"\n        - Following Text: \"However, if you look to the left up the sloping path, there's another wooden platform leading to a small alcove by the edge of the water, where the small rat you've been seeing in almost every chapter is sitting atop another statue head. Once he flees, inspect it to find your fourth Skandha: The **Skandha of Choice**.\n![Wukong LowerHollow 69.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4f/Wukong_LowerHollow_69.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the game *Black Myth: Wukong*, where the player character, wielding a fiery staff, stands on a wooden platform overlooking a rocky area with large cocoon-like structures. A Lantern Holder enemy is visible in the distance, marked with a red circle, patrolling near the cocoons. The setting aligns with the walkthrough's description of a gorge area with enemies and paths to explore. The \"Will\" resource counter is displayed on the screen, indicating gameplay progression."
}