{
    "chunk_id": 905202340703,
    "source_file": "Woods_of_Ember_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/93/Chapter_5_Secret_Area_%289%29.png",
    "alt_text": "Chapter 5 Secret Area \\(9\\).png",
    "position_desc": 58,
    "img_above_text": "### Yoaguai Chief - Gray-Bronze Cart\nHead straight up the narrow path, and when you're close to the cart, look to the left to find an alcove you can dip into to avoid the fire attacks that also has a green Wisp in it.",
    "img_below_text": "You can expect the same moveset from each of the carts, so again, the Fireproof Mantle Vessel works wonders here. For this one, though, you won't be able to get close to the feet and stay there without being hit with the fire attacks. So, stick close during the fist slam (without the fire) and dodge this. But when it rears up, jump back into the alcove to protect yourself from any fire attacks.\nGray-Bronze Cart",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"### Yoaguai Chief - Gray-Bronze Cart\nHead straight up the narrow path, and when you're close to the cart, look to the left to find an alcove you can dip into to avoid the fire attacks that also has a green Wisp in it.\"\n        - Following Text: \"You can expect the same moveset from each of the carts, so again, the Fireproof Mantle Vessel works wonders here. For this one, though, you won't be able to get close to the feet and stay there without being hit with the fire attacks. So, stick close during the fist slam (without the fire) and dodge this. But when it rears up, jump back into the alcove to protect yourself from any fire attacks.\nGray-Bronze Cart\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dark, narrow path surrounded by intricately carved stone walls, leading to a large, ominous cart-like structure resembling a Yoaguai Chief. The red arrow points to an alcove on the left, which is mentioned in the preceding text as a safe spot to avoid fire attacks and contains a green Wisp. The image serves as a visual guide to help players navigate the area and strategically position themselves during the encounter with the Gray-Bronze Cart enemy."
}