{
    "chunk_id": 132472265688,
    "source_file": "Bronze_Cloud_Staff.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b7/Bronze_Cloud_Staff.jpg",
    "alt_text": "Bronze Cloud Staff.jpg",
    "position_desc": 1,
    "img_above_text": "The Bronze Cloud Staff is another basic weapon you get at the beginning of Black Myth: Wukong. However, it is exclusive to the Deluxe Edition of the game. It comes with slightly improved stats compared to the Willow Wood Staff. Despite that, before long you will want to switch to one of the other Weapons when you get them due to its low damage.\nThe weapon has a 36 damage stat, with a decent 2% Critical Hit Chance. While it doesn't have a unique effect, the damage and critical hit chance can give you a slight edge at this point in the game.",
    "img_below_text": "## Black Myth: Wukong Bronze Cloud Staff Location\nWith it being exclusive to the Deluxe Edition of the game, you can't craft it. However, it can be found at the first Shrine in Chapter 1 - Black Wind Mountain. Simply pick it up under the \"Trailblazer's Gifts\" section.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Bronze Cloud Staff is another basic weapon you get at the beginning of Black Myth: Wukong. However, it is exclusive to the Deluxe Edition of the game. It comes with slightly improved stats compared to the Willow Wood Staff. Despite that, before long you will want to switch to one of the other Weapons when you get them due to its low damage.\nThe weapon has a 36 damage stat, with a decent 2% Critical Hit Chance. While it doesn't have a unique effect, the damage and critical hit chance can give you a slight edge at this point in the game.\"\n        - Following Text: \"## Black Myth: Wukong Bronze Cloud Staff Location\nWith it being exclusive to the Deluxe Edition of the game, you can't craft it. However, it can be found at the first Shrine in Chapter 1 - Black Wind Mountain. Simply pick it up under the \"Trailblazer's Gifts\" section.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image showcases the in-game menu for the \"Bronze Cloud Staff\" in *Black Myth: Wukong*. It is an uncommon weapon with 36 attack power and a 2% critical hit chance. The weapon is part of the Deluxe Edition and is accessible early in the game. The menu allows the player to equip, examine, or view details about the staff."
}