{
    "chunk_id": 206174382598,
    "source_file": "Yellow_Sand_Formation_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bb/Wukong_Yellow_62.jpg",
    "alt_text": "Wukong Yellow 62.jpg",
    "position_desc": 66,
    "img_above_text": "![Wukong Yellow 58.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/05/Wukong_Yellow_58.jpg)\nOnce you’ve carved out around a third of the Yellow Wind Sage’s health bar, things will get a little more scary. He’ll suddenly toss the head into the sky, and begin to sweep his spear around him to create a giant sandstorm — the power of the Samahdi Winds. Stay very clear of his repeated swings when this happens, as he’ll end the move with a giant whirling spin attack.",
    "img_below_text": "Note - if you have the Wind Tamer, you can use it now to fully negate the sandstorm and stop it from happening, which will also force him out of many of the attacks he uses in this phase. As an added bonus, using the Wind Tamer will also stun him for an extended period, so make use of it by hitting him with your biggest charged heavy strikes!\nIf you don’t have the Wind Tamer, he’ll vanish into the sandstorm, and instead send out giant sand copies of himself to strike at you in different directions. Since they are copies, you can’t really counter attack them, and they’ll fade away right after attacking:",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Yellow 58.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/05/Wukong_Yellow_58.jpg)\nOnce you’ve carved out around a third of the Yellow Wind Sage’s health bar, things will get a little more scary. He’ll suddenly toss the head into the sky, and begin to sweep his spear around him to create a giant sandstorm — the power of the Samahdi Winds. Stay very clear of his repeated swings when this happens, as he’ll end the move with a giant whirling spin attack.\"\n        - Following Text: \"Note - if you have the Wind Tamer, you can use it now to fully negate the sandstorm and stop it from happening, which will also force him out of many of the attacks he uses in this phase. As an added bonus, using the Wind Tamer will also stun him for an extended period, so make use of it by hitting him with your biggest charged heavy strikes!\nIf you don’t have the Wind Tamer, he’ll vanish into the sandstorm, and instead send out giant sand copies of himself to strike at you in different directions. Since they are copies, you can’t really counter attack them, and they’ll fade away right after attacking:\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a climactic moment in the boss battle against the Yellow Wind Sage in *Black Myth: Wukong*. The player character is shown using the Wind Tamer ability, which emits a glowing effect and appears to counter the boss's sandstorm attack. The boss's health bar is visible, and the dialogue, \"The Wind Tamer... How is it yours to use?\" suggests the boss is reacting to the player's use of this ability. The scene emphasizes the strategic use of the Wind Tamer to turn the tide of the fight."
}