{
    "chunk_id": 603148065301,
    "source_file": "Heart_of_Stone.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/16/Heart_of_Stone.jpg",
    "alt_text": "Heart of Stone.jpg",
    "position_desc": 1,
    "img_above_text": "Heart of Stone is one of the unique materials in Black Myth: Wukong. It is used for weapon and armor crafting to craft unique gear unlocked upon defeating a boss.\nThe Heart of Stone can be used to craft the Cloud-Patterned Stone Staff from the Shrine.",
    "img_below_text": "To obtain the Heart of Stone, you need to defeat Shigandang in Fright Cliff in Rockrest Flat in Yellow Wind Ridge. You need all six Buddhas Eyeball items to be able to trigger this fight.\n![Wukong Shigandang 2.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/60/Wukong_Shigandang_2.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Heart of Stone is one of the unique materials in Black Myth: Wukong. It is used for weapon and armor crafting to craft unique gear unlocked upon defeating a boss.\nThe Heart of Stone can be used to craft the Cloud-Patterned Stone Staff from the Shrine.\"\n        - Following Text: \"To obtain the Heart of Stone, you need to defeat Shigandang in Fright Cliff in Rockrest Flat in Yellow Wind Ridge. You need all six Buddhas Eyeball items to be able to trigger this fight.\n![Wukong Shigandang 2.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/60/Wukong_Shigandang_2.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image showcases the in-game inventory screen from *Black Myth: Wukong*, specifically highlighting the \"Heart of Stone,\" a rare special crafting material. The description states that this item belonged to someone who renounced faith and slaughtered the divine, and it is used for crafting weapons. The preceding and following text explain that the Heart of Stone is used to craft the Cloud-Patterned Stone Staff and can be obtained by defeating the boss Shigandang in Fright Cliff, requiring six Buddhas Eyeball items to trigger the fight."
}