{
    "chunk_id": 891061100970,
    "source_file": "Woods_of_Ember_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/42/Woods_Ember_Walkthrough_%28100%29.png",
    "alt_text": "Woods Ember Walkthrough \\(100\\).png",
    "position_desc": 55,
    "img_above_text": "Turn around and go straight ahead to where the enemy holds the spirit. Defeat this enemy to get Blood of the Iron Bull and collect the Charface Spirit.\nCharface Spirit",
    "img_below_text": "Continue forward and take down the next revenant, so you're free to collect the green Wisp on the right. Then turn left and make your way outside.\n![Woods Ember Walkthrough \\(101\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/25/Woods_Ember_Walkthrough_%28101%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Turn around and go straight ahead to where the enemy holds the spirit. Defeat this enemy to get Blood of the Iron Bull and collect the Charface Spirit.\nCharface Spirit\"\n        - Following Text: \"Continue forward and take down the next revenant, so you're free to collect the green Wisp on the right. Then turn left and make your way outside.\n![Woods Ember Walkthrough \\(101\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/25/Woods_Ember_Walkthrough_%28101%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dark, cave-like environment from the game *Black Myth: Wukong*. A character is shown navigating the area, with visual indicators highlighting two points of interest: a glowing green Wisp on the right and a pathway to the left marked by a red arrow. The preceding text suggests the player has just defeated an enemy to obtain the Charface Spirit, while the following text instructs the player to collect the green Wisp and proceed outside via the left path."
}