{
    "chunk_id": 692237258364,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8c/Wukong_Wolves_53.jpg",
    "alt_text": "Wukong Wolves 53.jpg",
    "position_desc": 58,
    "img_above_text": "His most threatening attack comes when he disengages from the fight and jump to a nearby rooftop. He’ll jump around a bit, and then leap high into the air to bellyflop onto you, causing a large shockwave that you’ll need to time well and dodge or take a ton of damage.\nHe also has an uppercut grab he can sometimes employ after a dashing strike that’s hard to see coming, which can launch you into the air for a multi-hit attack that can deal a scary amount of damage. This move comes when he’s hunched over and growls, but he won’t raise his claw until it’s too late to dodge!",
    "img_below_text": "Once you’ve got him back on the ground, try utilizing your new Red Waves spell to fight a wolf with a wolf, and unleash the fiery spin attacks while still making sure to dodge his swipes. Even though you have a new separate health bar, you’ll be able to unleash more damage in this form if you don’t spend the entire time taking damage.\n![Wukong Wolves 54.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bc/Wukong_Wolves_54.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"His most threatening attack comes when he disengages from the fight and jump to a nearby rooftop. He’ll jump around a bit, and then leap high into the air to bellyflop onto you, causing a large shockwave that you’ll need to time well and dodge or take a ton of damage.\nHe also has an uppercut grab he can sometimes employ after a dashing strike that’s hard to see coming, which can launch you into the air for a multi-hit attack that can deal a scary amount of damage. This move comes when he’s hunched over and growls, but he won’t raise his claw until it’s too late to dodge!\"\n        - Following Text: \"Once you’ve got him back on the ground, try utilizing your new Red Waves spell to fight a wolf with a wolf, and unleash the fiery spin attacks while still making sure to dodge his swipes. Even though you have a new separate health bar, you’ll be able to unleash more damage in this form if you don’t spend the entire time taking damage.\n![Wukong Wolves 54.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bc/Wukong_Wolves_54.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an intense combat scene from *Black Myth: Wukong*, showcasing the player character, transformed into a wolf-like form, battling a large, ferocious white wolf enemy named \"Lingxuzi.\" The player is using fiery attacks, with options for \"Light Attack: Moon Dance\" and \"Heavy Attack: Moon Chase,\" as indicated in the interface. The preceding and following text suggests the fight involves strategic dodging and utilizing powerful spells like \"Red Waves\" to counter the enemy's aggressive moves, including shockwaves and multi-hit attacks."
}