{
    "chunk_id": 419083492477,
    "source_file": "New_Thunderclap_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/53/Wukong_Thunderclap_8.jpg",
    "alt_text": "Wukong Thunderclap 8.jpg",
    "position_desc": 8,
    "img_above_text": "The good news is that they largely remain stationary, meaning you can easily stop a few feet away and charge a full heavy thrust attack to knock them flat, and then follow up with a quick light combo as they stagger to their feet.\nOnce this monk has been defeated, check the corner of this snowdrift for a green Wisp to absorb.",
    "img_below_text": "Inside the building itself, you'll find another Overseeing Monk in the main room (plus another on the far right side of the building exterior), and on the other side is the beginning of the main plaza, but the stairs beyond are lined with several Thunder Rhino Masters, so let's backtrack and find an optional side path.\nBack at the Temple Entrance Shrine, move to the right to find two other paths:",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The good news is that they largely remain stationary, meaning you can easily stop a few feet away and charge a full heavy thrust attack to knock them flat, and then follow up with a quick light combo as they stagger to their feet.\nOnce this monk has been defeated, check the corner of this snowdrift for a green Wisp to absorb.\"\n        - Following Text: \"Inside the building itself, you'll find another Overseeing Monk in the main room (plus another on the far right side of the building exterior), and on the other side is the beginning of the main plaza, but the stairs beyond are lined with several Thunder Rhino Masters, so let's backtrack and find an optional side path.\nBack at the Temple Entrance Shrine, move to the right to find two other paths:\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character, armed with a spear, approaching a snowy temple courtyard in a video game. The scene highlights the entrance to a large, intricate structure with statues and stairs, where enemies, including monks, are stationed. This area appears to be part of a challenging section of the game, requiring strategic combat and exploration, as referenced in the preceding and following text."
}