{
    "chunk_id": 652233748208,
    "source_file": "New_Thunderclap_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b0/Wukong_Thunderclap_78.jpg",
    "alt_text": "Wukong Thunderclap 78.jpg",
    "position_desc": 77,
    "img_above_text": "![Wukong Thunderclap 76.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e8/Wukong_Thunderclap_76.jpg)\nAfter fighting for a bit, Yellowbrow will often vanish into thin air, but you can get a heads up on where he's going by looking for his shadow on the ground and which direction it darts off to.",
    "img_below_text": "Early on, he'll reappear just to gloat, and if you see him raise his arms in a taunt, that's your cue to retaliate by expending your focus points to hit him hard. Three Focus Points on a Pillar Heavy Strike can often send him staggering to his knees, giving you a lot of opportunity to continue your assault.\nJust be warned that as the battle progresses, he'll come out of his vanishing act with another attack prepped, so you'll need to both find his new position (or listen for it), and react quickly.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Thunderclap 76.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e8/Wukong_Thunderclap_76.jpg)\nAfter fighting for a bit, Yellowbrow will often vanish into thin air, but you can get a heads up on where he's going by looking for his shadow on the ground and which direction it darts off to.\"\n        - Following Text: \"Early on, he'll reappear just to gloat, and if you see him raise his arms in a taunt, that's your cue to retaliate by expending your focus points to hit him hard. Three Focus Points on a Pillar Heavy Strike can often send him staggering to his knees, giving you a lot of opportunity to continue your assault.\nJust be warned that as the battle progresses, he'll come out of his vanishing act with another attack prepped, so you'll need to both find his new position (or listen for it), and react quickly.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss battle against \"Yellowbrow\" in *Black Myth: Wukong*. The character is shown wielding a spiked weapon, seated on a throne-like structure, surrounded by ornate decorations. The health bar at the bottom indicates the ongoing fight, while the UI elements suggest the player has access to abilities and focus points. The preceding and following text provides strategies for combating Yellowbrow, including tracking his movements when he vanishes and retaliating during his taunts to stagger him for further attacks."
}