{
    "chunk_id": 474458325584,
    "source_file": "Flint_Vanguard_Spirit.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0b/Flint_Vanguard_Spirit.jpg",
    "alt_text": "Flint Vanguard Spirit.jpg",
    "position_desc": 3,
    "img_above_text": "The best way to fight this foe is by sticking behind it. The Flint Vanguard punches into the ground with its fists and has a sweeping attack that reaches either side of the beast, but both can be avoided by staying directly behind the creature.\n## Flint Vanguard Spirit",
    "img_below_text": "* **Flaming Flint**\n* Equipped Effect: Moderately increases Scorch Damage and Burn Resistance.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The best way to fight this foe is by sticking behind it. The Flint Vanguard punches into the ground with its fists and has a sweeping attack that reaches either side of the beast, but both can be avoided by staying directly behind the creature.\n## Flint Vanguard Spirit\"\n        - Following Text: \"* **Flaming Flint**\n* Equipped Effect: Moderately increases Scorch Damage and Burn Resistance.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image showcases the \"Flint Vanguard Spirit\" in the Equipment menu of a video game. This Epic Spirit allows players to take the form of Flint Vanguard, using stone fists to attack enemies and inflict Scorch Bane, with additional burn damage if the foe is ignited. The equipped effect moderately boosts Scorch Damage and Burn Resistance. The interface also includes options to equip, watch a demo, and view stats, alongside a list of other available spirits."
}