{
    "chunk_id": 949859348689,
    "source_file": "Webbed_Hollow_-_Upper_Hollow_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8f/Wukong_UpperHollow_8.jpg",
    "alt_text": "Wukong UpperHollow 8.jpg",
    "position_desc": 9,
    "img_above_text": "![Wukong UpperHollow 7.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/20/Wukong_UpperHollow_7.jpg)\nBeyond the wall, you can find a thin ledge leading along the rocky cave wall guarded by a Dragonfly Guai peppering you with poison arrows. After you cross the gap, you can spot torches up the wall on the right, and a lower path to the left leading back down to an overlook for the Upper Hollow Shrine, complete with a green Wisp to absorb along the ledge.",
    "img_below_text": "Just to the right of this ledge, there's a small cave lined with tiny cocoons everywhere, and a few medium-sized cocoons that will burst to reveal ugly looking Minor Amourworms. They can't do too much other than thrash about or lunge (a surprisingly long distance in a short span), but the one you'll want to worry about is the larger cocoon in the middle that holds a Lesser Amourworm.\n![Wukong UpperHollow 9.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5c/Wukong_UpperHollow_9.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong UpperHollow 7.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/20/Wukong_UpperHollow_7.jpg)\nBeyond the wall, you can find a thin ledge leading along the rocky cave wall guarded by a Dragonfly Guai peppering you with poison arrows. After you cross the gap, you can spot torches up the wall on the right, and a lower path to the left leading back down to an overlook for the Upper Hollow Shrine, complete with a green Wisp to absorb along the ledge.\"\n        - Following Text: \"Just to the right of this ledge, there's a small cave lined with tiny cocoons everywhere, and a few medium-sized cocoons that will burst to reveal ugly looking Minor Amourworms. They can't do too much other than thrash about or lunge (a surprisingly long distance in a short span), but the one you'll want to worry about is the larger cocoon in the middle that holds a Lesser Amourworm.\n![Wukong UpperHollow 9.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5c/Wukong_UpperHollow_9.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from *Black Myth: Wukong*, showing the player character in a dimly lit cave filled with spiderwebs and numerous small cocoons scattered across the ground. A glowing torch illuminates the background, and a large cocoon-like structure is visible, hinting at the presence of enemies. The player is armed with a flaming staff, preparing to confront a creature emerging from a medium-sized cocoon, identifiable by its red health bar. This setting introduces a tense encounter with Minor Amourworms and possibly a larger Lesser Amourworm."
}