{
    "chunk_id": 726021008826,
    "source_file": "Emerald-Armed_Mantis.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/ae/Foothills_Walkthrough_%2879%29.png",
    "alt_text": "Foothills Walkthrough \\(79\\).png",
    "position_desc": 3,
    "img_above_text": "Note! If you die here, you'll be automatically transported back to near Zhu Bajie. There's a nearby Mantis-Catching Swamp that can also be activated, just behind where Bajie stands against the tree. To get back inside him, approach him and talk to him.\nBecause the fight takes place inside Bajie's stomach, the area is limited. You'll find the mantis hacking and slashing away at the lining of Bajie's stomach, and it will soon turn its attention to you.",
    "img_below_text": "The first thing to take note of is the two blades it has for arms. It will use this to perform a combo of melee attacks, which mainly start with it raising both blades and stabbing them down into the pool of stomach contents you'll be wading through. As the blades land, this is a moment of vulnerability for the mantis, that will allow you to attack.\n![Foothills Walkthrough \\(78\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/37/Foothills_Walkthrough_%2878%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Note! If you die here, you'll be automatically transported back to near Zhu Bajie. There's a nearby Mantis-Catching Swamp that can also be activated, just behind where Bajie stands against the tree. To get back inside him, approach him and talk to him.\nBecause the fight takes place inside Bajie's stomach, the area is limited. You'll find the mantis hacking and slashing away at the lining of Bajie's stomach, and it will soon turn its attention to you.\"\n        - Following Text: \"The first thing to take note of is the two blades it has for arms. It will use this to perform a combo of melee attacks, which mainly start with it raising both blades and stabbing them down into the pool of stomach contents you'll be wading through. As the blades land, this is a moment of vulnerability for the mantis, that will allow you to attack.\n![Foothills Walkthrough \\(78\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/37/Foothills_Walkthrough_%2878%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight scenario from the video game *Black Myth: Wukong*. It shows a large, menacing mantis-like creature wielding two blade-like arms, poised for combat inside a dark, organic environment, likely the stomach of Zhu Bajie as described in the context. The player character, armed with a spear, faces the mantis in a pool of stomach contents, setting the stage for a challenging battle."
}