{
    "chunk_id": 555056020853,
    "source_file": "Secrets_in_Black_Myth_Wukong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/6c/Five_Skandhas_%289%29.png",
    "alt_text": "Five Skandhas \\(9\\).png",
    "position_desc": 14,
    "img_above_text": "# Chapter 4 Secrets\n## Skandha of Choice",
    "img_below_text": "The Skandha of Choice can be found in Chapter 4. Go right from The Purifying Spring Keeper's Choice and up the stairs and through the gap in the wall. Follow this path along to the right, and cross the bridge. Then turn left and look for the white sacs that block a path going down. Smash through these and go down here to find a Buddha head, where the monkey from previous chapters will be sitting. Once the monkey has run off, take the Skandha of Choice from the Buddha's head.\n## Yellow Loong and Transformation Spell: Golden Lining",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"# Chapter 4 Secrets\n## Skandha of Choice\"\n        - Following Text: \"The Skandha of Choice can be found in Chapter 4. Go right from The Purifying Spring Keeper's Choice and up the stairs and through the gap in the wall. Follow this path along to the right, and cross the bridge. Then turn left and look for the white sacs that block a path going down. Smash through these and go down here to find a Buddha head, where the monkey from previous chapters will be sitting. Once the monkey has run off, take the Skandha of Choice from the Buddha's head.\n## Yellow Loong and Transformation Spell: Golden Lining\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a rocky, cavernous area with white, sac-like formations blocking paths and a Buddha head positioned centrally, illuminated by two nearby flames. This setting aligns with the walkthrough's description of the location where players can find the \"Skandha of Choice\" in Chapter 4. The sacs are mentioned as obstacles to smash through, leading to the Buddha head where the item is collected after interacting with the monkey."
}