{
    "chunk_id": 517724995934,
    "source_file": "Violet_Spider.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/cb/Wukong_LowerHollow_81.jpg",
    "alt_text": "Wukong LowerHollow 81.jpg",
    "position_desc": 10,
    "img_above_text": "![Wukong LowerHollow 78.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9f/Wukong_LowerHollow_78.jpg)\nOnce she reaches about half of her health or less, you'll need to keep your eyes peeled for when she dives her head into the ground. This will leave only her rear abdomen sticking out of the ground, but resist the urge to smack at it. Zhu Bajie may try to warn you, but it may not come out in time that she's preparing a deadly poison explosion!",
    "img_below_text": "The poison blast has an extremely wide area of effect, and can be difficult to escape if you're still very close to her when she burrows in. Luckily, as long as you have a lot of stamina saved up, you can also negate the blast by using the Pillar Stance. It will likely take 50% of your stamina bar to soak, but you'll be free of any damage or poison!\n![Wukong LowerHollow 82.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c3/Wukong_LowerHollow_82.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong LowerHollow 78.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9f/Wukong_LowerHollow_78.jpg)\nOnce she reaches about half of her health or less, you'll need to keep your eyes peeled for when she dives her head into the ground. This will leave only her rear abdomen sticking out of the ground, but resist the urge to smack at it. Zhu Bajie may try to warn you, but it may not come out in time that she's preparing a deadly poison explosion!\"\n        - Following Text: \"The poison blast has an extremely wide area of effect, and can be difficult to escape if you're still very close to her when she burrows in. Luckily, as long as you have a lot of stamina saved up, you can also negate the blast by using the Pillar Stance. It will likely take 50% of your stamina bar to soak, but you'll be free of any damage or poison!\n![Wukong LowerHollow 82.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c3/Wukong_LowerHollow_82.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a battle scene from *Black Myth: Wukong*, showcasing the player character engaging with a boss named \"Violet Spider.\" The spider appears partially burrowed into the ground, likely preparing its deadly poison explosion, as described in the preceding text. The player is advised to avoid attacking its exposed abdomen and instead prepare to mitigate the incoming poison blast using stamina-saving techniques like the Pillar Stance. The health bar of the Violet Spider is visible, indicating the ongoing fight."
}