{
    "chunk_id": 896937389227,
    "source_file": "Bamboo_Grove_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/11/Wukong_Bamboo_31.jpg",
    "alt_text": "Wukong Bamboo 31.jpg",
    "position_desc": 30,
    "img_above_text": "![Wukong Bamboo 30.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/80/Wukong_Bamboo_30.jpg)\nThe good news is other than his poison spray, Guangmou doesn’t really have any melee attacks to defend himself at close range — other than a very slow repulsing explosion he needs to charge up by spinning while he gathers energy. Use this to your advantage by pressing your light attack combos whenever you close the gap, and if you have defeated the Wandering Wight, use its Spirit Attack to knock him down with a mighty headbutt to keep him from teleporting away.",
    "img_below_text": "Another good strategy to note is that if you’re in danger of getting close to becoming poisoned, using the Red Tides spell can help you transform out of danger. Any status effects suffered while transformed as Guangzhi will be removed when you regain your regular health bar. As an added bonus, Guangmou will even comment on your transformation.\nOnce you’ve learned how to evade his projectiles, the rest of the fight will just boil down to chasing him down and stunning him however you can with Immobilize, your Spirit Attack, and other heavy hits. When he falls, you’ll gain Guangmou’s Spirit to add to your collection, allowing you to summon venomous snakes of your own!",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Bamboo 30.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/80/Wukong_Bamboo_30.jpg)\nThe good news is other than his poison spray, Guangmou doesn’t really have any melee attacks to defend himself at close range — other than a very slow repulsing explosion he needs to charge up by spinning while he gathers energy. Use this to your advantage by pressing your light attack combos whenever you close the gap, and if you have defeated the Wandering Wight, use its Spirit Attack to knock him down with a mighty headbutt to keep him from teleporting away.\"\n        - Following Text: \"Another good strategy to note is that if you’re in danger of getting close to becoming poisoned, using the Red Tides spell can help you transform out of danger. Any status effects suffered while transformed as Guangzhi will be removed when you regain your regular health bar. As an added bonus, Guangmou will even comment on your transformation.\nOnce you’ve learned how to evade his projectiles, the rest of the fight will just boil down to chasing him down and stunning him however you can with Immobilize, your Spirit Attack, and other heavy hits. When he falls, you’ll gain Guangmou’s Spirit to add to your collection, allowing you to summon venomous snakes of your own!\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image showcases gameplay from *Black Myth: Wukong*, specifically during a boss fight against Guangmou. The player character is seen attacking Guangmou with fiery strikes, while the on-screen prompts detail combat options such as \"Light Attack 'Moon Dance,'\" \"Heavy Attack 'Moon Chase,'\" and a dodge-followed heavy attack. The boss's health bar is visible, indicating the progress of the fight. The lush environment and combat mechanics highlight the strategic elements of the encounter, as discussed in the surrounding text."
}