{
    "chunk_id": 775591188493,
    "source_file": "Celestial_Jade_Lotus_Pill_Locations.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f2/Jade_Lotus_Xu_Dog.jpg",
    "alt_text": "Jade Lotus Xu Dog.jpg",
    "position_desc": 3,
    "img_above_text": "## Xu-Dog Celestial Jade Lotus Pills\nXu-Dog Celestial Jade Lotus Pills",
    "img_below_text": "Fall down the sand slide after exploring the Crouching Tiger Temple Cellar to meet the Xu-Dog. The Xu-Dog crafts Celestial Medicines for you in exchange for Mind Cores. You can craft a total of nine Celestial Jade Lotus Pills with the Xu-Dog. You can find Mind Cores in chests or as loot for defeating particularly vicious foes.\n## The New West Celestial Jade Lotus Pill",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Xu-Dog Celestial Jade Lotus Pills\nXu-Dog Celestial Jade Lotus Pills\"\n        - Following Text: \"Fall down the sand slide after exploring the Crouching Tiger Temple Cellar to meet the Xu-Dog. The Xu-Dog crafts Celestial Medicines for you in exchange for Mind Cores. You can craft a total of nine Celestial Jade Lotus Pills with the Xu-Dog. You can find Mind Cores in chests or as loot for defeating particularly vicious foes.\n## The New West Celestial Jade Lotus Pill\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image showcases the crafting menu for Celestial Medicines in a video game, specifically focusing on the \"Jade Lotus Pill.\" This item is described as a lesser celestial medicine that permanently increases Maximum Health. Players can craft up to nine Jade Lotus Pills using \"Mind Cores\" as the primary ingredient, with a cost of 3 Mind Cores per pill. Additionally, crafting requires 540 Will points. The menu displays the health and resistance stats that will be affected, alongside the visual design of the pill. The context indicates that these pills are crafted through interactions with the Xu-Dog, a character found after exploring the Crouching Tiger Temple Cellar."
}