{
    "chunk_id": 27747199374,
    "source_file": "Non-Able.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/db/Wukong_Brook_19.jpg",
    "alt_text": "Wukong Brook 19.jpg",
    "position_desc": 7,
    "img_above_text": "![Wukong Brook 20.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8d/Wukong_Brook_20.jpg)\nSince things are rarely as easy as they seem, eliminating his health bar will trigger phase two, whereupon he'll break his restraints and not only fight you with his fists, but supercharge his limbs to deal an insane amount of damage!",
    "img_below_text": "Non-Able will always start his second phase with an immediate charge to grab you. This can't be blocked, and the timing can be hard to dodge to the side, so you're better off dodging backward or using Cloud Step when he reaches out with his right hand. Get caught, and you'll take a ton of damage. Be warned if you try to Immobilize him mid-grab, he can often pop out of it and continue the grab animation unless you reposition yourself somewhere safe.\n![Wukong Brook 21.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/db/Wukong_Brook_21.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Brook 20.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8d/Wukong_Brook_20.jpg)\nSince things are rarely as easy as they seem, eliminating his health bar will trigger phase two, whereupon he'll break his restraints and not only fight you with his fists, but supercharge his limbs to deal an insane amount of damage!\"\n        - Following Text: \"Non-Able will always start his second phase with an immediate charge to grab you. This can't be blocked, and the timing can be hard to dodge to the side, so you're better off dodging backward or using Cloud Step when he reaches out with his right hand. Get caught, and you'll take a ton of damage. Be warned if you try to Immobilize him mid-grab, he can often pop out of it and continue the grab animation unless you reposition yourself somewhere safe.\n![Wukong Brook 21.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/db/Wukong_Brook_21.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the boss \"Non-Able\" during his second phase in *Black Myth: Wukong*. He appears to have broken free from his restraints and is preparing to attack the player with enhanced aggression and supercharged limbs. The snowy environment and HUD elements indicate an active combat scenario, with the boss's health bar visible at the bottom. The preceding and following text describe his initial charge attack in this phase, which is difficult to block or dodge, emphasizing the need for strategic movement to avoid significant damage."
}