{
    "chunk_id": 380565152040,
    "source_file": "Bitter_Lake_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5f/Wukong_Bitter_64.jpg",
    "alt_text": "Wukong Bitter 64.jpg",
    "position_desc": 96,
    "img_above_text": "Return to speak with the monk, who ends up teasing Zhu Bajie some more before appearing up on the cliffs above, as a large Buddha statue materializes next to him.\nSadly, Zhu Bajie will send you off alone and promise to meet you at the summit, which will end your jolly cooperation for now.",
    "img_below_text": "Look for a path to the right of the pavilion and start heading up the winding stairs that criss-cross along the cliffs filled with statues.\n![Wukong Bitter 65.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5e/Wukong_Bitter_65.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Return to speak with the monk, who ends up teasing Zhu Bajie some more before appearing up on the cliffs above, as a large Buddha statue materializes next to him.\nSadly, Zhu Bajie will send you off alone and promise to meet you at the summit, which will end your jolly cooperation for now.\"\n        - Following Text: \"Look for a path to the right of the pavilion and start heading up the winding stairs that criss-cross along the cliffs filled with statues.\n![Wukong Bitter 65.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5e/Wukong_Bitter_65.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a snowy, mountainous area with a stone staircase leading upward, flanked by ornate railings and a lit brazier. A character, likely the player-controlled protagonist, is shown holding a staff and preparing to ascend the stairs. This scene aligns with the narrative context of exploring the cliffs and finding a path to the summit after parting ways with Zhu Bajie."
}