{
    "chunk_id": 41371351179,
    "source_file": "Mind_Core.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2a/Wukong_Sandgate_12.jpg",
    "alt_text": "Wukong Sandgate 12.jpg",
    "position_desc": 2,
    "img_above_text": "Mind Cores can be used at Xu Dog in the Crouching Tiger Temple \\- Cellar area to upgrade your stats. From the Shrine, you can look to your right to find Xu Dog who will upgrade your stats.\nYou will have to complete some tasks before being able to access his upgrades. This includes finding him in the path through the cave in Sandgate Village \\- Village Entrance and defeating Lang-Li-Guhh-Baw in the pit beneath him.",
    "img_below_text": "This will cause him to move on to the Cellar area of the Crouching Tiger Temple. From there, you will need to obtain both the Keeness of Tiger and Sterness of Stone Key Items from defeating the Tiger Vanguard and Stone Vanguard bosses along the chapter's main story path.\nYou can then use these items on the Tallies around Yellow Wind Ridge. To access the Crouching Tiger Temple cellar, you will need to activate the Tally in the arena where you fought the Tiger Vanguard and continue down until you reach the slope, leading you to the Shrine.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Mind Cores can be used at Xu Dog in the Crouching Tiger Temple \\- Cellar area to upgrade your stats. From the Shrine, you can look to your right to find Xu Dog who will upgrade your stats.\nYou will have to complete some tasks before being able to access his upgrades. This includes finding him in the path through the cave in Sandgate Village \\- Village Entrance and defeating Lang-Li-Guhh-Baw in the pit beneath him.\"\n        - Following Text: \"This will cause him to move on to the Cellar area of the Crouching Tiger Temple. From there, you will need to obtain both the Keeness of Tiger and Sterness of Stone Key Items from defeating the Tiger Vanguard and Stone Vanguard bosses along the chapter's main story path.\nYou can then use these items on the Tallies around Yellow Wind Ridge. To access the Crouching Tiger Temple cellar, you will need to activate the Tally in the arena where you fought the Tiger Vanguard and continue down until you reach the slope, leading you to the Shrine.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image shows a player character standing near a lit brazier in a rocky, outdoor environment. A red arrow highlights a cave entrance beneath a large stone statue, suggesting the next objective or path. This scene likely corresponds to the task of locating Xu Dog in the cave near Sandgate Village, as described in the preceding text."
}