{
    "chunk_id": 808374857642,
    "source_file": "Valley_of_Ecstasy_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1c/Wukong_Longevity_9.jpg",
    "alt_text": "Wukong Longevity 9.jpg",
    "position_desc": 105,
    "img_above_text": "![Wukong Longevity 5.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/91/Wukong_Longevity_5.jpg)\nGuarding the Shrine is another Dual-Blade Monk, who thankfully won't respawn when killed, so feel free to go all out with your spells to overpower him after deflecting an attack to stagger him.",
    "img_below_text": "From here, the large main field in front of you hides several more Frozen Corpse ambushes, plus Falcon Fan-Makers who will try and stop you from reaching the New Thunderclap Temple. However, there is one last side area worth checking out.\nLook for a lower path leading left of the Shrine, and you'll find a road leading along the ridge above the Towers of Karma into another wooded area. This place is effectively one big loop, with a lower and upper path to take.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Longevity 5.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/91/Wukong_Longevity_5.jpg)\nGuarding the Shrine is another Dual-Blade Monk, who thankfully won't respawn when killed, so feel free to go all out with your spells to overpower him after deflecting an attack to stagger him.\"\n        - Following Text: \"From here, the large main field in front of you hides several more Frozen Corpse ambushes, plus Falcon Fan-Makers who will try and stop you from reaching the New Thunderclap Temple. However, there is one last side area worth checking out.\nLook for a lower path leading left of the Shrine, and you'll find a road leading along the ridge above the Towers of Karma into another wooded area. This place is effectively one big loop, with a lower and upper path to take.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a gameplay scene from *Black Myth: Wukong*, showing the player character facing multiple enemies in a snowy field. The player wields a staff and appears ready for combat, with various abilities and resources displayed in the HUD, including \"Will\" and \"Silk.\" This scene aligns with the preceding text, where the player is advised to defeat a Dual-Blade Monk guarding a shrine, and the following text, which warns of ambushes and challenges in the surrounding area as the player progresses toward the New Thunderclap Temple."
}