{
    "chunk_id": 504748321235,
    "source_file": "Village_of_Lanxi_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/83/Wukong_Lanxi_8.jpg",
    "alt_text": "Wukong Lanxi 8.jpg",
    "position_desc": 8,
    "img_above_text": "![Wukong Lanxi 7.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5f/Wukong_Lanxi_7.jpg)\nThis Dragonfly Guai will fire off poison arrows at a measured pace, which are an unfortunate pairing with the fiery hostile wisps the Lantern Holder can create, alongside his equally poisonous sickle.",
    "img_below_text": "Once they've been defeated, look for some stairs left of the lantern decorations, and head to the lower level. There's many more green Wisps to absorb, so long as you take out the other Lantern Holder creating more dangerous wisps of his own.\nAt the end of this lower path with the five green Wisps scattered about, there's a innocuous looking chest sitting in front of a small shack, but when you try to claim it, you'll be ambushed by a swarm of small Stone Spiders.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Lanxi 7.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5f/Wukong_Lanxi_7.jpg)\nThis Dragonfly Guai will fire off poison arrows at a measured pace, which are an unfortunate pairing with the fiery hostile wisps the Lantern Holder can create, alongside his equally poisonous sickle.\"\n        - Following Text: \"Once they've been defeated, look for some stairs left of the lantern decorations, and head to the lower level. There's many more green Wisps to absorb, so long as you take out the other Lantern Holder creating more dangerous wisps of his own.\nAt the end of this lower path with the five green Wisps scattered about, there's a innocuous looking chest sitting in front of a small shack, but when you try to claim it, you'll be ambushed by a swarm of small Stone Spiders.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat encounter in *Black Myth: Wukong*, where the player character, armed with a fiery spear, faces off against a Lantern Holder enemy. The Lantern Holder is capable of summoning green Wisps and attacking with a poisonous sickle. Green Wisps, marked with red outlines, are scattered throughout the area and can be absorbed by the player. The setting is an outdoor environment with a small building and rocky terrain, indicating progression through this hostile area."
}