{
    "chunk_id": 947358928671,
    "source_file": "Centipede_Guai.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/25/Wukong_MiddleHollow_42.jpg",
    "alt_text": "Wukong MiddleHollow 42.jpg",
    "position_desc": 3,
    "img_above_text": "When attacking from the front, he'll often slam down his head repeatedly to hit you with two times, and then quickly stand up while pivoting around to fall on its back to squash you with its armored hide. Be ready to dodge the third slam, and then immediately begin a combo attack while it struggles to rise up again.\nThe Centipede Guai can also perform two slow frontal sweeps with its main claws, alternating a claw on each side, but with its fairly slow swings you can step to the side to focus on its legs.",
    "img_below_text": "It can also rear back while still crouched on the ground, and extend its head to lunge at you up to two times in a row with reaching claw swipes.\n![Wukong MiddleHollow 39.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d8/Wukong_MiddleHollow_39.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"When attacking from the front, he'll often slam down his head repeatedly to hit you with two times, and then quickly stand up while pivoting around to fall on its back to squash you with its armored hide. Be ready to dodge the third slam, and then immediately begin a combo attack while it struggles to rise up again.\nThe Centipede Guai can also perform two slow frontal sweeps with its main claws, alternating a claw on each side, but with its fairly slow swings you can step to the side to focus on its legs.\"\n        - Following Text: \"It can also rear back while still crouched on the ground, and extend its head to lunge at you up to two times in a row with reaching claw swipes.\n![Wukong MiddleHollow 39.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d8/Wukong_MiddleHollow_39.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character engaged in combat with the Centipede Guai, a large, armored insect-like enemy in a dark, skeletal-filled cavern. The health bar labeled \"Centipede Guai\" indicates the ongoing battle, with the player preparing to attack while surrounded by environmental details such as webs and bones. The preceding and following text provides strategies for dodging the enemy's attacks and exploiting its vulnerabilities during specific movements."
}