{
    "chunk_id": 276665367356,
    "source_file": "Black_Loong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/68/Wukong_BlackLoong_7.jpg",
    "alt_text": "Wukong BlackLoong 7.jpg",
    "position_desc": 14,
    "img_above_text": "![Wukong BlackLoong 5.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1a/Wukong_BlackLoong_5.jpg)\nIf you spot the Black Loong raising his weapons high in a slow manner while they crackle to life, it’s a sign he’s going to bang them together slowly three times, causing explosions in the air that gradually increase in range. This is a good time to sprint to safety and use your medicines while you wait for the attack to end.",
    "img_below_text": "However, the most dire of his attacks will come when he seems to emit even more electricity coming from his mouth and arcing around his body. Listen carefully to the drumbeat of the music, as he’ll start to pound the very earth in time with the drum beats, causing several rings of electric energy to expel outward.\nGetting hit by even a few of these will quickly deplete your healthbar, and you’ll have to stop everything to focus on evasion. While it is possible to get on top of your staff in the Pillar Stance, each electric ring will take a chunk out of your stamina, and this segment lasts far too long to wait out in this style.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong BlackLoong 5.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1a/Wukong_BlackLoong_5.jpg)\nIf you spot the Black Loong raising his weapons high in a slow manner while they crackle to life, it’s a sign he’s going to bang them together slowly three times, causing explosions in the air that gradually increase in range. This is a good time to sprint to safety and use your medicines while you wait for the attack to end.\"\n        - Following Text: \"However, the most dire of his attacks will come when he seems to emit even more electricity coming from his mouth and arcing around his body. Listen carefully to the drumbeat of the music, as he’ll start to pound the very earth in time with the drum beats, causing several rings of electric energy to expel outward.\nGetting hit by even a few of these will quickly deplete your healthbar, and you’ll have to stop everything to focus on evasion. While it is possible to get on top of your staff in the Pillar Stance, each electric ring will take a chunk out of your stamina, and this segment lasts far too long to wait out in this style.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an intense boss battle from *Black Myth: Wukong*, showcasing the protagonist engaging the Black Loong, a large, electrified dragon-like creature. The scene highlights the Black Loong's use of powerful electric attacks, with visible arcs of lightning and the creature's glowing mouth. The surrounding environment is desolate and ominous, emphasizing the high-stakes nature of the fight. The HUD elements suggest active combat mechanics, including health, stamina, and ability icons, while the boss's health bar indicates the progression of the encounter."
}