{
    "chunk_id": 200589685959,
    "source_file": "Chapter_4_Secret_-_Purple_Cloud_Mountain_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a2/Wukong_UpperHollow_33.jpg",
    "alt_text": "Wukong UpperHollow 33.jpg",
    "position_desc": 1,
    "img_above_text": "## How to Access Purple Cloud Mountain\nUnlike other Secret Areas in previous chapters, accessing the Purple Cloud Mountain is fairly straightforward, and only requires you to track down and defeat an optional boss character in both locations he's hiding in.",
    "img_below_text": "The first time you can find the Venom Daoist, he'll be hiding in the Upper Hollow of the major Webbed Hollow region. You can find it by circling the first area to the right, dropping down a hole to a slightly lower level, and fighting your way through tunnels full of hanging cocoons to reach the Pools of Shattered Jade Shrine.\n![Wukong UpperHollow 35.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/47/Wukong_UpperHollow_35.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## How to Access Purple Cloud Mountain\nUnlike other Secret Areas in previous chapters, accessing the Purple Cloud Mountain is fairly straightforward, and only requires you to track down and defeat an optional boss character in both locations he's hiding in.\"\n        - Following Text: \"The first time you can find the Venom Daoist, he'll be hiding in the Upper Hollow of the major Webbed Hollow region. You can find it by circling the first area to the right, dropping down a hole to a slightly lower level, and fighting your way through tunnels full of hanging cocoons to reach the Pools of Shattered Jade Shrine.\n![Wukong UpperHollow 35.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/47/Wukong_UpperHollow_35.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game *Black Myth: Wukong*, showing the player character navigating a lush, dimly lit area with tall grass, a pond, and stone structures. A glowing marker, highlighted by a red circle, indicates an interactive or significant object near the water. This setting corresponds to the \"Pools of Shattered Jade Shrine\" in the Upper Hollow region, where players are directed to locate the optional boss, the Venom Daoist, as part of the guide's instructions for accessing Purple Cloud Mountain."
}