{
    "chunk_id": 932086664202,
    "source_file": "Webbed_Hollow_-_Middle_Hollow_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/87/Wukong_MiddleHollow_7.jpg",
    "alt_text": "Wukong MiddleHollow 7.jpg",
    "position_desc": 7,
    "img_above_text": "## Yaoguai Chief Miniboss Fight - Elder Amourworm\nWhile not a particularly challenging fight, the Elder Amourworm is a hefty foe that makes up for its lack of abilities with a few dirty tricks you'll need to be ready for, and also be stocked up on Antimiasma Medicine.",
    "img_below_text": "The Elder Amourworm sports a large creepy mask that you can see when it rears up, and it will use it to shoot out sticky threads in frontal arc. If you get caught, you'll have to mash to get out before being charged and attacked while unable to defend yourself.\n![Wukong MiddleHollow 8.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2f/Wukong_MiddleHollow_8.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Yaoguai Chief Miniboss Fight - Elder Amourworm\nWhile not a particularly challenging fight, the Elder Amourworm is a hefty foe that makes up for its lack of abilities with a few dirty tricks you'll need to be ready for, and also be stocked up on Antimiasma Medicine.\"\n        - Following Text: \"The Elder Amourworm sports a large creepy mask that you can see when it rears up, and it will use it to shoot out sticky threads in frontal arc. If you get caught, you'll have to mash to get out before being charged and attacked while unable to defend yourself.\n![Wukong MiddleHollow 8.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2f/Wukong_MiddleHollow_8.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the Elder Amourworm miniboss fight from *Black Myth: Wukong*. The scene shows the player character engaging the large, worm-like enemy in a dark, rocky environment filled with web-like textures and egg-like objects. The Elder Amourworm is using its sticky thread attack, which spreads in a frontal arc, as described in the accompanying text. The player's health and stamina bars, along with ability icons, are visible on the screen, emphasizing the combat mechanics."
}