{
    "chunk_id": 437215727080,
    "source_file": "Black_Wind_Cave_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/20/Wukong_BlackWind_22.jpg",
    "alt_text": "Wukong BlackWind 22.jpg",
    "position_desc": 20,
    "img_above_text": "## Outside the Cave\nAfter resting at the nearby Shrine, you can look for a small cliffside path below the shrine for a Snake-Head Mushroom, and then start your ascent to the top of the mountain.",
    "img_below_text": "Just ahead up the path, a Wolf Sentinel and two Wolf Archers will be ready to engage you, so lure the Sentinel back down the path first, and then deflect the arrows as you reach the two archers and deal with them. Just below their position, you can find a lower path with a green wisp Spirit to absorb for some Will.\n![Wukong BlackWind 23.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/67/Wukong_BlackWind_23.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Outside the Cave\nAfter resting at the nearby Shrine, you can look for a small cliffside path below the shrine for a Snake-Head Mushroom, and then start your ascent to the top of the mountain.\"\n        - Following Text: \"Just ahead up the path, a Wolf Sentinel and two Wolf Archers will be ready to engage you, so lure the Sentinel back down the path first, and then deflect the arrows as you reach the two archers and deal with them. Just below their position, you can find a lower path with a green wisp Spirit to absorb for some Will.\n![Wukong BlackWind 23.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/67/Wukong_BlackWind_23.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat encounter in *Black Myth: Wukong*, showing the player character engaged in battle on a forested path. Sparks fly as the character deflects incoming projectiles, likely arrows, while advancing toward enemies further up the trail. A lit brazier is visible on the right, adding to the atmospheric lighting. This scene aligns with the guide's description of facing a Wolf Sentinel and archers along the mountain path, emphasizing strategic combat and progression."
}