{
    "chunk_id": 878692435962,
    "source_file": "Yellow_Sand_Formation_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e3/Wukong_Yellow_71.jpg",
    "alt_text": "Wukong Yellow 71.jpg",
    "position_desc": 76,
    "img_above_text": "![Wukong Yellow 69.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b5/Wukong_Yellow_69.jpg)\nThe Yellow Wind Sage also has a tricky feint where he’ll appear to run past you, but then lunge back into a sliding swipe with his arm. If timed correctly, you can cast Rock Solid just as he lunges back after the feint, which will often knock him to the ground and let you get a decent amount of damage in as he struggles to get up.",
    "img_below_text": "Once he’s down to the last quarter of health, he’ll prepare another sandstorm and grab the head back from where it’s been floating up above. During this period he’ll also summon a sand tornado to move around the arena, which you’ll need to avoid at all costs — especially if the Wind Tamer hasn’t recharged enough to use it again.\n![Wukong Yellow 72.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b0/Wukong_Yellow_72.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Yellow 69.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b5/Wukong_Yellow_69.jpg)\nThe Yellow Wind Sage also has a tricky feint where he’ll appear to run past you, but then lunge back into a sliding swipe with his arm. If timed correctly, you can cast Rock Solid just as he lunges back after the feint, which will often knock him to the ground and let you get a decent amount of damage in as he struggles to get up.\"\n        - Following Text: \"Once he’s down to the last quarter of health, he’ll prepare another sandstorm and grab the head back from where it’s been floating up above. During this period he’ll also summon a sand tornado to move around the arena, which you’ll need to avoid at all costs — especially if the Wind Tamer hasn’t recharged enough to use it again.\n![Wukong Yellow 72.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b0/Wukong_Yellow_72.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat encounter with the Yellow Wind Sage, a boss in *Black Myth: Wukong*. The player character is engaged in battle within a sandy arena, showcasing the boss's imposing size and weaponry. The preceding text describes the boss's feint attack and suggests using the Rock Solid ability to counter it effectively, while the following text warns of the boss's sandstorm and tornado attacks as its health diminishes. The image visually supports the guide's strategic advice for this challenging fight."
}