{
    "chunk_id": 502614474287,
    "source_file": "Secrets_in_Black_Myth_Wukong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3b/Zodiac_Village_.png",
    "alt_text": "Zodiac Village .png",
    "position_desc": 11,
    "img_above_text": "* How to Find Cyan Loong\n## The Painted Realm and Zodiac Village",
    "img_below_text": "After riding the giant turtle to the Bitter Lake, you'll land on the North Shore. If you turn back on yourself and head up the beach toward the cabin, you'll find an NPC in the water. This is Chen Loong and if you fight him and then collect the tonic he wants from Xu Dog, he'll give the Ruyi Scroll. This takes you to a completely different area in the Painted Realm called Zodiac Village. This is a hub where a number of the NPCs you've met will go, and you can even **unlock the ability to upgrade armor**.\n### Relevant Guide Pages",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"* How to Find Cyan Loong\n## The Painted Realm and Zodiac Village\"\n        - Following Text: \"After riding the giant turtle to the Bitter Lake, you'll land on the North Shore. If you turn back on yourself and head up the beach toward the cabin, you'll find an NPC in the water. This is Chen Loong and if you fight him and then collect the tonic he wants from Xu Dog, he'll give the Ruyi Scroll. This takes you to a completely different area in the Painted Realm called Zodiac Village. This is a hub where a number of the NPCs you've met will go, and you can even **unlock the ability to upgrade armor**.\n### Relevant Guide Pages\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a detailed scene of a blacksmith working at a forge in a rustic outdoor setting, surrounded by tools and equipment. This visual likely represents a location or NPC in the game where players can interact to upgrade armor, as mentioned in the following text about Zodiac Village. The setting aligns with the game's theme of exploration and progression within the Painted Realm."
}