{
    "chunk_id": 206630782619,
    "source_file": "Celestial_Taiyi_Pill_Locations.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e8/Taiyi_Xu_Dog.jpg",
    "alt_text": "Taiyi Xu Dog.jpg",
    "position_desc": 3,
    "img_above_text": "## Xu-Dog Celestial Taiyi Pills\nXu-Dog Celestial Taiyi Pills",
    "img_below_text": "Fall down the sand slide after exploring the Crouching Tiger Temple Cellar to meet the Xu-Dog. The Xu-Dog crafts Celestial Medicines for you in exchange for Mind Cores. You can craft a total of nine Celestial Taiyi Pills with the Xu-Dog. You can find Mind Cores in chests or as loot for defeating particularly vicious foes.\n## The New West Celestial Taiyi Pill",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Xu-Dog Celestial Taiyi Pills\nXu-Dog Celestial Taiyi Pills\"\n        - Following Text: \"Fall down the sand slide after exploring the Crouching Tiger Temple Cellar to meet the Xu-Dog. The Xu-Dog crafts Celestial Medicines for you in exchange for Mind Cores. You can craft a total of nine Celestial Taiyi Pills with the Xu-Dog. You can find Mind Cores in chests or as loot for defeating particularly vicious foes.\n## The New West Celestial Taiyi Pill\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image shows a crafting menu for Celestial Medicines in a video game, specifically highlighting the \"Taiyi Pill.\" This item is described as a lesser celestial medicine that permanently and moderately increases Maximum Mana. Crafting the Taiyi Pill requires 360 Will and two Mind Cores, with a maximum of nine pills that can be made. The menu also displays the player's current stats and the changes that will occur upon using the item. The context suggests that the Xu-Dog character facilitates the crafting of such items in exchange for Mind Cores."
}