{
    "chunk_id": 834481146630,
    "source_file": "Violet_Spider.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/27/Wukong_LowerHollow_77.jpg",
    "alt_text": "Wukong LowerHollow 77.jpg",
    "position_desc": 6,
    "img_above_text": "When she goes into a frenzy of stamping down all of her legs quickly, she'll do so while spewing out poison in several directions. Try to stay one step ahead of her by keeping to her right side, and watch for her final talon stab at her front to your right, sending out another plume of poison, but leaving the rest of that area exposed to a counter attack.\nShe also has a nasty habit of rapidly twitching her body while standing still, only to suddenly pivot and slam her rear into you at full force, which can deal a ton of damage. Even if you're at range, expect webbing strands to fly out that you need to dodge or deflect with your staff spin.",
    "img_below_text": "One of her more insidious moves is another play on her webbing attack, where she'll laugh as she sends out strands from her back to slowly arc across the air and seek you out. She'll send these webbing strands out one after the other to try and both slow you down and also deal damage, ending with a huge wave of 12 projectiles in a large arc that all fly to you at once. If you're stuck trying to get out of her earlier webbing, you'll be a sitting duck, making evading the last salvo even harder.\n![Wukong LowerHollow 80.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2e/Wukong_LowerHollow_80.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"When she goes into a frenzy of stamping down all of her legs quickly, she'll do so while spewing out poison in several directions. Try to stay one step ahead of her by keeping to her right side, and watch for her final talon stab at her front to your right, sending out another plume of poison, but leaving the rest of that area exposed to a counter attack.\nShe also has a nasty habit of rapidly twitching her body while standing still, only to suddenly pivot and slam her rear into you at full force, which can deal a ton of damage. Even if you're at range, expect webbing strands to fly out that you need to dodge or deflect with your staff spin.\"\n        - Following Text: \"One of her more insidious moves is another play on her webbing attack, where she'll laugh as she sends out strands from her back to slowly arc across the air and seek you out. She'll send these webbing strands out one after the other to try and both slow you down and also deal damage, ending with a huge wave of 12 projectiles in a large arc that all fly to you at once. If you're stuck trying to get out of her earlier webbing, you'll be a sitting duck, making evading the last salvo even harder.\n![Wukong LowerHollow 80.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2e/Wukong_LowerHollow_80.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss battle against the \"Violet Spider\" in *Black Myth: Wukong*. The player character, wielding a fiery weapon, is engaged in combat within a web-covered cavern. The spider appears to be using its webbing-based attacks, as strands of web are visible in the air. The preceding and following text describe the spider's attack patterns, including poison spewing, webbing projectiles, and physical strikes, emphasizing the need for strategic evasion and counterattacks during this challenging encounter."
}