{
    "chunk_id": 288916849912,
    "source_file": "Bamboo_Grove_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/da/Wukong_Bamboo_6.jpg",
    "alt_text": "Wukong Bamboo 6.jpg",
    "position_desc": 6,
    "img_above_text": "To advance, keep heading up the stairway to cross the high bridge over the falls, where you’ll soon see the golden trail of a nearby shrine beckoning you left. Before making that turn, be sure to look to the right to find a small wooden gazebo with a small table, and open the small gold box on top to find a variety of medicines, including 2 **Tiger Subduing Pellets** , 1 **Evil Repelling Medicament** and 1 **Amplification Pellet**.\n## Snake Trail",
    "img_below_text": "As you reach the site of the Shrine, you’ll need to deal with an angry Crow Diviner who guards it (these types of enemies don’t respawn, thankfully). Be wary of their fast reverse blade swings and jumping claw kicks, and rest up after they’ve been defeated.\nThe main path lies up the stairs to the right, but be sure to look in the awning over to the left of the shrine first for some pots to break. Technically, you can find a big shortcut by simply jumping over the rocks to the nearby canyon stream, but there’s important things to find while taking the main route first.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"To advance, keep heading up the stairway to cross the high bridge over the falls, where you’ll soon see the golden trail of a nearby shrine beckoning you left. Before making that turn, be sure to look to the right to find a small wooden gazebo with a small table, and open the small gold box on top to find a variety of medicines, including 2 **Tiger Subduing Pellets** , 1 **Evil Repelling Medicament** and 1 **Amplification Pellet**.\n## Snake Trail\"\n        - Following Text: \"As you reach the site of the Shrine, you’ll need to deal with an angry Crow Diviner who guards it (these types of enemies don’t respawn, thankfully). Be wary of their fast reverse blade swings and jumping claw kicks, and rest up after they’ve been defeated.\nThe main path lies up the stairs to the right, but be sure to look in the awning over to the left of the shrine first for some pots to break. Technically, you can find a big shortcut by simply jumping over the rocks to the nearby canyon stream, but there’s important things to find while taking the main route first.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an intense combat encounter in a forested area, with the player character engaging an enemy illuminated by firelight. The scene aligns with the walkthrough's context, where players are navigating towards a shrine guarded by a Crow Diviner. The player appears to be using melee attacks, with visible health and ability indicators on the screen. This moment emphasizes the need for caution and preparation before advancing further along the Snake Trail."
}