{
    "chunk_id": 233900302619,
    "source_file": "Thunderbolt_Horn.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/33/Thunderbolt_Horn_1.jpg",
    "alt_text": "Thunderbolt Horn 1.jpg",
    "position_desc": 2,
    "img_above_text": "## Black Myth: Wukong Thunderbolt Horn Location\nThe Thunderbolt Horn is found at the Shen Monkey Vendor in Bamboo Grove \\- Marsh of White Mist Shrine in Black Wind Mountain after completing Chapter 2 - Yellow Wind Ridge. Simply visit him after starting Chapter 3 - The New West and you will be able to buy the Soak from him for 3600 Will.",
    "img_below_text": "Soaks are more common than the Drinks for your Gourds in the game. They are scattered throughout the chapters. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Black Myth: Wukong Thunderbolt Horn Location\nThe Thunderbolt Horn is found at the Shen Monkey Vendor in Bamboo Grove \\- Marsh of White Mist Shrine in Black Wind Mountain after completing Chapter 2 - Yellow Wind Ridge. Simply visit him after starting Chapter 3 - The New West and you will be able to buy the Soak from him for 3600 Will.\"\n        - Following Text: \"Soaks are more common than the Drinks for your Gourds in the game. They are scattered throughout the chapters. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image displays the in-game shop interface from *Black Myth: Wukong*, specifically highlighting the \"Thunderbolt Horn,\" an uncommon Soak item priced at 3600 Will. The item moderately increases Shock Resistance for a short duration when used with the gourd. This shop screen is likely part of a guide explaining where and how to acquire the Thunderbolt Horn, which becomes available at the Shen Monkey Vendor in Chapter 3 after completing Chapter 2."
}