{
    "chunk_id": 125827846310,
    "source_file": "Foothills_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e4/Foothills_Walkthrough_%2849%29.png",
    "alt_text": "Foothills Walkthrough \\(49\\).png",
    "position_desc": 37,
    "img_above_text": "![Foothills Walkthrough \\(46\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/87/Foothills_Walkthrough_%2846%29.png)\nWhen you can't use the Wandering Wight, you need to build focus quickly. Alternatively, just keep holding charge until you’ve built your focus up. If you’re building your focus up naturally, then it’s worth using Immobilize when it's ready again to get the Rhino to stand still so you'll have more chance of hitting your target. You don't want to waste your attacks in this, otherwise, you could be in for a lengthy fit.",
    "img_below_text": "Though you can do damage by hitting the Rhino in other areas, there’s little point in doing so unless you want the fight to last a long time. If you miss hitting the horn, you can still attack it. Avoid hitting its face and instead focus on hitting it from behind. This will annoy it, and it will buck to try and kick you with its back legs.\nBut if you’re holding charge to build it up, wait until the Rhino is coming toward you or pauses for a moment, and then unleash the attack. One of the best times to hit is when it's moving slowly, with sparks appearing around its horn.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Foothills Walkthrough \\(46\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/87/Foothills_Walkthrough_%2846%29.png)\nWhen you can't use the Wandering Wight, you need to build focus quickly. Alternatively, just keep holding charge until you’ve built your focus up. If you’re building your focus up naturally, then it’s worth using Immobilize when it's ready again to get the Rhino to stand still so you'll have more chance of hitting your target. You don't want to waste your attacks in this, otherwise, you could be in for a lengthy fit.\"\n        - Following Text: \"Though you can do damage by hitting the Rhino in other areas, there’s little point in doing so unless you want the fight to last a long time. If you miss hitting the horn, you can still attack it. Avoid hitting its face and instead focus on hitting it from behind. This will annoy it, and it will buck to try and kick you with its back legs.\nBut if you’re holding charge to build it up, wait until the Rhino is coming toward you or pauses for a moment, and then unleash the attack. One of the best times to hit is when it's moving slowly, with sparks appearing around its horn.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a battle scene from a video game, where a group of characters is engaged in combat with a large, armored rhino-like creature. The context provided suggests strategies for defeating this creature, emphasizing the importance of building focus and targeting specific areas, particularly the horn, to effectively damage it. The image visually supports the guide's advice on how to approach and attack the rhino, illustrating the intense and strategic nature of the encounter."
}