{
    "chunk_id": 338799461725,
    "source_file": "Chen_Loong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/09/Wukong_Bitter_3.jpg",
    "alt_text": "Wukong Bitter 3.jpg",
    "position_desc": 1,
    "img_above_text": "* **Rewards:** TBA\n## Where to Find Chen Loong",
    "img_below_text": "Chen Loong is an optional opponent who has their own quest, which you can find shortly after leaving Turtle Rock for the North Shore of the Bitter Lake. From the Shrine, head left while facing it to head along the lakeshore toward a lone shack by the water.\nSearch the shallows near this shack, and you'll find the old dragon wandering the waters, and will become hostile as you approach.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"* **Rewards:** TBA\n## Where to Find Chen Loong\"\n        - Following Text: \"Chen Loong is an optional opponent who has their own quest, which you can find shortly after leaving Turtle Rock for the North Shore of the Bitter Lake. From the Shrine, head left while facing it to head along the lakeshore toward a lone shack by the water.\nSearch the shallows near this shack, and you'll find the old dragon wandering the waters, and will become hostile as you approach.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character walking along a snowy lakeshore in a video game, heading toward a distant shack near the water. A red arrow highlights a specific area in the shallows, suggesting the location of Chen Loong, an optional opponent tied to a quest. The preceding and following text provides context for finding Chen Loong after leaving Turtle Rock and approaching the North Shore of the Bitter Lake."
}