{
    "chunk_id": 113045161979,
    "source_file": "Non-White_Spirit.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/91/Non-white_power.png",
    "alt_text": "Non-white power.png",
    "position_desc": 3,
    "img_above_text": "Non-White fights with a double-ended blade that deals ice damage. He can also cast ice spells with it that summon a trail of razor-sharp icicles to rise from the ground. The key to Non-White is anticipating his blows as he winds up and perfect dodging out of the way before they hit you. You could also consider taking some Body-Warming Powder into the fight with you to combat Chill.\n## Non-White Spirit",
    "img_below_text": "* **Bone Spikes**\n* Equipped Effect: Moderately increases Poison and Frost Damage.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Non-White fights with a double-ended blade that deals ice damage. He can also cast ice spells with it that summon a trail of razor-sharp icicles to rise from the ground. The key to Non-White is anticipating his blows as he winds up and perfect dodging out of the way before they hit you. You could also consider taking some Body-Warming Powder into the fight with you to combat Chill.\n## Non-White Spirit\"\n        - Following Text: \"* **Bone Spikes**\n* Equipped Effect: Moderately increases Poison and Frost Damage.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image showcases the \"Non-White Spirit\" from a video game, displayed in the Equipment menu under the \"Spirits\" section. This spirit has an \"Epic\" rarity and a high Qi cost. Its ability, \"Bone Spikes,\" allows the player to take the form of Non-White, performing spinning and leaping attacks that draw enemies in and deal damage with sprouting thorns. The equipped effect moderately increases Poison and Frost damage. The interface also includes a demo preview, stats, and the option to equip the spirit."
}