{
    "chunk_id": 602319468565,
    "source_file": "Black_Loong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1a/Wukong_BlackLoong_5.jpg",
    "alt_text": "Wukong BlackLoong 5.jpg",
    "position_desc": 13,
    "img_above_text": "![Wukong BlackLoong 9.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/85/Wukong_BlackLoong_9.jpg)\nAnother lengthy combo that can be hard to get away from will be when Black Loong starts to repeatedly pound the ground with alternate weapon slams, expelling electric blasts from each one. This can go on for up to nine slams, with the final attack being the one that causes the biggest explosion. If you try to interrupt him with Immobilize, be sure to follow up with a strong attack that can stagger, or he’ll simply keep the combo going.",
    "img_below_text": "If you spot the Black Loong raising his weapons high in a slow manner while they crackle to life, it’s a sign he’s going to bang them together slowly three times, causing explosions in the air that gradually increase in range. This is a good time to sprint to safety and use your medicines while you wait for the attack to end.\n![Wukong BlackLoong 7.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/68/Wukong_BlackLoong_7.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong BlackLoong 9.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/85/Wukong_BlackLoong_9.jpg)\nAnother lengthy combo that can be hard to get away from will be when Black Loong starts to repeatedly pound the ground with alternate weapon slams, expelling electric blasts from each one. This can go on for up to nine slams, with the final attack being the one that causes the biggest explosion. If you try to interrupt him with Immobilize, be sure to follow up with a strong attack that can stagger, or he’ll simply keep the combo going.\"\n        - Following Text: \"If you spot the Black Loong raising his weapons high in a slow manner while they crackle to life, it’s a sign he’s going to bang them together slowly three times, causing explosions in the air that gradually increase in range. This is a good time to sprint to safety and use your medicines while you wait for the attack to end.\n![Wukong BlackLoong 7.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/68/Wukong_BlackLoong_7.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dramatic moment during the battle against Black Loong in *Black Myth: Wukong*. It showcases an intense electric explosion, likely part of Black Loong's attack sequence described in the preceding text, where he pounds the ground repeatedly with weapon slams, generating electric blasts. The player's health and ability icons are visible, emphasizing the need for strategic movement and resource management during this challenging encounter."
}