{
    "chunk_id": 469895875087,
    "source_file": "New_Thunderclap_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/46/Wukong_Thunderclap_54.jpg",
    "alt_text": "Wukong Thunderclap 54.jpg",
    "position_desc": 53,
    "img_above_text": "Another attack he can perform while you engage him from the front will start when he bunches up his fists close to his body. He'll explode outward with a simultaneous punch and kick move, and then after a moment will follow up with two charging fist strikes while phased out, sending him forward several steps to pursue any backward evasions.\nOnce you learn to anticipate these attacks, you'll find it easier to outmaneuver him, and look for the best opening to expend your focus points and deal the most damage (doing so when he's Immobilized is also a good guarantee).",
    "img_below_text": "Similarly, any Transformation can deal good damage here, but be sure not to expend your final attack when he's phasing out, or you'll waste it entirely.\nWhen Non-Void finally falls to your assault, you'll be able to absorb the Non-Void Spirit.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Another attack he can perform while you engage him from the front will start when he bunches up his fists close to his body. He'll explode outward with a simultaneous punch and kick move, and then after a moment will follow up with two charging fist strikes while phased out, sending him forward several steps to pursue any backward evasions.\nOnce you learn to anticipate these attacks, you'll find it easier to outmaneuver him, and look for the best opening to expend your focus points and deal the most damage (doing so when he's Immobilized is also a good guarantee).\"\n        - Following Text: \"Similarly, any Transformation can deal good damage here, but be sure not to expend your final attack when he's phasing out, or you'll waste it entirely.\nWhen Non-Void finally falls to your assault, you'll be able to absorb the Non-Void Spirit.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat sequence against the \"Non-Void\" enemy in a video game. The player is utilizing various abilities, including \"Chop Wood\" (light attack), \"Blow Fire\" (heavy attack), and \"Fiery Burst\" (spell), which consume focus points and deal significant damage. The fiery explosion suggests the use of the \"Fiery Burst\" spell, which causes area damage and triggers de-transformation. The preceding and following text emphasize strategies for anticipating the enemy's attacks, exploiting openings, and dealing maximum damage, particularly when the enemy is immobilized or phased out. Upon defeating Non-Void, the player can absorb its spirit."
}