{
    "chunk_id": 979793993667,
    "source_file": "Snowhill_Path_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bc/Wukong_Snowhill_24.jpg",
    "alt_text": "Wukong Snowhill 24.jpg",
    "position_desc": 23,
    "img_above_text": "![Wukong Snowhill 23.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/51/Wukong_Snowhill_23.jpg)\nEntering the large temple complex, there's actually not as much to explore as you might think. A large open area to the right leads to a sealed building, but guarding it is a new enemy - the Yaksha Patroller.",
    "img_below_text": "These formidable foes are pretty beefy, and use their wicked weapons to throw at you like boomerangs from a distance. They can also string long combo attacks together, requiring you to interrupt one with a Rock Solid deflection or wait until their final leaping slash or delayed uppercut to retaliate.\nOnce the Patroller is down, you can find a green Wisp to absorb at the foot of the building to replenish your gourd, but there's not much else here.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Snowhill 23.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/51/Wukong_Snowhill_23.jpg)\nEntering the large temple complex, there's actually not as much to explore as you might think. A large open area to the right leads to a sealed building, but guarding it is a new enemy - the Yaksha Patroller.\"\n        - Following Text: \"These formidable foes are pretty beefy, and use their wicked weapons to throw at you like boomerangs from a distance. They can also string long combo attacks together, requiring you to interrupt one with a Rock Solid deflection or wait until their final leaping slash or delayed uppercut to retaliate.\nOnce the Patroller is down, you can find a green Wisp to absorb at the foot of the building to replenish your gourd, but there's not much else here.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat scene from *Black Myth: Wukong*, showcasing the protagonist engaged in battle with a Yaksha Patroller in a snowy environment near a temple complex. The Yaksha Patroller is mid-attack, while the protagonist appears to be evading or countering. The HUD displays health bars, abilities, and controls, emphasizing the game's action-oriented mechanics. This moment aligns with the walkthrough's description of encountering and defeating the Yaksha Patroller to progress in the area."
}