{
    "chunk_id": 276703973447,
    "source_file": "First_Prince_of_Flowing_Sands.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/55/Wukong_Sandgate_63.jpg",
    "alt_text": "Wukong Sandgate 63.jpg",
    "position_desc": 1,
    "img_above_text": "* Rewards: Arhat Hold Piece, Silk x2, Yarn x2, 1102 Experience, 1020 Will\n## Where to Find First Prince of Flowing Sands",
    "img_below_text": "While you can find the First Prince of Flowing Sands in the Valley of Despair beyond the Sandgate Village in Chapter 2's Yellow Wind Ridge. However, depending on how you deal with his father and brother - the King of Flowing Sands and Second Rat Prince - there are a few ways he can appear.\nIf you didn't kill the King during the previous fight and only defeated the Second Rat Prince, the King will have fled -- to this very area in fact. When you approach, he'll summon his son, but meet an untimely demise.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"* Rewards: Arhat Hold Piece, Silk x2, Yarn x2, 1102 Experience, 1020 Will\n## Where to Find First Prince of Flowing Sands\"\n        - Following Text: \"While you can find the First Prince of Flowing Sands in the Valley of Despair beyond the Sandgate Village in Chapter 2's Yellow Wind Ridge. However, depending on how you deal with his father and brother - the King of Flowing Sands and Second Rat Prince - there are a few ways he can appear.\nIf you didn't kill the King during the previous fight and only defeated the Second Rat Prince, the King will have fled -- to this very area in fact. When you approach, he'll summon his son, but meet an untimely demise.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from a video game where the player character, armed with a staff, is navigating a rocky, arid area with sparse vegetation. This location is likely the Valley of Despair, mentioned in the text, where the First Prince of Flowing Sands can be encountered. The setting and gameplay interface suggest the player is preparing for a potential encounter or battle, possibly influenced by prior choices involving the King of Flowing Sands and the Second Rat Prince."
}