{
    "chunk_id": 937070798694,
    "source_file": "Sandgate_Village_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/09/Wukong_Sandgate_38.jpg",
    "alt_text": "Wukong Sandgate 38.jpg",
    "position_desc": 36,
    "img_above_text": "![Wukong Sandgate 37.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c8/Wukong_Sandgate_37.jpg)\nHeading back down the hill towards the path at the bottom, be sure to stop by a lone shack far apart from the others. You’ll hear some whispering as you draw close, and a voice will speak out as you interact with the shack, telling you to go away for fear the two-headed Rat Captains will find them. Keep talking with the mysterious voice, and after you’ve rid the area of captains, they’ll thank you, and mention they may go off in search of the missing Third Prince somewhere in the West.",
    "img_below_text": "Heading to the left of the lone shack, you’ll find a gate guarded by a Rat Governor and another Archer on the rooftops that connects to the one you climbed earlier. Defeat them to gain access to a large open field inside the Village’s main area. From across the field, a voice pleading to be freed calls out, but in your way is a large loping creature that will want to engage you first.\n### Yaoguai Chief Mini-Boss Fight - Earth Wolf",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Sandgate 37.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c8/Wukong_Sandgate_37.jpg)\nHeading back down the hill towards the path at the bottom, be sure to stop by a lone shack far apart from the others. You’ll hear some whispering as you draw close, and a voice will speak out as you interact with the shack, telling you to go away for fear the two-headed Rat Captains will find them. Keep talking with the mysterious voice, and after you’ve rid the area of captains, they’ll thank you, and mention they may go off in search of the missing Third Prince somewhere in the West.\"\n        - Following Text: \"Heading to the left of the lone shack, you’ll find a gate guarded by a Rat Governor and another Archer on the rooftops that connects to the one you climbed earlier. Defeat them to gain access to a large open field inside the Village’s main area. From across the field, a voice pleading to be freed calls out, but in your way is a large loping creature that will want to engage you first.\n### Yaoguai Chief Mini-Boss Fight - Earth Wolf\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat scene from the video game *Black Myth: Wukong*, showing the player character engaged in a battle near a wooden gate. The character wields a glowing staff and is mid-action, suggesting an intense fight. This moment aligns with the walkthrough's description of encountering enemies, such as the Rat Governor and an Archer, while progressing toward the Village’s main area. The setting features a rustic, overgrown environment with a focus on dynamic combat mechanics."
}