{
    "chunk_id": 459564396586,
    "source_file": "Mad_Tiger.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/dc/Wukong_MadTiger_16.jpg",
    "alt_text": "Wukong MadTiger 16.jpg",
    "position_desc": 13,
    "img_above_text": "![Wukong MadTiger 15.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bd/Wukong_MadTiger_15.jpg)\nAfter beating on him for bit, you may sometimes hear him yell out in anger, which will be a quick tell that he’s about to perform an ear-shattering roar that can damage you if you’re near him, and will also cause rocks to fall from the ceiling onto you, and will require quick thinking to avoid.",
    "img_below_text": "In this rage-filled state, he’ll unleash even more leaping attacks, like a foot-first jump ending in a slam with his right arm, before spiraling upward with another rising claw swipe as he propels himself into the air, and back down onto you for a huge slam that will shatter the earth around the point of impact.\n![Wukong MadTiger 17.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/05/Wukong_MadTiger_17.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong MadTiger 15.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bd/Wukong_MadTiger_15.jpg)\nAfter beating on him for bit, you may sometimes hear him yell out in anger, which will be a quick tell that he’s about to perform an ear-shattering roar that can damage you if you’re near him, and will also cause rocks to fall from the ceiling onto you, and will require quick thinking to avoid.\"\n        - Following Text: \"In this rage-filled state, he’ll unleash even more leaping attacks, like a foot-first jump ending in a slam with his right arm, before spiraling upward with another rising claw swipe as he propels himself into the air, and back down onto you for a huge slam that will shatter the earth around the point of impact.\n![Wukong MadTiger 17.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/05/Wukong_MadTiger_17.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an intense battle scene from *Black Myth: Wukong*, showcasing the \"Mad Tiger\" boss mid-attack in a dimly lit cavern. The tiger-like creature is leaping aggressively toward the player character, surrounded by fiery effects and debris. The health bar labeled \"Mad Tiger\" is visible, indicating the ongoing fight. The preceding and following text describe the boss's rage-induced attacks, including a roar that causes falling rocks and devastating leaping slams, emphasizing the need for quick reflexes and strategic movement during this encounter."
}