{
    "chunk_id": 715950199751,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e6/Wukong_Wolves_2.jpg",
    "alt_text": "Wukong Wolves 2.jpg",
    "position_desc": 10,
    "img_above_text": "![Wukong Wolves 1.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b2/Wukong_Wolves_1.jpg)\nThese basic enemies, the Wolf Scout and Wolf Swornsword, are perfect for getting a feel for some real combat. They tend to attack fairly slowly and draw out their sword slices giving you ample time to dodge even while using light combo attacks.",
    "img_below_text": "Since the Destined One can dodge mid-attack, you should press your offense while dealing with these foes, and watch their movements to find the right time to leap out of the way. Your light combo attack comes in four sustained attacks, culminating in a strong overhead slam when performed uninterrupted.\nDefeating each of them will earn you a fair bit of Experience - seen by the yellow bar in the top right corner, as well as a bit of “**Will** ”, which serves as a form of currency. Given that you’ll need both to succeed in your adventure, it’s usually best to take on enemies you encounter rather than running past them.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Wolves 1.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b2/Wukong_Wolves_1.jpg)\nThese basic enemies, the Wolf Scout and Wolf Swornsword, are perfect for getting a feel for some real combat. They tend to attack fairly slowly and draw out their sword slices giving you ample time to dodge even while using light combo attacks.\"\n        - Following Text: \"Since the Destined One can dodge mid-attack, you should press your offense while dealing with these foes, and watch their movements to find the right time to leap out of the way. Your light combo attack comes in four sustained attacks, culminating in a strong overhead slam when performed uninterrupted.\nDefeating each of them will earn you a fair bit of Experience - seen by the yellow bar in the top right corner, as well as a bit of “**Will** ”, which serves as a form of currency. Given that you’ll need both to succeed in your adventure, it’s usually best to take on enemies you encounter rather than running past them.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts combat gameplay from *Black Myth: Wukong*, showcasing the player character engaging two wolf-like enemies in a forested area. The preceding and following text highlights these enemies, the Wolf Scout and Wolf Swornsword, as introductory foes ideal for practicing dodging and light combo attacks. The image reinforces the narrative role of these enemies as a source of experience points and \"Will\" currency, encouraging players to confront them rather than avoid combat. Visual elements include health bars, a stamina-like meter, and an action icon in the bottom corners, emphasizing the game's mechanics."
}