{
    "chunk_id": 162709508959,
    "source_file": "Gore-Eye_Daoist.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/dc/Wukong_Yellow_46.jpg",
    "alt_text": "Wukong Yellow 46.jpg",
    "position_desc": 8,
    "img_above_text": "![Wukong Yellow 45.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/54/Wukong_Yellow_45.jpg)\nThe most annoying part will be when he hunches over and starts to mumble. Lines of red will start appearing from the eyes on his back toward each of the blood pools he’s created, and will essentially suck the pools back in and regenerate a portion of health. Stop him the moment you see this with a well timed Immobilize, or try a Spirit with a mighty attack to stagger him out of it, otherwise the fight will just go on longer.",
    "img_below_text": "Try to keep him boxed in if possible — getting his back stuck to a wall can severely limit how much blood he can expel from his eyeballs, and stop the projectiles from seeking you out. Use stunning, staggering, and heavy hits to keep him off-balance and unable to cast his spells, and he’ll fall before long.\n![Wukong Yellow 47.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d8/Wukong_Yellow_47.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Yellow 45.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/54/Wukong_Yellow_45.jpg)\nThe most annoying part will be when he hunches over and starts to mumble. Lines of red will start appearing from the eyes on his back toward each of the blood pools he’s created, and will essentially suck the pools back in and regenerate a portion of health. Stop him the moment you see this with a well timed Immobilize, or try a Spirit with a mighty attack to stagger him out of it, otherwise the fight will just go on longer.\"\n        - Following Text: \"Try to keep him boxed in if possible — getting his back stuck to a wall can severely limit how much blood he can expel from his eyeballs, and stop the projectiles from seeking you out. Use stunning, staggering, and heavy hits to keep him off-balance and unable to cast his spells, and he’ll fall before long.\n![Wukong Yellow 47.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d8/Wukong_Yellow_47.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight against the \"Gore-Eye Daoist\" in *Black Myth: Wukong*. The boss is surrounded by red blood pools, which are a key mechanic in the fight as they allow him to regenerate health if not interrupted. The on-screen prompts suggest using specific attacks, such as \"Earth Shatter\" and \"Mountain Splitter,\" to deal damage and potentially stagger the boss. The preceding and following text emphasize strategies to prevent the boss from healing and to keep him off-balance for a quicker victory."
}