{
    "chunk_id": 39266787705,
    "source_file": "Man-in-Stone_Questline.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/63/Wukong_Fright_28.jpg",
    "alt_text": "Wukong Fright 28.jpg",
    "position_desc": 6,
    "img_above_text": "At the end of the cave path, you’ll find the object of the Man-in-Stone’s quest - an even larger statue embedded with shining blue crystals. Don’t get too enraptured that you miss a Poisestone along the walls trying to ambush you, though.\n### Yaoguai Chief Miniboss - Mother of Stone",
    "img_below_text": "This boss battle is an interesting one, simply because the giant crystal-embedded statue known as the Mother of Stone doesn’t actually fight you. It doesn’t really move at all, but it has a lot of health to slowly chip through.\n![Wukong Fright 29.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/ff/Wukong_Fright_29.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"At the end of the cave path, you’ll find the object of the Man-in-Stone’s quest - an even larger statue embedded with shining blue crystals. Don’t get too enraptured that you miss a Poisestone along the walls trying to ambush you, though.\n### Yaoguai Chief Miniboss - Mother of Stone\"\n        - Following Text: \"This boss battle is an interesting one, simply because the giant crystal-embedded statue known as the Mother of Stone doesn’t actually fight you. It doesn’t really move at all, but it has a lot of health to slowly chip through.\n![Wukong Fright 29.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/ff/Wukong_Fright_29.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a gameplay moment from *Black Myth: Wukong*, showcasing the encounter with the miniboss \"Mother of Stone.\" The large crystal-embedded statue is central to the scene, surrounded by glowing blue shards and effects. The health bar labeled \"Mother of Stones\" indicates the player's progress in chipping away at its high health. The preceding and following text clarify that the statue does not actively fight or move, making this a unique boss battle focused on endurance and strategy."
}