{
    "chunk_id": 791856727206,
    "source_file": "New_Thunderclap_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e1/Wukong_Thunderclap_97.jpg",
    "alt_text": "Wukong Thunderclap 97.jpg",
    "position_desc": 96,
    "img_above_text": "### Floating Sculpture\nYellowbrow will then scoop you out of the sack and place your tiny form into his Floating Sculpture with all his other \"disciples\".",
    "img_below_text": "In this new transformed state, you'll have little else to do but slash through all of the figures that try to oppose you.\nThe good news in all of this is you'll be pretty unstoppable in this mode. Your light attacks will unleash a flurry of wide sweep attacks, and your heavy strike will perform his spinning slash move.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"### Floating Sculpture\nYellowbrow will then scoop you out of the sack and place your tiny form into his Floating Sculpture with all his other \"disciples\".\"\n        - Following Text: \"In this new transformed state, you'll have little else to do but slash through all of the figures that try to oppose you.\nThe good news in all of this is you'll be pretty unstoppable in this mode. Your light attacks will unleash a flurry of wide sweep attacks, and your heavy strike will perform his spinning slash move.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dark, atmospheric scene within a narrow, ornate corridor filled with statues and carvings, likely representing the \"Floating Sculpture\" mentioned in the preceding text. A transformed character is shown mid-combat, wielding a glowing weapon and performing a dynamic attack against an opponent. The setting emphasizes the eerie and mystical tone of the narrative, aligning with the player's newly acquired, powerful combat abilities described in the following text. The on-screen text, \"All conditioned things are impermanent and lead astray,\" reinforces the game's philosophical undertones."
}