{
    "chunk_id": 582538025802,
    "source_file": "Gore-Eye_Daoist_Spirit.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b6/Gore_eye_power.png",
    "alt_text": "Gore eye power.png",
    "position_desc": 3,
    "img_above_text": "The Gore-Eye Daoist can also shoot solidified shards of blood at you from its many eyeballs, inflicting poison damage on impact. In addition to that, there is another staff slam move that the Gore-Eye Daoist does that releases a shock wave over the arena. There is a lot to contend with here. Take some Antimiasma Powder before you head into the fight, and don't skimp on your Immobilize or A Pluck of Many spells.\n## Gore-Eye Daoist Spirit",
    "img_below_text": "* **Raging Blood**\n* Equipped Effect: Moderately increases Maximum Mana.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Gore-Eye Daoist can also shoot solidified shards of blood at you from its many eyeballs, inflicting poison damage on impact. In addition to that, there is another staff slam move that the Gore-Eye Daoist does that releases a shock wave over the arena. There is a lot to contend with here. Take some Antimiasma Powder before you head into the fight, and don't skimp on your Immobilize or A Pluck of Many spells.\n## Gore-Eye Daoist Spirit\"\n        - Following Text: \"* **Raging Blood**\n* Equipped Effect: Moderately increases Maximum Mana.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image displays the equipment menu of a video game, specifically showcasing the \"Gore-Eye Daoist Spirit,\" categorized as an Epic Spirit. The description highlights its ability, \"Raging Blood,\" which allows the player to take the form of the Gore-Eye Daoist, enhancing attacks when staying within the glow of its staff. The staff, topped with a crimson-glowing toad, vanishes after a while. The equipped effect moderately increases Maximum Mana. The menu also provides options to equip, watch a demo, and view stats related to the character."
}