{
    "chunk_id": 610821468379,
    "source_file": "Woods_of_Ember_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5e/Woods_Ember_Walkthrough_%2837%29.png",
    "alt_text": "Woods Ember Walkthrough \\(37\\).png",
    "position_desc": 19,
    "img_above_text": "Instead of finding him wherever you left him kneeling, you'll now see him by the edge of the cliff. As you come back down the stairs to the area where you fought him, you'll see a small set opposite with two Buddha statues on either side. Go up these and to the left, to find him overlooking the mountain. Talk to him and exhaust any new dialogue.\n## Camp of Seasons",
    "img_below_text": "From the Camp of Seasons Keeper's Shrine go left and cross the bridge. On the other side of it is an archer, so be prepared to dodge its attacks or use Cloudstep to get across undisturbed.\n![Woods Ember Walkthrough .png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/46/Woods_Ember_Walkthrough_.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Instead of finding him wherever you left him kneeling, you'll now see him by the edge of the cliff. As you come back down the stairs to the area where you fought him, you'll see a small set opposite with two Buddha statues on either side. Go up these and to the left, to find him overlooking the mountain. Talk to him and exhaust any new dialogue.\n## Camp of Seasons\"\n        - Following Text: \"From the Camp of Seasons Keeper's Shrine go left and cross the bridge. On the other side of it is an archer, so be prepared to dodge its attacks or use Cloudstep to get across undisturbed.\n![Woods Ember Walkthrough .png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/46/Woods_Ember_Walkthrough_.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a narrow, weathered wooden bridge stretching across a rocky chasm toward a dark cave entrance. A humanoid figure is visible at the far end of the bridge, standing near the cave. The surrounding environment is rugged and desolate, with barren trees and steep cliffs. Based on the context, this scene appears to be part of the \"Camp of Seasons\" area in the game, serving as a transitional path or encounter location, possibly involving an archer as mentioned in the following text."
}