{
    "chunk_id": 365631526195,
    "source_file": "Black_Wind_Cave_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d8/Wukong_BlackWind_24.jpg",
    "alt_text": "Wukong BlackWind 24.jpg",
    "position_desc": 22,
    "img_above_text": "Nearby you’ll find a large wooden bridge area leading to ruins with an overwhelming amount of Wolf Archers backing up some more Wolf Sentinels. This is the perfect opportunity to employ your new Cloud Strike. Vanish away as you approach them, and in your mist form, race up and head left to find a path up to the high roof where the top archer is.\nAmbush him, and ignore the hulking brute for a moment as you dive back down to attack the other Wolf Archers from behind. Once all are cleared out, return to the long wooden walkway area.",
    "img_below_text": "If you look just to the left of this wooden walkway before the ruins, you can spot a small wooden plank leading off to an area where a Wolf Assassin is waiting in the shadows. Unlike the other assassins you fought in the cave, this one is a lot stronger than the rest, and his evasive maneuvers can make him hard to pin down.\n![Wukong BlackWind 25.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3d/Wukong_BlackWind_25.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Nearby you’ll find a large wooden bridge area leading to ruins with an overwhelming amount of Wolf Archers backing up some more Wolf Sentinels. This is the perfect opportunity to employ your new Cloud Strike. Vanish away as you approach them, and in your mist form, race up and head left to find a path up to the high roof where the top archer is.\nAmbush him, and ignore the hulking brute for a moment as you dive back down to attack the other Wolf Archers from behind. Once all are cleared out, return to the long wooden walkway area.\"\n        - Following Text: \"If you look just to the left of this wooden walkway before the ruins, you can spot a small wooden plank leading off to an area where a Wolf Assassin is waiting in the shadows. Unlike the other assassins you fought in the cave, this one is a lot stronger than the rest, and his evasive maneuvers can make him hard to pin down.\n![Wukong BlackWind 25.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3d/Wukong_BlackWind_25.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player-controlled character, likely the protagonist, running across a wooden walkway toward a staircase leading to ruins. A red arrow highlights a small wooden plank to the left of the walkway, suggesting an alternate path. This area is described in the guide as leading to a hidden Wolf Assassin encounter, emphasizing exploration and preparation for a challenging fight."
}