{
    "chunk_id": 468059949400,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/76/Wukong_Wolves_38.jpg",
    "alt_text": "Wukong Wolves 38.jpg",
    "position_desc": 44,
    "img_above_text": "![Wukong Wolves 36.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/46/Wukong_Wolves_36.jpg)\nAnother scary move that may take a bit of practice to understand is his pogo jump: Watch for him to raise his weapon high and vertical over his head before slamming it down, and then somersaulting forward in quick succession to bounce off the ground off his weapon. After a short pause, he’ll leap up to slam down for a third attack, and then even higher up for one last pogo slam explosion. With the last two attacks being spaced out, stand your ground to wait for the drop to dodge around, and cast Immobilize once he’s grounded to pin him down while you unleash your attacks.",
    "img_below_text": "At range, he can still be a major problem as you learn his moves, as he can strike from a distance with very little warning. If you see him somersault backward and out of range of your strikes, don’t blindly rush in. He’ll pause for a moment, and then toss his twinblade at you like a boomerang that requires dodging as it spins toward you, and back to his hand.\n![Wukong Wolves 37.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2f/Wukong_Wolves_37.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Wolves 36.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/46/Wukong_Wolves_36.jpg)\nAnother scary move that may take a bit of practice to understand is his pogo jump: Watch for him to raise his weapon high and vertical over his head before slamming it down, and then somersaulting forward in quick succession to bounce off the ground off his weapon. After a short pause, he’ll leap up to slam down for a third attack, and then even higher up for one last pogo slam explosion. With the last two attacks being spaced out, stand your ground to wait for the drop to dodge around, and cast Immobilize once he’s grounded to pin him down while you unleash your attacks.\"\n        - Following Text: \"At range, he can still be a major problem as you learn his moves, as he can strike from a distance with very little warning. If you see him somersault backward and out of range of your strikes, don’t blindly rush in. He’ll pause for a moment, and then toss his twinblade at you like a boomerang that requires dodging as it spins toward you, and back to his hand.\n![Wukong Wolves 37.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2f/Wukong_Wolves_37.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat scene from *Black Myth: Wukong*, showcasing the player character engaged in a fiery attack against an enemy named \"Guangzhi,\" as indicated by the health bar. The preceding and following text describes the enemy's complex attack patterns, including a pogo jump and ranged twinblade strikes, emphasizing the need for strategic dodging and counterattacks. The visual highlights the intense and dynamic nature of the battle, with fire effects and a dark, forested environment adding to the dramatic atmosphere."
}