{
    "chunk_id": 846550921655,
    "source_file": "Village_of_Lanxi_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f6/Wukong_Lanxi_32.jpg",
    "alt_text": "Wukong Lanxi 32.jpg",
    "position_desc": 30,
    "img_above_text": "There's a large pit in the middle of this courtyard, but before you follow Zhu Bajie down, check the large altar on the other side of the pit, and you'll be able to claim a **Celestial Jade Lotus Pill** to increase your maximum health!\nThe Webbed Hollow Celestial Jade Lotus Pill",
    "img_below_text": "When you're ready to move to the next area, jump into the pit, only to find yourself taking a one way trip down to the true **Webbed Hollow** of this realm.\nVillage of Lanxi Complete",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"There's a large pit in the middle of this courtyard, but before you follow Zhu Bajie down, check the large altar on the other side of the pit, and you'll be able to claim a **Celestial Jade Lotus Pill** to increase your maximum health!\nThe Webbed Hollow Celestial Jade Lotus Pill\"\n        - Following Text: \"When you're ready to move to the next area, jump into the pit, only to find yourself taking a one way trip down to the true **Webbed Hollow** of this realm.\nVillage of Lanxi Complete\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from a video game where the player is instructed to jump into a large pit in a courtyard to proceed to the next area, known as the Webbed Hollow. Before doing so, players are advised to explore the altar on the opposite side of the pit to obtain a Celestial Jade Lotus Pill, which increases maximum health. The image serves as a visual guide for navigating this part of the game."
}