{
    "chunk_id": 516835394864,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/ac/Wukong_Fright_27.jpg",
    "alt_text": "Wukong Fright 27.jpg",
    "position_desc": 28,
    "img_above_text": "![Wukong Fright 26.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/11/Wukong_Fright_26.jpg)\nYou’ll soon be ambushed by another Poisestone nearby, but this one is wreathed in blue flames and is much stronger. On the plus side, defeating it will earn you the Poisestone Spirit to transform into!",
    "img_below_text": "At the end of the cave path, you’ll find the object of the Man-in-Stone’s quest - an even larger statue embedded with shining blue crystals. Don’t get too enraptured that you miss a Poisestone along the walls trying to ambush you, though.\n### The Fifth Buddha’s Eyeball",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Fright 26.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/11/Wukong_Fright_26.jpg)\nYou’ll soon be ambushed by another Poisestone nearby, but this one is wreathed in blue flames and is much stronger. On the plus side, defeating it will earn you the Poisestone Spirit to transform into!\"\n        - Following Text: \"At the end of the cave path, you’ll find the object of the Man-in-Stone’s quest - an even larger statue embedded with shining blue crystals. Don’t get too enraptured that you miss a Poisestone along the walls trying to ambush you, though.\n### The Fifth Buddha’s Eyeball\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from *Black Myth: Wukong*, showing the protagonist approaching a large rock formation embedded with glowing blue crystals. This environment aligns with the walkthrough's description of a cave path containing Poisestones and blue crystal formations. The preceding text mentions an ambush by a stronger Poisestone wreathed in blue flames, while the following text warns of another Poisestone ambush near a larger statue with shining blue crystals. The image likely illustrates the setting for these encounters."
}