{
    "chunk_id": 839622245112,
    "source_file": "Village_of_Lanxi_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5d/Wukong_Lanxi_9.jpg",
    "alt_text": "Wukong Lanxi 9.jpg",
    "position_desc": 9,
    "img_above_text": "Once they've been defeated, look for some stairs left of the lantern decorations, and head to the lower level. There's many more green Wisps to absorb, so long as you take out the other Lantern Holder creating more dangerous wisps of his own.\nAt the end of this lower path with the five green Wisps scattered about, there's a innocuous looking chest sitting in front of a small shack, but when you try to claim it, you'll be ambushed by a swarm of small Stone Spiders.",
    "img_below_text": "These little enemies are surprisingly durable, and can often come in waves. You'll really need to keep a close eye on them -- if you spot them begin to vibrate rapidly, they'll all explode at once, and getting hit by several exploding spiders can deal a ton of damage if you aren't paying attention.\nOnce all the waves of Stone Spiders are dealt with, loot the **Treasure Chest** for a Blood of the Iron Bull and some random materials.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Once they've been defeated, look for some stairs left of the lantern decorations, and head to the lower level. There's many more green Wisps to absorb, so long as you take out the other Lantern Holder creating more dangerous wisps of his own.\nAt the end of this lower path with the five green Wisps scattered about, there's a innocuous looking chest sitting in front of a small shack, but when you try to claim it, you'll be ambushed by a swarm of small Stone Spiders.\"\n        - Following Text: \"These little enemies are surprisingly durable, and can often come in waves. You'll really need to keep a close eye on them -- if you spot them begin to vibrate rapidly, they'll all explode at once, and getting hit by several exploding spiders can deal a ton of damage if you aren't paying attention.\nOnce all the waves of Stone Spiders are dealt with, loot the **Treasure Chest** for a Blood of the Iron Bull and some random materials.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character battling small Stone Spiders near a glowing treasure chest in a forested area. This scene aligns with the preceding and following text, where the player is ambushed by waves of durable Stone Spiders upon approaching the chest. The player must defeat the spiders to safely loot the chest, which contains valuable items like Blood of the Iron Bull and random materials."
}