{
    "chunk_id": 900123674225,
    "source_file": "Black_Wind_Cave_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/32/Wukong_BlackWind_8.jpg",
    "alt_text": "Wukong BlackWind 8.jpg",
    "position_desc": 7,
    "img_above_text": "## Yaoguai King Boss Fight - Black Wind King\nThe self-imposed King of the Black Wind Mountain has been waiting for you, and though he’s only facing you now in his human form, he’s got a lot of powerful attacks to watch out for.",
    "img_below_text": "The Black Wind King will start the fight with a jumping spear thrust, pausing in mid-air briefly before lunging forward, and powering his spear with the Black Wind to throw it into the ground in front of him as he lands.\nHe’ll often follow this jumping attack with two spins of his spear until it lands behind him, and give you a big opportunity to commence an attack of your own as he recovers from the move.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Yaoguai King Boss Fight - Black Wind King\nThe self-imposed King of the Black Wind Mountain has been waiting for you, and though he’s only facing you now in his human form, he’s got a lot of powerful attacks to watch out for.\"\n        - Following Text: \"The Black Wind King will start the fight with a jumping spear thrust, pausing in mid-air briefly before lunging forward, and powering his spear with the Black Wind to throw it into the ground in front of him as he lands.\nHe’ll often follow this jumping attack with two spins of his spear until it lands behind him, and give you a big opportunity to commence an attack of your own as he recovers from the move.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the boss fight against the Black Wind King, a key encounter in the game. The boss, in his human form, is shown mid-air performing a jumping spear thrust attack, with dark energy emanating from his weapon. The player character is positioned below, preparing to react. The setting is an outdoor area with traditional architecture, lit by fire pits, and surrounded by foliage. This moment aligns with the description of the Black Wind King's opening attack sequence in the guide."
}