{
    "chunk_id": 391198717651,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/cb/Furnace_Valley_Walkthrough_%2889%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(89\\).png",
    "position_desc": 48,
    "img_above_text": "![Furnace Valley Walkthrough \\(86\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f7/Furnace_Valley_Walkthrough_%2886%29.png)\nHe will start to attack using white projectiles, which can be dodged or outrun. When you've got his health down to around 60-70%, he will use the white and black orbs to summon undead enemies.",
    "img_below_text": "The white revenants are large enemies with clubs, while the black revenants are archers. These are the ones you want to target, as their ranged attacks can be annoying and do the most damage. Clear these revenants out as quickly as possible, to get it back to a fight against just the Keeper of the Flaming Mountains.\nWhen you've got his health down to around 30%, Zhu Bajie will leave you to take him on one-on-one. The aim is still to just attack normally to get his health bar down quickly.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Furnace Valley Walkthrough \\(86\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f7/Furnace_Valley_Walkthrough_%2886%29.png)\nHe will start to attack using white projectiles, which can be dodged or outrun. When you've got his health down to around 60-70%, he will use the white and black orbs to summon undead enemies.\"\n        - Following Text: \"The white revenants are large enemies with clubs, while the black revenants are archers. These are the ones you want to target, as their ranged attacks can be annoying and do the most damage. Clear these revenants out as quickly as possible, to get it back to a fight against just the Keeper of the Flaming Mountains.\nWhen you've got his health down to around 30%, Zhu Bajie will leave you to take him on one-on-one. The aim is still to just attack normally to get his health bar down quickly.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a tense moment from the \"Black Myth: Wukong\" video game, likely during the battle against the Keeper of the Flaming Mountains. It shows a reflective, ethereal battlefield with two figures: one wielding a bow and crouching, and the other standing with a club. This scene aligns with the guide's description of the fight involving revenants (white and black), where the player must prioritize ranged enemies like the archer to simplify the encounter. The atmospheric setting emphasizes the intensity and otherworldly nature of the fight."
}