{
    "chunk_id": 74311960433,
    "source_file": "Turtle_Tear.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/ff/Wukong_Bitter_44.jpg",
    "alt_text": "Wukong Bitter 44.jpg",
    "position_desc": 2,
    "img_above_text": "![Wukong Bitter 33.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/52/Wukong_Bitter_33.jpg)\nInteract with this skeleton to spawn the Soak back on the shoreline by Turtle Island.",
    "img_below_text": "Soaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Bitter 33.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/52/Wukong_Bitter_33.jpg)\nInteract with this skeleton to spawn the Soak back on the shoreline by Turtle Island.\"\n        - Following Text: \"Soaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a snowy shoreline environment in *Black Myth: Wukong*, where the player character, Wukong, is navigating the terrain with a staff. A glowing green aura near the shoreline suggests an interactive element, likely tied to the preceding text's mention of spawning a \"Soak\" by interacting with a skeleton. This area appears to be part of a guide for locating resources or progressing in the game."
}