{
    "chunk_id": 616301833865,
    "source_file": "Golden_Loong_Staff.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0d/Wukong_Turtle_25.jpg",
    "alt_text": "Wukong Turtle 25.jpg",
    "position_desc": 2,
    "img_above_text": "## Black Myth: Wukong Golden Loong Staff Location\nThe Golden Loong Staff can be found in Chapter 3 - The New West upon defeating Cyan Loong. This is an optional boss on Turtle Island which requires the Loong Scales.",
    "img_below_text": "Weapons can be crafted throughout the game from the Shrines throughout the game's six chapters. Crafting weapons will require Will and various Crafting Materials from the game's locales and enemies. To craft the Golden Loong Staff you will need:\n* 1 Mountain-Shaking Claw",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Black Myth: Wukong Golden Loong Staff Location\nThe Golden Loong Staff can be found in Chapter 3 - The New West upon defeating Cyan Loong. This is an optional boss on Turtle Island which requires the Loong Scales.\"\n        - Following Text: \"Weapons can be crafted throughout the game from the Shrines throughout the game's six chapters. Crafting weapons will require Will and various Crafting Materials from the game's locales and enemies. To craft the Golden Loong Staff you will need:\n* 1 Mountain-Shaking Claw\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts gameplay from *Black Myth: Wukong*, showcasing a battle against Cyan Loong, an optional boss located on Turtle Island in Chapter 3 - The New West. Defeating Cyan Loong is necessary to obtain the Golden Loong Staff. The snowy environment and visible health bar emphasize the intense combat encounter, which plays a key role in progressing toward crafting the weapon using specific materials."
}