{
    "chunk_id": 559923959428,
    "source_file": "Yellow_Sand_Formation_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fd/Wukong_Yellow_54.jpg",
    "alt_text": "Wukong Yellow 54.jpg",
    "position_desc": 61,
    "img_above_text": "![Wukong Yellow 53.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9c/Wukong_Yellow_53.jpg)\nOne of his bigger attacks with a slow startup involves him performing a backhanded swing where he spins around first. Watch his movements, and you’ll be able to go Rock Solid to parry this move and stagger him, opening up to a large counter attack!",
    "img_below_text": "However, attacking from the front can often prove dangerous, as you don’t want to drain all your stamina and run out of juice for dodging. He can often lure you in, and then stab his imbued weapon down right in front of him. Don’t dodge backward but instead flee to the sides, as the impact will create a line of smaller spears from the sand itself that erupt in a straight line from the point of impact.\nYou can get in a few strikes after dodging this stab, but save your heavy attack, as the Yellow Wind Sage will usually follow this up by a jumping stomp attack to create a shockwave around him. This will leave him open for a strong heavy hit and follow up attacks.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Yellow 53.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9c/Wukong_Yellow_53.jpg)\nOne of his bigger attacks with a slow startup involves him performing a backhanded swing where he spins around first. Watch his movements, and you’ll be able to go Rock Solid to parry this move and stagger him, opening up to a large counter attack!\"\n        - Following Text: \"However, attacking from the front can often prove dangerous, as you don’t want to drain all your stamina and run out of juice for dodging. He can often lure you in, and then stab his imbued weapon down right in front of him. Don’t dodge backward but instead flee to the sides, as the impact will create a line of smaller spears from the sand itself that erupt in a straight line from the point of impact.\nYou can get in a few strikes after dodging this stab, but save your heavy attack, as the Yellow Wind Sage will usually follow this up by a jumping stomp attack to create a shockwave around him. This will leave him open for a strong heavy hit and follow up attacks.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an intense moment from a boss fight in *Black Myth: Wukong* against the \"Yellow Wind Sage.\" The boss is shown performing a powerful attack, likely the described move where he stabs his weapon into the ground, causing an eruption of smaller spears and debris. The chaotic scene highlights the need for precise dodging to the sides, as emphasized in the accompanying text, to avoid the attack and create an opportunity for counterstrikes."
}