{
    "chunk_id": 315851229128,
    "source_file": "Field_of_Fire_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/67/Field_Fire_Walkthrough_%2859%29.png",
    "alt_text": "Field Fire Walkthrough \\(59\\).png",
    "position_desc": 53,
    "img_above_text": "![Field Fire Walkthrough \\(60\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8d/Field_Fire_Walkthrough_%2860%29.png)\nYou'll also find that he performs acrobatics around the arena, and will run up the wall occasionally. When he does this, he'll flip off of the rocks and try to land on you. As he lands, he will also send the blades up from the ground, along with rocks.",
    "img_below_text": "After knocking down a chunk of his health, there will be times when he starts to switch to using just one blade. You'll know when this is about to happen, as only one blade will glow brightly, while the other will be dimmed. When he does this, this will mean that the blade will be able to reach much further, and he'll create huge extended arcs with it. He often does this in chains of three and will start to say a word like \"Merciless\" or \"Sheathless\" before each attack. You'll want to learn the timings of this attack, so you can dodge and roll right underneath it each time.\n![Field Fire Walkthrough \\(63\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b7/Field_Fire_Walkthrough_%2863%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Field Fire Walkthrough \\(60\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8d/Field_Fire_Walkthrough_%2860%29.png)\nYou'll also find that he performs acrobatics around the arena, and will run up the wall occasionally. When he does this, he'll flip off of the rocks and try to land on you. As he lands, he will also send the blades up from the ground, along with rocks.\"\n        - Following Text: \"After knocking down a chunk of his health, there will be times when he starts to switch to using just one blade. You'll know when this is about to happen, as only one blade will glow brightly, while the other will be dimmed. When he does this, this will mean that the blade will be able to reach much further, and he'll create huge extended arcs with it. He often does this in chains of three and will start to say a word like \"Merciless\" or \"Sheathless\" before each attack. You'll want to learn the timings of this attack, so you can dodge and roll right underneath it each time.\n![Field Fire Walkthrough \\(63\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b7/Field_Fire_Walkthrough_%2863%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat encounter in a rocky, dimly lit arena. A player-controlled character, adorned in ornate armor and wielding a weapon, faces off against a red-skinned enemy with glowing dual blades. The preceding text describes the enemy's acrobatic attacks, including wall runs and blade strikes that emerge from the ground. The following text mentions the enemy switching to a single blade for extended attacks, emphasizing the need for precise dodging. The image visually complements the guide's explanation of the enemy's attack patterns and environment."
}