{
    "chunk_id": 228103016262,
    "source_file": "Buddha%27s_Right_Hand.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/84/Wukong_MiddleHollow_62.jpg",
    "alt_text": "Wukong MiddleHollow 62.jpg",
    "position_desc": 7,
    "img_above_text": "The terrifying creature will lunge down with a scream, and then begin to spew a literal river of poison into a narrow arena. This stream of bile will damage you continuously, and there are only two real ways to avoid it.\nIf you're quick, you can dash under it before it starts spewing poison to get around behind it. If not, quickly get up onto a Pillar Stance to perch above the poison.",
    "img_below_text": "Unfortunately, you won't be able to hide up here forever, as the boss will often start to turn its body, and then slam down its hand onto the poison river, but you can slam down first and run for safety.\nNow that its body is now clinging to the walls in front of you, you'll need to aim for its face, and the Pillar or Thrust Stance can help with that.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The terrifying creature will lunge down with a scream, and then begin to spew a literal river of poison into a narrow arena. This stream of bile will damage you continuously, and there are only two real ways to avoid it.\nIf you're quick, you can dash under it before it starts spewing poison to get around behind it. If not, quickly get up onto a Pillar Stance to perch above the poison.\"\n        - Following Text: \"Unfortunately, you won't be able to hide up here forever, as the boss will often start to turn its body, and then slam down its hand onto the poison river, but you can slam down first and run for safety.\nNow that its body is now clinging to the walls in front of you, you'll need to aim for its face, and the Pillar or Thrust Stance can help with that.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an intense boss encounter in a narrow, rocky arena. The player character faces a massive, grotesque creature named \"Buddha's Right Hand,\" as indicated by the health bar at the bottom. The preceding and following text describe strategies for avoiding the creature's poisonous attack, either by dashing behind it or perching on pillars, and emphasize targeting its face while evading its hand slams. The setting is dimly lit, adding to the ominous atmosphere of the battle."
}