{
    "chunk_id": 605362604082,
    "source_file": "Black_Bear_Guai.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/88/Wukong_BlackWind_38.jpg",
    "alt_text": "Wukong BlackWind 38.jpg",
    "position_desc": 8,
    "img_above_text": "![Wukong BlackWind 37.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e1/Wukong_BlackWind_37.jpg)\nOnce engulfed in flames, the Black Bear Guai will revert to his old tricks of turning into the black wind wisp and charging at you after a small explosion — only this time it will also deal fire damage. Be ready for him to zip back and forth quickly to catch you off guard.",
    "img_below_text": "He can also pull his familiar trick of turning into mist and then reappearing with a diving bodyslam (now on fire). If you see his black wind fly up, be ready for the attack and either dodge past him or Cloud Step away and retaliate as he struggles to rise.\nWhen he comes at you in his bear form, all of his attacks will now deal fire damage, and all of his slams will cause explosions in front of him when his attacks hit the ground. Dodging is now more important than ever, especially to the side of his attacks to escape their explosion range.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong BlackWind 37.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e1/Wukong_BlackWind_37.jpg)\nOnce engulfed in flames, the Black Bear Guai will revert to his old tricks of turning into the black wind wisp and charging at you after a small explosion — only this time it will also deal fire damage. Be ready for him to zip back and forth quickly to catch you off guard.\"\n        - Following Text: \"He can also pull his familiar trick of turning into mist and then reappearing with a diving bodyslam (now on fire). If you see his black wind fly up, be ready for the attack and either dodge past him or Cloud Step away and retaliate as he struggles to rise.\nWhen he comes at you in his bear form, all of his attacks will now deal fire damage, and all of his slams will cause explosions in front of him when his attacks hit the ground. Dodging is now more important than ever, especially to the side of his attacks to escape their explosion range.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dramatic scene from the video game \"Black Myth: Wukong,\" featuring a boss battle against the Black Bear Guai. The bear is engulfed in flames, indicating its enhanced fire-based attacks. The player character is engaged in combat, with the game's interface showing health bars and ability icons. The surrounding environment is ablaze, emphasizing the intensity and danger of the encounter. The image illustrates the bear's transformation and the player's need to dodge and strategize to overcome the fiery challenge."
}