{
    "chunk_id": 527176675238,
    "source_file": "Black_Wind_Cave_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/de/Wukong_BlackWind_31.jpg",
    "alt_text": "Wukong BlackWind 31.jpg",
    "position_desc": 28,
    "img_above_text": "The rest of the long stairway up is lined with assorted Wolf Guai, but between your new Cloud Step, Spirit Attacks, and other new moves, they won’t stand a chance against you. Be sure to look along the left by some graves to find some Aged Ginseng as you keep heading upward. If you run out of mana for your Cloud Step, just keep enemies or the environment between you and the Wolf Archer’s opening salvo, and then rush them when they start shooting single arrows again.\n## Bodhi Peak",
    "img_below_text": "When you’ve at least reached the top of the mountain, it’s time to do one final inventory before approaching the final boss of Chapter 1:\n* Make sure you’ve rung the 3 bells, and fought the secret boss to obtain the Legendary Fireproof Mantle.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The rest of the long stairway up is lined with assorted Wolf Guai, but between your new Cloud Step, Spirit Attacks, and other new moves, they won’t stand a chance against you. Be sure to look along the left by some graves to find some Aged Ginseng as you keep heading upward. If you run out of mana for your Cloud Step, just keep enemies or the environment between you and the Wolf Archer’s opening salvo, and then rush them when they start shooting single arrows again.\n## Bodhi Peak\"\n        - Following Text: \"When you’ve at least reached the top of the mountain, it’s time to do one final inventory before approaching the final boss of Chapter 1:\n* Make sure you’ve rung the 3 bells, and fought the secret boss to obtain the Legendary Fireproof Mantle.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character ascending a stone stairway surrounded by lush greenery, holding a staff or weapon. The scene aligns with the context of progressing up Bodhi Peak, where players encounter Wolf Guai enemies and collect items like Aged Ginseng. The preceding text emphasizes using abilities like Cloud Step and Spirit Attacks to overcome challenges, while the following text suggests preparing for the final boss of Chapter 1 after reaching the mountain's summit. The image visually represents the journey and combat preparation leading to the chapter's climax."
}