{
    "chunk_id": 862275637657,
    "source_file": "Bamboo_Grove_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8c/Wukong_Bamboo_9.jpg",
    "alt_text": "Wukong Bamboo 9.jpg",
    "position_desc": 10,
    "img_above_text": "* At the Guanyin Temple entrance by the Shrine in front of a wolf statue altar\n* Back down the path in the Bamboo Grove where the falls are",
    "img_below_text": "When you’re ready to proceed, head across the large bridge to find a new type of enemy, the Snake Patroller. These spear-wielding snake-men will stand up straight up before lunging at you with a bite that inflicts major damage while poisoning you, which may force you to use Anti-miasma powder to negate its effects. They can also put their spear in their teeth and dash with it held horizontally to swing it about in a combo attack.\n![Wukong Bamboo 10.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/74/Wukong_Bamboo_10.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"* At the Guanyin Temple entrance by the Shrine in front of a wolf statue altar\n* Back down the path in the Bamboo Grove where the falls are\"\n        - Following Text: \"When you’re ready to proceed, head across the large bridge to find a new type of enemy, the Snake Patroller. These spear-wielding snake-men will stand up straight up before lunging at you with a bite that inflicts major damage while poisoning you, which may force you to use Anti-miasma powder to negate its effects. They can also put their spear in their teeth and dash with it held horizontally to swing it about in a combo attack.\n![Wukong Bamboo 10.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/74/Wukong_Bamboo_10.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a gameplay scene from *Black Myth: Wukong*, showing the player character encountering a Snake Patroller enemy on a bamboo bridge in a dense forest setting. The Snake Patroller is mid-attack, wielding a spear, while the player prepares to engage in combat. The preceding and following text suggests this is part of a guide detailing enemy behavior and strategies for progressing through the area."
}