{
    "chunk_id": 287528284697,
    "source_file": "Blood_of_the_Iron_Bull.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b4/Wukong_Sandgate_55.jpg",
    "alt_text": "Wukong Sandgate 55.jpg",
    "position_desc": 9,
    "img_above_text": "Additionally, just onwards from this fight, as you progress on the main story path, you will come across the King of Flowing Sands and Second Rat Prince at the Sandgate Village \\- Valley of Despair Shrine in Yellow Wind Ridge. This is a mandatory boss, so you can't miss them.\nUpon defeating them, you will get another Blood of the Iron Bull, as they will drop a Spirit for you to collect.",
    "img_below_text": "### Blood of the Iron Bull Location 8\nThe next Blood of the Iron Bull can be found at the Crouching Tiger Temple \\- Temple Entrance Shrine in Yellow Wind Ridge. Head up the stairs, and once you are about halfway up, turn to your right, and you will see a chest. Inside this chest is the material.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Additionally, just onwards from this fight, as you progress on the main story path, you will come across the King of Flowing Sands and Second Rat Prince at the Sandgate Village \\- Valley of Despair Shrine in Yellow Wind Ridge. This is a mandatory boss, so you can't miss them.\nUpon defeating them, you will get another Blood of the Iron Bull, as they will drop a Spirit for you to collect.\"\n        - Following Text: \"### Blood of the Iron Bull Location 8\nThe next Blood of the Iron Bull can be found at the Crouching Tiger Temple \\- Temple Entrance Shrine in Yellow Wind Ridge. Head up the stairs, and once you are about halfway up, turn to your right, and you will see a chest. Inside this chest is the material.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight from a video game, featuring two enemies: the King of Flowing Sands and the Second Rat Prince. This encounter takes place at the Sandgate Village - Valley of Despair Shrine in Yellow Wind Ridge, as part of the main story progression. Defeating these mandatory bosses rewards the player with a Spirit drop and another Blood of the Iron Bull item."
}