{
    "chunk_id": 855575105740,
    "source_file": "Chapter_2_Secret_-_Kingdom_of_Sahali_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/12/Wukong_Sahali_19.jpg",
    "alt_text": "Wukong Sahali 19.jpg",
    "position_desc": 16,
    "img_above_text": "![Wukong Sahali 14.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f6/Wukong_Sahali_14.jpg)\nNote that you can use the Rock Solid deflection spell to surprise him (since it's his own spell that he passed down to the son you gained it from) but he can also use the spell as well. It’s not as obvious as when the other boss used it, as his fur will darken but he won’t turn completely to stone.",
    "img_below_text": "If you ever see him freeze up (usually in a ready stance) hold off on attacking and instead charge up for a heavy attack when he starts to move again. If you attack too early, he’ll counter your deflected attack by whirling on you with a claw swipe, followed by a leaping downward slash with a huge arc and a delay before he lands.\n![Wukong Sahali 15.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/23/Wukong_Sahali_15.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Sahali 14.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f6/Wukong_Sahali_14.jpg)\nNote that you can use the Rock Solid deflection spell to surprise him (since it's his own spell that he passed down to the son you gained it from) but he can also use the spell as well. It’s not as obvious as when the other boss used it, as his fur will darken but he won’t turn completely to stone.\"\n        - Following Text: \"If you ever see him freeze up (usually in a ready stance) hold off on attacking and instead charge up for a heavy attack when he starts to move again. If you attack too early, he’ll counter your deflected attack by whirling on you with a claw swipe, followed by a leaping downward slash with a huge arc and a delay before he lands.\n![Wukong Sahali 15.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/23/Wukong_Sahali_15.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat scene from the video game *Black Myth: Wukong*, featuring the player character engaging in battle with a boss named \"Tiger Vanguard.\" The environment is a rocky, desolate area with scattered debris and grass. The preceding and following text provides strategic advice for this encounter, including using the \"Rock Solid\" deflection spell and timing heavy attacks carefully to avoid counters from the boss. The image highlights the intensity of the fight and the importance of tactical gameplay."
}