{
    "chunk_id": 417840872120,
    "source_file": "Gore-Eye_Daoist.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/54/Wukong_Yellow_45.jpg",
    "alt_text": "Wukong Yellow 45.jpg",
    "position_desc": 7,
    "img_above_text": "![Wukong Yellow 41.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2e/Wukong_Yellow_41.jpg)\nIf you see him begin to lean back and shake his staff over his head, prepare for him to create several more blood projectiles to shoot out of the eyes on his back. They’ll track your position and fly in an arc towards you, so be ready to dodge or employ your staff spin to destroy the projectiles before they can poison you.",
    "img_below_text": "The most annoying part will be when he hunches over and starts to mumble. Lines of red will start appearing from the eyes on his back toward each of the blood pools he’s created, and will essentially suck the pools back in and regenerate a portion of health. Stop him the moment you see this with a well timed Immobilize, or try a Spirit with a mighty attack to stagger him out of it, otherwise the fight will just go on longer.\n![Wukong Yellow 46.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/dc/Wukong_Yellow_46.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Yellow 41.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2e/Wukong_Yellow_41.jpg)\nIf you see him begin to lean back and shake his staff over his head, prepare for him to create several more blood projectiles to shoot out of the eyes on his back. They’ll track your position and fly in an arc towards you, so be ready to dodge or employ your staff spin to destroy the projectiles before they can poison you.\"\n        - Following Text: \"The most annoying part will be when he hunches over and starts to mumble. Lines of red will start appearing from the eyes on his back toward each of the blood pools he’s created, and will essentially suck the pools back in and regenerate a portion of health. Stop him the moment you see this with a well timed Immobilize, or try a Spirit with a mighty attack to stagger him out of it, otherwise the fight will just go on longer.\n![Wukong Yellow 46.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/dc/Wukong_Yellow_46.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a battle scene from a video game where the player character is confronting an enemy named \"Gore-Eye Daoist.\" The scene is filled with a red hue, indicating a potentially dangerous or intense moment in the fight. The enemy appears to be using a special attack or ability, as suggested by the red lines emanating from the eyes on its back, which are likely related to the blood projectiles mentioned in the preceding text. The player must be prepared to dodge or counter these attacks to avoid damage or poisoning."
}