{
    "chunk_id": 470174606305,
    "source_file": "Chapter_2_Secret_-_Kingdom_of_Sahali_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f6/Wukong_Sahali_14.jpg",
    "alt_text": "Wukong Sahali 14.jpg",
    "position_desc": 15,
    "img_above_text": "Other times, his lunging attack will be just one big leaping sword slice while low to the ground, which is easier to dodge as it has no follow up most of the time, though he will turn to this move instead of finishing some of his combo attacks to throw you off your guard.\nEvery so often, he’ll decline the lunge, and simply swing his sword up to send a projectile slash your way. The good news is it's rare and just a single slash, moving slow enough that it can be dodged reliably well.",
    "img_below_text": "Note that you can use the Rock Solid deflection spell to surprise him (since it's his own spell that he passed down to the son you gained it from) but he can also use the spell as well. It’s not as obvious as when the other boss used it, as his fur will darken but he won’t turn completely to stone.\n![Wukong Sahali 19.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/12/Wukong_Sahali_19.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Other times, his lunging attack will be just one big leaping sword slice while low to the ground, which is easier to dodge as it has no follow up most of the time, though he will turn to this move instead of finishing some of his combo attacks to throw you off your guard.\nEvery so often, he’ll decline the lunge, and simply swing his sword up to send a projectile slash your way. The good news is it's rare and just a single slash, moving slow enough that it can be dodged reliably well.\"\n        - Following Text: \"Note that you can use the Rock Solid deflection spell to surprise him (since it's his own spell that he passed down to the son you gained it from) but he can also use the spell as well. It’s not as obvious as when the other boss used it, as his fur will darken but he won’t turn completely to stone.\n![Wukong Sahali 19.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/12/Wukong_Sahali_19.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat sequence from *Black Myth: Wukong*, featuring the player character engaged in a battle against a boss named \"Tiger Vanguard.\" The boss is using a powerful attack or spell, as indicated by the dialogue: \"This is my secret spell. Who taught you?\" The preceding and following text suggests strategies for dealing with the boss's moves, including using the Rock Solid deflection spell to counter its attacks. The environment appears to be an open, rocky area, emphasizing the intense and dynamic nature of the fight."
}