{
    "chunk_id": 421507376744,
    "source_file": "New_Thunderclap_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/18/Wukong_Thunderclap_58.jpg",
    "alt_text": "Wukong Thunderclap 58.jpg",
    "position_desc": 58,
    "img_above_text": "Now you can return back to the Main Plaza, and this time head up past where you defeated the other Clay Vajra for its Spirit, and enter the last part of the temple.\n## Temple Inner Courtyard",
    "img_below_text": "Guarding the path to the last boss of the temple are two Dark-faced Overlords, and they won't be happy to see you. Expect at least one of them to toss a boulder at you, and you'll want to charge one as soon as possible to maximize the time you have 1v1 before the other arrives.\n![Wukong Thunderclap 59.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/49/Wukong_Thunderclap_59.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Now you can return back to the Main Plaza, and this time head up past where you defeated the other Clay Vajra for its Spirit, and enter the last part of the temple.\n## Temple Inner Courtyard\"\n        - Following Text: \"Guarding the path to the last boss of the temple are two Dark-faced Overlords, and they won't be happy to see you. Expect at least one of them to toss a boulder at you, and you'll want to charge one as soon as possible to maximize the time you have 1v1 before the other arrives.\n![Wukong Thunderclap 59.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/49/Wukong_Thunderclap_59.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a snowy courtyard leading to a grand temple staircase adorned with intricate statues. The player character, armed with a staff, faces two imposing enemies identified as Dark-faced Overlords, who block the path to the temple's final boss. The scene sets up a challenging encounter, emphasizing the need for strategic combat against these foes."
}