{
    "chunk_id": 282997087850,
    "source_file": "Lang-Li-Guhh-Lang.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d1/Wukong_Felicity_5.jpg",
    "alt_text": "Wukong Felicity 5.jpg",
    "position_desc": 4,
    "img_above_text": "![Wukong Felicity 9.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d4/Wukong_Felicity_9.jpg)\nHis tongue-lashing attack has now been altered to be even more deadly: It will create fields of frost on the ground as it swings back and forth -- and also lob rocks at you each time his tongue whips back, forcing you to stay mobile out of the frost and dodging the boulders at the same time.",
    "img_below_text": "He can also take a deep breath and bellow chilled air straight at you, which can make it tough to get out of his range unless you lock him down with Immobilize or Cloud Step away.\nAny time his icy attacks create a frost field, you'll need to evacuate quickly from the affected area, or you'll rapidly become chilled and eventually immobile while your stamina is sapped.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Felicity 9.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d4/Wukong_Felicity_9.jpg)\nHis tongue-lashing attack has now been altered to be even more deadly: It will create fields of frost on the ground as it swings back and forth -- and also lob rocks at you each time his tongue whips back, forcing you to stay mobile out of the frost and dodging the boulders at the same time.\"\n        - Following Text: \"He can also take a deep breath and bellow chilled air straight at you, which can make it tough to get out of his range unless you lock him down with Immobilize or Cloud Step away.\nAny time his icy attacks create a frost field, you'll need to evacuate quickly from the affected area, or you'll rapidly become chilled and eventually immobile while your stamina is sapped.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a gameplay moment from *Black Myth: Wukong*, showcasing a battle against the boss \"Lang-Li-Guhth-Lang\" in a snowy, frost-covered environment. The player character, armed with a staff, faces the boss as it unleashes a powerful icy attack, creating frost fields and chilled air that can immobilize the player and drain stamina. The preceding and following text emphasize the need for mobility and strategic abilities like Immobilize or Cloud Step to evade the boss's frost-based attacks and maintain combat effectiveness."
}