{
    "chunk_id": 458146130516,
    "source_file": "Bamboo_Grove_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3f/Wukong_Bamboo_22.jpg",
    "alt_text": "Wukong Bamboo 22.jpg",
    "position_desc": 21,
    "img_above_text": "![Wukong Bamboo 21.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3d/Wukong_Bamboo_21.jpg)\nThis bamboo forest is full of various Snake Patrollers, and a great amount of Skeletal Snake bones lying in wait and just waiting to ambush you as the bones awaken. Because of this, it’s best to proceed slowly through this region and alert the snakes one by one, defeating them as they come alive, and luring the living Snake Patrollers backward so your fights don’t attract more attention.",
    "img_below_text": "There’s just a few materials to find in this large circular grove, including more Snake-Head Mushroom — and one by a broken stone brazier that is actually a Fungiling in disguise. Much like the Ginsengling, these plant-head monsters are fairly durable and hit hard with a poleblade, so try to shut them down with Immobilize to press the attack while you can.\n![Wukong Bamboo 23.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/54/Wukong_Bamboo_23.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Bamboo 21.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3d/Wukong_Bamboo_21.jpg)\nThis bamboo forest is full of various Snake Patrollers, and a great amount of Skeletal Snake bones lying in wait and just waiting to ambush you as the bones awaken. Because of this, it’s best to proceed slowly through this region and alert the snakes one by one, defeating them as they come alive, and luring the living Snake Patrollers backward so your fights don’t attract more attention.\"\n        - Following Text: \"There’s just a few materials to find in this large circular grove, including more Snake-Head Mushroom — and one by a broken stone brazier that is actually a Fungiling in disguise. Much like the Ginsengling, these plant-head monsters are fairly durable and hit hard with a poleblade, so try to shut them down with Immobilize to press the attack while you can.\n![Wukong Bamboo 23.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/54/Wukong_Bamboo_23.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat encounter in a bamboo forest setting from the game *Black Myth: Wukong*. The player character is engaged in a fight with a large, snake-like enemy near a stone structure emitting a bright golden light. This scene aligns with the walkthrough's description of the area being populated by Snake Patrollers and ambushes, emphasizing the need for caution and strategic combat. The dynamic action suggests the player is actively dodging or attacking the enemy."
}