{
    "chunk_id": 191705862582,
    "source_file": "Wandering_Wight.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/50/8_ForestofWolves_7.mp4.00_04_31_28.Still005.jpg",
    "alt_text": "8 ForestofWolves 7.mp4.00 04 31 28.Still005.jpg",
    "position_desc": 11,
    "img_above_text": "When the Wandering Wight finally falls, you’ll get the Cat’s Eye Beads Curio to equip for a passive bonus, as well as a Stone Spirit material and 691 Will.\n## How to Absorb Spirit With Guidance",
    "img_below_text": "He will also leave behind the Wandering Wight Spirit — a purple glowing wisp — for you to absorb. if you tried to defeat this boss early, interacting with it will prompt the note: \"Cannot Absorb Spirit Without Guidance\".\n![20240815101010 1.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c9/20240815101010_1.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"When the Wandering Wight finally falls, you’ll get the Cat’s Eye Beads Curio to equip for a passive bonus, as well as a Stone Spirit material and 691 Will.\n## How to Absorb Spirit With Guidance\"\n        - Following Text: \"He will also leave behind the Wandering Wight Spirit — a purple glowing wisp — for you to absorb. if you tried to defeat this boss early, interacting with it will prompt the note: \"Cannot Absorb Spirit Without Guidance\".\n![20240815101010 1.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c9/20240815101010_1.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the aftermath of defeating the Wandering Wight boss in *Black Myth: Wukong*. The player has received rewards, including the Cat’s Eye Beads Curio (providing a passive bonus), 691 Will, and a Stone Spirit material. A glowing purple wisp, identified as the Wandering Wight Spirit, is visible, which the player can absorb if they have the required \"Guidance.\""
}