{
    "chunk_id": 658032685060,
    "source_file": "Wandering_Wight.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/83/Wukong_Wight_7.jpg",
    "alt_text": "Wukong Wight 7.jpg",
    "position_desc": 10,
    "img_above_text": "![Wukong Wight 8.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e1/Wukong_Wight_8.jpg)\nIf you see him stagger away from your hits, press the attack whenever possible, as following up with a charged heavy strike while he’s stumbling can even cause him to fall down on his back, giving you an extended period to dish out damage before he can rise up.",
    "img_below_text": "If you keep your distance and wait for the end of his growing earthquake explosions, don’t get too comfortable. The Wandering Wight will regularly end his series of explosions by rapidly moving his hands and charging up before blasting an energy wave directly at you. This will also deal massive damage, and you’ll need to begin strafing and time your dodge to the side to avoid its blast.\nIf you find yourself low on health and in danger of being defeated, remember that you can use the Red Tides Transformation Spell to turn into the Wolf Guai, which will grant you a new health bar to use for a limited time. Make the most of it by unleashing quick combos and continuing to dodge his strikes and build up Might, and then perform a special spell with a full Might bar by dodging an attack and then using the heavy attack button to perform an explosive pogo jump to take off a huge piece of his health!",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Wight 8.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e1/Wukong_Wight_8.jpg)\nIf you see him stagger away from your hits, press the attack whenever possible, as following up with a charged heavy strike while he’s stumbling can even cause him to fall down on his back, giving you an extended period to dish out damage before he can rise up.\"\n        - Following Text: \"If you keep your distance and wait for the end of his growing earthquake explosions, don’t get too comfortable. The Wandering Wight will regularly end his series of explosions by rapidly moving his hands and charging up before blasting an energy wave directly at you. This will also deal massive damage, and you’ll need to begin strafing and time your dodge to the side to avoid its blast.\nIf you find yourself low on health and in danger of being defeated, remember that you can use the Red Tides Transformation Spell to turn into the Wolf Guai, which will grant you a new health bar to use for a limited time. Make the most of it by unleashing quick combos and continuing to dodge his strikes and build up Might, and then perform a special spell with a full Might bar by dodging an attack and then using the heavy attack button to perform an explosive pogo jump to take off a huge piece of his health!\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a battle scene from the game *Black Myth: Wukong*, showcasing the player character engaging the \"Wandering Wight\" enemy in a forested environment. The Wandering Wight is emitting a powerful explosion, scattering debris and rocks, likely part of its earthquake attack mentioned in the text. The health bar at the bottom indicates the enemy's status, while the UI elements show the player's resources and abilities. The preceding and following text provides strategies for dealing with the Wight, emphasizing exploiting its staggered state for heavy attacks and dodging its energy wave after the earthquake explosions."
}