{
    "chunk_id": 390987836484,
    "source_file": "Secrets_in_Black_Myth_Wukong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d3/Chapter_4_Secret_Area_%2816%29.png",
    "alt_text": "Chapter 4 Secret Area \\(16\\).png",
    "position_desc": 17,
    "img_above_text": "* How to Find All Purple Talisman Altars in Chapter 4\n## Purple Cloud Mountain",
    "img_below_text": "You'll need to beat the Venom Daoist twice in Chapter 4 to gain access to Purple Cloud Mountain. You can first fight him in the Webbed Hollow, and then fight him again in the Temple of Yellow Flowers. After this fight, a wall will appear that will allow you to go to Purple Cloud Mountain.\n### Relevant Guide Pages",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"* How to Find All Purple Talisman Altars in Chapter 4\n## Purple Cloud Mountain\"\n        - Following Text: \"You'll need to beat the Venom Daoist twice in Chapter 4 to gain access to Purple Cloud Mountain. You can first fight him in the Webbed Hollow, and then fight him again in the Temple of Yellow Flowers. After this fight, a wall will appear that will allow you to go to Purple Cloud Mountain.\n### Relevant Guide Pages\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image showcases the in-game environment of \"Purple Cloud Mountain,\" a location from Chapter 4 of the video game. It features a character equipped with a weapon, standing amidst a scenic autumnal landscape with rocky terrain and vibrant foliage. The preceding and following text suggests that this area becomes accessible after defeating the Venom Daoist twice, serving as a key progression point in the chapter. The image likely highlights the visual design and atmosphere of the mountain, as well as gameplay elements such as inventory items and abilities visible on the interface."
}