{
    "chunk_id": 191852891940,
    "source_file": "Webbed_Hollow_-_Upper_Hollow_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/10/Wukong_UpperHollow_20.jpg",
    "alt_text": "Wukong UpperHollow 20.jpg",
    "position_desc": 21,
    "img_above_text": "You'll now find yourself on the opposite side of the Hollow from where you first started, with a group of platforms in front of you that offer a one-way ticket down to the start of the Middle Hollow and the Verdure Bridge. However, going down there now would cause to a miss a large optional area complete with a boss (but you can drop down early to grab the Shrine and warp back up if you want).\n## Pool of Shattered Jade",
    "img_below_text": "Return back to the first large area filled with cocoons to the right of the Upper Hollow Shrine, and look for the pit in the middle with a wooden platform ledge you can use to drop down to a slightly lower floor.\n![Wukong UpperHollow 21.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/87/Wukong_UpperHollow_21.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"You'll now find yourself on the opposite side of the Hollow from where you first started, with a group of platforms in front of you that offer a one-way ticket down to the start of the Middle Hollow and the Verdure Bridge. However, going down there now would cause to a miss a large optional area complete with a boss (but you can drop down early to grab the Shrine and warp back up if you want).\n## Pool of Shattered Jade\"\n        - Following Text: \"Return back to the first large area filled with cocoons to the right of the Upper Hollow Shrine, and look for the pit in the middle with a wooden platform ledge you can use to drop down to a slightly lower floor.\n![Wukong UpperHollow 21.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/87/Wukong_UpperHollow_21.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character standing near a wooden platform overlooking a pit in a cavernous area, with a red arrow indicating a drop-down point. This scene aligns with the guide's instructions to return to the Upper Hollow Shrine area and use the wooden ledge to descend to a lower floor, progressing toward the next section of the game."
}