{
    "chunk_id": 4657851085,
    "source_file": "Serpentscale_Set.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/29/Serpentscale_Bracers_1.jpg",
    "alt_text": "Serpentscale Bracers 1.jpg",
    "position_desc": 1,
    "img_above_text": "* Wave Rider - Massively reduces stamina cost when in water (3 pieces equipped)\nAll of the Serpentscale Set Armor and Gear pieces are unlocked upon defeating Whiteclad Noble in Bamboo Grove in Chapter 1 - Black Wind Mountain. You can craft them from any Shrine and once the mandatory boss has been defeated.",
    "img_below_text": "The Serpentscale Set of Armor and Gear can be crafted, as it is the only way to get it. To craft it you need the following:\n* 5 Yarn, 1,350 Will - body",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"* Wave Rider - Massively reduces stamina cost when in water (3 pieces equipped)\nAll of the Serpentscale Set Armor and Gear pieces are unlocked upon defeating Whiteclad Noble in Bamboo Grove in Chapter 1 - Black Wind Mountain. You can craft them from any Shrine and once the mandatory boss has been defeated.\"\n        - Following Text: \"The Serpentscale Set of Armor and Gear can be crafted, as it is the only way to get it. To craft it you need the following:\n* 5 Yarn, 1,350 Will - body\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image is a screenshot from a video game showing the crafting menu for the Serpentscale Bracers, part of the Serpentscale Set Armor and Gear. The bracers offer defense and poison resistance, and have the Wave Rider ability, which reduces stamina cost in water. The crafting process requires Yarn and Will, and the player has enough resources to craft the item. This image illustrates the crafting mechanics and the benefits of equipping the Serpentscale Bracers."
}