{
    "chunk_id": 479496607340,
    "source_file": "Valley_of_Ecstasy_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1b/Wukong_Karma_4.jpg",
    "alt_text": "Wukong Karma 4.jpg",
    "position_desc": 77,
    "img_above_text": "![Wukong Karma 3.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c0/Wukong_Karma_3.jpg)\nThis area has its own Crow Diviner, and while not as durable as the one who dropped the Spirit, he can still employ their new Cloud Step-like abilities to turn almost invisible and attack with chilling force.",
    "img_below_text": "After defeating this foe, you can grab a green Wisp on a rock, and then head downstream gathering Jade Lotus Plants as you go. Be ready to be ambushed by a few Croaky enemies after hopping down the falls or taking the nearby stairs, and continue on until the stream ends.\nTo the right of the water, you'll spot the assorted stone monuments that are the titular Towers of Karma, giving the place a cemetery-like quality. A path winds through these small stone pillars, and is guarded by an assortment of Frozen Corpses, Monk Supporters, and a new enemy.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Karma 3.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c0/Wukong_Karma_3.jpg)\nThis area has its own Crow Diviner, and while not as durable as the one who dropped the Spirit, he can still employ their new Cloud Step-like abilities to turn almost invisible and attack with chilling force.\"\n        - Following Text: \"After defeating this foe, you can grab a green Wisp on a rock, and then head downstream gathering Jade Lotus Plants as you go. Be ready to be ambushed by a few Croaky enemies after hopping down the falls or taking the nearby stairs, and continue on until the stream ends.\nTo the right of the water, you'll spot the assorted stone monuments that are the titular Towers of Karma, giving the place a cemetery-like quality. A path winds through these small stone pillars, and is guarded by an assortment of Frozen Corpses, Monk Supporters, and a new enemy.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game *Black Myth: Wukong*, where the player character, Wukong, is wading through a shallow, snow-covered stream. The environment features a serene winter landscape with stone monuments visible in the background, hinting at the \"Towers of Karma\" area. The HUD indicates item collection, with \"Jade Lotus x2\" being acquired, and the character is equipped with a staff weapon. This moment appears to be part of an exploration sequence, leading to potential enemy encounters and further progression downstream."
}