{
    "chunk_id": 212897508417,
    "source_file": "Blood_of_the_Iron_Bull.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/21/Wukong_MadTiger_10.jpg",
    "alt_text": "Wukong MadTiger 10.jpg",
    "position_desc": 16,
    "img_above_text": "After defeating the Tiger's Acolyte in Yellow Sand Formation \\- Windrest Hamlet, you will get the Old Rattle-Drum. You will need to complete this questline to then take on the Mad Tiger. Defeating the Mad-Tiger will give you another Blood of the Iron Bull.\nA full breakdown of this quest can be found here.",
    "img_below_text": "From Chapter 3 onwards, the Blood of the Iron Bull becomes far more common, and you can find several in each sub-area. Simply kill as many enemies and bosses, and keep an eye out for chests as you explore.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"After defeating the Tiger's Acolyte in Yellow Sand Formation \\- Windrest Hamlet, you will get the Old Rattle-Drum. You will need to complete this questline to then take on the Mad Tiger. Defeating the Mad-Tiger will give you another Blood of the Iron Bull.\nA full breakdown of this quest can be found here.\"\n        - Following Text: \"From Chapter 3 onwards, the Blood of the Iron Bull becomes far more common, and you can find several in each sub-area. Simply kill as many enemies and bosses, and keep an eye out for chests as you explore.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight against the \"Mad Tiger,\" a large, ferocious creature in a rocky, desolate environment. This encounter is part of a questline following the defeat of the Tiger's Acolyte, where players obtain the Old Rattle-Drum. Successfully defeating the Mad Tiger rewards the player with \"Blood of the Iron Bull,\" a resource that becomes more common in later chapters. The image highlights the intensity of the battle and the player's interface during the fight."
}