{
    "chunk_id": 627638665808,
    "source_file": "Field_of_Fire_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5b/FIeld_Fire_Walkthrough_%2846%29.png",
    "alt_text": "FIeld Fire Walkthrough \\(46\\).png",
    "position_desc": 41,
    "img_above_text": "Collect the green Wisps from the far edge on the left, then follow the path where the fox went toward the Bull King. This will take you down a path that leads up to the Bull King, and where you can find the next Keeper's Shrine called Fallen Furnace Crater.\n## Fallen Furnace Crater",
    "img_below_text": "Head up the slope to see Pingping speak to her father. The Bull King isn't best pleased with The Destined One, but also has an issue with Pingping and her deception. It turns out that Pingping is actually the Red Boy, and he will transform before your eyes, ready for a battle.\n### Yaoguai King - Red Boy",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Collect the green Wisps from the far edge on the left, then follow the path where the fox went toward the Bull King. This will take you down a path that leads up to the Bull King, and where you can find the next Keeper's Shrine called Fallen Furnace Crater.\n## Fallen Furnace Crater\"\n        - Following Text: \"Head up the slope to see Pingping speak to her father. The Bull King isn't best pleased with The Destined One, but also has an issue with Pingping and her deception. It turns out that Pingping is actually the Red Boy, and he will transform before your eyes, ready for a battle.\n### Yaoguai King - Red Boy\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dark, volcanic environment with flowing lava streams and jagged rock formations. A character in ornate armor, holding a staff, stands in the foreground, facing a path marked by an arrow. The path leads toward a distant pagoda-like structure and is part of the route to the \"Fallen Furnace Crater,\" a location mentioned in the walkthrough. This area sets the stage for an encounter with the Bull King and the revelation of Pingping's true identity as the Red Boy."
}