{
    "chunk_id": 30226237581,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/dd/Wukong_Wolves_5.jpg",
    "alt_text": "Wukong Wolves 5.jpg",
    "position_desc": 13,
    "img_above_text": "Alternatively, you can simply hold the Heavy Attack button to begin charging up your Focus, and letting go of the button will unleash the attack, which can be devastating on slow or unsuspecting enemies. It’s important to note that Focus won’t decay from performing light attacks, but you can’t keep the Focus from charging up, so knowing when to use which type of heavy attack can prove useful.\nHead up the stone stairway into a narrow path full of boulders, where the path splits in two:",
    "img_below_text": "The route on the left leads down to a Wolf Scout guarding a small gold chest, which contains 5 **Tiny Piece of Gold** \\- an item that can be sold at shops to earn more Will.\n![Wukong Wolves 6.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7a/Wukong_Wolves_6.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Alternatively, you can simply hold the Heavy Attack button to begin charging up your Focus, and letting go of the button will unleash the attack, which can be devastating on slow or unsuspecting enemies. It’s important to note that Focus won’t decay from performing light attacks, but you can’t keep the Focus from charging up, so knowing when to use which type of heavy attack can prove useful.\nHead up the stone stairway into a narrow path full of boulders, where the path splits in two:\"\n        - Following Text: \"The route on the left leads down to a Wolf Scout guarding a small gold chest, which contains 5 **Tiny Piece of Gold** \\- an item that can be sold at shops to earn more Will.\n![Wukong Wolves 6.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7a/Wukong_Wolves_6.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game *Black Myth: Wukong*, showing the player character defeating a Wolf Scout near a fallen tree and a small gold chest. The chest, located on the right side of the image, contains 5 **Tiny Piece of Gold**, which can be sold at shops for currency. This area is part of a split path, with the left route leading to this encounter."
}