{
    "chunk_id": 814969430216,
    "source_file": "New_Thunderclap_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/99/Wukong_Thunderclap_6.jpg",
    "alt_text": "Wukong Thunderclap 6.jpg",
    "position_desc": 7,
    "img_above_text": "![Wukong Thunderclap 7.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/ae/Wukong_Thunderclap_7.jpg)\nBehind the mage, you can spot a new enemy standing by a sealed doorway. These Overseeing Monks are an interesting enemy - they really are blind, and will often shift about when they sense you approach. However, once you attack, they'll immediately begin to counter with powerful martial arts, which can sometimes extend for several powerful attacks in a row.",
    "img_below_text": "The good news is that they largely remain stationary, meaning you can easily stop a few feet away and charge a full heavy thrust attack to knock them flat, and then follow up with a quick light combo as they stagger to their feet.\nOnce this monk has been defeated, check the corner of this snowdrift for a green Wisp to absorb.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Thunderclap 7.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/ae/Wukong_Thunderclap_7.jpg)\nBehind the mage, you can spot a new enemy standing by a sealed doorway. These Overseeing Monks are an interesting enemy - they really are blind, and will often shift about when they sense you approach. However, once you attack, they'll immediately begin to counter with powerful martial arts, which can sometimes extend for several powerful attacks in a row.\"\n        - Following Text: \"The good news is that they largely remain stationary, meaning you can easily stop a few feet away and charge a full heavy thrust attack to knock them flat, and then follow up with a quick light combo as they stagger to their feet.\nOnce this monk has been defeated, check the corner of this snowdrift for a green Wisp to absorb.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat encounter in a snowy environment from the game *Black Myth: Wukong*. The player character, seemingly mid-attack, is engaging an Overseeing Monk, an enemy known for its blindness and martial arts counterattacks. Sparks and fiery effects suggest an intense moment in the fight. The context highlights strategies for defeating this enemy, such as using heavy thrust attacks to stagger it before following up with light combos. A green Wisp collectible is visible in the background, indicating a reward after the battle."
}