{
    "chunk_id": 846611208767,
    "source_file": "Pagoda_Realm_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d1/Wukong_Pagoda_60.jpg",
    "alt_text": "Wukong Pagoda 60.jpg",
    "position_desc": 57,
    "img_above_text": "Watch out for his extended spinning attack with his weapon, and wait for him to get dizzy before launching a counter attack and Immobilizing him to extend his downtime. If he floats into the air, be ready for him to crash his weapon into the ground as he lands.\nWhen defeated, you'll earn his Fungiman Spirit to add to your collection. Not far past where the Fungiman was hiding you can spot the stairway up to Level 4, but there's a bit more to explore here first.",
    "img_below_text": "Back on the outside ring, you may notice two more Lantern Sentries patrolling when the beguiling chant is active, so it's a good idea to take them down whenever the chanting begins.\n![Wukong Pagoda 61.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f6/Wukong_Pagoda_61.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Watch out for his extended spinning attack with his weapon, and wait for him to get dizzy before launching a counter attack and Immobilizing him to extend his downtime. If he floats into the air, be ready for him to crash his weapon into the ground as he lands.\nWhen defeated, you'll earn his Fungiman Spirit to add to your collection. Not far past where the Fungiman was hiding you can spot the stairway up to Level 4, but there's a bit more to explore here first.\"\n        - Following Text: \"Back on the outside ring, you may notice two more Lantern Sentries patrolling when the beguiling chant is active, so it's a good idea to take them down whenever the chanting begins.\n![Wukong Pagoda 61.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f6/Wukong_Pagoda_61.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dark, rocky environment within the game *Black Myth: Wukong*, featuring a player character crouching stealthily near the edge of a cliff. Two Lantern Sentries with glowing eye symbols are visible on the opposite side, patrolling a narrow pathway. The scene aligns with the guide's mention of encountering Lantern Sentries outside the Fungiman's location, emphasizing the need for caution and strategic takedowns during this section."
}