{
    "chunk_id": 712602347025,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fd/Wukong_Fright_18.jpg",
    "alt_text": "Wukong Fright 18.jpg",
    "position_desc": 19,
    "img_above_text": "Start by luring the shieldless Spearbone out of range of the Blazebones above, then climb the stairs to rush down the projectile throwers. Be sure to look at the ruined home at the first landing below the first Blazebone for a yellow chest that has 2 **Yaoguai Core** and 3 **Tiny Piece of Gold**.\n### The Third Buddha’s Eyeball",
    "img_below_text": "Fight your way to the top of the stairs and keep staff spinning to deflect the ranged attacks until all the Blazebones are dead. At the end of this high raised wooden platform you’ll find another of the giant statue heads, allowing you to take its Buhdda’s Eyeball.\n![Wukong Fright 19.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f3/Wukong_Fright_19.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Start by luring the shieldless Spearbone out of range of the Blazebones above, then climb the stairs to rush down the projectile throwers. Be sure to look at the ruined home at the first landing below the first Blazebone for a yellow chest that has 2 **Yaoguai Core** and 3 **Tiny Piece of Gold**.\n### The Third Buddha’s Eyeball\"\n        - Following Text: \"Fight your way to the top of the stairs and keep staff spinning to deflect the ranged attacks until all the Blazebones are dead. At the end of this high raised wooden platform you’ll find another of the giant statue heads, allowing you to take its Buhdda’s Eyeball.\n![Wukong Fright 19.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f3/Wukong_Fright_19.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player-character in **Black Myth: Wukong** navigating a high wooden platform while engaging in combat with an enemy. To the right, a glowing **giant statue head** with illuminated eyes is visible, which is likely the **Buddha’s Eyeball** mentioned in the walkthrough. This scene aligns with the guide's instructions to defeat enemies and retrieve the eyeball at the end of the platform."
}