{
    "chunk_id": 623462570027,
    "source_file": "Webbed_Hollow_-_Middle_Hollow_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/36/Wukong_MiddleHollow_24.jpg",
    "alt_text": "Wukong MiddleHollow 24.jpg",
    "position_desc": 24,
    "img_above_text": "She'll warn you to leave things alone, and bid you to find your friend instead. Since we're not much for following orders, go ahead and remove the Talisman from the purple altar, and keep your eyes out for more in this chapter - they'll help us unlock a big secret!\nMoving ahead on this path, you'll cross a large bridge where a Dragonfly Guai archer is posted overlooking the lower path we'll explore next.",
    "img_below_text": "Beyond the bridge is another next of Amourworms hiding in cocoons, and just past them the passageway opens out into a grassy area.\n![Wukong MiddleHollow 25.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/77/Wukong_MiddleHollow_25.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"She'll warn you to leave things alone, and bid you to find your friend instead. Since we're not much for following orders, go ahead and remove the Talisman from the purple altar, and keep your eyes out for more in this chapter - they'll help us unlock a big secret!\nMoving ahead on this path, you'll cross a large bridge where a Dragonfly Guai archer is posted overlooking the lower path we'll explore next.\"\n        - Following Text: \"Beyond the bridge is another next of Amourworms hiding in cocoons, and just past them the passageway opens out into a grassy area.\n![Wukong MiddleHollow 25.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/77/Wukong_MiddleHollow_25.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dark, rocky cavern environment with clusters of cocoon-like formations and webbing scattered across the ground and walls. A character, armed with a glowing staff or weapon, is engaged in combat or exploration amidst the eerie surroundings. This scene aligns with the narrative progression described, where the player encounters Amourworms hiding in cocoons shortly after crossing a bridge, transitioning into a grassy area beyond."
}