{
    "chunk_id": 333202157983,
    "source_file": "Sandgate_Village_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/cc/Wukong_Sandgate_2.jpg",
    "alt_text": "Wukong Sandgate 2.jpg",
    "position_desc": 2,
    "img_above_text": "In Black Myth Wukong’s second chapter, you’ll leave behind the forests of Black Wind Mountain for the dry sands of the Yellow Wind Ridge. An energetic (yet headless) man playing a Chinese lute (known as a sanxian) will set the stage for this realm, and helpfully revive our Destined One from becoming a pincushion full of arrows.\n## Yellow Wind Ridge",
    "img_below_text": "When you regain control, head into the stagnant shallow pool of water, where you’ll find a few Jade Lotus to harvest. Over on the right, the source of the arrows you became riddled with will become apparent, as a nearby ridge is lined with Rat Archers who will fire long salvos of flaming arrows from above.\n![Wukong Sandgate 3.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/34/Wukong_Sandgate_3.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"In Black Myth Wukong’s second chapter, you’ll leave behind the forests of Black Wind Mountain for the dry sands of the Yellow Wind Ridge. An energetic (yet headless) man playing a Chinese lute (known as a sanxian) will set the stage for this realm, and helpfully revive our Destined One from becoming a pincushion full of arrows.\n## Yellow Wind Ridge\"\n        - Following Text: \"When you regain control, head into the stagnant shallow pool of water, where you’ll find a few Jade Lotus to harvest. Over on the right, the source of the arrows you became riddled with will become apparent, as a nearby ridge is lined with Rat Archers who will fire long salvos of flaming arrows from above.\n![Wukong Sandgate 3.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/34/Wukong_Sandgate_3.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the protagonist of *Black Myth: Wukong* wading through a shallow, stagnant pool of water in the Yellow Wind Ridge area. A notification indicates the collection of a \"Jade Lotus\" item nearby. In the background, a rocky ridge is visible, with Rat Archers positioned above, firing flaming arrows. This scene highlights exploration, resource gathering, and the looming threat of ranged enemies."
}