{
    "chunk_id": 891037620618,
    "source_file": "Supreme_Gourd.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fe/Furnace_Valley_Walkthrough_%28101%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(101\\).png",
    "position_desc": 1,
    "img_above_text": "## Black Myth: Wukong Supreme Gourd Location\nThe Supreme Gourd can be obtained from Rakshasa Palace within the Flaming Mountains. Upon talking with the NPC here, you can interact with the fire to upgrade your Gourd (it will replace your Old Gourd in your inventory). As mentioned, you will need to have upgraded that Gourd at the Shen Monkey Vendor to its previous maximum of 9 uses using Luojia Fragrant Vines to be able to do this.",
    "img_below_text": "For even more guides and tips on finding all the Gourd customisation items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, Awaken Wine Worm locations, and Luoija Fragrant Vine locations.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Black Myth: Wukong Supreme Gourd Location\nThe Supreme Gourd can be obtained from Rakshasa Palace within the Flaming Mountains. Upon talking with the NPC here, you can interact with the fire to upgrade your Gourd (it will replace your Old Gourd in your inventory). As mentioned, you will need to have upgraded that Gourd at the Shen Monkey Vendor to its previous maximum of 9 uses using Luojia Fragrant Vines to be able to do this.\"\n        - Following Text: \"For even more guides and tips on finding all the Gourd customisation items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, Awaken Wine Worm locations, and Luoija Fragrant Vine locations.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from *Black Myth: Wukong*, showing the interior of the Rakshasa Palace within the Flaming Mountains. The highlighted elements (circled in red) likely indicate interactable objects, including a glowing fire and a nearby NPC. This setting is where players can upgrade their Gourd to the Supreme Gourd after meeting specific requirements, as described in the preceding text."
}