{
    "chunk_id": 29200924321,
    "source_file": "Skandha_of_Feeling.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/45/Skanda_of_Feeling.jpg",
    "alt_text": "Skanda of Feeling.jpg",
    "position_desc": 1,
    "img_above_text": "The Skandha of Feeling is one of the rarer Key Items in Black Myth: Wukong, as it is easy to miss, hidden away behind a secret boss in Yellow Wind Ridge. Despite collecting the Skandha of Felling in one of the earliest chapters, you won't actually be able to use the item until the very last area of the game in Chapter 6.\n_\"Emotion is the child of uncertainty, born from the touch of experience. Once hidden inside the Buddha's head, this treasure has a secret yet to be revealed.\"_",
    "img_below_text": "The Skanda of Feeling can be obtained by defeating Shigandang in Fright Cliff - Rock Clash Platform in Yellow Wind Ridge. This boss is located in the arena where you fought the Stone Vanguard, but you will need to activate it by interacting with the rock in the arena after collecting all 6 of the Buddha's Eyeballs throughout Yellow Wind Ridge.\nDefeating Shigandang isn't an easy task, as it has a lot of powerful moves. But, our guide on the boss fight breaks down everything you need to know.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Skandha of Feeling is one of the rarer Key Items in Black Myth: Wukong, as it is easy to miss, hidden away behind a secret boss in Yellow Wind Ridge. Despite collecting the Skandha of Felling in one of the earliest chapters, you won't actually be able to use the item until the very last area of the game in Chapter 6.\n_\"Emotion is the child of uncertainty, born from the touch of experience. Once hidden inside the Buddha's head, this treasure has a secret yet to be revealed.\"_\"\n        - Following Text: \"The Skanda of Feeling can be obtained by defeating Shigandang in Fright Cliff - Rock Clash Platform in Yellow Wind Ridge. This boss is located in the arena where you fought the Stone Vanguard, but you will need to activate it by interacting with the rock in the arena after collecting all 6 of the Buddha's Eyeballs throughout Yellow Wind Ridge.\nDefeating Shigandang isn't an easy task, as it has a lot of powerful moves. But, our guide on the boss fight breaks down everything you need to know.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image displays the inventory screen from *Black Myth: Wukong*, showcasing the \"Skandha of Feeling,\" a rare Key Item. The item's description highlights its philosophical significance, stating, \"Emotion is the child of uncertainty, born from the touch of experience,\" and hints at a hidden secret tied to its origin within the Buddha's head. This item is obtained by defeating the secret boss Shigandang in Yellow Wind Ridge after collecting all 6 Buddha's Eyeballs, and it plays a role in the game's final chapter."
}