{
    "chunk_id": 400690337294,
    "source_file": "The_Second_Sister.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/16/Wukong_Lanxi_23.jpg",
    "alt_text": "Wukong Lanxi 23.jpg",
    "position_desc": 3,
    "img_above_text": "![Wukong Lanxi 22.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f0/Wukong_Lanxi_22.jpg)\nWhen she follows up her mad dance with a giant leap, roll forward to dodge under her slam, and you'll be able to pivot and unleash an attack of your own.",
    "img_below_text": "She has a particularly damaging attack where she'll extend both front legs far to the sides, and you'll be able to spot a gleam along them before she thrusts both legs together in a pincer strike. Time it right by using Rock Solid when you spot the legs gleam, and you can knock her back.\n![Wukong Lanxi 25.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7f/Wukong_Lanxi_25.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Lanxi 22.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f0/Wukong_Lanxi_22.jpg)\nWhen she follows up her mad dance with a giant leap, roll forward to dodge under her slam, and you'll be able to pivot and unleash an attack of your own.\"\n        - Following Text: \"She has a particularly damaging attack where she'll extend both front legs far to the sides, and you'll be able to spot a gleam along them before she thrusts both legs together in a pincer strike. Time it right by using Rock Solid when you spot the legs gleam, and you can knock her back.\n![Wukong Lanxi 25.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7f/Wukong_Lanxi_25.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat scene from *Black Myth: Wukong*, showcasing the player character engaged in a battle against a boss named \"The Second Sister.\" The environment is dark and atmospheric, with a traditional building in the background and dense foliage surrounding the area. The boss appears to be a large, insect-like creature emitting a glowing green attack. The preceding and following text provides strategies for dodging and countering the boss's moves, emphasizing timing and positioning during its powerful attacks."
}