{
    "chunk_id": 129215501090,
    "source_file": "Chapter_1_Secret_-_Ancient_Guanyin_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fb/Wukong_Guanyin_11.jpg",
    "alt_text": "Wukong Guanyin 11.jpg",
    "position_desc": 9,
    "img_above_text": "![Wukong Guanyin 5.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/23/Wukong_Guanyin_5.jpg)\nHe can also perform the palm blast wave after charging up, only Jinchi will also summon all of the wandering spirits to increase the power of his blast and delay its attack, which you’ll really want to be careful to dodge at the right time.",
    "img_below_text": "The Wandering Wight’s most annoying attack to deal with also returns, as Jinchi can raise his fist high and then slam it down, creating a single shockwave blast, or keeping his hand in the ground to erupt the ground at farther distances up to three times (which is a good time to run away and hit any wandering corpses). Seeing him raise up his hand for this attack is one of the best times to try **Immobilizing him** and dealing enough damage to stagger him out of the attack before he can truly start it.\nSimilarly, you can use the Wandering Wight’s Spirit Attack to quickly stagger Jinchi, which is great for breaking him out of otherwise dangerous moves - provided you do so before the attack lands since it can still hurt your health bar.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Guanyin 5.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/23/Wukong_Guanyin_5.jpg)\nHe can also perform the palm blast wave after charging up, only Jinchi will also summon all of the wandering spirits to increase the power of his blast and delay its attack, which you’ll really want to be careful to dodge at the right time.\"\n        - Following Text: \"The Wandering Wight’s most annoying attack to deal with also returns, as Jinchi can raise his fist high and then slam it down, creating a single shockwave blast, or keeping his hand in the ground to erupt the ground at farther distances up to three times (which is a good time to run away and hit any wandering corpses). Seeing him raise up his hand for this attack is one of the best times to try **Immobilizing him** and dealing enough damage to stagger him out of the attack before he can truly start it.\nSimilarly, you can use the Wandering Wight’s Spirit Attack to quickly stagger Jinchi, which is great for breaking him out of otherwise dangerous moves - provided you do so before the attack lands since it can still hurt your health bar.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss battle against \"Elder Jinchi\" in *Black Myth: Wukong*. Jinchi, a large humanoid figure with glowing cracks and a golden aura, is shown performing a powerful attack, causing debris to rise and the ground to erupt. The player character, wielding a staff, is engaged in combat, emphasizing the need to dodge or stagger Jinchi to interrupt his devastating moves, as described in the accompanying text. The environment features traditional Chinese architecture and a dark, ominous atmosphere."
}