{
    "chunk_id": 289746071458,
    "source_file": "Crouching_Tiger_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/78/Wukong_Tiger_14.jpg",
    "alt_text": "Wukong Tiger 14.jpg",
    "position_desc": 12,
    "img_above_text": "One major trick the Tiger Vanguard has up his sleeve is the power to turn to stone. He’ll try and bait you into this when spreading his arms wide or crouching down, but try not to take the bait, and use the time to heal, use consumables, or ready a Transformation.\nAt the start, attacking him will prompt him to soak the blow and retaliate with a large punch when he comes out of his stone form. This time can be much better spent charging up your own heavy attack to hit him with the moment he comes out of the form and shakes off the dust.",
    "img_below_text": "Unfortunately, after the fight goes on for a bit, he won’t wait around to fool you. Whether you strike his stone form or not, he’ll use his own version of Cloud Step to race around the arena, and try to ambush you from a random angle. Watch for the signs of the blood splashing to anticipate where he’s coming from, and either let your stamina recharge to evade, or turn the tables on him with a Cloud Step of your own when he comes out of hiding.\nAfter the fight has raged for a bit and you may think you have a handle on this, you must still beware the Tiger Vanguard’s sword. He may deploy it sparingly, but when unsheathed it can deal a world of hurt and easily kill you before you’re able to find a time to heal. Knowing when that blade is coming is crucial to surviving the latter half of the fight.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"One major trick the Tiger Vanguard has up his sleeve is the power to turn to stone. He’ll try and bait you into this when spreading his arms wide or crouching down, but try not to take the bait, and use the time to heal, use consumables, or ready a Transformation.\nAt the start, attacking him will prompt him to soak the blow and retaliate with a large punch when he comes out of his stone form. This time can be much better spent charging up your own heavy attack to hit him with the moment he comes out of the form and shakes off the dust.\"\n        - Following Text: \"Unfortunately, after the fight goes on for a bit, he won’t wait around to fool you. Whether you strike his stone form or not, he’ll use his own version of Cloud Step to race around the arena, and try to ambush you from a random angle. Watch for the signs of the blood splashing to anticipate where he’s coming from, and either let your stamina recharge to evade, or turn the tables on him with a Cloud Step of your own when he comes out of hiding.\nAfter the fight has raged for a bit and you may think you have a handle on this, you must still beware the Tiger Vanguard’s sword. He may deploy it sparingly, but when unsheathed it can deal a world of hurt and easily kill you before you’re able to find a time to heal. Knowing when that blade is coming is crucial to surviving the latter half of the fight.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight with the \"Tiger Vanguard\" in a dark, atmospheric arena filled with blood-red water. The player character is engaged in combat, with the boss seemingly in a crouched or transitional state. The health bar at the bottom indicates the boss's remaining vitality. The context suggests this moment occurs during a critical phase of the fight, where the player must anticipate the boss's attacks, including its ability to turn to stone or use swift ambush tactics. The HUD elements show player abilities and resources, emphasizing strategic gameplay."
}