{
    "chunk_id": 137664383827,
    "source_file": "How_to_Upgrade_Your_Health,_Magic,_and_Stamina.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f0/Health_Mana_Stamina_Upgrades_%282%29.png",
    "alt_text": "Health Mana Stamina Upgrades \\(2\\).png",
    "position_desc": 1,
    "img_above_text": "3. Give Mind Cores to Xu Dog in exchange for buffs\n### How to Use Skills to Upgrade Health, Mana, and Stamina",
    "img_below_text": "The first way to upgrade your Health, Magic, and Stamina levels is to unlock skills. Open the Self-Advancement sub-menu from the main menu.\nOnce you're here, you can use the Foundation tab to upgrade your Health, Stamina, and Mana. Look for the Survival category, and you'll see the top two icons are for increasing your Health and Stamina.**Robust Constitution increases your health, while Rampant Vigor will boost your Stamina**. You can upgrade these both 6 times to give you an extra boost.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"3. Give Mind Cores to Xu Dog in exchange for buffs\n### How to Use Skills to Upgrade Health, Mana, and Stamina\"\n        - Following Text: \"The first way to upgrade your Health, Magic, and Stamina levels is to unlock skills. Open the Self-Advancement sub-menu from the main menu.\nOnce you're here, you can use the Foundation tab to upgrade your Health, Stamina, and Mana. Look for the Survival category, and you'll see the top two icons are for increasing your Health and Stamina.**Robust Constitution increases your health, while Rampant Vigor will boost your Stamina**. You can upgrade these both 6 times to give you an extra boost.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "1. **Summary**: The image displays the \"Foundation\" skill tree menu from a video game, specifically focusing on the \"Survival\" category. This section allows players to enhance their physical attributes, such as Health and Stamina, by unlocking and upgrading skills. The highlighted description emphasizes the importance of physical strengthening for survival and performance.\n\n2. **Purpose/Role**: The image serves as a visual guide to explain how players can use the skill tree to improve their character's survivability by investing in the \"Survival\" skills, which are crucial for progressing in the game."
}