{
    "chunk_id": 815224199836,
    "source_file": "Pagoda_Realm_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/ba/Wukong_Pagoda_78.jpg",
    "alt_text": "Wukong Pagoda 78.jpg",
    "position_desc": 75,
    "img_above_text": "When you're ready, it's time to stop that awful chanting once and for all by heading into the pagoda itself.\n## Yaoguai King Boss Fight - Captain Wise-Voice",
    "img_below_text": "Much like Captain Lotus-Vision, the second Captain of the Pagoda Realm is a creepy one, with a strange construct-like shape with four legs, housing an golden sphere adorned with dragons that serves as its central core. The rest of the construct is highly resistant to damage, meaning you'll need to stun it so that you can take a shot at its most vulnerable part.\nOnly one of its legs is susceptible to attack, where you can see an orange glow emanating from its front right leg, so try to focus your attacks there whenever possible to try and stagger it.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"When you're ready, it's time to stop that awful chanting once and for all by heading into the pagoda itself.\n## Yaoguai King Boss Fight - Captain Wise-Voice\"\n        - Following Text: \"Much like Captain Lotus-Vision, the second Captain of the Pagoda Realm is a creepy one, with a strange construct-like shape with four legs, housing an golden sphere adorned with dragons that serves as its central core. The rest of the construct is highly resistant to damage, meaning you'll need to stun it so that you can take a shot at its most vulnerable part.\nOnly one of its legs is susceptible to attack, where you can see an orange glow emanating from its front right leg, so try to focus your attacks there whenever possible to try and stagger it.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the Yaoguai King, a boss encountered in the Pagoda Realm, as described in the walkthrough. The creature has a construct-like appearance with four legs and a golden sphere adorned with dragon motifs as its core. The environment is dark and ominous, with the boss's front right leg glowing orange, indicating its vulnerable point. This visual aligns with the guide's instructions to focus attacks on this weak spot to stagger the boss."
}