{
    "chunk_id": 841138393863,
    "source_file": "Field_of_Fire_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4c/Field_Fire_Walkthrough_%2828%29.png",
    "alt_text": "Field Fire Walkthrough \\(28\\).png",
    "position_desc": 33,
    "img_above_text": "Let the cutscene play out as you approach and see the Pale-Axe Stalwart from the mouth of the cart, and then be prepared to use everything you've got against the most aggressive coffin cart of the Chapter.\nIt will combine the movesets from the previous three carts you've encountered and add its own to the mix. While some moves will seem familiar, others you'll need to learn to avoid.",
    "img_below_text": "Use Immobilize when you can to stop it from zooming around and follow up with combo attacks quickly. Landing heavy attacks in this manner will knock the cart down, leaving it vulnerable to further follow-up attacks.\n![Field Fire Walkthrough \\(30\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bd/Field_Fire_Walkthrough_%2830%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Let the cutscene play out as you approach and see the Pale-Axe Stalwart from the mouth of the cart, and then be prepared to use everything you've got against the most aggressive coffin cart of the Chapter.\nIt will combine the movesets from the previous three carts you've encountered and add its own to the mix. While some moves will seem familiar, others you'll need to learn to avoid.\"\n        - Following Text: \"Use Immobilize when you can to stop it from zooming around and follow up with combo attacks quickly. Landing heavy attacks in this manner will knock the cart down, leaving it vulnerable to further follow-up attacks.\n![Field Fire Walkthrough \\(30\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bd/Field_Fire_Walkthrough_%2830%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss encounter in a rocky, desolate environment. The boss, a large, ornate, and menacing creature resembling a flaming, lion-like cart, is facing off against the player character wielding a flaming weapon. This scene aligns with the guide's description of the \"most aggressive coffin cart\" in the chapter, combining movesets from previous encounters and requiring strategic use of abilities like Immobilize and heavy attacks to defeat."
}