{
    "chunk_id": 617093787214,
    "source_file": "Mother_of_Flamlings_Spirit.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/42/Mother_of_Flamlings_Location.jpg",
    "alt_text": "Mother of Flamlings Location.jpg",
    "position_desc": 2,
    "img_above_text": "Once you've completed the Iron Ball challenge in the Flaming Mountains and unlocked the Fallen Furnace Crater Keeper's Shrine, head back down the hill and take the newly opened passage on the left. Follow the path until you find a pile of glowing rocks lying in a large clearing. Approach the rocks to awaken the Flint Vanguard.\nContinue down the path after you've defeated the Flint Vanguard, and look to the left to find a small, glowing spot in the ground. Interact with the glowing spot and deliver **four Flame Ores** to summon the Mother of Flamlings.",
    "img_below_text": "You can get Flame Ores by defeating Flamlings.\n## Mother of Flamlings Fight",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Once you've completed the Iron Ball challenge in the Flaming Mountains and unlocked the Fallen Furnace Crater Keeper's Shrine, head back down the hill and take the newly opened passage on the left. Follow the path until you find a pile of glowing rocks lying in a large clearing. Approach the rocks to awaken the Flint Vanguard.\nContinue down the path after you've defeated the Flint Vanguard, and look to the left to find a small, glowing spot in the ground. Interact with the glowing spot and deliver **four Flame Ores** to summon the Mother of Flamlings.\"\n        - Following Text: \"You can get Flame Ores by defeating Flamlings.\n## Mother of Flamlings Fight\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from a video game where the player character is standing in a volcanic landscape, ready to deliver Flame Ores at a glowing spot on the ground. This action is part of a quest to summon the Mother of Flamlings, following the defeat of the Flint Vanguard. The player is prompted to press the \"RT\" button to deliver the required items."
}