{
    "chunk_id": 758530506650,
    "source_file": "Celestial_Jade_Lotus_Pill_Locations.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5e/Yellow_Wind_Jade_Lotus.jpg",
    "alt_text": "Yellow Wind Jade Lotus.jpg",
    "position_desc": 2,
    "img_above_text": "## Yellow Wind Ridge Celestial Jade Lotus Pill\nYellow Wind Ridge Celestial Jade Lotus Pill",
    "img_below_text": "The Celestial Jade Lotus Pill in Chapter 2 is hidden deep within the Crouching Tiger Temple. To reach it, you must defeat both the Tiger Vanguard and Stone Vanguard to collect the Sternness of Stone and Keenness of Tiger items. Place those items in the Tally in the Crouching Tiger Temple arena to open a secret door leading to the Cellar.\nThe Celestial Jade Lotus Pill can be found in a golden chest on the left wall of the Cellar.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Yellow Wind Ridge Celestial Jade Lotus Pill\nYellow Wind Ridge Celestial Jade Lotus Pill\"\n        - Following Text: \"The Celestial Jade Lotus Pill in Chapter 2 is hidden deep within the Crouching Tiger Temple. To reach it, you must defeat both the Tiger Vanguard and Stone Vanguard to collect the Sternness of Stone and Keenness of Tiger items. Place those items in the Tally in the Crouching Tiger Temple arena to open a secret door leading to the Cellar.\nThe Celestial Jade Lotus Pill can be found in a golden chest on the left wall of the Cellar.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a richly detailed temple interior, featuring ornate statues and carvings, with a central fire-lit altar. The \"RT Open\" prompt suggests interactive gameplay, likely involving opening an object or progressing in the quest. Based on the context, this scene is part of the Crouching Tiger Temple in Chapter 2, where players seek the Celestial Jade Lotus Pill. The setting aligns with the narrative of defeating vanguards, collecting items, and unlocking a secret door to access the Cellar containing the pill."
}