{
    "chunk_id": 366370578763,
    "source_file": "Foothills_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/6c/Foothills_Walkthrough_%2873%29.png",
    "alt_text": "Foothills Walkthrough \\(73\\).png",
    "position_desc": 80,
    "img_above_text": "When he gets back up, use the Plantain Fan to stagger him and remove the lightning attacks and then folow up.\nSon of Stones",
    "img_below_text": "When the Sone of Stones is down, there's just one more boss to take care of, which is a secret Yoaguai King. To be able to summon it, you'll need to have collected the Skandhas through the previous Chapters. If you haven't already got your hands on these Skandhas, follow our guide to collecting them all here.\nGo to the clearing behind where you fought the Son of Stones, just off to the left. You'll see some water, a large rock to the left of it, and two golden trees on either side of the rock.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"When he gets back up, use the Plantain Fan to stagger him and remove the lightning attacks and then folow up.\nSon of Stones\"\n        - Following Text: \"When the Sone of Stones is down, there's just one more boss to take care of, which is a secret Yoaguai King. To be able to summon it, you'll need to have collected the Skandhas through the previous Chapters. If you haven't already got your hands on these Skandhas, follow our guide to collecting them all here.\nGo to the clearing behind where you fought the Son of Stones, just off to the left. You'll see some water, a large rock to the left of it, and two golden trees on either side of the rock.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the \"Son of Stones,\" a large, rock-like boss creature, seemingly defeated and collapsed on the ground in a forested area. This moment aligns with the walkthrough's description of defeating the Son of Stones using the Plantain Fan to stagger it and remove its lightning attacks. The setting transitions the player to the next objective, involving the summoning of a secret Yoaguai King in a nearby clearing."
}