{
    "chunk_id": 311528404803,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/05/Wukong_Fright_54.jpg",
    "alt_text": "Wukong Fright 54.jpg",
    "position_desc": 60,
    "img_above_text": "Just beyond where the Rat Governor was guarding, you can find a **Meditation Spot** down a short flight of stairs that overlooks the ravine, granting you a free Skill Point for resting here.\nThe Ravine, Rock Clash Platform Meditation Spot",
    "img_below_text": "To proceed, head back up the stairs and take a left where a group of braziers are. In the middle of this path is a small altar with a yellow pot, and inside you’ll find a **Celestial Taiyi Pill** , raising your maximum Mana once more by a considerable amount!\nYellow Wind Ridge Celestial Taiyi Pill",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Just beyond where the Rat Governor was guarding, you can find a **Meditation Spot** down a short flight of stairs that overlooks the ravine, granting you a free Skill Point for resting here.\nThe Ravine, Rock Clash Platform Meditation Spot\"\n        - Following Text: \"To proceed, head back up the stairs and take a left where a group of braziers are. In the middle of this path is a small altar with a yellow pot, and inside you’ll find a **Celestial Taiyi Pill** , raising your maximum Mana once more by a considerable amount!\nYellow Wind Ridge Celestial Taiyi Pill\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character in a dark, rocky area with lit braziers and a glowing item marked by a red circle in the background. This scene aligns with the preceding and following text, suggesting it is near the Meditation Spot overlooking the ravine and close to the path leading to the altar with the **Celestial Taiyi Pill**. The glowing item appears to represent collectible \"Will\" points, as indicated by the \"+4 Will x18\" displayed on the screen."
}