{
    "chunk_id": 642857505507,
    "source_file": "Old_Ginseng_Guai.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/94/Wukong_Karma_18.jpg",
    "alt_text": "Wukong Karma 18.jpg",
    "position_desc": 8,
    "img_above_text": "![Wukong Karma 17.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3f/Wukong_Karma_17.jpg)\nAfter he's done creating the root system, he'll finally tear the whole thing up in a massive burst (at which point you can slam down from your Pillar Stance), however in doing so he'll summon a small group of mini Ginsenglings to attack you.",
    "img_below_text": "They behave much in the same way as regular Ginsenglings do, moving slightly faster than the boss, which can help you lure them away from his attacks. Prioritize taking them out first so you don't get blindsided later, and try the Ashen Slumber transformation spell to detonate yourself near them, or use Spirit Attacks with wide reaches.\n![Wukong Karma 12.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/80/Wukong_Karma_12.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Karma 17.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3f/Wukong_Karma_17.jpg)\nAfter he's done creating the root system, he'll finally tear the whole thing up in a massive burst (at which point you can slam down from your Pillar Stance), however in doing so he'll summon a small group of mini Ginsenglings to attack you.\"\n        - Following Text: \"They behave much in the same way as regular Ginsenglings do, moving slightly faster than the boss, which can help you lure them away from his attacks. Prioritize taking them out first so you don't get blindsided later, and try the Ashen Slumber transformation spell to detonate yourself near them, or use Spirit Attacks with wide reaches.\n![Wukong Karma 12.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/80/Wukong_Karma_12.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game \"Black Myth: Wukong,\" showing the player character engaged in combat with an enemy named \"Old Ginseng Guai.\" The player has options for attacks, including \"Light Attack 'Earth Shatter'\" and \"Heavy Attack 'Mountain Splitter'.\" The context provided indicates that this encounter follows a larger battle where the boss summons mini Ginsenglings to attack the player. The image illustrates the combat mechanics and the environment where the battle takes place."
}