{
    "chunk_id": 742869175571,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/63/Wukong_Fright_50.jpg",
    "alt_text": "Wukong Fright 50.jpg",
    "position_desc": 56,
    "img_above_text": "Note - This arena is actually home to more than one boss, and it’s hiding in plain sight. Near the entrance you came in through the large archway, there’s a large stone on the side, and on closer inspection has many heads carved into it. Draw close, and you’ll be able to interact with it, inserting the six Buddha Eyeballs you gained from the statue heads around the Fright Cliff. Doing so will unlock the Shigandang secret boss battle. It’s a much tougher fight than the Stone Vanguard, and we recommend saving it for the tail end of this chapter, either after you’ve cleared it or are close to doing so.\n## Rock Clash Platform",
    "img_below_text": "Just beyond the arena where you fought the Stone Vanguard, you can find a new Shrine to rest at. Defeating the Stone Vanguard will unlock a new armor set to craft: The Galeguard Set, which will grant you certain bonuses when utilizing Perfect Dodges.\n![Wukong Fright 51.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/93/Wukong_Fright_51.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Note - This arena is actually home to more than one boss, and it’s hiding in plain sight. Near the entrance you came in through the large archway, there’s a large stone on the side, and on closer inspection has many heads carved into it. Draw close, and you’ll be able to interact with it, inserting the six Buddha Eyeballs you gained from the statue heads around the Fright Cliff. Doing so will unlock the Shigandang secret boss battle. It’s a much tougher fight than the Stone Vanguard, and we recommend saving it for the tail end of this chapter, either after you’ve cleared it or are close to doing so.\n## Rock Clash Platform\"\n        - Following Text: \"Just beyond the arena where you fought the Stone Vanguard, you can find a new Shrine to rest at. Defeating the Stone Vanguard will unlock a new armor set to craft: The Galeguard Set, which will grant you certain bonuses when utilizing Perfect Dodges.\n![Wukong Fright 51.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/93/Wukong_Fright_51.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character in the video game *Black Myth: Wukong* advancing through a rocky, open area near a large stone structure and sparse vegetation. This scene likely follows the battle with the Stone Vanguard boss, as described in the preceding and following text. The area shown may lead to the Shrine mentioned in the guide, where players can rest and unlock rewards, such as the Galeguard armor set."
}