{
    "chunk_id": 165175617384,
    "source_file": "Snowhill_Path_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c0/Wukong_Snowhill_25.jpg",
    "alt_text": "Wukong Snowhill 25.jpg",
    "position_desc": 24,
    "img_above_text": "These formidable foes are pretty beefy, and use their wicked weapons to throw at you like boomerangs from a distance. They can also string long combo attacks together, requiring you to interrupt one with a Rock Solid deflection or wait until their final leaping slash or delayed uppercut to retaliate.\nOnce the Patroller is down, you can find a green Wisp to absorb at the foot of the building to replenish your gourd, but there's not much else here.",
    "img_below_text": "Instead, return to the temple entrance and look for stairs leading upward. Be wary of more Frozen Corpses coming to life as you ascend, and another will try and ambush you from the left as you reach the next landing.\n![Wukong Snowhill 26.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e1/Wukong_Snowhill_26.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"These formidable foes are pretty beefy, and use their wicked weapons to throw at you like boomerangs from a distance. They can also string long combo attacks together, requiring you to interrupt one with a Rock Solid deflection or wait until their final leaping slash or delayed uppercut to retaliate.\nOnce the Patroller is down, you can find a green Wisp to absorb at the foot of the building to replenish your gourd, but there's not much else here.\"\n        - Following Text: \"Instead, return to the temple entrance and look for stairs leading upward. Be wary of more Frozen Corpses coming to life as you ascend, and another will try and ambush you from the left as you reach the next landing.\n![Wukong Snowhill 26.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e1/Wukong_Snowhill_26.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a snowy temple courtyard in *Black Myth: Wukong*, where the player character is preparing to confront enemies. A Frozen Corpse is emerging from the left, while other foes, including a Patroller, are visible ahead. The setting aligns with the walkthrough's guidance about navigating the area, dealing with ambushes, and progressing toward the temple stairs."
}