{
    "chunk_id": 760660343663,
    "source_file": "Black_Wind_Cave_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/33/Wukong_BlackWind_42.jpg",
    "alt_text": "Wukong BlackWind 42.jpg",
    "position_desc": 39,
    "img_above_text": "![Wukong BlackWind 40.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/57/Wukong_BlackWind_40.jpg)\nThis fight will last awhile, so be sure to be mindful of your stamina and back off when you need to recover, or reposition yourself if you find yourself too close to any fire pits he’s created. It’s much better to wait and find a better avenue of attack than getting too reckless and being burned as a result.",
    "img_below_text": "When he’s finally defeated, the Black Bear Guai will try and flee with the sense of the Great Sage, only for it to reject his escape attempt. As he realizes your true purpose, he’ll plead for mercy, blaming the Celestial Palace. It matters little, as the true object of your quest in the Black Wind Mountain is now yours - The Craving Eyes Relic.\nBlack Bear Guai",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong BlackWind 40.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/57/Wukong_BlackWind_40.jpg)\nThis fight will last awhile, so be sure to be mindful of your stamina and back off when you need to recover, or reposition yourself if you find yourself too close to any fire pits he’s created. It’s much better to wait and find a better avenue of attack than getting too reckless and being burned as a result.\"\n        - Following Text: \"When he’s finally defeated, the Black Bear Guai will try and flee with the sense of the Great Sage, only for it to reject his escape attempt. As he realizes your true purpose, he’ll plead for mercy, blaming the Celestial Palace. It matters little, as the true object of your quest in the Black Wind Mountain is now yours - The Craving Eyes Relic.\nBlack Bear Guai\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a character from *Black Myth: Wukong*, likely the protagonist, Wukong (the Monkey King), holding a weapon and showcasing detailed textures and lighting. The preceding text suggests this is part of a challenging fight against the Black Bear Guai, requiring strategic stamina management and avoidance of fire pits. The following text indicates the character's victory leads to obtaining the Craving Eyes Relic, advancing the narrative."
}