{
    "chunk_id": 759599481613,
    "source_file": "Tiger_Tally.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f6/Tiger_Tally.jpg",
    "alt_text": "Tiger Tally.jpg",
    "position_desc": 1,
    "img_above_text": "The Tiger Tally is another tiger-themed item you can find in Chapter 2 of Black Myth: Wukong, specifically a Curios item. It is one of the harder Curios items to find as it is located within the secret area of Chapter 2.\nWith the Tiger Tally equipped, you will get the following buff: Upon successful hits with light attack combo, moderately increases attack for a short duration. This is a specialized effect, requiring a trigger to activate, but the damage buff is decent, and most of the time you will be landing a full light attack combo in a fight anyway.",
    "img_below_text": "All Curios items in Black Myth: Wukong can't be upgraded, so you aren't able to increase their power or potency. Therefore, you will want to switch to other Curios items to better fit your build as you play. This can be done at any point from the Equipment menu.\n## Black Myth: Wukong Tiger Tally Location",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"The Tiger Tally is another tiger-themed item you can find in Chapter 2 of Black Myth: Wukong, specifically a Curios item. It is one of the harder Curios items to find as it is located within the secret area of Chapter 2.\nWith the Tiger Tally equipped, you will get the following buff: Upon successful hits with light attack combo, moderately increases attack for a short duration. This is a specialized effect, requiring a trigger to activate, but the damage buff is decent, and most of the time you will be landing a full light attack combo in a fight anyway.\"\n        - Following Text: \"All Curios items in Black Myth: Wukong can't be upgraded, so you aren't able to increase their power or potency. Therefore, you will want to switch to other Curios items to better fit your build as you play. This can be done at any point from the Equipment menu.\n## Black Myth: Wukong Tiger Tally Location\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image displays the Equipment menu from *Black Myth: Wukong*, showcasing the \"Tiger Tally,\" a rare Curios item. The Tiger Tally provides a buff that moderately increases attack for a short duration upon successful light attack combos. It is part of the Curios category, which includes other items like \"Cat Eye Beads\" that slightly increase critical hit chance. The Tiger Tally is highlighted as a specialized item with a trigger-based effect, aligning with the preceding text's description of its utility in combat."
}