{
    "chunk_id": 353002945157,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/88/Wukong_Sandgate_81.jpg",
    "alt_text": "Wukong Sandgate 81.jpg",
    "position_desc": 1,
    "img_above_text": "* Yaoguai King - Stone Vanguard\n* **Rock Crash Platform**",
    "img_below_text": "Fright Cliff is one of the two sub-regions you’ll need to explore in Chapter 2 of Black Myth Wukong in order to unlock the large sealed doors that lead to the end of the chapter. You can first reach this area by heading through the Sandgate Village and defeating the King of Flowing Sands and Second Rat Prince, and then crossing the bridge to the right of the sealed door.\n![Wukong Fright 1.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/97/Wukong_Fright_1.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"* Yaoguai King - Stone Vanguard\n* **Rock Crash Platform**\"\n        - Following Text: \"Fright Cliff is one of the two sub-regions you’ll need to explore in Chapter 2 of Black Myth Wukong in order to unlock the large sealed doors that lead to the end of the chapter. You can first reach this area by heading through the Sandgate Village and defeating the King of Flowing Sands and Second Rat Prince, and then crossing the bridge to the right of the sealed door.\n![Wukong Fright 1.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/97/Wukong_Fright_1.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from *Black Myth: Wukong*, showing the player character navigating through a desolate, rocky area with tall grass and dilapidated wooden structures. This location is likely part of Fright Cliff, a sub-region in Chapter 2, which players must explore to unlock sealed doors leading to the chapter's end. The preceding and following text suggests progression through this area is tied to defeating key enemies and advancing the narrative."
}