{
    "chunk_id": 861867125256,
    "source_file": "Yellow_Loong.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/04/Wukong_YellowLoong_3.jpg",
    "alt_text": "Wukong YellowLoong 3.jpg",
    "position_desc": 8,
    "img_above_text": "After a brief moment, he'll perform a spinning strike that hits twice as he winds up and then slams down his glaive, dealing electric damage all the while. This is a good time to dodge and then get in a light combo, and then start on a new combo chain.\nUsually as you begin your second combo chain, he'll do one of two things. If he performs a spinning flip, he'll retreat backwards, but the end of your combo can usually chase after him and strike regardless.",
    "img_below_text": "However, if you see him raise up his glaive, he'll strike downwards, which you can break off your attack to deflect with Rock Solid, or Immobilize him before the hit lands to finish your second combo.\n![Wukong YellowLoong 15.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bb/Wukong_YellowLoong_15.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"After a brief moment, he'll perform a spinning strike that hits twice as he winds up and then slams down his glaive, dealing electric damage all the while. This is a good time to dodge and then get in a light combo, and then start on a new combo chain.\nUsually as you begin your second combo chain, he'll do one of two things. If he performs a spinning flip, he'll retreat backwards, but the end of your combo can usually chase after him and strike regardless.\"\n        - Following Text: \"However, if you see him raise up his glaive, he'll strike downwards, which you can break off your attack to deflect with Rock Solid, or Immobilize him before the hit lands to finish your second combo.\n![Wukong YellowLoong 15.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bb/Wukong_YellowLoong_15.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat scene from *Black Myth: Wukong*, showcasing the protagonist, Wukong, engaging in battle with the \"Yellow Loong\" enemy. The Yellow Loong is performing a powerful attack, emitting bright, electric-like energy bursts, likely tied to the preceding and following text's description of its glaive-based electric strikes. The image emphasizes the intensity of the fight and the need for strategic dodging or deflection as outlined in the guide."
}