{
    "chunk_id": 256150075099,
    "source_file": "Pagoda_Realm_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/08/Wukong_Pagoda_113.jpg",
    "alt_text": "Wukong Pagoda 113.jpg",
    "position_desc": 109,
    "img_above_text": "Another Falcon Guai will appear not far up on the left side between two much larger trees, but apart from these enemies the rest of this sloping forest is largely devoid of enemies. Be sure to check behind the trees where he appeared to absorb another green Wisp.\nYou can find a path continuing at the top of the slope off to the right, past another Golden Lotus Guai.",
    "img_below_text": "When the path turns into a large valley, another Falcon Guai will appear, only this one is empowered by the Spirit within. You'll need to attack cautiously against this stronger foe, using Spirit attacks to stagger him, and Cloud Step to sidestep his gusts to flank him from the sides. Defeat him, and you'll gain the Falcon Hermit Spirit.\n![Wukong Pagoda 114.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/94/Wukong_Pagoda_114.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Another Falcon Guai will appear not far up on the left side between two much larger trees, but apart from these enemies the rest of this sloping forest is largely devoid of enemies. Be sure to check behind the trees where he appeared to absorb another green Wisp.\nYou can find a path continuing at the top of the slope off to the right, past another Golden Lotus Guai.\"\n        - Following Text: \"When the path turns into a large valley, another Falcon Guai will appear, only this one is empowered by the Spirit within. You'll need to attack cautiously against this stronger foe, using Spirit attacks to stagger him, and Cloud Step to sidestep his gusts to flank him from the sides. Defeat him, and you'll gain the Falcon Hermit Spirit.\n![Wukong Pagoda 114.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/94/Wukong_Pagoda_114.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a snowy, mountainous environment from the game *Black Myth: Wukong*. In the foreground, the protagonist, armed with a staff, approaches a Falcon Guai enemy perched on a rocky ledge. The scene aligns with the walkthrough's description of an encounter with a Falcon Guai, requiring cautious combat tactics. The HUD displays the player's abilities and resources, including \"Will\" with a count of 8, suggesting preparation for the upcoming battle."
}