{
    "chunk_id": 40642595064,
    "source_file": "Centipede_Guai.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0e/Wukong_MiddleHollow_45.jpg",
    "alt_text": "Wukong MiddleHollow 45.jpg",
    "position_desc": 7,
    "img_above_text": "While it does move fast, it's also extremely susceptible to a well-timed Rock Solid Deflection, and when done at the right time, will topple it to the ground. Use this period to unleash your focus points for a big hit, and it will struggle to rise and give you more time to Immobilize it and keep it vulnerable to more damage.\nBe sure to stay on guard when it finally does rise, as it can easily feint into a backward slam with its armored hide.",
    "img_below_text": "At lower health, it may also curl into a ball but fly up into the air to slam down while still curled up. Be wary when trying to counter this move, as it will start to squirm around before unraveling into a quick two-hit claw swipe as it reorients itself.\nThe one last trick it has up its sleeve will occur after losing half its health. When it starts to emit a large screeching roar, break off your attack and start running in the opposite direction.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"While it does move fast, it's also extremely susceptible to a well-timed Rock Solid Deflection, and when done at the right time, will topple it to the ground. Use this period to unleash your focus points for a big hit, and it will struggle to rise and give you more time to Immobilize it and keep it vulnerable to more damage.\nBe sure to stay on guard when it finally does rise, as it can easily feint into a backward slam with its armored hide.\"\n        - Following Text: \"At lower health, it may also curl into a ball but fly up into the air to slam down while still curled up. Be wary when trying to counter this move, as it will start to squirm around before unraveling into a quick two-hit claw swipe as it reorients itself.\nThe one last trick it has up its sleeve will occur after losing half its health. When it starts to emit a large screeching roar, break off your attack and start running in the opposite direction.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a tense boss battle against the \"Centipede Guai,\" a large, insect-like creature. The player character is shown mid-action, preparing to counter or attack, with the boss in its curled-up state, possibly initiating a powerful move. The surrounding environment is dark and ominous, littered with bones and debris, emphasizing the danger. The preceding and following text suggests strategies for exploiting the boss's vulnerabilities, such as timing deflections and avoiding its high-damage attacks as its health decreases."
}