{
    "chunk_id": 480710954495,
    "source_file": "Baw-Li-Guhh-Lang.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a5/Wukong_Bamboo_19.jpg",
    "alt_text": "Wukong Bamboo 19.jpg",
    "position_desc": 6,
    "img_above_text": "![Wukong Bamboo 18.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3b/Wukong_Bamboo_18.jpg)\nFinally, he can unleash a tongue attack that sweeps back and forth with a large reach several times, and will require you to dodge back and forth out of its path — or use your Immobilize to stop him in the act. Using your Red Tide spell to transform can also help out during these attacks as he’ll be vulnerable to getting hit from the side.",
    "img_below_text": "When Baw-Li-Guhh-Lang finally falls, he’ll leave behind his purple Spirit and a Tadpole Material. Using your new Blessed Gourd upgrade, you can now absorb the Spirit and add Baw-Li-Guhh-Lang’s power to your own, and temporarily transform to unleash a tongue attack against several enemies. If you decide to commit to cultivating his spirit and upgrading its damage potential, you can use the Tadpole he dropped to further upgrade it later on.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Bamboo 18.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3b/Wukong_Bamboo_18.jpg)\nFinally, he can unleash a tongue attack that sweeps back and forth with a large reach several times, and will require you to dodge back and forth out of its path — or use your Immobilize to stop him in the act. Using your Red Tide spell to transform can also help out during these attacks as he’ll be vulnerable to getting hit from the side.\"\n        - Following Text: \"When Baw-Li-Guhh-Lang finally falls, he’ll leave behind his purple Spirit and a Tadpole Material. Using your new Blessed Gourd upgrade, you can now absorb the Spirit and add Baw-Li-Guhh-Lang’s power to your own, and temporarily transform to unleash a tongue attack against several enemies. If you decide to commit to cultivating his spirit and upgrading its damage potential, you can use the Tadpole he dropped to further upgrade it later on.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the aftermath of a battle in *Black Myth: Wukong*, where the player character has defeated Baw-Li-Guhh-Lang, a boss enemy. The scene shows the player standing in a grassy area near a glowing purple Spirit and a Tadpole Material, which are rewards dropped by the defeated boss. These items are significant for gameplay progression, as the Spirit can be absorbed to gain the boss's tongue attack ability, and the Tadpole Material can be used for upgrading the acquired power."
}