{
    "chunk_id": 360713070749,
    "source_file": "Twin_Serpents_Staff.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/82/Wukong_Bamboo_42.jpg",
    "alt_text": "Wukong Bamboo 42.jpg",
    "position_desc": 2,
    "img_above_text": "## Black Myth: Wukong Twin Serpents Staff Location\nThe Twin Serpents Staff can be found in Chapter 1 - Black Wind Mountain upon defeating Whiteclad Noble in Bamboo Grove. This is a mandatory boss, so you can't miss him.",
    "img_below_text": "Weapons can be crafted throughout the game from the Shrines throughout the game's six chapters. Crafting weapons will require Will and various Crafting Materials from the game's locales and enemies. To craft the Twin Serpents Staff you will need:\n* 1 Jade Fang",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Black Myth: Wukong Twin Serpents Staff Location\nThe Twin Serpents Staff can be found in Chapter 1 - Black Wind Mountain upon defeating Whiteclad Noble in Bamboo Grove. This is a mandatory boss, so you can't miss him.\"\n        - Following Text: \"Weapons can be crafted throughout the game from the Shrines throughout the game's six chapters. Crafting weapons will require Will and various Crafting Materials from the game's locales and enemies. To craft the Twin Serpents Staff you will need:\n* 1 Jade Fang\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image shows a gameplay moment from *Black Myth: Wukong*, featuring the boss fight against \"Whiteclad Noble\" in a watery environment. This encounter occurs in Chapter 1 at Black Wind Mountain, and defeating this mandatory boss is necessary to obtain the Twin Serpents Staff. The health bar at the bottom indicates the boss's remaining health, while the player interface displays abilities and resources."
}