{
    "chunk_id": 973259584726,
    "source_file": "Field_of_Fire_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/84/Field_Fire_Walkthrough_%2849%29.png",
    "alt_text": "Field Fire Walkthrough \\(49\\).png",
    "position_desc": 45,
    "img_above_text": "![Field Fire Walkthrough \\(52\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c2/Field_Fire_Walkthrough_%2852%29.png)\nWhen he winds his staff to create a ring of fire, the attack looks a lot worse than it actually is. He'll throw out the ring toward you and it will start to bounce around the clearing. Keep track of it by looking up and following it to stay away from where it lands. If you keep moving, it's fairly easy to avoid. After bouncing around a few times, the Red Boy will slam down into the ground to recover the spear. There's a brief pause here while he composes himself, so you'll be able to rush in to attack.",
    "img_below_text": "If he performs the combination of moves where he twirls the spear around him, he'll perform a leap and thrust his spear into the ground, then flip toward you. When he does this, he'll follow it up immediately with a flamethrower from his hand. It's best to dodge all of this moveset, then attack.\nThough it's tempting to create distance, it's better to stay close to the Red Boy during this fight. Not only will this allow you to take advantage of those pauses we mentioned previously, but it also means he's less likely to use projectiles. If you're too far away, he'll shoot fire along the ground to try and reach you.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Field Fire Walkthrough \\(52\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c2/Field_Fire_Walkthrough_%2852%29.png)\nWhen he winds his staff to create a ring of fire, the attack looks a lot worse than it actually is. He'll throw out the ring toward you and it will start to bounce around the clearing. Keep track of it by looking up and following it to stay away from where it lands. If you keep moving, it's fairly easy to avoid. After bouncing around a few times, the Red Boy will slam down into the ground to recover the spear. There's a brief pause here while he composes himself, so you'll be able to rush in to attack.\"\n        - Following Text: \"If he performs the combination of moves where he twirls the spear around him, he'll perform a leap and thrust his spear into the ground, then flip toward you. When he does this, he'll follow it up immediately with a flamethrower from his hand. It's best to dodge all of this moveset, then attack.\nThough it's tempting to create distance, it's better to stay close to the Red Boy during this fight. Not only will this allow you to take advantage of those pauses we mentioned previously, but it also means he's less likely to use projectiles. If you're too far away, he'll shoot fire along the ground to try and reach you.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a combat scene from the video game *Black Myth: Wukong*, featuring a battle between the player character and the boss known as \"Red Boy.\" The environment is a fiery, barren landscape, with flames and molten ground emphasizing the intensity of the fight. The player character wields a staff, while the Red Boy is shown preparing an attack with his spear. This moment aligns with the guide's description of the boss's fire-based attacks and strategies to counter them, such as staying close to exploit pauses in his moves."
}