{
    "chunk_id": 983536758144,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a1/Wukong_Wolves_47.jpg",
    "alt_text": "Wukong Wolves 47.jpg",
    "position_desc": 54,
    "img_above_text": "![Wukong Wolves 46.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/81/Wukong_Wolves_46.jpg)\nHe’ll usually start the fight with a big leaping strike, falling to the ground with one slash, and then quickly following up with a second slash from his other claw. Unfortunately, he’s a pretty evasive foe, and finding the right moments to counter attack can be tricky.",
    "img_below_text": "Certain times, he’ll dodge back after his attacks, but if he pauses to lick his claws, that’s your cue to sprint in (gaining a bonus from the Pilgrim Set) and attack with a quick light combo. Sometimes he may appear to charge the air around him — which means he’s preparing for a damaging howl. That’s your cue to simply run back a few paces to stand outside his range.\nTry not to get disoriented as he strafes before many of his attacks - which can sometimes end in a strafing lunge where he swipes upward as he slides toward you.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Wolves 46.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/81/Wukong_Wolves_46.jpg)\nHe’ll usually start the fight with a big leaping strike, falling to the ground with one slash, and then quickly following up with a second slash from his other claw. Unfortunately, he’s a pretty evasive foe, and finding the right moments to counter attack can be tricky.\"\n        - Following Text: \"Certain times, he’ll dodge back after his attacks, but if he pauses to lick his claws, that’s your cue to sprint in (gaining a bonus from the Pilgrim Set) and attack with a quick light combo. Sometimes he may appear to charge the air around him — which means he’s preparing for a damaging howl. That’s your cue to simply run back a few paces to stand outside his range.\nTry not to get disoriented as he strafes before many of his attacks - which can sometimes end in a strafing lunge where he swipes upward as he slides toward you.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight scene from the video game *Black Myth: Wukong*. The player character, armed with a staff, is engaged in combat with a large, white, wolf-like creature named \"Lingxuzi\" in a detailed outdoor environment featuring traditional Chinese architecture and lush greenery. The preceding and following text provides strategies for countering the boss's leaping strikes, evasive movements, and special attacks, emphasizing timing and positioning during the fight."
}