{
    "chunk_id": 612076129655,
    "source_file": "Yellow_Sand_Formation_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/aa/Wukong_Yellow_36.jpg",
    "alt_text": "Wukong Yellow 36.jpg",
    "position_desc": 39,
    "img_above_text": "We highly recommend checking this place out before taking on the Chapter 2 Boss, as much like Chapter 1, its reward can greatly help you in that battle, and you’ll also find a Meditation Spot in this secret area!\n## Windseal Gate",
    "img_below_text": "There’s only a few places left to explore that comprise the Yellow Wind Formation, and all roads lead to the Windseal Gate. You found one route after defeating the Stone Vanguard that led down the sloping sand canyon to the gate itself, but there’s more doors we haven’t unlocked with the Sterness of Stone and Keeness of Tiger.\n![Wukong Yellow 37.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3c/Wukong_Yellow_37.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"We highly recommend checking this place out before taking on the Chapter 2 Boss, as much like Chapter 1, its reward can greatly help you in that battle, and you’ll also find a Meditation Spot in this secret area!\n## Windseal Gate\"\n        - Following Text: \"There’s only a few places left to explore that comprise the Yellow Wind Formation, and all roads lead to the Windseal Gate. You found one route after defeating the Stone Vanguard that led down the sloping sand canyon to the gate itself, but there’s more doors we haven’t unlocked with the Sterness of Stone and Keeness of Tiger.\n![Wukong Yellow 37.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3c/Wukong_Yellow_37.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from a video game where a character is interacting with a small statue, indicated by the on-screen prompt \"Use Tally.\" This interaction likely serves a purpose related to the game's progression or unlocking new areas, as suggested by the surrounding context discussing exploration and unlocking doors in the Yellow Wind Formation area. The image is part of a guide or walkthrough for navigating and overcoming challenges in this section of the game."
}