{
    "chunk_id": 104076228075,
    "source_file": "New_Thunderclap_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c6/Wukong_Thunderclap_35.jpg",
    "alt_text": "Wukong Thunderclap 35.jpg",
    "position_desc": 34,
    "img_above_text": "It's worth noting that this area only has two real Shrines, and the other is up near the boss room past two Dark-faced Overlords. Given there's more optional bosses and enemies to face, it's not a bad idea to go back and rest at the entrance before making a beeline through the side path to return to the main plaza.\nAt the top of the stairs where all the mages were positioned, there's actually not too much to find here. Several Monk Supporters patrol the building exterior, where you can also find a few Overseeing Monks training along the corners.",
    "img_below_text": "The interior building hides three more Overseeing Monks and a patrolling Dual-Blade Monk, but nothing in the way of actual rewards.\nIf you want to advance to the main boss, the large stairway on the other side of the building will lead you to the Inner Courtyard, but there's another optional side path to explore first, on the opposite side as the other optional path we explored earlier.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"It's worth noting that this area only has two real Shrines, and the other is up near the boss room past two Dark-faced Overlords. Given there's more optional bosses and enemies to face, it's not a bad idea to go back and rest at the entrance before making a beeline through the side path to return to the main plaza.\nAt the top of the stairs where all the mages were positioned, there's actually not too much to find here. Several Monk Supporters patrol the building exterior, where you can also find a few Overseeing Monks training along the corners.\"\n        - Following Text: \"The interior building hides three more Overseeing Monks and a patrolling Dual-Blade Monk, but nothing in the way of actual rewards.\nIf you want to advance to the main boss, the large stairway on the other side of the building will lead you to the Inner Courtyard, but there's another optional side path to explore first, on the opposite side as the other optional path we explored earlier.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character inside a dimly lit temple-like structure adorned with large statues of monks or deities. The player is positioned near the entrance, holding a spear, with the doorway leading to an exterior area visible in the background. The context suggests this location is part of a video game walkthrough, where players encounter patrolling enemies like Monk Supporters and Overseeing Monks. This area serves as a transitional space leading to optional paths or the main boss area, with limited rewards or items to collect."
}