{
    "chunk_id": 822267350944,
    "source_file": "Macaque_Chief.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/95/Wukong_Thunderclap_89.jpg",
    "alt_text": "Wukong Thunderclap 89.jpg",
    "position_desc": 13,
    "img_above_text": "Expect him to employ his reliable sword stab where the claws out in front of him before grabbing the sword back with his legs to swing at you with, but the range will be greatly increased.\nHe also employs a lot of usual blade swipes, and his multi-hit spinning two-handed swings, which now create large projectiles slashes in front of him.",
    "img_below_text": "Luckily, the Macaque Chief is just as prone to staggering as he was before, even more-so now thanks to the combined efforts of you and your ally, you can repeatedly knock him out of certain moves with well-times heavy hits that sends him toppling to the ground. A single focus point is you need to poke him off his sword when he stands on it!\n![Wukong Thunderclap 90.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/66/Wukong_Thunderclap_90.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Expect him to employ his reliable sword stab where the claws out in front of him before grabbing the sword back with his legs to swing at you with, but the range will be greatly increased.\nHe also employs a lot of usual blade swipes, and his multi-hit spinning two-handed swings, which now create large projectiles slashes in front of him.\"\n        - Following Text: \"Luckily, the Macaque Chief is just as prone to staggering as he was before, even more-so now thanks to the combined efforts of you and your ally, you can repeatedly knock him out of certain moves with well-times heavy hits that sends him toppling to the ground. A single focus point is you need to poke him off his sword when he stands on it!\n![Wukong Thunderclap 90.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/66/Wukong_Thunderclap_90.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dramatic battle scene against the \"Macaque Chief\" in *Black Myth: Wukong*. The environment is bathed in red, emphasizing the intensity of the fight. The boss is shown mid-attack, likely using one of his powerful sword techniques described in the preceding text, such as a spinning or projectile-generating move. The player's health and ability icons are visible, along with the boss's health bar and a taunting dialogue line: \"Thou shalt lust, before all loves turn into dust.\" This moment highlights the challenging nature of the encounter and the importance of timing heavy hits to stagger the boss, as noted in the following text."
}