{
    "chunk_id": 732589709770,
    "source_file": "Hundred-Eyed_Daoist_Master.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4e/Wukong_YellowFlower_77.jpg",
    "alt_text": "Wukong YellowFlower 77.jpg",
    "position_desc": 13,
    "img_above_text": "![Wukong YellowFlower 76.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/af/Wukong_YellowFlower_76.jpg)\nIf he stabs his sword into the ground in front of him, he's actually hoping to bait you into deflecting your attack, which he'll counter with a charged electric stab. The good news is you can deflect him right back, just be ready for him to get mad and burrow down in response.",
    "img_below_text": "He can also hold his sword high up above him while charging it with lightning strikes. After a delay, he'll begin slashing the air in your direction, unleashing a low projectile wave followed by a diagonal slash wave, and then charge up his sword before jabbing it ahead to send a beam of lightning straight at you. It's better to keep your distance the moment you see him charging up, then dodge the three blasts before moving back in to fight.\n![Wukong YellowFlower 78.png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/61/Wukong_YellowFlower_78.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong YellowFlower 76.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/af/Wukong_YellowFlower_76.jpg)\nIf he stabs his sword into the ground in front of him, he's actually hoping to bait you into deflecting your attack, which he'll counter with a charged electric stab. The good news is you can deflect him right back, just be ready for him to get mad and burrow down in response.\"\n        - Following Text: \"He can also hold his sword high up above him while charging it with lightning strikes. After a delay, he'll begin slashing the air in your direction, unleashing a low projectile wave followed by a diagonal slash wave, and then charge up his sword before jabbing it ahead to send a beam of lightning straight at you. It's better to keep your distance the moment you see him charging up, then dodge the three blasts before moving back in to fight.\n![Wukong YellowFlower 78.png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/61/Wukong_YellowFlower_78.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss battle in *Black Myth: Wukong* against the \"Hundred-Eyed Daoist Master.\" The boss is shown charging its sword with lightning, likely preparing for a powerful attack as described in the context. The player character, Wukong, is positioned in a defensive stance amidst a vibrant field of yellow flowers, emphasizing the need to dodge or strategize against the incoming lightning-based attacks."
}