{
    "chunk_id": 52041080026,
    "source_file": "Pagoda_Realm_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/04/Wukong_Pagoda_70.jpg",
    "alt_text": "Wukong Pagoda 70.jpg",
    "position_desc": 67,
    "img_above_text": "To the left, you can find the Mani Wheel Shrine and a path to the boss, but there's one last section of the fourth level of the prison we need to complete, which unfortunately means going back to the madness. Be sure to unlock the Shrine regardless so you can teleport back to it easily.\nTake the path going right from the wooden beams, and you'll come upon a group of frozen corpses by a raised platform. They'll be smashed to pieces as a new enemy flies down -- a Falcon Fan-Maker.",
    "img_below_text": "This enemy is built fairly tough, and can launch themselves high up to slice the air with their fan to create projectiles to slash your way.\nWhen he descends back to the ground, use Immobilize to keep him pinned down as you press the attack, and use Spirit attacks to keep him staggered. Be ready for him to flap his wings to push your back or create whirlwinds as he flies up.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"To the left, you can find the Mani Wheel Shrine and a path to the boss, but there's one last section of the fourth level of the prison we need to complete, which unfortunately means going back to the madness. Be sure to unlock the Shrine regardless so you can teleport back to it easily.\nTake the path going right from the wooden beams, and you'll come upon a group of frozen corpses by a raised platform. They'll be smashed to pieces as a new enemy flies down -- a Falcon Fan-Maker.\"\n        - Following Text: \"This enemy is built fairly tough, and can launch themselves high up to slice the air with their fan to create projectiles to slash your way.\nWhen he descends back to the ground, use Immobilize to keep him pinned down as you press the attack, and use Spirit attacks to keep him staggered. Be ready for him to flap his wings to push your back or create whirlwinds as he flies up.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character in a snowy, ruined environment facing off against a flying enemy, the Falcon Fan-Maker. The enemy is mid-air, performing an attack with its fan weapon, creating visible energy projectiles. The scene aligns with the guide's description of encountering this tough opponent after passing frozen corpses and preparing for its aerial and ranged attacks. The HUD shows the player's abilities and resources, emphasizing combat readiness."
}