{
    "chunk_id": 199687674131,
    "source_file": "Things_Black_Myth_Wukong_Doesn%27t_Tell_You.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ec/Wukong_Tiger_31.jpg",
    "alt_text": "Wukong Tiger 31.jpg",
    "position_desc": 21,
    "img_above_text": "![Wukong Tiger 30.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2e/Wukong_Tiger_30.jpg)\nAfter reaching Chapter 2 and defeating the lightning frog in the small pool of water at the far end of the canyon, you’ll run into an NPC, the Xu Dog, who will grant you the ability to make medicines. While you can only make consumable Mortal Medicines at first when you stop at shrines, once you reach the Cellar Keeper’s Shrine below the Crouching Tiger Temple further into Chapter 2, you’ll run into Xu Dog again, and he’ll grant the ability to craft Celestial Medicines.",
    "img_below_text": "Celestial Medicines give permanent boosts to different stats, such as health, mana, stamina, and even certain Bane resistances. You consume Mind Cores to create these medicines, but can refund all of them at any time. You must return to Xu Dog every time you want to either create Celestial Medicines, or refund your Mind Cores.\nLooking for more Black Myth: Wukong guides? Check out these pages:",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Tiger 30.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2e/Wukong_Tiger_30.jpg)\nAfter reaching Chapter 2 and defeating the lightning frog in the small pool of water at the far end of the canyon, you’ll run into an NPC, the Xu Dog, who will grant you the ability to make medicines. While you can only make consumable Mortal Medicines at first when you stop at shrines, once you reach the Cellar Keeper’s Shrine below the Crouching Tiger Temple further into Chapter 2, you’ll run into Xu Dog again, and he’ll grant the ability to craft Celestial Medicines.\"\n        - Following Text: \"Celestial Medicines give permanent boosts to different stats, such as health, mana, stamina, and even certain Bane resistances. You consume Mind Cores to create these medicines, but can refund all of them at any time. You must return to Xu Dog every time you want to either create Celestial Medicines, or refund your Mind Cores.\nLooking for more Black Myth: Wukong guides? Check out these pages:\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the crafting menu for Celestial Medicines in *Black Myth: Wukong*. It highlights the \"Jade Lotus Pill,\" a consumable that permanently increases Maximum Health. The menu shows the required resources, including 540 Will and 3 Mind Cores, alongside the player's current stats and potential changes. This interface ties into the game's progression system, where players can enhance their character's attributes by crafting these medicines at specific shrines, such as the Cellar Keeper’s Shrine, after unlocking the ability from the NPC Xu Dog."
}