{
    "chunk_id": 181995408160,
    "source_file": "Poisestone_Spirit.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1b/Poisestone_power.png",
    "alt_text": "Poisestone power.png",
    "position_desc": 3,
    "img_above_text": "Poisestone fights like all of the other enemies of her type in Black Myth: Wukong. Her main methods of attack are kick-based, and they hit extremely hard. Thankfully, most of her attacks can be avoided with well-timed Perfect Dodges. Be careful when you knock Poisestone down that she is actually dead. Some rock enemies have a habit of passing out for a bit before getting back up to continue fighting.\n## Poisestone Spirit",
    "img_below_text": "* **Strike at Heart**\n* Equipped Effect: Moderately increases the Damage of Jump Light Attacks and reduces the Stamina cost of Sprinting.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Poisestone fights like all of the other enemies of her type in Black Myth: Wukong. Her main methods of attack are kick-based, and they hit extremely hard. Thankfully, most of her attacks can be avoided with well-timed Perfect Dodges. Be careful when you knock Poisestone down that she is actually dead. Some rock enemies have a habit of passing out for a bit before getting back up to continue fighting.\n## Poisestone Spirit\"\n        - Following Text: \"* **Strike at Heart**\n* Equipped Effect: Moderately increases the Damage of Jump Light Attacks and reduces the Stamina cost of Sprinting.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image showcases the \"Poisestone Spirit\" equipment screen in *Black Myth: Wukong*. It provides details about the spirit's abilities, including the \"Strike at Heart\" skill, which allows the player to take the form of Poisestone and perform a powerful leap-and-kick attack, followed by a ground slam that damages nearby foes. The equipped effect enhances Jump Light Attack damage and reduces Sprinting stamina cost. The interface includes options to equip the spirit, view stats, and watch a demo of the skill in action."
}