{
    "chunk_id": 848494536567,
    "source_file": "Baw-Lang_Lang.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/51/Chapter_5_Secret_Area_%2812%29.png",
    "alt_text": "Chapter 5 Secret Area \\(12\\).png",
    "position_desc": 1,
    "img_above_text": "Baw-Lang-Lang is one of the six frog bosses you can find in Black Myth: Wukong. The fifth of the frogs, Baw-Lang-Lang can only be discovered once you've taken down the Five Element Carts and gained access to Bishui Cave.\n## How to Find Baw-Lang-Lang",
    "img_below_text": "When you've beaten the Rusty-Gold Cart approach the frozen-over entrance and break through to head inside.\nThis doorway will take you to the chapter's secret area called the Bishui Cave. We'd recommend completing this before you finish up the chapter. But there's one last miniboss to fight before you teleport to the secret area.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Baw-Lang-Lang is one of the six frog bosses you can find in Black Myth: Wukong. The fifth of the frogs, Baw-Lang-Lang can only be discovered once you've taken down the Five Element Carts and gained access to Bishui Cave.\n## How to Find Baw-Lang-Lang\"\n        - Following Text: \"When you've beaten the Rusty-Gold Cart approach the frozen-over entrance and break through to head inside.\nThis doorway will take you to the chapter's secret area called the Bishui Cave. We'd recommend completing this before you finish up the chapter. But there's one last miniboss to fight before you teleport to the secret area.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character standing in front of a frozen-over entrance marked with a red arrow, indicating the need to break through to access Bishui Cave in *Black Myth: Wukong*. A red dashed circle highlights an enemy or object nearby, possibly a miniboss that must be defeated before progressing to the secret area. This scene aligns with the guide's instructions for locating and preparing to face Baw-Lang-Lang."
}