{
    "chunk_id": 927763193499,
    "source_file": "New_Thunderclap_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/be/Wukong_Thunderclap_44.jpg",
    "alt_text": "Wukong Thunderclap 44.jpg",
    "position_desc": 43,
    "img_above_text": "Take this bridge path up to find a massive statue altar at the far end. Standing next to a pillar nearby, you'll have your third meeting with the friendly Horse Guai. It seems he's quite bewitched by Yellowbrow and has lost the will to continue his quest.\nWhile there's nothing you can do to resolve his dilemma (other than beat up Yellowbrow yourself), you can keep talking to him and he'll give you the **Trailblazer's Scarlet Gourd** , a new gourd bottle you can try that grants a full heal on the first swig!",
    "img_below_text": "Be sure to also inspect the small gold box at the foot of the large statue altar, and you'll get the Body-**Fleeting Powder Formula** , plus three extra powders for free that can allow you to fight without expending stamina for a short duration.\n![Wukong Thunderclap 45.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1f/Wukong_Thunderclap_45.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Take this bridge path up to find a massive statue altar at the far end. Standing next to a pillar nearby, you'll have your third meeting with the friendly Horse Guai. It seems he's quite bewitched by Yellowbrow and has lost the will to continue his quest.\nWhile there's nothing you can do to resolve his dilemma (other than beat up Yellowbrow yourself), you can keep talking to him and he'll give you the **Trailblazer's Scarlet Gourd** , a new gourd bottle you can try that grants a full heal on the first swig!\"\n        - Following Text: \"Be sure to also inspect the small gold box at the foot of the large statue altar, and you'll get the Body-**Fleeting Powder Formula** , plus three extra powders for free that can allow you to fight without expending stamina for a short duration.\n![Wukong Thunderclap 45.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1f/Wukong_Thunderclap_45.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game *Black Myth: Wukong*, showing the player character approaching a large statue altar in a temple-like environment. The red-dotted circle highlights a point of interest at the foot of the altar, likely the small gold box mentioned in the following text. This location is where players can obtain the **Fleeting Powder Formula** and additional powders. The preceding text references a nearby interaction with the Horse Guai NPC, who provides the **Trailblazer's Scarlet Gourd**, a healing item. The image serves to illustrate the setting and key objectives in this part of the walkthrough."
}