{
    "chunk_id": 206909391889,
    "source_file": "Bitter_Lake_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7f/Wukong_Turtle_29.jpg",
    "alt_text": "Wukong Turtle 29.jpg",
    "position_desc": 27,
    "img_above_text": "![Wukong Turtle 26.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ef/Wukong_Turtle_26.jpg)\nExpect him to also utilize his sword slashes in simple 1 or 2 hit attacks, or use his lightning palm attack on its own. His sword swings aren't too fast, but they can blindside you if you aren't ready to break off your attacks or use up all your stamina.",
    "img_below_text": "Another dangerous attack he can launch with little warning only comes with a small tell -- when he quickly swaps his sword to hold in a reverse grip behind his back. He'll then quickly launch himself through the air at you with a spinning slash that can take a chunk off your health, and then dive back to your position after a moment for sword slice when he reaches the ground.\n![Wukong Turtle 30.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/ad/Wukong_Turtle_30.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Turtle 26.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ef/Wukong_Turtle_26.jpg)\nExpect him to also utilize his sword slashes in simple 1 or 2 hit attacks, or use his lightning palm attack on its own. His sword swings aren't too fast, but they can blindside you if you aren't ready to break off your attacks or use up all your stamina.\"\n        - Following Text: \"Another dangerous attack he can launch with little warning only comes with a small tell -- when he quickly swaps his sword to hold in a reverse grip behind his back. He'll then quickly launch himself through the air at you with a spinning slash that can take a chunk off your health, and then dive back to your position after a moment for sword slice when he reaches the ground.\n![Wukong Turtle 30.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/ad/Wukong_Turtle_30.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight scene from *Black Myth: Wukong*, featuring the player character engaging with \"Cyan Loong,\" a large, antlered enemy wielding a sword. The red arrow highlights the enemy's sword, emphasizing its use in the described attack patterns, such as slashes and lightning palm strikes. The snowy terrain and distant mountains set the stage for the battle, while the HUD elements show the player's health, abilities, and options."
}