{
    "chunk_id": 212243056740,
    "source_file": "Hundred-Eyed_Daoist_Master.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ee/Wukong_YellowFlower_83.jpg",
    "alt_text": "Wukong YellowFlower 83.jpg",
    "position_desc": 22,
    "img_above_text": "![Wukong YellowFlower 84.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c2/Wukong_YellowFlower_84.jpg)\nThese attacks can be followed up often by him raising up on his claws while holding his electric orb high. After a moment, he'll slam everything down to create a massive shockwave that you need to either run from, or dodge at just the right moment (your Pillar Stance won't save you here). The good news is this blast leaves him very vulnerable for several moments afterward, once you get the dodge timing down.",
    "img_below_text": "If you see him perform an extravagant twisting somersault through the air, don't be dazzled, as he'll chain this feinting maneuver into a quick grab once he touches back on the ground and take a few step, lunging extra distance to try and yank you forward and take off a huge portion of your health with his crazy unblockable grab attack.\n![Wukong YellowFlower 86.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f0/Wukong_YellowFlower_86.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong YellowFlower 84.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c2/Wukong_YellowFlower_84.jpg)\nThese attacks can be followed up often by him raising up on his claws while holding his electric orb high. After a moment, he'll slam everything down to create a massive shockwave that you need to either run from, or dodge at just the right moment (your Pillar Stance won't save you here). The good news is this blast leaves him very vulnerable for several moments afterward, once you get the dodge timing down.\"\n        - Following Text: \"If you see him perform an extravagant twisting somersault through the air, don't be dazzled, as he'll chain this feinting maneuver into a quick grab once he touches back on the ground and take a few step, lunging extra distance to try and yank you forward and take off a huge portion of your health with his crazy unblockable grab attack.\n![Wukong YellowFlower 86.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f0/Wukong_YellowFlower_86.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a boss fight in *Black Myth: Wukong* against the \"Hundred-Eyed Daoist Master,\" a humanoid creature fused with a centipede-like body. The scene is set in a vibrant field of yellow flowers, with the boss mid-attack, showcasing its menacing form and dynamic movement. The preceding and following text describe the boss's attack patterns, including shockwaves and a feinting somersault leading into a grab. The image serves to illustrate the challenging nature of this encounter and the need for precise dodging and timing during the fight."
}