{
    "chunk_id": 146788910146,
    "source_file": "Chapter_2_Secret_-_Kingdom_of_Sahali_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/95/Wukong_Sahali_13.jpg",
    "alt_text": "Wukong Sahali 13.jpg",
    "position_desc": 13,
    "img_above_text": "## Yaoguai Chief Mini-Boss Fight - \"Tiger Vanguard\" (Kingdom of Sahali)\nWhile this Tiger Vanguard is indeed related to the one you’ve faced at the Crouching Tiger Temple, he doesn’t fight in quite the exact same style, despite also having a sword. Understanding the differences and similarities in their style can help you succeed in this fight, but it will take a little practice.",
    "img_below_text": "This Tiger happens to be a big fan of lunging attacks, and will almost always start the fight by leaping at you low to the ground, clawing at you with his free hand as he comes to a stop. He’ll follow this with a slash from his sword rather quickly, and let the momentum carry him along the ground in a spin to perform a quick secondary overhead slash from his low position.\nIt will take him a moment to get to his feet afterward, but you’ll want to react fast and retaliate, and possibly Immobilize him, or there’s a good chance he’ll leap away and retreat before his next attack.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"## Yaoguai Chief Mini-Boss Fight - \"Tiger Vanguard\" (Kingdom of Sahali)\nWhile this Tiger Vanguard is indeed related to the one you’ve faced at the Crouching Tiger Temple, he doesn’t fight in quite the exact same style, despite also having a sword. Understanding the differences and similarities in their style can help you succeed in this fight, but it will take a little practice.\"\n        - Following Text: \"This Tiger happens to be a big fan of lunging attacks, and will almost always start the fight by leaping at you low to the ground, clawing at you with his free hand as he comes to a stop. He’ll follow this with a slash from his sword rather quickly, and let the momentum carry him along the ground in a spin to perform a quick secondary overhead slash from his low position.\nIt will take him a moment to get to his feet afterward, but you’ll want to react fast and retaliate, and possibly Immobilize him, or there’s a good chance he’ll leap away and retreat before his next attack.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the \"Tiger Vanguard\" mini-boss fight in *Kingdom of Sahali*. The player character is engaged in combat with the Tiger Vanguard, who is mid-lunge in an outdoor, rocky environment. The health bar at the bottom identifies the enemy, while the HUD displays player abilities and items. This scene aligns with the guide's description of the Tiger Vanguard's aggressive lunging attacks, emphasizing the need for quick reactions and strategic retaliation."
}