{
    "chunk_id": 555876354243,
    "source_file": "Webbed_Hollow_-_Middle_Hollow_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/96/Wukong_MiddleHollow_52.jpg",
    "alt_text": "Wukong MiddleHollow 52.jpg",
    "position_desc": 50,
    "img_above_text": "Be sure to turn around before you reach the shrine, and you'll find another Purple Talisman Altar, so be sure to collect a second talisman by interacting with it.\nJust past the altar, you can find a small house with a **Treasure Chest** in the front that holds materials like a Blood of the Iron Bull, and two Wasp Guais hiding around the sides.",
    "img_below_text": "Rest up at the shrine, and then head into the narrow passage to encounter a very disturbing sight: A very large hand holding a mirror.\n## Yaoguai Chief Miniboss Fight - Buddha's Right Hand",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Be sure to turn around before you reach the shrine, and you'll find another Purple Talisman Altar, so be sure to collect a second talisman by interacting with it.\nJust past the altar, you can find a small house with a **Treasure Chest** in the front that holds materials like a Blood of the Iron Bull, and two Wasp Guais hiding around the sides.\"\n        - Following Text: \"Rest up at the shrine, and then head into the narrow passage to encounter a very disturbing sight: A very large hand holding a mirror.\n## Yaoguai Chief Miniboss Fight - Buddha's Right Hand\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player-controlled character navigating a dimly lit cave adorned with numerous Buddha statues carved into the walls. The character is equipped with a staff-like weapon and appears to be heading toward a glowing area in the distance, likely a shrine mentioned in the preceding text. This setting serves as a transition point leading to the \"Yaoguai Chief Miniboss Fight - Buddha's Right Hand,\" as referenced in the following text."
}