{
    "chunk_id": 722363305727,
    "source_file": "Hundred-Eyed_Daoist_Master.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f0/Wukong_YellowFlower_86.jpg",
    "alt_text": "Wukong YellowFlower 86.jpg",
    "position_desc": 23,
    "img_above_text": "![Wukong YellowFlower 83.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ee/Wukong_YellowFlower_83.jpg)\nIf you see him perform an extravagant twisting somersault through the air, don't be dazzled, as he'll chain this feinting maneuver into a quick grab once he touches back on the ground and take a few step, lunging extra distance to try and yank you forward and take off a huge portion of your health with his crazy unblockable grab attack.",
    "img_below_text": "This is a good time to use your best Transformation Spell to help whittle down his health, especially if you're worried about the grab or are electrified and need to retreat. The Golden Lining transformation is a good bet for its shock resistance, and many of his massive attacks are slow enough that you can \"see through\" them to build up focus points and blast him back. If you haven't beaten Yellow Loong or aren't sure about his moves, you can also use Hoarfrost or Umbral Abyss to try freezing him, just be sure to keep on top of dodging his big blasts.\nThe last piece of his health bar is by far the scariest to take down, and you'll need to constantly be watching his electrified talismans to anticipate where his next big blast is coming from. If you have extra mana, you can also try going for the Pluck of Mana, or just focus on more Immobilizations and Rock Solid Deflections.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong YellowFlower 83.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ee/Wukong_YellowFlower_83.jpg)\nIf you see him perform an extravagant twisting somersault through the air, don't be dazzled, as he'll chain this feinting maneuver into a quick grab once he touches back on the ground and take a few step, lunging extra distance to try and yank you forward and take off a huge portion of your health with his crazy unblockable grab attack.\"\n        - Following Text: \"This is a good time to use your best Transformation Spell to help whittle down his health, especially if you're worried about the grab or are electrified and need to retreat. The Golden Lining transformation is a good bet for its shock resistance, and many of his massive attacks are slow enough that you can \"see through\" them to build up focus points and blast him back. If you haven't beaten Yellow Loong or aren't sure about his moves, you can also use Hoarfrost or Umbral Abyss to try freezing him, just be sure to keep on top of dodging his big blasts.\nThe last piece of his health bar is by far the scariest to take down, and you'll need to constantly be watching his electrified talismans to anticipate where his next big blast is coming from. If you have extra mana, you can also try going for the Pluck of Mana, or just focus on more Immobilizations and Rock Solid Deflections.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a gameplay moment from *Black Myth: Wukong*, showcasing a battle against a large, multi-legged boss named \"Hundred-Eyed Daoist Master.\" The player character is engaged in combat, utilizing abilities like \"Lightning Dance\" and \"Fatal Shadow,\" as described in the text. The preceding and following context emphasizes the boss's dangerous moves, including unblockable grabs and electrified attacks, and suggests strategies such as using transformation spells for shock resistance or freezing effects to counter its powerful abilities. The visual highlights the intense action and strategic elements of the fight in a vibrant, detailed environment."
}