{
    "chunk_id": 896649159617,
    "source_file": "Chapter_2_Secret_-_Kingdom_of_Sahali_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8c/Wukong_SahalI_11.jpg",
    "alt_text": "Wukong SahalI 11.jpg",
    "position_desc": 11,
    "img_above_text": "Once you follow him through the large gate with the small crawlspace, you’ll find yourself overlooking an ancient and forgotten kingdom, and suddenly be transported into the past and into the Kingdom of Sahali\n## Sandgate Pass",
    "img_below_text": "Arriving in this realm of the past, you’ll find yourself in a large canyon. Head up to find a Shrine on the left, and be sure to check the shop in this secret realm, as it offers wares not sold in the rest of the Yellow Wind Ridge:\nKingdom of Sahali Shrine Shop",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Once you follow him through the large gate with the small crawlspace, you’ll find yourself overlooking an ancient and forgotten kingdom, and suddenly be transported into the past and into the Kingdom of Sahali\n## Sandgate Pass\"\n        - Following Text: \"Arriving in this realm of the past, you’ll find yourself in a large canyon. Head up to find a Shrine on the left, and be sure to check the shop in this secret realm, as it offers wares not sold in the rest of the Yellow Wind Ridge:\nKingdom of Sahali Shrine Shop\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image shows a player character approaching a glowing shrine-like structure emitting swirling energy or light in a rocky canyon environment. This scene likely represents the moment after entering the Kingdom of Sahali in the past, as described in the context, and highlights the shrine mentioned in the following text. The shrine appears to be a key point of interest in this area."
}