{
    "chunk_id": 22329524247,
    "source_file": "Mountain_Patroller_Spirit.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/be/Mountain_Patroller_Power.png",
    "alt_text": "Mountain Patroller Power.png",
    "position_desc": 3,
    "img_above_text": "There are a few other enemies to contend with when taking down the Mountain Patroller, so begin by trying to pick them off one by one. He will notice you eventually once you get close enough to him, but hopefully, you are able to dispose of a majority of the other enemies before he spots you.\n## Mountain Patroller Spirit Power",
    "img_below_text": "* **Swift Leap**\n* Equipped Effect: Slightly increases Critical Hit Chance of Jump Heavy Attacks.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"There are a few other enemies to contend with when taking down the Mountain Patroller, so begin by trying to pick them off one by one. He will notice you eventually once you get close enough to him, but hopefully, you are able to dispose of a majority of the other enemies before he spots you.\n## Mountain Patroller Spirit Power\"\n        - Following Text: \"* **Swift Leap**\n* Equipped Effect: Slightly increases Critical Hit Chance of Jump Heavy Attacks.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image is a game interface showing the \"Mountain Patroller\" spirit, which is a rare equipment option in the game. It requires a moderate Qi cost and offers the \"Swift Leap\" ability, allowing the player to take the form of the Mountain Patroller and perform a series of slashes to deter foes. The equipped effect slightly increases the critical hit chance of jump heavy attacks. The interface includes options to equip the spirit and view a demo of its abilities. The preceding text suggests strategies for dealing with enemies when confronting the Mountain Patroller, while the following text details the effects of the Swift Leap ability."
}