{
    "chunk_id": 261851457730,
    "source_file": "Fungiwoman.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/75/Wukong_YellowFlower_42.jpg",
    "alt_text": "Wukong YellowFlower 42.jpg",
    "position_desc": 4,
    "img_above_text": "For all their extra health, they don't have too many more moves than a regular enemy, so keep on the offensive so they don't have a chance to sprout more spore projectiles, using Immobilize to lock them down and Rock Solid when they try to swipe at you with their staff.\nOnce defeated, you'll gain a Knot of Voidness, and a Monkey-Head Fungus Seed to take back to the Zodiac Village, as well as their Fungiwoman Spirit to absorb.",
    "img_below_text": "Be sure to check the shack on the far end before leaving, as you'll find the **Sunset of the Nine Skies Drink** sittng on a table, which will restore Qi as well as health!",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"For all their extra health, they don't have too many more moves than a regular enemy, so keep on the offensive so they don't have a chance to sprout more spore projectiles, using Immobilize to lock them down and Rock Solid when they try to swipe at you with their staff.\nOnce defeated, you'll gain a Knot of Voidness, and a Monkey-Head Fungus Seed to take back to the Zodiac Village, as well as their Fungiwoman Spirit to absorb.\"\n        - Following Text: \"Be sure to check the shack on the far end before leaving, as you'll find the **Sunset of the Nine Skies Drink** sittng on a table, which will restore Qi as well as health!\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player character crouching near a shack in a lush, rocky environment, wielding a fiery weapon. A glowing item, highlighted with a red circle, is visible on a table near the shack, likely the **Sunset of the Nine Skies Drink** mentioned in the following text. The HUD shows the player's health, abilities, and \"Will\" resource, indicating gameplay readiness. This scene emphasizes exploration and item collection after defeating a challenging enemy."
}