{
    "chunk_id": 291265382794,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/28/Furnace_Valley_Walkthrough_%28106%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(106\\).png",
    "position_desc": 55,
    "img_above_text": "Then go back to the stairs and head for the balcony (facing opposite the altar in The Emerald Hall). Turn to the right, and go up the stairs to find the Meditation Spot.\nThe Buddha, Emerald Hall Meditation Spot",
    "img_below_text": "Now go back to The Emerald Hall and up to the altar near where you respawned. Collect the Loong Balm drink from the altar then turn left.\n![Furnace Valley Walkthrough \\(107\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d5/Furnace_Valley_Walkthrough_%28107%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Then go back to the stairs and head for the balcony (facing opposite the altar in The Emerald Hall). Turn to the right, and go up the stairs to find the Meditation Spot.\nThe Buddha, Emerald Hall Meditation Spot\"\n        - Following Text: \"Now go back to The Emerald Hall and up to the altar near where you respawned. Collect the Loong Balm drink from the altar then turn left.\n![Furnace Valley Walkthrough \\(107\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d5/Furnace_Valley_Walkthrough_%28107%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from a video game where the player character is standing near an altar in The Emerald Hall. The altar is adorned with candles and other items, and a specific spot on the altar is highlighted, indicating the location of the Loong Balm drink that the player needs to collect. This scene follows the player's visit to the Meditation Spot and precedes the next objective of collecting the drink and continuing the journey."
}