{
    "chunk_id": 174573344726,
    "source_file": "Foothills_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2f/Foothills_Walkthrough_%283%29.png",
    "alt_text": "Foothills Walkthrough \\(3\\).png",
    "position_desc": 1,
    "img_above_text": "* Yaoguai King - Giant Shigandang\nThe beginning of Chapter 6 is a linear path, so proceed down the slope from where you spawn. As you make your way along this road, you'll be intercepted by the last of the Lesser Yoaguais you need to complete your journal.",
    "img_below_text": "This will include Hound, Jackal, and Eagle Soldiers, as well as the tougher looker variants with shields called Captain of the Court.\nAs you get closer to the first Keeper's Shrine of the area, you'll see a large group of soldiers appear. Clear these out and then you can activate the shrine.",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"* Yaoguai King - Giant Shigandang\nThe beginning of Chapter 6 is a linear path, so proceed down the slope from where you spawn. As you make your way along this road, you'll be intercepted by the last of the Lesser Yoaguais you need to complete your journal.\"\n        - Following Text: \"This will include Hound, Jackal, and Eagle Soldiers, as well as the tougher looker variants with shields called Captain of the Court.\nAs you get closer to the first Keeper's Shrine of the area, you'll see a large group of soldiers appear. Clear these out and then you can activate the shrine.\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a player-controlled character, heavily armored and wielding a polearm, approaching a group of three hostile soldiers in a forested area. This scene aligns with the narrative of Chapter 6, where the player progresses along a linear path, encountering enemies like Lesser Yaoguais and soldiers, including tougher variants. The setting appears to be part of the journey toward the first Keeper's Shrine mentioned in the following text."
}