{
    "chunk_id": 571137852443,
    "source_file": "Chapter_1_Secret_-_Ancient_Guanyin_Temple_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c9/Wukong_Guanyin_14.jpg",
    "alt_text": "Wukong Guanyin 14.jpg",
    "position_desc": 15,
    "img_above_text": "Once Elder Jinchi is defeated, you’ll automatically be returned back to the third bell in the Marsh of the White Mist. You can now interact with the Wolf Guai hanging from the tree, causing it to turn to dust, and rewarding you with the Fireproof Mantle Vessel, and 2,000 Will.\nElder Jinchi",
    "img_below_text": "Vessels are extremely rare and special items that not only provide a passive bonus, but can be activated when you’ve built up Ki from attacking enemies. Most Vessels are gained from completing a Secret Area’s boss fight, and will give you a huge situational advantage on the boss of that same chapter. The Fireproof Mantle allows you to negate fire damage attacks, which is what the final boss of this chapter will try to use against you!\nAncient Guanyin Temple Complete",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Once Elder Jinchi is defeated, you’ll automatically be returned back to the third bell in the Marsh of the White Mist. You can now interact with the Wolf Guai hanging from the tree, causing it to turn to dust, and rewarding you with the Fireproof Mantle Vessel, and 2,000 Will.\nElder Jinchi\"\n        - Following Text: \"Vessels are extremely rare and special items that not only provide a passive bonus, but can be activated when you’ve built up Ki from attacking enemies. Most Vessels are gained from completing a Secret Area’s boss fight, and will give you a huge situational advantage on the boss of that same chapter. The Fireproof Mantle allows you to negate fire damage attacks, which is what the final boss of this chapter will try to use against you!\nAncient Guanyin Temple Complete\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image showcases the **Fireproof Mantle**, a legendary Vessel in the game. It provides **Burn Immunity** and increases **Focus** temporarily when activated, making it highly effective against fire-based enemies and environments. Its equipped effect significantly boosts **Burn Resistance** and grants immunity to **Scorch Damage** from lava-covered areas. This item is obtained after defeating Elder Jinchi and is particularly useful against the chapter's final boss, who uses fire attacks."
}