{
    "chunk_id": 406118575138,
    "source_file": "Bishui_Golden-Eyed_Beast.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/da/Bishui_Cave_Walkthrough_%2843%29.png",
    "alt_text": "Bishui Cave Walkthrough \\(43\\).png",
    "position_desc": 8,
    "img_above_text": "Head up the stairs in this section and on the right, you'll be able to harvest a Fire Date. On the left, you can find an Awaken Wine Worm, and straight up ahead before the stairs, you'll see a green Wisp on the left.\nBishui Cave Awaken Wine Worm",
    "img_below_text": "Continue up the stairs, and you'll see the beast leaping around the rooftops. Go along the corridor, where you'll come to a frozen room with a doorway that has fire blocking it.\n![Bishui Cave Walkthrough \\(45\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bd/Bishui_Cave_Walkthrough_%2845%29.png)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Head up the stairs in this section and on the right, you'll be able to harvest a Fire Date. On the left, you can find an Awaken Wine Worm, and straight up ahead before the stairs, you'll see a green Wisp on the left.\nBishui Cave Awaken Wine Worm\"\n        - Following Text: \"Continue up the stairs, and you'll see the beast leaping around the rooftops. Go along the corridor, where you'll come to a frozen room with a doorway that has fire blocking it.\n![Bishui Cave Walkthrough \\(45\\).png](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bd/Bishui_Cave_Walkthrough_%2845%29.png)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dark, icy cave environment with a doorway engulfed in flames, blocking the path forward. The scene aligns with the walkthrough's description of a \"frozen room\" featuring a fire-blocked doorway, which players must navigate as they continue exploring Bishui Cave in *Black Myth: Wukong*."
}