{
    "chunk_id": 801122476154,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3b/Wukong_Fright_52.jpg",
    "alt_text": "Wukong Fright 52.jpg",
    "position_desc": 58,
    "img_above_text": "![Wukong Fright 51.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/93/Wukong_Fright_51.jpg)\nHead down the path to find a row of shacks, and an opening you can head through on the left filled with a few zombie-like Withered Corpses that can lunge at you, but otherwise move fairly slow. The yard behind this hut has a Ginsengling you can defeat for extra materials.",
    "img_below_text": "Further down the main path, you’ll find a large terrace overlooking a ravine below where the black tornado swirls. Guarding this spot is a bolstered Rat Governor, who uses deadly lightning attacks (and can even create temporary copies of himself for added damage!) you’ll want to shut down by Immobilizing him. Defeat this stronger foe, and you’ll be able to absorb the Rat Governor Spirit to perform your own electric attack!\n![Wukong Fright 53.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/93/Wukong_Fright_53.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"![Wukong Fright 51.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/93/Wukong_Fright_51.jpg)\nHead down the path to find a row of shacks, and an opening you can head through on the left filled with a few zombie-like Withered Corpses that can lunge at you, but otherwise move fairly slow. The yard behind this hut has a Ginsengling you can defeat for extra materials.\"\n        - Following Text: \"Further down the main path, you’ll find a large terrace overlooking a ravine below where the black tornado swirls. Guarding this spot is a bolstered Rat Governor, who uses deadly lightning attacks (and can even create temporary copies of himself for added damage!) you’ll want to shut down by Immobilizing him. Defeat this stronger foe, and you’ll be able to absorb the Rat Governor Spirit to perform your own electric attack!\n![Wukong Fright 53.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/93/Wukong_Fright_53.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game \"Black Myth: Wukong,\" where the player character is navigating a rocky path surrounded by dilapidated structures. The character appears to be engaging with zombie-like Withered Corpses, as mentioned in the preceding text, which describes these enemies as slow-moving but capable of lunging attacks. The setting is a rugged, mountainous area with visible flames, suggesting a hostile environment. This scene is part of a sequence leading to a confrontation with a more formidable enemy, the Rat Governor, as described in the following text."
}