{
    "chunk_id": 535003354829,
    "source_file": "Valley_of_Ecstasy_Walkthrough.md",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f7/Wukong_Karma_19.jpg",
    "alt_text": "Wukong Karma 19.jpg",
    "position_desc": 92,
    "img_above_text": "Stick to staying in safe spots to keep using Thrust Stance out of the range of his roots, or Pillar Stance above him, and look for his many openings when he tumbles to the ground to press the attack, and he'll fall before long, granting you both the **Old Ginseng Guai Spirit** , Millenium Ginseng Seeds to give to Chen Loong, and the **Ginseng Cape** to wear.\nOld Ginseng Guai",
    "img_below_text": "With the Yaoguai Chief defeated, be sure to check around behind the large stone monument near where you fought the miniboss. On a small snow-covered table, you can find the **Jade Essence** \\- a new Gourd Drink that allows you to recover mana as well as health!\n![Wukong Karma 21.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7f/Wukong_Karma_21.jpg)",
    "summary_promot": "You are shown an image extracted from a video game walkthrough or guide.\n\n\n        \n        Context:\n        - Preceding Text: \"Stick to staying in safe spots to keep using Thrust Stance out of the range of his roots, or Pillar Stance above him, and look for his many openings when he tumbles to the ground to press the attack, and he'll fall before long, granting you both the **Old Ginseng Guai Spirit** , Millenium Ginseng Seeds to give to Chen Loong, and the **Ginseng Cape** to wear.\nOld Ginseng Guai\"\n        - Following Text: \"With the Yaoguai Chief defeated, be sure to check around behind the large stone monument near where you fought the miniboss. On a small snow-covered table, you can find the **Jade Essence** \\- a new Gourd Drink that allows you to recover mana as well as health!\n![Wukong Karma 21.jpg](https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7f/Wukong_Karma_21.jpg)\"\n\n        Your task:\n        1. Generate a **short, clear, and informative English summary** of the image.\n        2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n        3. Do **not** speculate beyond the visible content.",
    "img_summary": "The image shows a player character in a snowy environment near a large stone monument. A red arrow highlights an interactable item on a small snow-covered table, prompting the player to \"Pick Up\" the **Jade Essence**, a collectible that restores both mana and health. This scene follows the defeat of the Yaoguai Chief and encourages exploration of the area for rewards."
}