{
    "chunk_id": 593434645970,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Fright Cliff Walkthrough",
    "h2_title": "Rock Clash Platform",
    "h1_content": "Fright Cliff is one of two possible second main regions of Chapter 2 in the Yellow Wind Ridge of Black Myth: Wukong. Below you'll find a guide for the Fright Cliff Region and its side quests for the Man-in-Stone and Yellow-Robed Squire, as well as how to defeat its many bosses that include the Mother of Stones and Stone Vanguard to get the Sterness of Stone.\n* **Jump to A Section:**\n* **Squall Hideout**\n* Yaoguai Chief - Mother of Stones\n* **Rockrest Flat**\n* Yaoguai King - Stone Vanguard\n* **Rock Crash Platform**\nFright Cliff is one of the two sub-regions you’ll need to explore in Chapter 2 of Black Myth Wukong in order to unlock the large sealed doors that lead to the end of the chapter. You can first reach this area by heading through the Sandgate Village and defeating the King of Flowing Sands and Second Rat Prince, and then crossing the bridge to the right of the sealed door.\nAs you cross the bridge, you can harvest some Licorice on the other side, and look to the left to spot a large archway in the distance, with a whirling black tornado even further left in a canyon separating the Fright Cliffs from the Crouching Tiger Temple.\nHeading toward the archway in the distance, you can find a green Wisp to absorb on the left side of the broken rock pathway, and on the right is a new type of enemy that will try to ambush you. This Pitstone is a mass of rock and skulls on legs, and will try to use its weight to jump down on you, and perform somersaults to use its momentum to slam into you. If they prove to be a problem to evade, consider using the Thrust Stance to charge up attacks from a distance and shatter them.\nAt the foot of the large archway stands another new enemy, the Spearbone. These warriors with horse skull heads adorned with brambles are very durable enemies, and will roar before stabbing and slashing with their hefty spears. Since they are slow to hit, engage in light attack combos and watch their moments to know when to dodge or try a strike through.\nAs you enter the Fright Cliff proper, another Pitstone enemy waits up the path, with a Blazebone enemy on a ledge to the right to try and pepper you with projectiles.\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.",
    "h2_content": "Just beyond the arena where you fought the Stone Vanguard, you can find a new Shrine to rest at. Defeating the Stone Vanguard will unlock a new armor set to craft: The Galeguard Set, which will grant you certain bonuses when utilizing Perfect Dodges.\nHead down the path to find a row of shacks, and an opening you can head through on the left filled with a few zombie-like Withered Corpses that can lunge at you, but otherwise move fairly slow. The yard behind this hut has a Ginsengling you can defeat for extra materials.\nFurther down the main path, you’ll find a large terrace overlooking a ravine below where the black tornado swirls. Guarding this spot is a bolstered Rat Governor, who uses deadly lightning attacks (and can even create temporary copies of himself for added damage!) you’ll want to shut down by Immobilizing him. Defeat this stronger foe, and you’ll be able to absorb the Rat Governor Spirit to perform your own electric attack!\nJust beyond where the Rat Governor was guarding, you can find a **Meditation Spot** down a short flight of stairs that overlooks the ravine, granting you a free Skill Point for resting here.\nThe Ravine, Rock Clash Platform Meditation Spot\nTo proceed, head back up the stairs and take a left where a group of braziers are. In the middle of this path is a small altar with a yellow pot, and inside you’ll find a **Celestial Taiyi Pill** , raising your maximum Mana once more by a considerable amount!\nYellow Wind Ridge Celestial Taiyi Pill\nPast this upgrade, the path will begin to slope down, and quite suddenly you may find yourself slipping and sliding down a one way sandy slope into a new sub-region. It’s worth getting the Shrine at the bottom of this area, but you’ll also need to dodge a lot of Rat Archers that you won’t be able to reach.\nAs you slide, try to angle yourself to the left, and you can find a large structure that you can jump to.\nClear out the archers as best you can and look for some Fragrant Jade Flowers to harvest (plus a green Wisp to absorb on the far side of the upper ridge) before dropping down to the bottom floor of the structure.\nAt the base of a large statue here, you can find a chest to open containing a **Blood of the Iron Bull** , 1 **Small Piece of Gold** , and 4 **Tiny Piece of Gold**.\nHop back onto the sands and slide past the rest of the Rat Archers until you reach the bottom of the Ravine. It’s here you’ll find another of the large stone doors that requires both items from the Vanguard bosses to proceed, and you may only have one by this point.\nThe good news is that as you approach, the headless musician will appear once more, and this time he has a gift for you: **The Pluck of Many**. You may have been able to try it out during the Prologue — this spell allows you to summon several copies of yourself to fight alongside you for a short duration. The copies don’t have much health and it costs a lot of mana to use, but they’ll help you overwhelm enemies in a pinch!\nAfter resting at the Windseal Gate Shrine, it’s time to fight the other Vanguard at the **Crouching Tiger Temple**, and we’ll return back to the Yellow Wind Formation area soon enough.\nFright Cliff Complete",
    "promot": "This is an excerpt from the file 'Fright_Cliff_Walkthrough.md', located in the main section titled 'Fright Cliff Walkthrough'. The section summary is: Fright Cliff is one of two possible second main regions of Chapter 2 in the Yellow Wind Ridge of Black Myth: Wukong. Below you'll find a guide for the Fright Cliff Region and its side quests for the Man-in-Stone and Yellow-Robed Squire, as well as how to defeat its many bosses that include the Mother of Stones and Stone Vanguard to get the Sterness of Stone.\n* **Jump to A Section:**\n* **Squall Hideout**\n* Yaoguai Chief - Mother of Stones\n* **Rockrest Flat**\n* Yaoguai King - Stone Vanguard\n* **Rock Crash Platform**\nFright Cliff is one of the two sub-regions you’ll need to explore in Chapter 2 of Black Myth Wukong in order to unlock the large sealed doors that lead to the end of the chapter. You can first reach this area by heading through the Sandgate Village and defeating the King of Flowing Sands and Second Rat Prince, and then crossing the bridge to the right of the sealed door.\nAs you cross the bridge, you can harvest some Licorice on the other side, and look to the left to spot a large archway in the distance, with a whirling black tornado even further left in a canyon separating the Fright Cliffs from the Crouching Tiger Temple.\nHeading toward the archway in the distance, you can find a green Wisp to absorb on the left side of the broken rock pathway, and on the right is a new type of enemy that will try to ambush you. This Pitstone is a mass of rock and skulls on legs, and will try to use its weight to jump down on you, and perform somersaults to use its momentum to slam into you. If they prove to be a problem to evade, consider using the Thrust Stance to charge up attacks from a distance and shatter them.\nAt the foot of the large archway stands another new enemy, the Spearbone. These warriors with horse skull heads adorned with brambles are very durable enemies, and will roar before stabbing and slashing with their hefty spears. Since they are slow to hit, engage in light attack combos and watch their moments to know when to dodge or try a strike through.\nAs you enter the Fright Cliff proper, another Pitstone enemy waits up the path, with a Blazebone enemy on a ledge to the right to try and pepper you with projectiles.\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Rock Clash Platform', and the detailed content is as follows:\nJust beyond the arena where you fought the Stone Vanguard, you can find a new Shrine to rest at. Defeating the Stone Vanguard will unlock a new armor set to craft: The Galeguard Set, which will grant you certain bonuses when utilizing Perfect Dodges.\nHead down the path to find a row of shacks, and an opening you can head through on the left filled with a few zombie-like Withered Corpses that can lunge at you, but otherwise move fairly slow. The yard behind this hut has a Ginsengling you can defeat for extra materials.\nFurther down the main path, you’ll find a large terrace overlooking a ravine below where the black tornado swirls. Guarding this spot is a bolstered Rat Governor, who uses deadly lightning attacks (and can even create temporary copies of himself for added damage!) you’ll want to shut down by Immobilizing him. Defeat this stronger foe, and you’ll be able to absorb the Rat Governor Spirit to perform your own electric attack!\nJust beyond where the Rat Governor was guarding, you can find a **Meditation Spot** down a short flight of stairs that overlooks the ravine, granting you a free Skill Point for resting here.\nThe Ravine, Rock Clash Platform Meditation Spot\nTo proceed, head back up the stairs and take a left where a group of braziers are. In the middle of this path is a small altar with a yellow pot, and inside you’ll find a **Celestial Taiyi Pill** , raising your maximum Mana once more by a considerable amount!\nYellow Wind Ridge Celestial Taiyi Pill\nPast this upgrade, the path will begin to slope down, and quite suddenly you may find yourself slipping and sliding down a one way sandy slope into a new sub-region. It’s worth getting the Shrine at the bottom of this area, but you’ll also need to dodge a lot of Rat Archers that you won’t be able to reach.\nAs you slide, try to angle yourself to the left, and you can find a large structure that you can jump to.\nClear out the archers as best you can and look for some Fragrant Jade Flowers to harvest (plus a green Wisp to absorb on the far side of the upper ridge) before dropping down to the bottom floor of the structure.\nAt the base of a large statue here, you can find a chest to open containing a **Blood of the Iron Bull** , 1 **Small Piece of Gold** , and 4 **Tiny Piece of Gold**.\nHop back onto the sands and slide past the rest of the Rat Archers until you reach the bottom of the Ravine. It’s here you’ll find another of the large stone doors that requires both items from the Vanguard bosses to proceed, and you may only have one by this point.\nThe good news is that as you approach, the headless musician will appear once more, and this time he has a gift for you: **The Pluck of Many**. You may have been able to try it out during the Prologue — this spell allows you to summon several copies of yourself to fight alongside you for a short duration. The copies don’t have much health and it costs a lot of mana to use, but they’ll help you overwhelm enemies in a pinch!\nAfter resting at the Windseal Gate Shrine, it’s time to fight the other Vanguard at the **Crouching Tiger Temple**, and we’ll return back to the Yellow Wind Formation area soon enough.\nFright Cliff Complete",
    "promot_tokens_num": 1311
}