{
    "chunk_id": 593025450018,
    "source_file": "Earth_Wolf.md",
    "content_type": "one and two",
    "h1_title": "Earth Wolf",
    "h2_title": "Where to Find the Earth Wolf",
    "h1_content": "The Earth Wolf is an optional Yaoguai Chief miniboss that you can encounter in Chapter 2 of Black Myth Wukong. As an optional foe, you can seek out this enemy to gain their Spirit power by defeating them inside the Sandgate Village.\n* Rewards: Earth Wolf Spirit",
    "h2_content": "The Earth Wolf is located early in Chapter 2's Yellow Wind Ridge, once you enter the Sandgate Village and pass the Village Entrance Shrine. The miniboss is located behind a large gate guarded by many archers, forcing you to take the long way around.\nTake the path to the right of the sealed gate, and fight past two Rat Captains while keeping the village shacks on your left. As you circle the area, you can find a pathway leading to an archway guarded by a Rat Archer and Rat Governor, and you'll find the boss inside.",
    "promot": "This is an excerpt from the file 'Earth_Wolf.md', located in the main section titled 'Earth Wolf'. The section summary is: The Earth Wolf is an optional Yaoguai Chief miniboss that you can encounter in Chapter 2 of Black Myth Wukong. As an optional foe, you can seek out this enemy to gain their Spirit power by defeating them inside the Sandgate Village.\n* Rewards: Earth Wolf Spirit This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find the Earth Wolf', and the detailed content is as follows:\nThe Earth Wolf is located early in Chapter 2's Yellow Wind Ridge, once you enter the Sandgate Village and pass the Village Entrance Shrine. The miniboss is located behind a large gate guarded by many archers, forcing you to take the long way around.\nTake the path to the right of the sealed gate, and fight past two Rat Captains while keeping the village shacks on your left. As you circle the area, you can find a pathway leading to an archway guarded by a Rat Archer and Rat Governor, and you'll find the boss inside.",
    "promot_tokens_num": 234
}