{
    "chunk_id": 954561619969,
    "source_file": "Temple_of_Yellow_Flowers_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Temple of Yellow Flowers Walkthrough",
    "h2_title": "Boss Fight - Supreme Inspector",
    "h1_content": "The Temple of Yellow Flowers is the final main area of Black Myth: Wukong's Chapter 4, located high above the Webbed Hollow on. Below you'll find a guide for the final area of The Webbed Hollow, including how to track down the Violet Spider and defeat the Hundred-Eyed Daoist Master, as well as getting a rematch with the Venom Daoist to unlock a Secret Area, and finding the last Purple Talisman Altar.\n* **Jump to a Section**\n* **Mountain Trail**\n* **Forest of Ferocity**\n* Yaoguai Chief - Commander Beetle\n* **Temple Entrance**\n* Yaoguai Chief - Fungiwoman\n* Boss Fight - Venom Daoist\n* **Court of Illumination**\n* Boss Fight - Supreme Inspector\n* Yaoguai King - Hundred-Eyed Daoist Master\nAfter defeating the Violet Spider, you'll have to escape her spider swarm as she retreats, but luckily you'll be plucked to safety by the one Spider Sister that seems to be on your side.\nWhen you untangle yourself from the webbing, you'll find yourself high above the Webbed Hollow, on a mountain path leading to a large temple filled with Daoist martial artists.",
    "h2_content": "In truth, this is only a prelude to an actual boss fight you won't encounter until much later, but it doesn't make the Supreme Inspector any less intimidating. He's got a ton of attacks that hit extremely hard, and even though you're supposed to \"lose\" this fight, you can end it by taking off 10% of his health.\nWith that in mind, do you best to dodge his wing attacks after he extends them slightly, and unleash everything you've got in your arsenal to try burning down that 10%.\nIf he takes to the air,  it safe and hang back, waiting to dodge when he divekicks his way back to you before trying to Immobilize and counter him.\nIf he tries to shoot out various wing-tip projectiles at you, don't panic and just use your staff spin to knock them all aside.\nOnce the battle comes to a conclusion, a Heron Noble will intervene, calling his attack... hand, off. He'll reprimand you (or Wukong) for your foolish acts, and despite destroying the altars, it seems they are set on keeping the Spider Sister who has been helping you from breaking free of her life in the Webbed Hollow.\nThat's all you can do with him for now, but at the very least, you can now approach the table behind where the purple talisman altar was placed to find a **Celestial Nonary Pill** , increasing your stamina by a bit more!\nThe Webbed Hollow Celestial Nonary Pill\nNow that you've done all there is to do here, you can return to rest at the Shrine, and head toward the large field to finally catch up to the Violet Spider and her master, the Hundred-Eyed Daoist.",
    "promot": "This is an excerpt from the file 'Temple_of_Yellow_Flowers_Walkthrough.md', located in the main section titled 'Temple of Yellow Flowers Walkthrough'. The section summary is: The Temple of Yellow Flowers is the final main area of Black Myth: Wukong's Chapter 4, located high above the Webbed Hollow on. Below you'll find a guide for the final area of The Webbed Hollow, including how to track down the Violet Spider and defeat the Hundred-Eyed Daoist Master, as well as getting a rematch with the Venom Daoist to unlock a Secret Area, and finding the last Purple Talisman Altar.\n* **Jump to a Section**\n* **Mountain Trail**\n* **Forest of Ferocity**\n* Yaoguai Chief - Commander Beetle\n* **Temple Entrance**\n* Yaoguai Chief - Fungiwoman\n* Boss Fight - Venom Daoist\n* **Court of Illumination**\n* Boss Fight - Supreme Inspector\n* Yaoguai King - Hundred-Eyed Daoist Master\nAfter defeating the Violet Spider, you'll have to escape her spider swarm as she retreats, but luckily you'll be plucked to safety by the one Spider Sister that seems to be on your side.\nWhen you untangle yourself from the webbing, you'll find yourself high above the Webbed Hollow, on a mountain path leading to a large temple filled with Daoist martial artists. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Boss Fight - Supreme Inspector', and the detailed content is as follows:\nIn truth, this is only a prelude to an actual boss fight you won't encounter until much later, but it doesn't make the Supreme Inspector any less intimidating. He's got a ton of attacks that hit extremely hard, and even though you're supposed to \"lose\" this fight, you can end it by taking off 10% of his health.\nWith that in mind, do you best to dodge his wing attacks after he extends them slightly, and unleash everything you've got in your arsenal to try burning down that 10%.\nIf he takes to the air,  it safe and hang back, waiting to dodge when he divekicks his way back to you before trying to Immobilize and counter him.\nIf he tries to shoot out various wing-tip projectiles at you, don't panic and just use your staff spin to knock them all aside.\nOnce the battle comes to a conclusion, a Heron Noble will intervene, calling his attack... hand, off. He'll reprimand you (or Wukong) for your foolish acts, and despite destroying the altars, it seems they are set on keeping the Spider Sister who has been helping you from breaking free of her life in the Webbed Hollow.\nThat's all you can do with him for now, but at the very least, you can now approach the table behind where the purple talisman altar was placed to find a **Celestial Nonary Pill** , increasing your stamina by a bit more!\nThe Webbed Hollow Celestial Nonary Pill\nNow that you've done all there is to do here, you can return to rest at the Shrine, and head toward the large field to finally catch up to the Violet Spider and her master, the Hundred-Eyed Daoist.",
    "promot_tokens_num": 682
}