{
    "chunk_id": 152832454939,
    "source_file": "Pale-Axe_Stalwart.md",
    "content_type": "one and two",
    "h1_title": "Pale-Axe Stalwart",
    "h2_title": "Pale-Axe Stalwart Boss Fight and Guide",
    "h1_content": "The Pale-Axe Stalwart is a Character boss you'll go up against at the start of Chapter 5 in Black Myth: Wukong. After defeating the imposing Stalwart, you'll be asked to complete a side quest for him.",
    "h2_content": "The health bar for the Pale-Axe Stalwart will appear as soon as you approach the open area. There will be Revenants and Bull Soldiers fighting around you, but you can ignore these and focus solely on the Pale-Axe Stalwart for this miniboss fight.\nHe uses a huge axe, so most of his attacks are slow swings. The main approach to this fight should be to dodge the slow attacks, then immediately follow up with a combo as he takes time to recover.\nOccasionally, he will kick at you or jump up in the air, raising his axe above him. When he does the latter, he will slam it down as he lands, but even with this move, dodging is still the way to go.\nThe most beneficial thing to you here is the fire from above. He is also impacted by the fire attacks, so watch where the projectiles land and bait him into standing in the vicinity of them. This will build up his Fire Damage, weakening his health bar while you attack, and also completely stagger him at times, leaving him vulnerable to longer combos and heavier attacks.\nWhen you've knocked his health bar almost all the way down, he will kneel. To make the area safer, clear out the rest of the fighting Yaoguais, then approach the Pale-Axe Stalwart, who will now become an NPC with his own side quest for you to complete.\nPale-Axe Stalwart",
    "promot": "This is an excerpt from the file 'Pale-Axe_Stalwart.md', located in the main section titled 'Pale-Axe Stalwart'. The section summary is: The Pale-Axe Stalwart is a Character boss you'll go up against at the start of Chapter 5 in Black Myth: Wukong. After defeating the imposing Stalwart, you'll be asked to complete a side quest for him. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Pale-Axe Stalwart Boss Fight and Guide', and the detailed content is as follows:\nThe health bar for the Pale-Axe Stalwart will appear as soon as you approach the open area. There will be Revenants and Bull Soldiers fighting around you, but you can ignore these and focus solely on the Pale-Axe Stalwart for this miniboss fight.\nHe uses a huge axe, so most of his attacks are slow swings. The main approach to this fight should be to dodge the slow attacks, then immediately follow up with a combo as he takes time to recover.\nOccasionally, he will kick at you or jump up in the air, raising his axe above him. When he does the latter, he will slam it down as he lands, but even with this move, dodging is still the way to go.\nThe most beneficial thing to you here is the fire from above. He is also impacted by the fire attacks, so watch where the projectiles land and bait him into standing in the vicinity of them. This will build up his Fire Damage, weakening his health bar while you attack, and also completely stagger him at times, leaving him vulnerable to longer combos and heavier attacks.\nWhen you've knocked his health bar almost all the way down, he will kneel. To make the area safer, clear out the rest of the fighting Yaoguais, then approach the Pale-Axe Stalwart, who will now become an NPC with his own side quest for you to complete.\nPale-Axe Stalwart",
    "promot_tokens_num": 415
}