{
    "chunk_id": 472501458113,
    "source_file": "Loong_Scales.md",
    "content_type": "one and two",
    "h1_title": "Loong Scales",
    "h2_title": "Black Myth: Wukong Loong Scales Location",
    "h1_content": "Loong Scales are one of the most important Key Items in Black Myth: Wukong. These Legendary scales are vital to finding some of the toughest hidden bosses in the game, and killing all the Loong dragons. By killing all the dragons, you will be able to unlock new Weapons and gear, alongside getting some of the rarer materials in the game like a Loong Pearl.\nOn this page, we will cover the Loong Scales location and where you can use them to find the secret Loong dragon bosses.",
    "h2_content": "The Loong Scales are found in Sandgate Village - Valley of Despair in a secret area after defeating the First Prince of Flowing Sands and having the boss destroy the mural wall in the arena.\nTo defeat the First Prince of Flowing Sands, you will need to obtain the Pungent Flesh Chunk from defeating the King of Flowing Sand and Second Rat Prince in Sandgate Village. This is a mandatory boss, so you can't miss them.\nFrom there you can head into the caves below the Valley of Despair Shrine and use the Pungent Flesh Chunk on the cliff edge. The best method to get the boss to destroy the wall is to stand against the wall at a short-to-medium distance from the boss and have it do its slam with its hand. It will do this by turning to its right with its fist along the ground. Alternatively, you can bait the boss' charge and take a hit to ensure the boss hits the wall.\nFollowing that you can head through the wall to get the Loong Scales from the chest.\nLoong Scales",
    "promot": "This is an excerpt from the file 'Loong_Scales.md', located in the main section titled 'Loong Scales'. The section summary is: Loong Scales are one of the most important Key Items in Black Myth: Wukong. These Legendary scales are vital to finding some of the toughest hidden bosses in the game, and killing all the Loong dragons. By killing all the dragons, you will be able to unlock new Weapons and gear, alongside getting some of the rarer materials in the game like a Loong Pearl.\nOn this page, we will cover the Loong Scales location and where you can use them to find the secret Loong dragon bosses. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Loong Scales Location', and the detailed content is as follows:\nThe Loong Scales are found in Sandgate Village - Valley of Despair in a secret area after defeating the First Prince of Flowing Sands and having the boss destroy the mural wall in the arena.\nTo defeat the First Prince of Flowing Sands, you will need to obtain the Pungent Flesh Chunk from defeating the King of Flowing Sand and Second Rat Prince in Sandgate Village. This is a mandatory boss, so you can't miss them.\nFrom there you can head into the caves below the Valley of Despair Shrine and use the Pungent Flesh Chunk on the cliff edge. The best method to get the boss to destroy the wall is to stand against the wall at a short-to-medium distance from the boss and have it do its slam with its hand. It will do this by turning to its right with its fist along the ground. Alternatively, you can bait the boss' charge and take a hit to ensure the boss hits the wall.\nFollowing that you can head through the wall to get the Loong Scales from the chest.\nLoong Scales",
    "promot_tokens_num": 393
}