{
    "chunk_id": 211769573349,
    "source_file": "Brown-Iron_Cart.md",
    "content_type": "one and two",
    "h1_title": "Brown-Iron Cart",
    "h2_title": "How to Find the Brown-Iron Cart",
    "h1_content": "Brown-Iron Cart is a Yaoguai Chief boss fight that you'll go up against at the start of Chapter 5 in Black Myth: Wukong. Blocking the pathway from the Ashen Pass to the Camp of Seasons, the cart is just one of the Five Element Carts you'll need to fight in this Chapter.",
    "h2_content": "After defeating the Pale-Axe Stalwart, go up the stairs and begin your ascent of the mountain. At the top of these steps, the health bar for the Brown-Iron Cart will appear and you can find it blocking the path to the left. However, there's also a broken set of stairs to the immediate right, which you can climb up. This will bring you to a small roof you can run along to collect a green Wisp.\nDash up the broken steps and run along the small path to get behind the cart. Drop down and you'll also be at the next Keeper's Shrine.",
    "promot": "This is an excerpt from the file 'Brown-Iron_Cart.md', located in the main section titled 'Brown-Iron Cart'. The section summary is: Brown-Iron Cart is a Yaoguai Chief boss fight that you'll go up against at the start of Chapter 5 in Black Myth: Wukong. Blocking the pathway from the Ashen Pass to the Camp of Seasons, the cart is just one of the Five Element Carts you'll need to fight in this Chapter. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'How to Find the Brown-Iron Cart', and the detailed content is as follows:\nAfter defeating the Pale-Axe Stalwart, go up the stairs and begin your ascent of the mountain. At the top of these steps, the health bar for the Brown-Iron Cart will appear and you can find it blocking the path to the left. However, there's also a broken set of stairs to the immediate right, which you can climb up. This will bring you to a small roof you can run along to collect a green Wisp.\nDash up the broken steps and run along the small path to get behind the cart. Drop down and you'll also be at the next Keeper's Shrine.",
    "promot_tokens_num": 258
}