{
    "chunk_id": 938268175273,
    "source_file": "Glazed_Reliquary.md",
    "content_type": "one and two",
    "h1_title": "Glazed Reliquary",
    "h2_title": "Black Myth: Wukong Glazed Reliquary Location",
    "h1_content": "The Glazed Reliquary is one of the Curios items in Chapter 2 of Black Myth: Wukong. Unlike some of the other Curios' in this chapter, this one can easily be missed as it is in a rather well-hidden area.\nWhile perfect dodging, you will recover a small amount of stamina with this Curios equipped. Compared to most of the others, this one is particularly situational and unlikely to be as helpful for most ers compared to many of the other Curios items.\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, you will want to switch to other Curios items to better fit your build as you  if you find the Glazed Reliquary isn't working for you anymore. This can be done from the Equipment menu.",
    "h2_content": "The Glazed Reliquary can be found in a box by a statue, within the Windrest Hamelet area of the Yellow Sand Formation in Yellow Wind Ridge. As you make your way through this area, you will fight the Tiger Acolyte\"), obtain the Old Rattle-Drum, and be able to continue onwards into a cave.\nJust ahead, you can find the box with the Curios in.\nGlazed Reliquary\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "promot": "This is an excerpt from the file 'Glazed_Reliquary.md', located in the main section titled 'Glazed Reliquary'. The section summary is: The Glazed Reliquary is one of the Curios items in Chapter 2 of Black Myth: Wukong. Unlike some of the other Curios' in this chapter, this one can easily be missed as it is in a rather well-hidden area.\nWhile perfect dodging, you will recover a small amount of stamina with this Curios equipped. Compared to most of the others, this one is particularly situational and unlikely to be as helpful for most ers compared to many of the other Curios items.\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, you will want to switch to other Curios items to better fit your build as you  if you find the Glazed Reliquary isn't working for you anymore. This can be done from the Equipment menu. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Glazed Reliquary Location', and the detailed content is as follows:\nThe Glazed Reliquary can be found in a box by a statue, within the Windrest Hamelet area of the Yellow Sand Formation in Yellow Wind Ridge. As you make your way through this area, you will fight the Tiger Acolyte\"), obtain the Old Rattle-Drum, and be able to continue onwards into a cave.\nJust ahead, you can find the box with the Curios in.\nGlazed Reliquary\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "promot_tokens_num": 389
}