{
    "chunk_id": 408472435534,
    "source_file": "Snowhill_Path_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Snowhill Path Walkthrough",
    "h2_title": "Frost-Clad Path",
    "h1_content": "Black Myth: Wukong's Chapter 3 begins in the freezing mountain trail toward The New West. Below you'll find a guide for the first major area of The New West: Snowhill Path, as well as how to win your first encounter with Macaque Chief, and defeat the mighty Kang-Jin Loong.\n* **Jump to a Section:**\n* **Frost-Clad Path**\n* Yaoguai Chief - Macaque Chief\n* **Mirrormere**\n* Yaoguai Queen - Kang-Jin Loong\nIn Black Myth Wukong's third chapter, the Destined One will travel far from the arid deserts to the snowy mountaintops of The New West, where you'll spy an odd character masquerading as a statue.\nOnce you've taken off your own disguise, you'll find yourself in a frozen cave full of giant statues with only one way forward. That way is blocked by a tough looking new enemy, the Monk Supporter.\nThese foes are fairly slow but durable, and will use the large stones they carry to try pummeling you with. Thankfully, they are fairly susceptible to being deflected with Rock Solid.\nHead up the stairs at the end of the path to reach a high ledge in the cave, and on the way down you'll meet another new enemy. These Cyan Bats like to cling to ceiling and drop down to ambush you. While they are way less durable than the Swift Bats of the Yellow Wind Ridge, they can dive at you with their spears, or send ice attack projectiles your way that will try to inflict you with frostbite. If they try to dart out of reach, use the Thrust Stance to chase them down.\nBe sure to look to the left as you head down from the ledge, and you'll find a small pool of water with some Jade Lotus, and another Monk Supporter guarding a**Small Chest** , likely containing some Cold Iron Leaves and other materials.\nHead upwards to a break in the cave as the snowy wind billows down, and prepare for the low visibility to mask another Cyan Bat hiding around the corner.",
    "h2_content": "Grab the green Wisp and absorb it as you head up the final tunnel section of this cave, which will bring you at last to a large field of Snowhill Path. You can find some Gentian plants around here as you exit, and up ahead you can find the Frost-Clad Path Shrine.\nLike the previous chapters, this shrine has a whole new store for you to browse, and you'll also be able to start investing in crafting the Ochre Armor Set and Rat Sage Staff (or possibly the Loongwreathe Staff as well if you defeated the Red Loong and Black Loong in the previous chapters). These weapons will cost a fair amount of Will and other materials, so check your inventory often for when you have enough to upgrade, and also look into stocking up on new items:\nThe New West Shrine Shop\n---\nBody-Warming Powder (x6) - 180 Will | Shock-Quelling Powder (x6) - 180 Will | Longevity Decoction (x3) - 270 Will |\nMind Core (x4) - 1800 Will | Cold Iron Leaves (x2) - 900 Will | Refined Iron Sand (x1) - 1200 Will |\nAged Ginseng (x10) - 90 Will | Fire Bellflower (x10) - 120 Will | Tree Pearl (x10) - 180 Will | Snake-Head Mushroom (x10) - 120 Will\nGolden Lotus (x5) - 180 Will | Celestial Pear (x5) - 240 Will | |\nFrom the shrine, head up the path through the mountain. Compared to the previous chapter, you'll find this area much more linear like in Chapter 1.\nAs you reach a group of bodies frozen in the snow, a strange monkey will be alerted to your presence, throwing a piece of fruit at one of the corpses to awaken it from its slumber.\nNot all of the Frozen Corpses you'll find along this path will come alive, but those that do hold either spiked maces or very long blades, and will slowly swat at you or do leaping attacks with them.\nLuckily, they don't have much health and are easily dodged -- but note that the Frozen Corpses with spiked maces will swing wildly a few times after they've been \"killed\" so street clear of their death throes.\nYou can head past the small building the other monkey was perched on, or swing around the back side to find a small alternate path. This area leads up to a large column with a green Wisp you can absorb, and two Frozen Corpses guarding it.\nHead back up the main path through more Frozen Corpses, taking them on one at a time so you don't get overwhelmed. Once you reach the top of this area you'll find a large snowy field where the monkey is waiting for you.\n### Yaoguai Chief Miniboss Fight - Macaque Chief (First Encounter)\nYou can consider this one half of a real boss fight, since you won't actually defeat this miniboss here. Despite that, the Macaque Chief is not to be taken lightly. Many of his attacks inflict Frost, and if your bar fills, you'll have extremely reduced mobility and be unable to dodge many of his attacks. Plan ahead by crafting or buying Body-Warming Pills to offset this.\nThe Macaque Chief is fairly proficient with the giant curved blade he wields, and begins the fight by slamming it down to send a vacuum slice projectile right at you.\nHe can also heave his blade around that will send his body spinning, attacking with two quick spinning slice attacks. Often times he'll end up holding the blade with his foot, and perform a final upward slash as he backflips, sending out another projectile slash.\nHis one major attack will have him jump into the air and slam his blade into the ground, and then perform series of quick claw swipes in front of him with surprising reach, all while keeping close to the blade behind him -- meaning he can't really pivot if you dodge and attack from the sides.\nHe'll step back to grab the sword with his foot and jump onto its hilt, before preforming a quick roll along the ground to drag the sword in a whirlwind slice with a large reach to it, followed by a final downward slam, so don't press your attack too hard during this combo, or Immobilize him before the second part of his combo.\nA longer deadly combo attack he can employ comes with three quick slashes ending in a jumping upward slash. After a brief pause in the air, he'll use his foot to send the blade slamming down vertically, and then yank it back up in an arc for a final two-hand diagonal slice attack. Your Rock Solid won't always stagger him mid-combo, so it's better to wait and parry the final slice so you can retaliate faster.\nIf he begins to hold the blade in both hands, prepare for an extended attack with three alternating slices ending in an upward swing with a long delay. When he finally brings the blade down, he'll do so in a spinning multi-hit slash, followed by a final slam to emit a projectile slash.\nOnce you get him to around half his health, he'll suddenly jump backwards in retreat, and start putting his hands together to signal mercy and defeat.\nDo not be lured in by this gesture, as it's all an act -- as he'll eventually look up and use his tail to bring the blade up in an upward slash with a projectile slice at you!\nFinally, if you spend to much time dishing out damage to his face, he'll eventually counter with an unexpected move: puking on you. This will deal an immense amount of poison buildup, so be ready to Immobilize or dodge around behind him.\nWith his small frame, the Macaque Chief is fairly susceptible to being staggered with charged up heavy strikes. Build up your focus from light attack combos when dodging him, and then knock him down with big hits or after deflecting his moves.\nWhen he runs out of health, you won't get the traditional \"boss defeated\" scene, and only earn some Will as the Macaque Chief retreats, turns invisible, and runs off toward the ruins above while taunting you.\nMacaque Chief (Snowhill Path)\nWith the area now clear, you're free to continue up the mountain path to a large walled temple in the distance. Once you reach the final set of stairs leading up to the temple, be ready for a Cyan Bat hanging from a nearby tree to ambush you.\nClimbing the stairs, be sure to look to the left for some broken wooden platforms you can jump to, and beyond them you'll find a **Treasure Chest** containing items and likely a few Refined Iron Sand.\nEntering the large temple complex, there's actually not as much to explore as you might think. A large open area to the right leads to a sealed building, but guarding it is a new enemy - the Yaksha Patroller.\nThese formidable foes are pretty beefy, and use their wicked weapons to throw at you like boomerangs from a distance. They can also string long combo attacks together, requiring you to interrupt one with a Rock Solid deflection or wait until their final leaping slash or delayed uppercut to retaliate.\nOnce the Patroller is down, you can find a green Wisp to absorb at the foot of the building to replenish your gourd, but there's not much else here.\nInstead, return to the temple entrance and look for stairs leading upward. Be wary of more Frozen Corpses coming to life as you ascend, and another will try and ambush you from the left as you reach the next landing.\nThere's another Yaksha Patroller here waiting to challenge you, so try and isolate him first by luring the corpses down the stairs and then take him out. Once again, there's another green Wisp to absorb on the right to get some gourd healing back.\nAs you head to the end of the raised platform, you'll find a snowy sloping path off to the right, and another stairway path going straight ahead.\nTake the path straight first, and you'll find a supercharged Yaksha Patroller surrounded by a horde of Frozen Corpses, making this fight a lot harder than usual. Don't worry about conserving your power here -- let loose with your Pluck of Many and Spirit Transformations spells to even the odds as much as you can so you can take down all the extra enemies and then focus on whittling down the Patroller's health.\nOnce he dies, he'll drop the Mountain Patroller Spirit for you to absorb and get all your gourd's health charges back. As an added bonus, you can inspect this other sealed building to find a **Treasure Chest** on the left side, which usually contains a Blood of the Iron Bull and other items.\nAside from a Ginsengling hiding in the ruins nearby, that's it for this route, so return back to the previous platform and head down the sloping path.\nLook for an open covered platform to the left as you descend, and make a quick detour to inspect this area. A Cyan Bat is hiding in the rafters, and after luring it down and defeating it, you can loot one more **Treasure Chest** for an assortment of items.\nFinally, head across the bridge to a large open area in the middle of this temple ruin, and you'll meet your new guide for this region, who calls himself the Keeper of the New West.\nWith little warning, he'll transform you into a bat, and have you follow him across the mountain pass to take in the sights (unlike your brief transformation into a cicada, you can't control this part).",
    "promot": "This is an excerpt from the file 'Snowhill_Path_Walkthrough.md', located in the main section titled 'Snowhill Path Walkthrough'. The section summary is: Black Myth: Wukong's Chapter 3 begins in the freezing mountain trail toward The New West. Below you'll find a guide for the first major area of The New West: Snowhill Path, as well as how to win your first encounter with Macaque Chief, and defeat the mighty Kang-Jin Loong.\n* **Jump to a Section:**\n* **Frost-Clad Path**\n* Yaoguai Chief - Macaque Chief\n* **Mirrormere**\n* Yaoguai Queen - Kang-Jin Loong\nIn Black Myth Wukong's third chapter, the Destined One will travel far from the arid deserts to the snowy mountaintops of The New West, where you'll spy an odd character masquerading as a statue.\nOnce you've taken off your own disguise, you'll find yourself in a frozen cave full of giant statues with only one way forward. That way is blocked by a tough looking new enemy, the Monk Supporter.\nThese foes are fairly slow but durable, and will use the large stones they carry to try pummeling you with. Thankfully, they are fairly susceptible to being deflected with Rock Solid.\nHead up the stairs at the end of the path to reach a high ledge in the cave, and on the way down you'll meet another new enemy. These Cyan Bats like to cling to ceiling and drop down to ambush you. While they are way less durable than the Swift Bats of the Yellow Wind Ridge, they can dive at you with their spears, or send ice attack projectiles your way that will try to inflict you with frostbite. If they try to dart out of reach, use the Thrust Stance to chase them down.\nBe sure to look to the left as you head down from the ledge, and you'll find a small pool of water with some Jade Lotus, and another Monk Supporter guarding a**Small Chest** , likely containing some Cold Iron Leaves and other materials.\nHead upwards to a break in the cave as the snowy wind billows down, and prepare for the low visibility to mask another Cyan Bat hiding around the corner. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Frost-Clad Path', and the detailed content is as follows:\nGrab the green Wisp and absorb it as you head up the final tunnel section of this cave, which will bring you at last to a large field of Snowhill Path. You can find some Gentian plants around here as you exit, and up ahead you can find the Frost-Clad Path Shrine.\nLike the previous chapters, this shrine has a whole new store for you to browse, and you'll also be able to start investing in crafting the Ochre Armor Set and Rat Sage Staff (or possibly the Loongwreathe Staff as well if you defeated the Red Loong and Black Loong in the previous chapters). These weapons will cost a fair amount of Will and other materials, so check your inventory often for when you have enough to upgrade, and also look into stocking up on new items:\nThe New West Shrine Shop\n---\nBody-Warming Powder (x6) - 180 Will | Shock-Quelling Powder (x6) - 180 Will | Longevity Decoction (x3) - 270 Will |\nMind Core (x4) - 1800 Will | Cold Iron Leaves (x2) - 900 Will | Refined Iron Sand (x1) - 1200 Will |\nAged Ginseng (x10) - 90 Will | Fire Bellflower (x10) - 120 Will | Tree Pearl (x10) - 180 Will | Snake-Head Mushroom (x10) - 120 Will\nGolden Lotus (x5) - 180 Will | Celestial Pear (x5) - 240 Will | |\nFrom the shrine, head up the path through the mountain. Compared to the previous chapter, you'll find this area much more linear like in Chapter 1.\nAs you reach a group of bodies frozen in the snow, a strange monkey will be alerted to your presence, throwing a piece of fruit at one of the corpses to awaken it from its slumber.\nNot all of the Frozen Corpses you'll find along this path will come alive, but those that do hold either spiked maces or very long blades, and will slowly swat at you or do leaping attacks with them.\nLuckily, they don't have much health and are easily dodged -- but note that the Frozen Corpses with spiked maces will swing wildly a few times after they've been \"killed\" so street clear of their death throes.\nYou can head past the small building the other monkey was perched on, or swing around the back side to find a small alternate path. This area leads up to a large column with a green Wisp you can absorb, and two Frozen Corpses guarding it.\nHead back up the main path through more Frozen Corpses, taking them on one at a time so you don't get overwhelmed. Once you reach the top of this area you'll find a large snowy field where the monkey is waiting for you.\n### Yaoguai Chief Miniboss Fight - Macaque Chief (First Encounter)\nYou can consider this one half of a real boss fight, since you won't actually defeat this miniboss here. Despite that, the Macaque Chief is not to be taken lightly. Many of his attacks inflict Frost, and if your bar fills, you'll have extremely reduced mobility and be unable to dodge many of his attacks. Plan ahead by crafting or buying Body-Warming Pills to offset this.\nThe Macaque Chief is fairly proficient with the giant curved blade he wields, and begins the fight by slamming it down to send a vacuum slice projectile right at you.\nHe can also heave his blade around that will send his body spinning, attacking with two quick spinning slice attacks. Often times he'll end up holding the blade with his foot, and perform a final upward slash as he backflips, sending out another projectile slash.\nHis one major attack will have him jump into the air and slam his blade into the ground, and then perform series of quick claw swipes in front of him with surprising reach, all while keeping close to the blade behind him -- meaning he can't really pivot if you dodge and attack from the sides.\nHe'll step back to grab the sword with his foot and jump onto its hilt, before preforming a quick roll along the ground to drag the sword in a whirlwind slice with a large reach to it, followed by a final downward slam, so don't press your attack too hard during this combo, or Immobilize him before the second part of his combo.\nA longer deadly combo attack he can employ comes with three quick slashes ending in a jumping upward slash. After a brief pause in the air, he'll use his foot to send the blade slamming down vertically, and then yank it back up in an arc for a final two-hand diagonal slice attack. Your Rock Solid won't always stagger him mid-combo, so it's better to wait and parry the final slice so you can retaliate faster.\nIf he begins to hold the blade in both hands, prepare for an extended attack with three alternating slices ending in an upward swing with a long delay. When he finally brings the blade down, he'll do so in a spinning multi-hit slash, followed by a final slam to emit a projectile slash.\nOnce you get him to around half his health, he'll suddenly jump backwards in retreat, and start putting his hands together to signal mercy and defeat.\nDo not be lured in by this gesture, as it's all an act -- as he'll eventually look up and use his tail to bring the blade up in an upward slash with a projectile slice at you!\nFinally, if you spend to much time dishing out damage to his face, he'll eventually counter with an unexpected move: puking on you. This will deal an immense amount of poison buildup, so be ready to Immobilize or dodge around behind him.\nWith his small frame, the Macaque Chief is fairly susceptible to being staggered with charged up heavy strikes. Build up your focus from light attack combos when dodging him, and then knock him down with big hits or after deflecting his moves.\nWhen he runs out of health, you won't get the traditional \"boss defeated\" scene, and only earn some Will as the Macaque Chief retreats, turns invisible, and runs off toward the ruins above while taunting you.\nMacaque Chief (Snowhill Path)\nWith the area now clear, you're free to continue up the mountain path to a large walled temple in the distance. Once you reach the final set of stairs leading up to the temple, be ready for a Cyan Bat hanging from a nearby tree to ambush you.\nClimbing the stairs, be sure to look to the left for some broken wooden platforms you can jump to, and beyond them you'll find a **Treasure Chest** containing items and likely a few Refined Iron Sand.\nEntering the large temple complex, there's actually not as much to explore as you might think. A large open area to the right leads to a sealed building, but guarding it is a new enemy - the Yaksha Patroller.\nThese formidable foes are pretty beefy, and use their wicked weapons to throw at you like boomerangs from a distance. They can also string long combo attacks together, requiring you to interrupt one with a Rock Solid deflection or wait until their final leaping slash or delayed uppercut to retaliate.\nOnce the Patroller is down, you can find a green Wisp to absorb at the foot of the building to replenish your gourd, but there's not much else here.\nInstead, return to the temple entrance and look for stairs leading upward. Be wary of more Frozen Corpses coming to life as you ascend, and another will try and ambush you from the left as you reach the next landing.\nThere's another Yaksha Patroller here waiting to challenge you, so try and isolate him first by luring the corpses down the stairs and then take him out. Once again, there's another green Wisp to absorb on the right to get some gourd healing back.\nAs you head to the end of the raised platform, you'll find a snowy sloping path off to the right, and another stairway path going straight ahead.\nTake the path straight first, and you'll find a supercharged Yaksha Patroller surrounded by a horde of Frozen Corpses, making this fight a lot harder than usual. Don't worry about conserving your power here -- let loose with your Pluck of Many and Spirit Transformations spells to even the odds as much as you can so you can take down all the extra enemies and then focus on whittling down the Patroller's health.\nOnce he dies, he'll drop the Mountain Patroller Spirit for you to absorb and get all your gourd's health charges back. As an added bonus, you can inspect this other sealed building to find a **Treasure Chest** on the left side, which usually contains a Blood of the Iron Bull and other items.\nAside from a Ginsengling hiding in the ruins nearby, that's it for this route, so return back to the previous platform and head down the sloping path.\nLook for an open covered platform to the left as you descend, and make a quick detour to inspect this area. A Cyan Bat is hiding in the rafters, and after luring it down and defeating it, you can loot one more **Treasure Chest** for an assortment of items.\nFinally, head across the bridge to a large open area in the middle of this temple ruin, and you'll meet your new guide for this region, who calls himself the Keeper of the New West.\nWith little warning, he'll transform you into a bat, and have you follow him across the mountain pass to take in the sights (unlike your brief transformation into a cicada, you can't control this part).",
    "promot_tokens_num": 2509
}