{
    "chunk_id": 700632887581,
    "source_file": "Chapter_5_Secret-Bishui_Cave_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Chapter 5 Secret - Bishui Cave Walkthrough",
    "h2_title": "Yaoguai King - Bishui Golden-Eyed Beast",
    "h1_content": "Bishui Cave is a Secret Area found in Chapter 5 of Black Myth: Wukong. Below you'll find a guide to accessing the cave by defeating the Five Element Carts and information on the bosses you'll find inside, including the ferocious Bishui Golden-Eyed Beast.\n* **Jump to a Section:**\n* **Purge Pit**\n* Yaoguai Chief - Top Takes Bottom, Bottom Takes Top\n* **Cave Depths**\n* **Corridor of Fire and Ice**\n* Yaoguai King - Bishui Golden-Eyed Beast\nAfter being transported to Bishui Cave, head forward and clear out the two bull guards. Absorb the green Wisp by the water on the left, then head right and follow the ashen path up.\nTake down the next two bull guards you encounter, and look to the right to find a chest. Open it to pick up the Septenary Heartfire Pill Formula, then follow the path to the left and into the ruins.\nTo your left, immediately as you enter the room, you'll find the Purge Pit Keeper's Shrine.",
    "h2_content": "The fight will begin immediately as the beast launches itself at you. It's extremely agile, and a lot of the fight will be the beast hurtling towards you, trying to take swipes at you. Despite this agility, you'll see familiar moves to other bosses you've encountered in this Chapter so far.\nThe Bishui Golden-Eyed Beast likes to use punching attacks similar to the Stone Vanguard and the coffin carts. It will perform combos of smashing its fists down and creating pools of lava that will explode. The best way to deal with these is to dodge them or try to hang back from the beast as far as you can.\nIt will sometimes roll over when it tries to punch you and misses, allowing you to perform a quick follow-up attack. Where it differs from the other bosses, is that it will also leap up in the air and land like a frog, creating an explosion around it each time it lands. This move can be quite erratic, but you can avoid it entirely by keeping your distance.\nOne move to watch out for that has a wider area of attack is when it scraps its fist along the floor and flings an arc of fire toward you. These will stay on the ground for a while, and the beast can create multiple of them at once. This is when you'll want to have the Body-Cooling Powder and Fireproof Mantle on hand, as it becomes harder to dodge these the more they build up.\nBesides this, it will also charge at you leaving a trail of fire behind it. When it's charging, it's best to dodge the attacks and aim to build up Focus. The heavier you can attack, the better, because you'll want to stun the beast as often as possible.\nWhen you enter the arena, on the other side, you'll see another frozen-over archway. You can actually bait the beast to break this down and escape inside of it. While he's still trying to attack you, you can use Thrust Stance to get him.\nHead up the stairs in this section and on the right, you'll be able to harvest a Fire Date. On the left, you can find an Awaken Wine Worm, and straight up ahead before the stairs, you'll see a green Wisp on the left.\nBishui Cave Awaken Wine Worm\nContinue up the stairs, and you'll see the beast leaping around the rooftops. Go along the corridor, where you'll come to a frozen room with a doorway that has fire blocking it.\nThe best will appear again, and this time use freezing variations of the previous attacks. For this, you'll want Body-Warming Powder instead. There is another arena you can reach, and to do so, bait the beast to use a freeze attack on the door blocked by fire, so you can proceed. Go up the stairs and into the next section of the cave, where you'll slide down a frozen path and into the arena.\nHe'll be back to his fire attacks here but they'll be much more amped up, so you'll want to knock as much of his health down in the first two rounds as you can.\nBishui Golden-Eyed Beast\nLet the cutscene , and you'll be returned to the start of Bishui Cave, where you entered after defeating the last cart.\nBishui Cave Complete",
    "promot": "This is an excerpt from the file 'Chapter_5_Secret-Bishui_Cave_Walkthrough.md', located in the main section titled 'Chapter 5 Secret - Bishui Cave Walkthrough'. The section summary is: Bishui Cave is a Secret Area found in Chapter 5 of Black Myth: Wukong. Below you'll find a guide to accessing the cave by defeating the Five Element Carts and information on the bosses you'll find inside, including the ferocious Bishui Golden-Eyed Beast.\n* **Jump to a Section:**\n* **Purge Pit**\n* Yaoguai Chief - Top Takes Bottom, Bottom Takes Top\n* **Cave Depths**\n* **Corridor of Fire and Ice**\n* Yaoguai King - Bishui Golden-Eyed Beast\nAfter being transported to Bishui Cave, head forward and clear out the two bull guards. Absorb the green Wisp by the water on the left, then head right and follow the ashen path up.\nTake down the next two bull guards you encounter, and look to the right to find a chest. Open it to pick up the Septenary Heartfire Pill Formula, then follow the path to the left and into the ruins.\nTo your left, immediately as you enter the room, you'll find the Purge Pit Keeper's Shrine. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Yaoguai King - Bishui Golden-Eyed Beast', and the detailed content is as follows:\nThe fight will begin immediately as the beast launches itself at you. It's extremely agile, and a lot of the fight will be the beast hurtling towards you, trying to take swipes at you. Despite this agility, you'll see familiar moves to other bosses you've encountered in this Chapter so far.\nThe Bishui Golden-Eyed Beast likes to use punching attacks similar to the Stone Vanguard and the coffin carts. It will perform combos of smashing its fists down and creating pools of lava that will explode. The best way to deal with these is to dodge them or try to hang back from the beast as far as you can.\nIt will sometimes roll over when it tries to punch you and misses, allowing you to perform a quick follow-up attack. Where it differs from the other bosses, is that it will also leap up in the air and land like a frog, creating an explosion around it each time it lands. This move can be quite erratic, but you can avoid it entirely by keeping your distance.\nOne move to watch out for that has a wider area of attack is when it scraps its fist along the floor and flings an arc of fire toward you. These will stay on the ground for a while, and the beast can create multiple of them at once. This is when you'll want to have the Body-Cooling Powder and Fireproof Mantle on hand, as it becomes harder to dodge these the more they build up.\nBesides this, it will also charge at you leaving a trail of fire behind it. When it's charging, it's best to dodge the attacks and aim to build up Focus. The heavier you can attack, the better, because you'll want to stun the beast as often as possible.\nWhen you enter the arena, on the other side, you'll see another frozen-over archway. You can actually bait the beast to break this down and escape inside of it. While he's still trying to attack you, you can use Thrust Stance to get him.\nHead up the stairs in this section and on the right, you'll be able to harvest a Fire Date. On the left, you can find an Awaken Wine Worm, and straight up ahead before the stairs, you'll see a green Wisp on the left.\nBishui Cave Awaken Wine Worm\nContinue up the stairs, and you'll see the beast leaping around the rooftops. Go along the corridor, where you'll come to a frozen room with a doorway that has fire blocking it.\nThe best will appear again, and this time use freezing variations of the previous attacks. For this, you'll want Body-Warming Powder instead. There is another arena you can reach, and to do so, bait the beast to use a freeze attack on the door blocked by fire, so you can proceed. Go up the stairs and into the next section of the cave, where you'll slide down a frozen path and into the arena.\nHe'll be back to his fire attacks here but they'll be much more amped up, so you'll want to knock as much of his health down in the first two rounds as you can.\nBishui Golden-Eyed Beast\nLet the cutscene , and you'll be returned to the start of Bishui Cave, where you entered after defeating the last cart.\nBishui Cave Complete",
    "promot_tokens_num": 997
}