{
    "chunk_id": 689178101528,
    "source_file": "Tiger_Vanguard.md",
    "content_type": "one and two",
    "h1_title": "Tiger Vanguard",
    "h2_title": "Where to Find the Tiger Vanguard",
    "h1_content": "The Tiger Vanguard is a required Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Located in the center of the Crouching Tiger Temple, this fearsome Tiger Guai is one of the hardest bosses to overcome in all of Chapter 2.\n* **Rewards:** Rock Solid Spell, Keeness of Tiger, Mind Core x1, Silk x3, 1652 Experience, 1362 Will",
    "h2_content": "As a required boss, you won't be able to proceed to the Chapter 2 End Boss without defeating and him and obtaning one half of the Key Items needed to open various doors in Chapter 2's Yellow Wind Ridge.\nYou can find him inside the Crouching Tiger Temple, which is located at the end of the Sandgate Village, taking a left after defeating the King of Flowing Sands and through a crack in the wall in the Valley of Despair.",
    "promot": "This is an excerpt from the file 'Tiger_Vanguard.md', located in the main section titled 'Tiger Vanguard'. The section summary is: The Tiger Vanguard is a required Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Located in the center of the Crouching Tiger Temple, this fearsome Tiger Guai is one of the hardest bosses to overcome in all of Chapter 2.\n* **Rewards:** Rock Solid Spell, Keeness of Tiger, Mind Core x1, Silk x3, 1652 Experience, 1362 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find the Tiger Vanguard', and the detailed content is as follows:\nAs a required boss, you won't be able to proceed to the Chapter 2 End Boss without defeating and him and obtaning one half of the Key Items needed to open various doors in Chapter 2's Yellow Wind Ridge.\nYou can find him inside the Crouching Tiger Temple, which is located at the end of the Sandgate Village, taking a left after defeating the King of Flowing Sands and through a crack in the wall in the Valley of Despair.",
    "promot_tokens_num": 251
}