{
    "chunk_id": 757853733141,
    "source_file": "Feng-Tail_General.md",
    "content_type": "one and two",
    "h1_title": "Feng-Tail General",
    "h2_title": "Feng-Tail General Boss Fight and Guides",
    "h1_content": "Feng-Tail General is one of the main Yaoguai Chiefs you'll need to find in Chapter 6 of Black Myth: Wukong\"). Rather than being a traditional boss fight, the Feng-Tail General acts as a test of your stamina and health to make sure you're fit for the journey ahead.",
    "h2_content": "The boss fight against the Feng-Tail General is more of a skill check than anything, testing out whether you've got the necessary health and stamina to continue.\nFirstly, it will test your stamina. When you approach it near the Mantis-Catching Swamp, and land on its head you'll need to approach its antennae. Interact with them and hold on. It will begin to jump around the water, eventually ending up near the Rhino Watch Slope. Your stamina bar will drain as it does this, and you'll only be able to complete the test if it doesn't completely run out before the critter stops jumping. If you're finding it hard to hold on, reset some skills and ensure that Rampant Vigor is maxed out under Survival, and see if you've missed any Celestial Nonary Pill Locations.\nThe second test will be on your health bar, and particularly test your fire resistance. When the insect stops jumping, you'll be expected to interact with its flaming antennae. Before you do this, equip your Fireproof Mantle, and ensure you've maxed out your Bane Mitigation skill. Check to see if you have any other gear you can equip that helps with burn resistance, and see if you've missed any Celestial Jade Lotus Pill Locations.\nIf you're able to hang on without dying, you'll snap the antennae from the insect and receive the Golden Feng-Tail Crown.\nFeng-Tail General",
    "promot": "This is an excerpt from the file 'Feng-Tail_General.md', located in the main section titled 'Feng-Tail General'. The section summary is: Feng-Tail General is one of the main Yaoguai Chiefs you'll need to find in Chapter 6 of Black Myth: Wukong\"). Rather than being a traditional boss fight, the Feng-Tail General acts as a test of your stamina and health to make sure you're fit for the journey ahead. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Feng-Tail General Boss Fight and Guides', and the detailed content is as follows:\nThe boss fight against the Feng-Tail General is more of a skill check than anything, testing out whether you've got the necessary health and stamina to continue.\nFirstly, it will test your stamina. When you approach it near the Mantis-Catching Swamp, and land on its head you'll need to approach its antennae. Interact with them and hold on. It will begin to jump around the water, eventually ending up near the Rhino Watch Slope. Your stamina bar will drain as it does this, and you'll only be able to complete the test if it doesn't completely run out before the critter stops jumping. If you're finding it hard to hold on, reset some skills and ensure that Rampant Vigor is maxed out under Survival, and see if you've missed any Celestial Nonary Pill Locations.\nThe second test will be on your health bar, and particularly test your fire resistance. When the insect stops jumping, you'll be expected to interact with its flaming antennae. Before you do this, equip your Fireproof Mantle, and ensure you've maxed out your Bane Mitigation skill. Check to see if you have any other gear you can equip that helps with burn resistance, and see if you've missed any Celestial Jade Lotus Pill Locations.\nIf you're able to hang on without dying, you'll snap the antennae from the insect and receive the Golden Feng-Tail Crown.\nFeng-Tail General",
    "promot_tokens_num": 429
}