{
    "chunk_id": 962939098201,
    "source_file": "Water_Curtain_Cave_and_Birthstone_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Water Curtain Cave and Birthstone Walkthrough",
    "h2_title": "Return Path",
    "h1_content": "Water Curtain Cave is the second area of Chapter 6 of Black Myth: Wukong, while Birthstone is the final section of the game. After conquering a variety of bosses and obtaining Wukong's special armor, The Destined One is ready to complete his journey. Below, you'll find a Walkthrough of the final areas of Mount Huaguo as well as information on the bosses you'll encounter along the way.\n* **Jump to a Section:**\n* Water Curtain Cave**\n* Return Path**\n* Peak of Innocence**\n* Birthstone - Heart of Birthstone**\n* Stone Monkey\n* The Great Sage's Broken Shell",
    "h2_content": "Continue up the path, where you'll have to face off against numerous soldiers along the way. This is really just a chance for you to test the power of Jingubang, and pick up some extra Will and Sparks.\nAbout halfway up, Zhu Bajie loses his patience and transforms into a boar, knocking down a number of soldiers as he dashes off.\nJust keep working your way up to the top of the path, taking out as many soldiers as you want along the way. You'll pass by a portion of the path covered in fire, and then enter into a cave.\nGo to the top of the cave, then turn left, and follow the path until you need to squeeze through a gap in the wall.\nWhen you emerge on the other side, you'll see the final stretch of the path that dips down and then slopes upward. Head for the top and activate the Peak of Innocence Keeper's Shrine, just before the end of the path.",
    "promot": "This is an excerpt from the file 'Water_Curtain_Cave_and_Birthstone_Walkthrough.md', located in the main section titled 'Water Curtain Cave and Birthstone Walkthrough'. The section summary is: Water Curtain Cave is the second area of Chapter 6 of Black Myth: Wukong, while Birthstone is the final section of the game. After conquering a variety of bosses and obtaining Wukong's special armor, The Destined One is ready to complete his journey. Below, you'll find a Walkthrough of the final areas of Mount Huaguo as well as information on the bosses you'll encounter along the way.\n* **Jump to a Section:**\n* Water Curtain Cave**\n* Return Path**\n* Peak of Innocence**\n* Birthstone - Heart of Birthstone**\n* Stone Monkey\n* The Great Sage's Broken Shell This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Return Path', and the detailed content is as follows:\nContinue up the path, where you'll have to face off against numerous soldiers along the way. This is really just a chance for you to test the power of Jingubang, and pick up some extra Will and Sparks.\nAbout halfway up, Zhu Bajie loses his patience and transforms into a boar, knocking down a number of soldiers as he dashes off.\nJust keep working your way up to the top of the path, taking out as many soldiers as you want along the way. You'll pass by a portion of the path covered in fire, and then enter into a cave.\nGo to the top of the cave, then turn left, and follow the path until you need to squeeze through a gap in the wall.\nWhen you emerge on the other side, you'll see the final stretch of the path that dips down and then slopes upward. Head for the top and activate the Peak of Innocence Keeper's Shrine, just before the end of the path.",
    "promot_tokens_num": 400
}