{
    "chunk_id": 921876662172,
    "source_file": "Deathstinger_(Soak).md",
    "content_type": "one and two",
    "h1_title": "Deathstinger (Soak)",
    "h2_title": "Black Myth: Wukong Deathstinger (Soak) Location",
    "h1_content": "The Deathstinger Soak is one of the Rare Soaks for your Gourds in Black Myth: Wukong. The Soak's ability is punishing, actually dealing damage to yourself, making it not a useful option at all.\nThis is because with the Deathstinger Soak equipped, using the gourd will inflict the Poisoned state on the Destined One, slowly dealing damage to you.\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor.",
    "h2_content": "The Deathstinger Soak can be found upon defeating the Scorpion Prince enemy in The Verdure Bridge area of The Webbed Hollow.\nDeathstinger (Soak)\nSoaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "promot": "This is an excerpt from the file 'Deathstinger_(Soak).md', located in the main section titled 'Deathstinger (Soak)'. The section summary is: The Deathstinger Soak is one of the Rare Soaks for your Gourds in Black Myth: Wukong. The Soak's ability is punishing, actually dealing damage to yourself, making it not a useful option at all.\nThis is because with the Deathstinger Soak equipped, using the gourd will inflict the Poisoned state on the Destined One, slowly dealing damage to you.\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Deathstinger (Soak) Location', and the detailed content is as follows:\nThe Deathstinger Soak can be found upon defeating the Scorpion Prince enemy in The Verdure Bridge area of The Webbed Hollow.\nDeathstinger (Soak)\nSoaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "promot_tokens_num": 329
}