{
    "chunk_id": 261615031236,
    "source_file": "The_Spirit_of_Captain_Lotus-Vision.md",
    "content_type": "one and two",
    "h1_title": "The Spirit of Captain Lotus-Vision",
    "h2_title": "Where To Use The Spirit of Captain Lotus-Vision in Black Myth: Wukong",
    "h1_content": "The Spirit of Captain Lotus-Vision is one of the hidden Key Items in The New West. The item can be found after defeating Captain Lotus-Vision within the chapter. However, he is pretty hard to find, unless you know where he is.\nThe Spirit of Captain Lotus-Vision can be found in the Pagoda Realm in The New West. Specifically, right next to the Upper Pagoda Shrine. Once you spawn at the shrine, turn around and look down to find a small gap in the rocks with some enemies kneeling.\nDrop down here to find Captain Lotus-Vision, whom you will need to defeat. He is a particularly tricky boss, but our Captain Lotus-Vision guide goes over everything you need to know to defeat him.\nOne key tip, however, is to start the fight right when the alarm ends in the Pagoda Realm, which halves your health. That way, you can get through most, if not all, of the fight without losing a huge chunk of your survivability.\nThe Spirit of Captain Lotus-Vision",
    "h2_content": "The Spirit of Captain Lotus Vision isn't used. Instead, possession of it will cause the purple-sealed gates within the Pagoda Realm to unlock, allowing you to enter them to find secrets, gear, enemies, and even Ashen Slumber, one of the Transformation Spells.\nOur full walkthrough of the Pagoda Realm in Chapter 3 - White Snow - Ice Cold will help you find everything in this area.",
    "promot": "This is an excerpt from the file 'The_Spirit_of_Captain_Lotus-Vision.md', located in the main section titled 'The Spirit of Captain Lotus-Vision'. The section summary is: The Spirit of Captain Lotus-Vision is one of the hidden Key Items in The New West. The item can be found after defeating Captain Lotus-Vision within the chapter. However, he is pretty hard to find, unless you know where he is.\nThe Spirit of Captain Lotus-Vision can be found in the Pagoda Realm in The New West. Specifically, right next to the Upper Pagoda Shrine. Once you spawn at the shrine, turn around and look down to find a small gap in the rocks with some enemies kneeling.\nDrop down here to find Captain Lotus-Vision, whom you will need to defeat. He is a particularly tricky boss, but our Captain Lotus-Vision guide goes over everything you need to know to defeat him.\nOne key tip, however, is to start the fight right when the alarm ends in the Pagoda Realm, which halves your health. That way, you can get through most, if not all, of the fight without losing a huge chunk of your survivability.\nThe Spirit of Captain Lotus-Vision This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where To Use The Spirit of Captain Lotus-Vision in Black Myth: Wukong', and the detailed content is as follows:\nThe Spirit of Captain Lotus Vision isn't used. Instead, possession of it will cause the purple-sealed gates within the Pagoda Realm to unlock, allowing you to enter them to find secrets, gear, enemies, and even Ashen Slumber, one of the Transformation Spells.\nOur full walkthrough of the Pagoda Realm in Chapter 3 - White Snow - Ice Cold will help you find everything in this area.",
    "promot_tokens_num": 378
}