{
    "chunk_id": 632076593785,
    "source_file": "Old_Rattle-Drum_Questline.md",
    "content_type": "one and two",
    "h1_title": "Old Rattle-Drum Questline",
    "h2_title": "Second Location - Windseal Gate",
    "h1_content": "The Rattle-Drum Questline is a hidden side quest in Chapter 2 of Black Myth Wukong, and involves using a specific Old Rattle-Drum Key Item to communicate with the spirit of a boy, and unlock a hidden boss - the Mad Tiger.",
    "h2_content": "The second location where you can use the Old-Rattle Drum is on the path down from the sealed stone door where you fought the King of Flowing Sands and his Second Rat Prince son, using the **Keenness of Tiger** and **Sterness of Stone** items from the Vanguard bosses (The Stone Vanguard and Tiger Vanguard) to open the door.\nHead down from the door towards a bridge, but take a right to pass through a ruined building overhang where several **Weasel Captains** are lurking.\nOn the other side of the ruined building, there’s a long roof-like walkway and several Withering Corpses milling about, along with a Ginsengling hiding by a wooden chest. If you already used the Old Rattle-Drum back in Windrest Hamlet, you’ll again hear the spirit of a boy call out to you. Use the drum here, and prepare to fend off the zombies as he speaks to you. Interestingly, he mentions a **secret and a well** before clamming up, giving you one final clue to the third location.",
    "promot": "This is an excerpt from the file 'Old_Rattle-Drum_Questline.md', located in the main section titled 'Old Rattle-Drum Questline'. The section summary is: The Rattle-Drum Questline is a hidden side quest in Chapter 2 of Black Myth Wukong, and involves using a specific Old Rattle-Drum Key Item to communicate with the spirit of a boy, and unlock a hidden boss - the Mad Tiger. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Second Location - Windseal Gate', and the detailed content is as follows:\nThe second location where you can use the Old-Rattle Drum is on the path down from the sealed stone door where you fought the King of Flowing Sands and his Second Rat Prince son, using the **Keenness of Tiger** and **Sterness of Stone** items from the Vanguard bosses (The Stone Vanguard and Tiger Vanguard) to open the door.\nHead down from the door towards a bridge, but take a right to pass through a ruined building overhang where several **Weasel Captains** are lurking.\nOn the other side of the ruined building, there’s a long roof-like walkway and several Withering Corpses milling about, along with a Ginsengling hiding by a wooden chest. If you already used the Old Rattle-Drum back in Windrest Hamlet, you’ll again hear the spirit of a boy call out to you. Use the drum here, and prepare to fend off the zombies as he speaks to you. Interestingly, he mentions a **secret and a well** before clamming up, giving you one final clue to the third location.",
    "promot_tokens_num": 350
}