{
    "chunk_id": 198783390958,
    "source_file": "Venom_Daoist.md",
    "content_type": "one and two",
    "h1_title": "Venom Daoist",
    "h2_title": "Venom Daoist Boss Fight and Guide - Second Encounter",
    "h1_content": "The Venom Daoist is an enemy character who you will encounter during Chapter 4 of Black Myth Wukong, and will need to defeat twice both in the Webbed Hollow and the Temple of Yellow Flowers. By doing so, you can unlock a secret area to explore.\n* Rewards: Gold Tree Core, 2274 Experience, 1927 Will",
    "h2_content": "In your last encounter with the Venom Daoist, he sported quite a bit of arms -- some of which you may have lopped off during the course of the fight. This time, he only has two extra arms, but the same rules still apply for this fight -- at least part of it.\nIn his first phase, he'll still use all the same moves you remember, including his most familiar crouching slash that hits twice before he leaps into the air to stab the ground.\nJust like before, this is also the best time to attack his extra arms, as you'll be able to deal a ton of damage and even jumpstart the second phase if you destroy them both.\nRemember the timing of his other attacks, including his fast swipes before charging past you, then jumping back for another two hits.\nYou'll also have to be ready to deflect or dodge if he crouches down with sword raised behind his head, as he'll dash forward and back at rapid speed.\nA new move he can employ will have him toss one of his swords straight at you, then dash to pick it up while slicing with his second blade as he slides by.\nTaking off one of his arms will deal a chunk of damage, but if you can try targeting both of his extra arms, removing them both will instantly deplete his health, and begin the second phase where demands a true fight: two arms vs two arms.\nHe's got a lot more aggressive moves for this phase, and you'll need to be a bit more cautious as he has a lot less openings to retaliate than before.\nTo start, he often jumps up to float in the air a moment, tossing one sword after another at you, with the second sword landing a little farther past you. He'll then leap towards you and slash as he grabs both swords, ending with a mighty spinning slash to catch you trying to score a hit.\nBe wary when he assumes a crouched stance with his swords up. He'll start walking forward while performing a series of twirling slashes, which can be tough to avoid as all six slashes come out very rapidly, so keep your distance or try to deflect them.\nIf his stance moves into holding both swords up high, he'll perform a similar combo string of four quick hits, followed by twirling both blades around him as moves forward to perform a final double slash that hits extremely hard -- again, making staying out of range your best bet.\nHis hardest hitting attack will come when he swaps to a reverse grip with his left sword, before dashing close to unleash three quick hits before flipping high into the air and slamming down for his \"Flood of Blood\" attack. Watch out for when he lands, as he'll also perform a last sweeping attack as he reorients himself.\nMuch of the rest of this fight will revolve around avoiding his lengthy combo attacks and retaliating after his last hit, or quickly evading or deflecting his charging dash attacks to stop him in his tracks.\nOnce the Daoist is defeated for good, he'll impart a mysterious message, telling you to \"find the needle on Purple Cloud Mountain\". As he departs, he mural will form on the nearby wall, which you can now interact with to travel to **Chapter 4's Secret Area: Purple Cloud Mountain**. As with other Secret Areas, we recommend exploring it before you proceed to the final boss of this chapter, as it will be instrumental in helping to defeat the final boss of this area.\nVenom Daoist (Temple of Yellow Flowers)",
    "promot": "This is an excerpt from the file 'Venom_Daoist.md', located in the main section titled 'Venom Daoist'. The section summary is: The Venom Daoist is an enemy character who you will encounter during Chapter 4 of Black Myth Wukong, and will need to defeat twice both in the Webbed Hollow and the Temple of Yellow Flowers. By doing so, you can unlock a secret area to explore.\n* Rewards: Gold Tree Core, 2274 Experience, 1927 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Venom Daoist Boss Fight and Guide - Second Encounter', and the detailed content is as follows:\nIn your last encounter with the Venom Daoist, he sported quite a bit of arms -- some of which you may have lopped off during the course of the fight. This time, he only has two extra arms, but the same rules still apply for this fight -- at least part of it.\nIn his first phase, he'll still use all the same moves you remember, including his most familiar crouching slash that hits twice before he leaps into the air to stab the ground.\nJust like before, this is also the best time to attack his extra arms, as you'll be able to deal a ton of damage and even jumpstart the second phase if you destroy them both.\nRemember the timing of his other attacks, including his fast swipes before charging past you, then jumping back for another two hits.\nYou'll also have to be ready to deflect or dodge if he crouches down with sword raised behind his head, as he'll dash forward and back at rapid speed.\nA new move he can employ will have him toss one of his swords straight at you, then dash to pick it up while slicing with his second blade as he slides by.\nTaking off one of his arms will deal a chunk of damage, but if you can try targeting both of his extra arms, removing them both will instantly deplete his health, and begin the second phase where demands a true fight: two arms vs two arms.\nHe's got a lot more aggressive moves for this phase, and you'll need to be a bit more cautious as he has a lot less openings to retaliate than before.\nTo start, he often jumps up to float in the air a moment, tossing one sword after another at you, with the second sword landing a little farther past you. He'll then leap towards you and slash as he grabs both swords, ending with a mighty spinning slash to catch you trying to score a hit.\nBe wary when he assumes a crouched stance with his swords up. He'll start walking forward while performing a series of twirling slashes, which can be tough to avoid as all six slashes come out very rapidly, so keep your distance or try to deflect them.\nIf his stance moves into holding both swords up high, he'll perform a similar combo string of four quick hits, followed by twirling both blades around him as moves forward to perform a final double slash that hits extremely hard -- again, making staying out of range your best bet.\nHis hardest hitting attack will come when he swaps to a reverse grip with his left sword, before dashing close to unleash three quick hits before flipping high into the air and slamming down for his \"Flood of Blood\" attack. Watch out for when he lands, as he'll also perform a last sweeping attack as he reorients himself.\nMuch of the rest of this fight will revolve around avoiding his lengthy combo attacks and retaliating after his last hit, or quickly evading or deflecting his charging dash attacks to stop him in his tracks.\nOnce the Daoist is defeated for good, he'll impart a mysterious message, telling you to \"find the needle on Purple Cloud Mountain\". As he departs, he mural will form on the nearby wall, which you can now interact with to travel to **Chapter 4's Secret Area: Purple Cloud Mountain**. As with other Secret Areas, we recommend exploring it before you proceed to the final boss of this chapter, as it will be instrumental in helping to defeat the final boss of this area.\nVenom Daoist (Temple of Yellow Flowers)",
    "promot_tokens_num": 860
}