{
    "chunk_id": 773692052252,
    "source_file": "Pungent_Flesh_Chunk.md",
    "content_type": "one and two",
    "h1_title": "Pungent Flesh Chunk",
    "h2_title": "Where To Use The Pungent Flesh Chunk in Black Myth: Wukong",
    "h1_content": "The Pungent Flesh Chunk is one of the Key Items you can find in Yellow Wind Ridge during Chapter 2. It is unmissable as it is dropped from the mandatory boss: King of Flowing Sand and Second Rat Prince in Sandgate Village - Valley of Despair.\nThe item is of a Legendary rarity as it is important to obtaining another Key Item, specifically the Loong Scales, which will allow you to access a number of secret areas and secret bosses.\nAs with most Key Items in the game, however, you may be wondering where to use the Pungent Flesh Chunk. Thankfully you won't have to stray too far from where you obtained it.\nPungent Flesh Chunk",
    "h2_content": "The Pungent Flesh Chunk **can be used in the caves beneath the King of Flowing Sand and Second Rat Prince arena**. From the Shrine in the arena, head through the caves and take a left when it opens up. On your left you will find a cliff edge where you can use the Pungent Flesh Chunk.\nUsing it will cause the First Prince of Flowing Sands boss to spawn. In order to obtain the Loong Scales, you will need to have the boss destroy the wall in the arena with all the small statues. Destroying it will open up a small gap you can pass through to get the Loong Scales.\nThe best way to do this is to stand against the wall at a short-to-medium distance from the boss and have it do its slam with its hand. It will do this by turning to its right with its fist along the ground. Alternatively, you can bait the boss' charge and take a hit to ensure the boss hits the wall.\nIf you kill the boss without destroying the wall, extremely strong attacks from yourself can also destroy it. However, you will need to use one of the Transformation Spells, specifically Red Tides, as they have the strength to make an impact on the wall.",
    "promot": "This is an excerpt from the file 'Pungent_Flesh_Chunk.md', located in the main section titled 'Pungent Flesh Chunk'. The section summary is: The Pungent Flesh Chunk is one of the Key Items you can find in Yellow Wind Ridge during Chapter 2. It is unmissable as it is dropped from the mandatory boss: King of Flowing Sand and Second Rat Prince in Sandgate Village - Valley of Despair.\nThe item is of a Legendary rarity as it is important to obtaining another Key Item, specifically the Loong Scales, which will allow you to access a number of secret areas and secret bosses.\nAs with most Key Items in the game, however, you may be wondering where to use the Pungent Flesh Chunk. Thankfully you won't have to stray too far from where you obtained it.\nPungent Flesh Chunk This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where To Use The Pungent Flesh Chunk in Black Myth: Wukong', and the detailed content is as follows:\nThe Pungent Flesh Chunk **can be used in the caves beneath the King of Flowing Sand and Second Rat Prince arena**. From the Shrine in the arena, head through the caves and take a left when it opens up. On your left you will find a cliff edge where you can use the Pungent Flesh Chunk.\nUsing it will cause the First Prince of Flowing Sands boss to spawn. In order to obtain the Loong Scales, you will need to have the boss destroy the wall in the arena with all the small statues. Destroying it will open up a small gap you can pass through to get the Loong Scales.\nThe best way to do this is to stand against the wall at a short-to-medium distance from the boss and have it do its slam with its hand. It will do this by turning to its right with its fist along the ground. Alternatively, you can bait the boss' charge and take a hit to ensure the boss hits the wall.\nIf you kill the boss without destroying the wall, extremely strong attacks from yourself can also destroy it. However, you will need to use one of the Transformation Spells, specifically Red Tides, as they have the strength to make an impact on the wall.",
    "promot_tokens_num": 471
}