{
    "chunk_id": 731337662565,
    "source_file": "Yellow-Robed_Squire.md",
    "content_type": "one and two",
    "h1_title": "Yellow-Robed Squire",
    "h2_title": "Yellow-Robed Squire Boss Fight and Guide",
    "h1_content": "The Yellow-Robed Squire is a optional Character questline culminating in a boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Located at the far end of the Fright Cliff, you'll first have to fetch several items for this Drunken Boar before you can fight him to unlock a Secret Area.\n* **Rewards:** Snout Mask, 1102 Experience, 1037 Will",
    "h2_content": "While not technically a Yaoguai Chief, the Drunk Boar isn’t a pushover like the Man-in-Stone. He’s fairly formidable in his own right, and you’ll need to learn his attacks to win the duel. The Yellow-Robed Squire is a big fan of hurling dust clouds in your direction to mask his movements, and you’ll need to be even more reactive than usual to make sure you don’t get blindsided.\nHe’ll often start the fight by hurling dust in front of him, and then performing a fast charge attack to gore you with his tusks, but you can shut him down with a well timed Rock Solid deflection.\nOne of his main combos will begin with another “pocket sand” attack, followed by two quick swipes from his extended claws, and then a delayed jump attack to finish the combo, which can send up tremors from where he impacts.\nOther times, his third attack will have him extend his clawed hand back and charge up, before performing a dashing impaling thrust attack that covers a lot of ground quickly, so be ready to react when he lunges at you.\nAnother common attack combo he will perform will be to drag his claws slowly through the ground and pull them upward to attack and spread sand — which you can easily spot and deflect to interrupt him. If you don’t, he’ll charge forward through the sand to stab with his extended claws.\nIf you notice him throw out sand and then raise his hand high while it begins to glow, be ready for him to summon his secret weapon — a large bladed ring with barbs that he can employ for the rest of his combo.\nCertain times, he’ll start with a large downward slash, and then follow up after a delay with a second jumping slash attack, and then one final pivoting slash attack before it disappears into sand. As his health gets slower, he’ll add summoning the ring blade to his other combo attacks, but they can still be parried with Rock Solid.\nIf you try to pull back too far away from him, he also has a few more sandy surprises. Instead of crafting a ring blade, he can also summon a spear of sand behind his back that glows as it appears, and then he’ll launch it at you extremely fast.\nA good tactic to employ for this fight is to use the Thrust Stance’s retreating move after a combo when his sand comes out, and then follow up with a heavy thrust attack at range. It will move you out of the blinding sand, and also away from most of his claw swipe attacks. Without the sand masking his moves, he’s not overly tough, and you’ll be able to best him in this duel.\nUpon defeat, he’ll relent and offer to let you join him in exploring the Realm of Gold together, before vanishing off behind the giant gate. You’ll also earn the Snout Mask head gear, which has an interesting effect on raising and lowering attack power based on gourd use.\nYellow-Robed Squire\nOnce you follow him through the large gate with the small crawlspace, you’ll find yourself overlooking an ancient and forgotten kingdom, and suddenly be transported into the past and into Chapter 2’s Secret Area: The Kingdom of Sahali.",
    "promot": "This is an excerpt from the file 'Yellow-Robed_Squire.md', located in the main section titled 'Yellow-Robed Squire'. The section summary is: The Yellow-Robed Squire is a optional Character questline culminating in a boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Located at the far end of the Fright Cliff, you'll first have to fetch several items for this Drunken Boar before you can fight him to unlock a Secret Area.\n* **Rewards:** Snout Mask, 1102 Experience, 1037 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Yellow-Robed Squire Boss Fight and Guide', and the detailed content is as follows:\nWhile not technically a Yaoguai Chief, the Drunk Boar isn’t a pushover like the Man-in-Stone. He’s fairly formidable in his own right, and you’ll need to learn his attacks to win the duel. The Yellow-Robed Squire is a big fan of hurling dust clouds in your direction to mask his movements, and you’ll need to be even more reactive than usual to make sure you don’t get blindsided.\nHe’ll often start the fight by hurling dust in front of him, and then performing a fast charge attack to gore you with his tusks, but you can shut him down with a well timed Rock Solid deflection.\nOne of his main combos will begin with another “pocket sand” attack, followed by two quick swipes from his extended claws, and then a delayed jump attack to finish the combo, which can send up tremors from where he impacts.\nOther times, his third attack will have him extend his clawed hand back and charge up, before performing a dashing impaling thrust attack that covers a lot of ground quickly, so be ready to react when he lunges at you.\nAnother common attack combo he will perform will be to drag his claws slowly through the ground and pull them upward to attack and spread sand — which you can easily spot and deflect to interrupt him. If you don’t, he’ll charge forward through the sand to stab with his extended claws.\nIf you notice him throw out sand and then raise his hand high while it begins to glow, be ready for him to summon his secret weapon — a large bladed ring with barbs that he can employ for the rest of his combo.\nCertain times, he’ll start with a large downward slash, and then follow up after a delay with a second jumping slash attack, and then one final pivoting slash attack before it disappears into sand. As his health gets slower, he’ll add summoning the ring blade to his other combo attacks, but they can still be parried with Rock Solid.\nIf you try to pull back too far away from him, he also has a few more sandy surprises. Instead of crafting a ring blade, he can also summon a spear of sand behind his back that glows as it appears, and then he’ll launch it at you extremely fast.\nA good tactic to employ for this fight is to use the Thrust Stance’s retreating move after a combo when his sand comes out, and then follow up with a heavy thrust attack at range. It will move you out of the blinding sand, and also away from most of his claw swipe attacks. Without the sand masking his moves, he’s not overly tough, and you’ll be able to best him in this duel.\nUpon defeat, he’ll relent and offer to let you join him in exploring the Realm of Gold together, before vanishing off behind the giant gate. You’ll also earn the Snout Mask head gear, which has an interesting effect on raising and lowering attack power based on gourd use.\nYellow-Robed Squire\nOnce you follow him through the large gate with the small crawlspace, you’ll find yourself overlooking an ancient and forgotten kingdom, and suddenly be transported into the past and into Chapter 2’s Secret Area: The Kingdom of Sahali.",
    "promot_tokens_num": 830
}