{
    "chunk_id": 734192823180,
    "source_file": "Webbed_Hollow-Middle_Hollow_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Webbed Hollow - Middle Hollow Walkthrough",
    "h2_title": "Middle Hollow",
    "h1_content": "The Webbed Hollow is the second main area of Black Myth: Wukong's Chapter 4, continuing with the middle portion of the large underground cave system. Below you'll find a guide for the second middle area of The Webbed Hollow, including where to find an optional encounter against the Elder Amourworm, and how to get past the Centipede Guai and Right Hand of Buddha to reach the Lower Hollow.\n* **Jump to a Section**\n* **Verdure Bridge**\n* Yaoguai Chief - Elder Amourworm\n* **Middle Hollow**\n* **Bonevault**\n* Yaoguai Chief - Centipede Guai\n* **Cliff of Oblivion**\n* Yaoguai Chief - Buddha's Right Hand\nDue to the length, complexity, and number of bosses scattered throughout the Webbed Hollow section of Chapter 4, this particular region walkthrough will be split up into three parts with each section largely covering a major floor level of the hollow.",
    "h2_content": "Follow the lower path past a Dragonfly Guai archer, and you'll come to find the path below the bridge is covered in hanging cocoons.\nMind the Puppet Tick in the middle as you stab the Clawed Cocoons from afar, and create a path through.\nWhen you reach a fork in the road, you'll find two paths leading to the group of houses. The one on the right leads to the front, but there's also a Dragonfly Guai perched on a high ledge if you didn't kill him earlier that could be annoying. Taking the left path leads up to a back entrance, which may be preferable.\nUp the left path, you can find a small alcove with a green Wisp, and a Lantern Holder guarding the entrance to the \"village\".\nWhen you reach the village proper, you'll find a large tree with a collectible vine, but guarding it is another Scorpion Prince.\nThis particular foe is imbued with extra spirit power, so he'll be even tougher than the first one you fought in the Upper Hollow. There are also few larger cocoons in this village that hide Puppet Spiders, so try to lure him away from any you may spot to avoid having to deal with extra foes.\nDodge his multiple tail strikes and deflect his charging claw attacks to wait for opportunities to counter attack. Defeat him, and you'll gain the Scorpion Prince Spirit (as well as a **Deathstinger Soak**... in case you want to poison yourself on purpose), and can then harvest the **Luojia Fragrant Vine** on the large tree.\nMiddle Hollow Luojia Fragrant Vine\nFrom here, you'll again have two diverging paths - one leading up to the left of the large tree in the village area, and a lower path down to the right. Annoyingly, both paths will lead to the same spot where the next boss is, and both routes have a Shrine, plus items worth getting.\nWe'll take the higher path first, due to a bit of overlap that allows us to take out a pesky archer overlooking the lower path, so head up the stairs near the tree where you fought the Scorpion Prince.\nOn the next level, you'll find a Lantern Holder patrolling around a few more shacks and large cocoons with some enemies hiding inside. Be sure to check behind the house on the left to find a green Wisp around the corner.\nThere's also an open shack on the right, where you'll find a small gold **Treasure Chest** box to open that contains the Mirage Pill Recipe, and a few pills for free!\nOnce you cross a small bridge, you'll find a much larger home with giant cocoons blocking the doorway. Break them apart, and you'll find a large stove-top in the middle with a **Worryfree Brew** placed on it that you can gain as a new Drink for your Gourd.\nThere's also another green Wisp around the back of the house behind more cocoons, but one of the large cocoons behind it hides a Puppet Spider.\nOutside the house, look ahead to spot a purple glowing altar to the right of the main path. As you approach, the mysterious lady will appear again, unable to grab the talisman placed on the altar.\nShe'll warn you to leave things alone, and bid you to find your friend instead. Since we're not much for following orders, go ahead and remove the Talisman from the purple altar, and keep your eyes out for more in this chapter - they'll help us unlock a big secret!\nMoving ahead on this path, you'll cross a large bridge where a Dragonfly Guai archer is posted overlooking the lower path we'll explore next.\nBeyond the bridge is another next of Amourworms hiding in cocoons, and just past them the passageway opens out into a grassy area.\nBe wary of one of the mushrooms you can harvest here, as its actually a powerful Fungiman in disguise.\nAs you drop down, be sure to look to the right for a **Meditation Spot** , and over to the left you'll find the Middle Hollow Shrine guarded by an archer and Puppet Spider.\nThe Tree, Middle of the Hollow Meditation Spot\nThere's a ledge nearby that will lead you straight to the next boss (as well as a few Skeletal Snakes we haven't seen since Chapter 1), but first it's a good idea to check the alternate path.\nBefore you go, check the ledge to the left of the Shrine to find a **Treasure Chest** with some materials in it.",
    "promot": "This is an excerpt from the file 'Webbed_Hollow-Middle_Hollow_Walkthrough.md', located in the main section titled 'Webbed Hollow - Middle Hollow Walkthrough'. The section summary is: The Webbed Hollow is the second main area of Black Myth: Wukong's Chapter 4, continuing with the middle portion of the large underground cave system. Below you'll find a guide for the second middle area of The Webbed Hollow, including where to find an optional encounter against the Elder Amourworm, and how to get past the Centipede Guai and Right Hand of Buddha to reach the Lower Hollow.\n* **Jump to a Section**\n* **Verdure Bridge**\n* Yaoguai Chief - Elder Amourworm\n* **Middle Hollow**\n* **Bonevault**\n* Yaoguai Chief - Centipede Guai\n* **Cliff of Oblivion**\n* Yaoguai Chief - Buddha's Right Hand\nDue to the length, complexity, and number of bosses scattered throughout the Webbed Hollow section of Chapter 4, this particular region walkthrough will be split up into three parts with each section largely covering a major floor level of the hollow. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Middle Hollow', and the detailed content is as follows:\nFollow the lower path past a Dragonfly Guai archer, and you'll come to find the path below the bridge is covered in hanging cocoons.\nMind the Puppet Tick in the middle as you stab the Clawed Cocoons from afar, and create a path through.\nWhen you reach a fork in the road, you'll find two paths leading to the group of houses. The one on the right leads to the front, but there's also a Dragonfly Guai perched on a high ledge if you didn't kill him earlier that could be annoying. Taking the left path leads up to a back entrance, which may be preferable.\nUp the left path, you can find a small alcove with a green Wisp, and a Lantern Holder guarding the entrance to the \"village\".\nWhen you reach the village proper, you'll find a large tree with a collectible vine, but guarding it is another Scorpion Prince.\nThis particular foe is imbued with extra spirit power, so he'll be even tougher than the first one you fought in the Upper Hollow. There are also few larger cocoons in this village that hide Puppet Spiders, so try to lure him away from any you may spot to avoid having to deal with extra foes.\nDodge his multiple tail strikes and deflect his charging claw attacks to wait for opportunities to counter attack. Defeat him, and you'll gain the Scorpion Prince Spirit (as well as a **Deathstinger Soak**... in case you want to poison yourself on purpose), and can then harvest the **Luojia Fragrant Vine** on the large tree.\nMiddle Hollow Luojia Fragrant Vine\nFrom here, you'll again have two diverging paths - one leading up to the left of the large tree in the village area, and a lower path down to the right. Annoyingly, both paths will lead to the same spot where the next boss is, and both routes have a Shrine, plus items worth getting.\nWe'll take the higher path first, due to a bit of overlap that allows us to take out a pesky archer overlooking the lower path, so head up the stairs near the tree where you fought the Scorpion Prince.\nOn the next level, you'll find a Lantern Holder patrolling around a few more shacks and large cocoons with some enemies hiding inside. Be sure to check behind the house on the left to find a green Wisp around the corner.\nThere's also an open shack on the right, where you'll find a small gold **Treasure Chest** box to open that contains the Mirage Pill Recipe, and a few pills for free!\nOnce you cross a small bridge, you'll find a much larger home with giant cocoons blocking the doorway. Break them apart, and you'll find a large stove-top in the middle with a **Worryfree Brew** placed on it that you can gain as a new Drink for your Gourd.\nThere's also another green Wisp around the back of the house behind more cocoons, but one of the large cocoons behind it hides a Puppet Spider.\nOutside the house, look ahead to spot a purple glowing altar to the right of the main path. As you approach, the mysterious lady will appear again, unable to grab the talisman placed on the altar.\nShe'll warn you to leave things alone, and bid you to find your friend instead. Since we're not much for following orders, go ahead and remove the Talisman from the purple altar, and keep your eyes out for more in this chapter - they'll help us unlock a big secret!\nMoving ahead on this path, you'll cross a large bridge where a Dragonfly Guai archer is posted overlooking the lower path we'll explore next.\nBeyond the bridge is another next of Amourworms hiding in cocoons, and just past them the passageway opens out into a grassy area.\nBe wary of one of the mushrooms you can harvest here, as its actually a powerful Fungiman in disguise.\nAs you drop down, be sure to look to the right for a **Meditation Spot** , and over to the left you'll find the Middle Hollow Shrine guarded by an archer and Puppet Spider.\nThe Tree, Middle of the Hollow Meditation Spot\nThere's a ledge nearby that will lead you straight to the next boss (as well as a few Skeletal Snakes we haven't seen since Chapter 1), but first it's a good idea to check the alternate path.\nBefore you go, check the ledge to the left of the Shrine to find a **Treasure Chest** with some materials in it.",
    "promot_tokens_num": 1213
}