{
    "chunk_id": 285936711023,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Furnace Valley Walkthrough",
    "h2_title": "Rakshasa Palace",
    "h1_content": "Furnace Valley is the second major region in Chapter 5 of Black: Myth Wukong. Below, you'll find a detailed walkthrough of all the possible bosses there are to defeat in this section, along with conclusions to side quests, and key items to collect.\n* **Jump to a Section:**\n* **Valley Entrance**\n* Yaoguai Chief - Flint Chief\n* Yaoguai Chief - Cloudy Mist, Misty Cloud\n* **Rakshasa Palace**\n* **The Emerald Hall**\n* Yaoguai King - Keeper of the Flaming Mountains and Yin-Yang Fish\n* Yaoguai Chief - Crimson-Silver Cart\nAfter jumping down from the cliff at the end of Woods of Ember, you'll land in the waters at the start of Furnace Valley. Immediately turn to the right, to pick up the first green Wisp in the region.\nGo straight up toward the valley, but be careful as you explore the area. Some of the rocks in this area glow with lava, and that's because they're actually Searing-Fire enemies. These resemble the Palestones from Chapter 2 and are particularly annoying. They will leap in the air and drop on their back and front to cause explosions. For the sake of unlocking portraits, you can defeat just one and ignore the others.\nContinue straight up, following the gold trail to the Valley Entrance Keeper's Shrine. It's protected by an Earth Rakshasa, so either use heavy attacks to break down its shield, or get behind it to tackle it. When you've dealt with it, activate the Keeper's Shrine.\n### Return to the Pale-Axe Stalwart\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.",
    "h2_content": "Just beyond the shrine, there's a small area for you to explore. As you step toward the Keeper's Shrine, you'll likely see the golden box on the log just behind it. Go here to pick up a Celestial Taiyi Pill.\nFlaming Mountains Celestial Taiyi Pill\nThen look opposite the golden box to see a treasure chest inside the small building. Open this to pick up Blood of the Iron Bull and some gold pieces.\nHead back the other way and toward the steps. Before you go up them, you'll want to explore the lava on either side.\nGo left first and tackle the Bull Soldier, then look underneath the first curved portion of the bridge to absorb a green Wisp.\nContinue on the path to the left (running alongside the wall) to pick up the Fire Date from the tree on the right and take out the Bull Stalwart.\nHug the path to the left and continue along the lava, until you reach another tree to harvest a Fire Date and a statue on the right. Take the slope up and pick up the green Wisp from underneath the bridge directly opposite.\nThen, go left and deal with the Stalwart and open the treasure chest it guards to collect Fine Gold Thread and Blood of the Iron Bull.\nHead in the opposite direction and go underneath the bridge to loop back around to the right, and the first set of stairs now. Deal with the guard there, before proceeding up them.\nKeep following the staircases, turning right after the next set to cross the bridge toward the bull guard with the two staffs and the two Flame Rhino Masters.\nCross the bridge and up the small set of stairs, towards the giants. On the right, you'll encounter a Bull Governor. Though it's best to deal with the creature now, don't go to the right just yet.\nInstead, take the path to the left. You'll see a set of stares with the Flame Rhino Master at the top, and a small temple with a flame glowing inside. Head for the stairs first and take out the Flame Rhino Master, then hop over to the temple.\nInside here, you'll find the old man who gave you the gourd at the start of the game and an Awaken Wine Worm to the left.\nRakshasa Palace Awaken Wine Worm\nSpeak to the old man, and he'll tell you to find yourself a decent gourd (if you haven't already upgraded yours fully) and you can share a drink with him.",
    "promot": "This is an excerpt from the file 'Furnace_Valley_Walkthrough.md', located in the main section titled 'Furnace Valley Walkthrough'. The section summary is: Furnace Valley is the second major region in Chapter 5 of Black: Myth Wukong. Below, you'll find a detailed walkthrough of all the possible bosses there are to defeat in this section, along with conclusions to side quests, and key items to collect.\n* **Jump to a Section:**\n* **Valley Entrance**\n* Yaoguai Chief - Flint Chief\n* Yaoguai Chief - Cloudy Mist, Misty Cloud\n* **Rakshasa Palace**\n* **The Emerald Hall**\n* Yaoguai King - Keeper of the Flaming Mountains and Yin-Yang Fish\n* Yaoguai Chief - Crimson-Silver Cart\nAfter jumping down from the cliff at the end of Woods of Ember, you'll land in the waters at the start of Furnace Valley. Immediately turn to the right, to pick up the first green Wisp in the region.\nGo straight up toward the valley, but be careful as you explore the area. Some of the rocks in this area glow with lava, and that's because they're actually Searing-Fire enemies. These resemble the Palestones from Chapter 2 and are particularly annoying. They will leap in the air and drop on their back and front to cause explosions. For the sake of unlocking portraits, you can defeat just one and ignore the others.\nContinue straight up, following the gold trail to the Valley Entrance Keeper's Shrine. It's protected by an Earth Rakshasa, so either use heavy attacks to break down its shield, or get behind it to tackle it. When you've dealt with it, activate the Keeper's Shrine.\n### Return to the Pale-Axe Stalwart\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Rakshasa Palace', and the detailed content is as follows:\nJust beyond the shrine, there's a small area for you to explore. As you step toward the Keeper's Shrine, you'll likely see the golden box on the log just behind it. Go here to pick up a Celestial Taiyi Pill.\nFlaming Mountains Celestial Taiyi Pill\nThen look opposite the golden box to see a treasure chest inside the small building. Open this to pick up Blood of the Iron Bull and some gold pieces.\nHead back the other way and toward the steps. Before you go up them, you'll want to explore the lava on either side.\nGo left first and tackle the Bull Soldier, then look underneath the first curved portion of the bridge to absorb a green Wisp.\nContinue on the path to the left (running alongside the wall) to pick up the Fire Date from the tree on the right and take out the Bull Stalwart.\nHug the path to the left and continue along the lava, until you reach another tree to harvest a Fire Date and a statue on the right. Take the slope up and pick up the green Wisp from underneath the bridge directly opposite.\nThen, go left and deal with the Stalwart and open the treasure chest it guards to collect Fine Gold Thread and Blood of the Iron Bull.\nHead in the opposite direction and go underneath the bridge to loop back around to the right, and the first set of stairs now. Deal with the guard there, before proceeding up them.\nKeep following the staircases, turning right after the next set to cross the bridge toward the bull guard with the two staffs and the two Flame Rhino Masters.\nCross the bridge and up the small set of stairs, towards the giants. On the right, you'll encounter a Bull Governor. Though it's best to deal with the creature now, don't go to the right just yet.\nInstead, take the path to the left. You'll see a set of stares with the Flame Rhino Master at the top, and a small temple with a flame glowing inside. Head for the stairs first and take out the Flame Rhino Master, then hop over to the temple.\nInside here, you'll find the old man who gave you the gourd at the start of the game and an Awaken Wine Worm to the left.\nRakshasa Palace Awaken Wine Worm\nSpeak to the old man, and he'll tell you to find yourself a decent gourd (if you haven't already upgraded yours fully) and you can share a drink with him.",
    "promot_tokens_num": 977
}