{
    "chunk_id": 984887866249,
    "source_file": "Temple_of_Yellow_Flowers_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Temple of Yellow Flowers Walkthrough",
    "h2_title": "Temple Entrance",
    "h1_content": "The Temple of Yellow Flowers is the final main area of Black Myth: Wukong's Chapter 4, located high above the Webbed Hollow on. Below you'll find a guide for the final area of The Webbed Hollow, including how to track down the Violet Spider and defeat the Hundred-Eyed Daoist Master, as well as getting a rematch with the Venom Daoist to unlock a Secret Area, and finding the last Purple Talisman Altar.\n* **Jump to a Section**\n* **Mountain Trail**\n* **Forest of Ferocity**\n* Yaoguai Chief - Commander Beetle\n* **Temple Entrance**\n* Yaoguai Chief - Fungiwoman\n* Boss Fight - Venom Daoist\n* **Court of Illumination**\n* Boss Fight - Supreme Inspector\n* Yaoguai King - Hundred-Eyed Daoist Master\nAfter defeating the Violet Spider, you'll have to escape her spider swarm as she retreats, but luckily you'll be plucked to safety by the one Spider Sister that seems to be on your side.\nWhen you untangle yourself from the webbing, you'll find yourself high above the Webbed Hollow, on a mountain path leading to a large temple filled with Daoist martial artists.",
    "h2_content": "Once you reach the Temple Entrance Shrine, you'll finally be able to start exploring the Temple of Yellow Flowers, which is still a fairly spread out complex tucked into pathways further up the mountain.\nHead up the stairs beyond the main gate, but check a small alcove to the left first to find a green Wisp guarded by some Worm Practitioners. Be ready to find many of these enemies around the temple, as more than a few of them hide in the tall grass by lying down until you approach.\nAt the top of the stairs, pass through the gate to enter the first courtyard. This large open area sports a large tree with a **Treasure Chest** straight ahead, while a blood trail leads along the main path to the left.\nFirst, however, we will take the right path to a large gateway along the yellow walls after grabbing the chest.\nThis inner hall is teeming with tons of Worm Practitioners all over the lower walkway, with a Snake Sheriff patrolling up some stairs ahead. On the plus side, many of the Worm Practitioners are lying out in the sun and won't react until you get close, so you can either ignore them, or sneak up to hit them with charge attacks before finishing them off.\nWhether you want to kill every last one or not, be sure to at least clear out the far left side of the lower pathway first, and behind a tree you can find the final **Meditation Spot** for this temple area. If you remove all the enemies on the opposite side, you can grab a green Wisp and absorb it.\nThe Pines, Temple of Yellow Flowers Meditation Spot\nExpect the lion-headed enemy to be tougher than the rest as you climb the first set of stairs, but defeating it will earn you the Snake Sheriff Spirit.\nAt the top of the other stairs, you'll find a small enclosed area where the Ancient Master sits alone, ing an instrument called the guqin. While you can talk to him about the Violet Spider, the more important item here is located just behind him in a glowing pot - an **Awaken Wine Worm** to add to your Gourds!\nTemple of Yellow Flowers Awaken Wine Worm\nReturn back to the previous courtyard, and this time follow the blood trail to head up the left path. There will be a few Daoists trying to block your path, and once you head up the second set of stairs, be ready for an ambush on the right by a Snake Herbalist.\nOnce you head up the stone path where another Snake Herbalist patrols, you can find a tree next to a large stone boulder where the path diverges. To the left is the Court of Illumination Shrine -- your almost at the end of this area, but there's a very important thing to find by taking the other path first.\nGo right at the fork in the road. Once you reach a large gate, take out the Worm Practitioner and look for a **Treasure Chest** it was guarding on the left before continuing to the next area.\nFollow the winding mountain trail up several stairs and avoiding other Worm Practitioners until you reach the very top. The road will widen out as it follows a cliffside path toward a small shack with Snake Head Mushrooms all around it. One of these mushrooms... is not what it seems.",
    "promot": "This is an excerpt from the file 'Temple_of_Yellow_Flowers_Walkthrough.md', located in the main section titled 'Temple of Yellow Flowers Walkthrough'. The section summary is: The Temple of Yellow Flowers is the final main area of Black Myth: Wukong's Chapter 4, located high above the Webbed Hollow on. Below you'll find a guide for the final area of The Webbed Hollow, including how to track down the Violet Spider and defeat the Hundred-Eyed Daoist Master, as well as getting a rematch with the Venom Daoist to unlock a Secret Area, and finding the last Purple Talisman Altar.\n* **Jump to a Section**\n* **Mountain Trail**\n* **Forest of Ferocity**\n* Yaoguai Chief - Commander Beetle\n* **Temple Entrance**\n* Yaoguai Chief - Fungiwoman\n* Boss Fight - Venom Daoist\n* **Court of Illumination**\n* Boss Fight - Supreme Inspector\n* Yaoguai King - Hundred-Eyed Daoist Master\nAfter defeating the Violet Spider, you'll have to escape her spider swarm as she retreats, but luckily you'll be plucked to safety by the one Spider Sister that seems to be on your side.\nWhen you untangle yourself from the webbing, you'll find yourself high above the Webbed Hollow, on a mountain path leading to a large temple filled with Daoist martial artists. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Temple Entrance', and the detailed content is as follows:\nOnce you reach the Temple Entrance Shrine, you'll finally be able to start exploring the Temple of Yellow Flowers, which is still a fairly spread out complex tucked into pathways further up the mountain.\nHead up the stairs beyond the main gate, but check a small alcove to the left first to find a green Wisp guarded by some Worm Practitioners. Be ready to find many of these enemies around the temple, as more than a few of them hide in the tall grass by lying down until you approach.\nAt the top of the stairs, pass through the gate to enter the first courtyard. This large open area sports a large tree with a **Treasure Chest** straight ahead, while a blood trail leads along the main path to the left.\nFirst, however, we will take the right path to a large gateway along the yellow walls after grabbing the chest.\nThis inner hall is teeming with tons of Worm Practitioners all over the lower walkway, with a Snake Sheriff patrolling up some stairs ahead. On the plus side, many of the Worm Practitioners are lying out in the sun and won't react until you get close, so you can either ignore them, or sneak up to hit them with charge attacks before finishing them off.\nWhether you want to kill every last one or not, be sure to at least clear out the far left side of the lower pathway first, and behind a tree you can find the final **Meditation Spot** for this temple area. If you remove all the enemies on the opposite side, you can grab a green Wisp and absorb it.\nThe Pines, Temple of Yellow Flowers Meditation Spot\nExpect the lion-headed enemy to be tougher than the rest as you climb the first set of stairs, but defeating it will earn you the Snake Sheriff Spirit.\nAt the top of the other stairs, you'll find a small enclosed area where the Ancient Master sits alone, ing an instrument called the guqin. While you can talk to him about the Violet Spider, the more important item here is located just behind him in a glowing pot - an **Awaken Wine Worm** to add to your Gourds!\nTemple of Yellow Flowers Awaken Wine Worm\nReturn back to the previous courtyard, and this time follow the blood trail to head up the left path. There will be a few Daoists trying to block your path, and once you head up the second set of stairs, be ready for an ambush on the right by a Snake Herbalist.\nOnce you head up the stone path where another Snake Herbalist patrols, you can find a tree next to a large stone boulder where the path diverges. To the left is the Court of Illumination Shrine -- your almost at the end of this area, but there's a very important thing to find by taking the other path first.\nGo right at the fork in the road. Once you reach a large gate, take out the Worm Practitioner and look for a **Treasure Chest** it was guarding on the left before continuing to the next area.\nFollow the winding mountain trail up several stairs and avoiding other Worm Practitioners until you reach the very top. The road will widen out as it follows a cliffside path toward a small shack with Snake Head Mushrooms all around it. One of these mushrooms... is not what it seems.",
    "promot_tokens_num": 998
}