{
    "chunk_id": 231331023777,
    "source_file": "Fungiwoman.md",
    "content_type": "one and two",
    "h1_title": "Fungiwoman",
    "h2_title": "Where to Find the Fungiwoman",
    "h1_content": "The Fungiwoman is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong, though she is not officially tracked as a yaoguai chief in your journal. Located in the Temple of Yellow Flowers on a high hill, she hides among Monkey-Head Mushrooms.\n* Rewards: Fungiwoman Spirit, Monkey-Head Fungus Seed, Knot of Voidness, 1562 Experience, 1473 Will",
    "h2_content": "The Fungiwoman is a hidden optional boss that hides like most other fungi guai. After reaching the entrance of the Temple of Yellow Flowers, proceed on the main path until you find a fork in the road, with the left path leading to the Court of Illumination.\nTake the right path instead, and climb a mountain path up to a high ridge, leading to a shack with several mushrooms around it. One of the Monkey-Head Fungus on the right will actually be the Fungiwoman in hiding.",
    "promot": "This is an excerpt from the file 'Fungiwoman.md', located in the main section titled 'Fungiwoman'. The section summary is: The Fungiwoman is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong, though she is not officially tracked as a yaoguai chief in your journal. Located in the Temple of Yellow Flowers on a high hill, she hides among Monkey-Head Mushrooms.\n* Rewards: Fungiwoman Spirit, Monkey-Head Fungus Seed, Knot of Voidness, 1562 Experience, 1473 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find the Fungiwoman', and the detailed content is as follows:\nThe Fungiwoman is a hidden optional boss that hides like most other fungi guai. After reaching the entrance of the Temple of Yellow Flowers, proceed on the main path until you find a fork in the road, with the left path leading to the Court of Illumination.\nTake the right path instead, and climb a mountain path up to a high ridge, leading to a shack with several mushrooms around it. One of the Monkey-Head Fungus on the right will actually be the Fungiwoman in hiding.",
    "promot_tokens_num": 263
}