{
    "chunk_id": 820435518076,
    "source_file": "Guangzhi.md",
    "content_type": "one and two",
    "h1_title": "Guangzhi",
    "h2_title": "Where to Find Guangzhi",
    "h1_content": "Guangzhi is an optional yet very important Yaoguai Chief miniboss fight that you can encounter in Chapter 1 of Black Myth Wukong. Though he is not found along the main path through the Black Wind Mountain, defeating him will earn you an extremely useful Transformation Spell that should not be missed.\n* **Rewards:** Red Tide Transformation Spell, Stone Spirit x1, 700 Experience, 528 Will",
    "h2_content": "The Wolf Guai named Guangzhi is located partway through the Forest of Wolves, after you have defeated the Bullguard and reached the Outside the Forest Shrine.\nHead through the large forested area and keep to the left to travel up a hill to where a small guarded bridge is.\nOn the other side of the bridge, head straight to find a small archway between the forest hills, and you'll find Guangzhi's lair.\n### Guangzhi Mini-Boss Fight and Guide\nThis Yaoguai Chief is a lot more intimidating than the Bullguard, but thankfully much more approachable than the Wandering Wight nearby, even with his fearsome looking fiery twinblade. Remember that you can purchase some Cooling Powder should you find yourself being lit on fire too much, as well as Evil Repelling Medicant to boost your damage absorption.\nThe flashing of his fiery weapon may seem impossible to dodge, but the key to this fight is understanding exactly when his attacks actually land so that you can dodge around them. Guangzhi usually starts by charging forth for a combo attack, but each attack will cause him to jump into the air with a flourish before actually attacking with downward swings. Wait to dodge all three swing attacks and then hit him with some of your own while he tries to recover.\nIf he starts to whirl his fiery blade in circles around him, be ready but don’t panic as his attack is yet to come — wait for him to raise the blade and twirl it high before swinging it from side to side in two slower hits.\nAnother scary move that may take a bit of practice to understand is his pogo jump: Watch for him to raise his weapon high and vertical over his head before slamming it down, and then somersaulting forward in quick succession to bounce off the ground off his weapon. After a short pause, he’ll leap up to slam down for a third attack, and then even higher up for one last pogo slam explosion. With the last two attacks being spaced out, stand your ground to wait for the drop to dodge around, and cast Immobilize once he’s grounded to pin him down while you unleash your attacks.\nAt range, he can still be a major problem as you learn his moves, as he can strike from a distance with very little warning. If you see him somersault backward and out of range of your strikes, don’t blindly rush in. He’ll pause for a moment, and then toss his twinblade at you like a boomerang that requires dodging as it spins toward you, and back to his hand.\nHe can also prepare a flourish before holding his weapon straight up at his side while in a small crouch. If you notice this new stance, be ready to dodge the instant he moves, as he’ll dash forward at an alarming speed, and then dash back to his original spot to try and catch you off-guard.\nAnother quick moving attack has a lengthy start up, as he’ll keep somersaulting backward and leaping to build up momentum, jumping high and pausing in the air before slamming forward with weapon blazing. If you have the Pillar Style unlocked, you can actually hold your Heavy Attack button to lift yourself off the ground and avoid the attack entirely! He’ll waste time twirling his blade after this strike, making it a good time to get your own hits in.\nRemember to apply your Immobilize spell when it serves you best — interrupting his charged up attacks or after a combo when he’s not up in the air so you can lay into him, and use it whenever the spell recharges. With enough damage dealt, the boss will fall, leaving his weapon embedded in the ground nearby.\nGuangzhi\nPick up the fiery blade, and you’ll learn a Transformation Spell: **Red Tides**. Now you’ll be able to transform into the very boss you defeated, and use his own abilities in combat against your enemies.\nTransformation Spells are very powerful, and essentially give you a separate health and might bar to work with. Might will decay fairly quickly over time, and even more if you charge up the transformation’s focus bar to employ special spell attacks. For this particular spell, you’ll be able to use Guangzhi’s spinning light attacks, and charge a heavy attack for his quick dashes. With a full focus bar, you can use Might on spell after dodging to employ his powerful pogo jump attack!",
    "promot": "This is an excerpt from the file 'Guangzhi.md', located in the main section titled 'Guangzhi'. The section summary is: Guangzhi is an optional yet very important Yaoguai Chief miniboss fight that you can encounter in Chapter 1 of Black Myth Wukong. Though he is not found along the main path through the Black Wind Mountain, defeating him will earn you an extremely useful Transformation Spell that should not be missed.\n* **Rewards:** Red Tide Transformation Spell, Stone Spirit x1, 700 Experience, 528 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find Guangzhi', and the detailed content is as follows:\nThe Wolf Guai named Guangzhi is located partway through the Forest of Wolves, after you have defeated the Bullguard and reached the Outside the Forest Shrine.\nHead through the large forested area and keep to the left to travel up a hill to where a small guarded bridge is.\nOn the other side of the bridge, head straight to find a small archway between the forest hills, and you'll find Guangzhi's lair.\n### Guangzhi Mini-Boss Fight and Guide\nThis Yaoguai Chief is a lot more intimidating than the Bullguard, but thankfully much more approachable than the Wandering Wight nearby, even with his fearsome looking fiery twinblade. Remember that you can purchase some Cooling Powder should you find yourself being lit on fire too much, as well as Evil Repelling Medicant to boost your damage absorption.\nThe flashing of his fiery weapon may seem impossible to dodge, but the key to this fight is understanding exactly when his attacks actually land so that you can dodge around them. Guangzhi usually starts by charging forth for a combo attack, but each attack will cause him to jump into the air with a flourish before actually attacking with downward swings. Wait to dodge all three swing attacks and then hit him with some of your own while he tries to recover.\nIf he starts to whirl his fiery blade in circles around him, be ready but don’t panic as his attack is yet to come — wait for him to raise the blade and twirl it high before swinging it from side to side in two slower hits.\nAnother scary move that may take a bit of practice to understand is his pogo jump: Watch for him to raise his weapon high and vertical over his head before slamming it down, and then somersaulting forward in quick succession to bounce off the ground off his weapon. After a short pause, he’ll leap up to slam down for a third attack, and then even higher up for one last pogo slam explosion. With the last two attacks being spaced out, stand your ground to wait for the drop to dodge around, and cast Immobilize once he’s grounded to pin him down while you unleash your attacks.\nAt range, he can still be a major problem as you learn his moves, as he can strike from a distance with very little warning. If you see him somersault backward and out of range of your strikes, don’t blindly rush in. He’ll pause for a moment, and then toss his twinblade at you like a boomerang that requires dodging as it spins toward you, and back to his hand.\nHe can also prepare a flourish before holding his weapon straight up at his side while in a small crouch. If you notice this new stance, be ready to dodge the instant he moves, as he’ll dash forward at an alarming speed, and then dash back to his original spot to try and catch you off-guard.\nAnother quick moving attack has a lengthy start up, as he’ll keep somersaulting backward and leaping to build up momentum, jumping high and pausing in the air before slamming forward with weapon blazing. If you have the Pillar Style unlocked, you can actually hold your Heavy Attack button to lift yourself off the ground and avoid the attack entirely! He’ll waste time twirling his blade after this strike, making it a good time to get your own hits in.\nRemember to apply your Immobilize spell when it serves you best — interrupting his charged up attacks or after a combo when he’s not up in the air so you can lay into him, and use it whenever the spell recharges. With enough damage dealt, the boss will fall, leaving his weapon embedded in the ground nearby.\nGuangzhi\nPick up the fiery blade, and you’ll learn a Transformation Spell: **Red Tides**. Now you’ll be able to transform into the very boss you defeated, and use his own abilities in combat against your enemies.\nTransformation Spells are very powerful, and essentially give you a separate health and might bar to work with. Might will decay fairly quickly over time, and even more if you charge up the transformation’s focus bar to employ special spell attacks. For this particular spell, you’ll be able to use Guangzhi’s spinning light attacks, and charge a heavy attack for his quick dashes. With a full focus bar, you can use Might on spell after dodging to employ his powerful pogo jump attack!",
    "promot_tokens_num": 1049
}