{
    "chunk_id": 220509409519,
    "source_file": "Brown-Iron_Cart.md",
    "content_type": "one and two",
    "h1_title": "Brown-Iron Cart",
    "h2_title": "Brown-Iron Cart Boss Fight and Guide",
    "h1_content": "Brown-Iron Cart is a Yaoguai Chief boss fight that you'll go up against at the start of Chapter 5 in Black Myth: Wukong. Blocking the pathway from the Ashen Pass to the Camp of Seasons, the cart is just one of the Five Element Carts you'll need to fight in this Chapter.",
    "h2_content": "The Brown-Iron Cart doesn't have much variation in attacks. If you approach it head-on, you'll want to use the Fireproof Mantle to help with its continuous fire attacks. But, you can also avoid these by sticking close to its arms. You'll just need to watch out for when it rears slightly up and slams its fists down. Thankfully, this attack can be dodged.\nIf you've taken the small path to get behind it as we suggested, and got to the Keeper's Shrine, you have the advantage. The cart can't turn around considering it's on such a small path, so you can ignore the fist-slamming attacks entirely and focus just on when it blows out fire all around it. Use the Fireproof Mantle and watch out for when it blows fire. As soon as it dies down, drop down and hit it relentlessly with combos. When it starts to get ready to unleash the fire, jump back up the little ledge to completely avoid it.\nBrown-Iron Cart",
    "promot": "This is an excerpt from the file 'Brown-Iron_Cart.md', located in the main section titled 'Brown-Iron Cart'. The section summary is: Brown-Iron Cart is a Yaoguai Chief boss fight that you'll go up against at the start of Chapter 5 in Black Myth: Wukong. Blocking the pathway from the Ashen Pass to the Camp of Seasons, the cart is just one of the Five Element Carts you'll need to fight in this Chapter. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Brown-Iron Cart Boss Fight and Guide', and the detailed content is as follows:\nThe Brown-Iron Cart doesn't have much variation in attacks. If you approach it head-on, you'll want to use the Fireproof Mantle to help with its continuous fire attacks. But, you can also avoid these by sticking close to its arms. You'll just need to watch out for when it rears slightly up and slams its fists down. Thankfully, this attack can be dodged.\nIf you've taken the small path to get behind it as we suggested, and got to the Keeper's Shrine, you have the advantage. The cart can't turn around considering it's on such a small path, so you can ignore the fist-slamming attacks entirely and focus just on when it blows out fire all around it. Use the Fireproof Mantle and watch out for when it blows fire. As soon as it dies down, drop down and hit it relentlessly with combos. When it starts to get ready to unleash the fire, jump back up the little ledge to completely avoid it.\nBrown-Iron Cart",
    "promot_tokens_num": 341
}