{
    "chunk_id": 283704670681,
    "source_file": "Chitin_Staff.md",
    "content_type": "one and two",
    "h1_title": "Chitin Staff",
    "h2_title": "Black Myth: Wukong Chitin Staff Location",
    "h1_content": "The Chitin Staff is a weapon in Black Myth: Wukong. It comes with high stats, damage, and a unique effect like many of the other Weapons in the game.\nThe weapon comes with 75 damage, a 5% Critical Hit Chance boost, and the following unique effect:\n* Upon a successful hit with charged heavy attack, each Focus Point cost slightly recovers health.",
    "h2_content": "The Chitin Staff can be found in Chapter 4 - The Webbed Hollow, upon defeating [ The Second Sister] in the Village of Lanxi.\nChitin Staff\nWeapons can be crafted throughout the game from the Shrines throughout the game's six chapters. Crafting weapons will require Will and various Crafting Materials from the game's locales and enemies. To craft the Chitin Staff you will need:\n* 1 Venomous Hair\")\n* 1 Refined Iron Sand\n* 2 Yaoguai Core\n* 1,200 Will\nFor even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Armor and Gear locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.",
    "promot": "This is an excerpt from the file 'Chitin_Staff.md', located in the main section titled 'Chitin Staff'. The section summary is: The Chitin Staff is a weapon in Black Myth: Wukong. It comes with high stats, damage, and a unique effect like many of the other Weapons in the game.\nThe weapon comes with 75 damage, a 5% Critical Hit Chance boost, and the following unique effect:\n* Upon a successful hit with charged heavy attack, each Focus Point cost slightly recovers health. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Chitin Staff Location', and the detailed content is as follows:\nThe Chitin Staff can be found in Chapter 4 - The Webbed Hollow, upon defeating [ The Second Sister] in the Village of Lanxi.\nChitin Staff\nWeapons can be crafted throughout the game from the Shrines throughout the game's six chapters. Crafting weapons will require Will and various Crafting Materials from the game's locales and enemies. To craft the Chitin Staff you will need:\n* 1 Venomous Hair\")\n* 1 Refined Iron Sand\n* 2 Yaoguai Core\n* 1,200 Will\nFor even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Armor and Gear locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.",
    "promot_tokens_num": 332
}