{
    "chunk_id": 855498658682,
    "source_file": "Secret_Bosses_in_Black_Myth_Wukong.md",
    "content_type": "one and two",
    "h1_title": "Secret Bosses in Black Myth Wukong",
    "h2_title": "The Scorpionlord",
    "h1_content": "Black Myth: Wukong has a wealth of secrets to discover, from Transformation Spells to hidden Key Items and, of course, bosses. While some secret bosses can be found through exploration, others are well-hidden and require completing NPC questlines, collecting multiple items, or even fighting mini-bosses to make them emerge. Here's a breakdown of all the secret bosses in the game, organised by chapter.\nSecret Bosses in Chapter 1| Secret Bosses in Chapter 2| Secret Bosses in Chapter 3\n---|---|---\nSecret Bosses in Chapter 4| Secret Bosses in Chapter 5| Secret Bosses in Chapter 6\n# Secret Bosses in Chapter 1\nChapter 1 has two secret bosses for you to take on. The first can be found in the chapter's secret area Secret: Ancient Guanyin Temple; the second, you'll find behind a waterfall, but only after collecting the Loong Scales from Chapter 2.",
    "h2_content": "Chapter 4's secret area is called the Purple Cloud Mountain and there are 3 bosses to fight here! Scorpionlord can be found near the Bounds of Deity's Abode Keeper's Shrine. Smash his precious pots and he'll start a fight.\nThe Scorpionlord\n### Don't Miss This Boss!\nWe've listed the secret bosses in Purple Cloud Mountain in a particular order because ers have reported that this is a missable encounter. For that reason, we'd recommend tackling the Scorpionlord first when you're in Purple Cloud Mountain.",
    "promot": "This is an excerpt from the file 'Secret_Bosses_in_Black_Myth_Wukong.md', located in the main section titled 'Secret Bosses in Black Myth Wukong'. The section summary is: Black Myth: Wukong has a wealth of secrets to discover, from Transformation Spells to hidden Key Items and, of course, bosses. While some secret bosses can be found through exploration, others are well-hidden and require completing NPC questlines, collecting multiple items, or even fighting mini-bosses to make them emerge. Here's a breakdown of all the secret bosses in the game, organised by chapter.\nSecret Bosses in Chapter 1| Secret Bosses in Chapter 2| Secret Bosses in Chapter 3\n---|---|---\nSecret Bosses in Chapter 4| Secret Bosses in Chapter 5| Secret Bosses in Chapter 6\n# Secret Bosses in Chapter 1\nChapter 1 has two secret bosses for you to take on. The first can be found in the chapter's secret area Secret: Ancient Guanyin Temple; the second, you'll find behind a waterfall, but only after collecting the Loong Scales from Chapter 2. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'The Scorpionlord', and the detailed content is as follows:\nChapter 4's secret area is called the Purple Cloud Mountain and there are 3 bosses to fight here! Scorpionlord can be found near the Bounds of Deity's Abode Keeper's Shrine. Smash his precious pots and he'll start a fight.\nThe Scorpionlord\n### Don't Miss This Boss!\nWe've listed the secret bosses in Purple Cloud Mountain in a particular order because ers have reported that this is a missable encounter. For that reason, we'd recommend tackling the Scorpionlord first when you're in Purple Cloud Mountain.",
    "promot_tokens_num": 387
}