{
    "chunk_id": 672435760713,
    "source_file": "Black_Loong.md",
    "content_type": "one and two",
    "h1_title": "Black Loong",
    "h2_title": "Where to Find Black Loong",
    "h1_content": "Black Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Hidden beyond a waterfall of sand in the Fright Cliff, you won't be able to encounter this boss until you obtain a Key Item elswhere in this chapter, Black Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n* **Rewards:** Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1",
    "h2_content": "Much like the Red Loong Boss FIght, you will not be able to access and challenge this secret boss until obtaining a special item elswhere in Chapter 2.\nHead through the Sandgate Village and defeat the King of Flowing Sand and his Second Rat Prince son. After defeating the pair (or only the son), head left from the boss arena and into the Valley of Despair.\nOnce you arrive in the large covered valley area, keep to the left to find a large lower platform by a slightly rounded red wall lined with small statues. At this point, if you did not kill the King of Flowing Sand, he’ll summon his other son, the First Rat Prince — otherwise you can use the Pungent Flesh Chunk to summon him yourself.\nWhile fighting the First Rat Prince, you can lure him into performing one of his large slam attacks when facing the rounded wall, and it will cause a crack to appear in the wall. If you are unable to lure the boss into forming a crack in the wall, you can even do so yourself by hitting it with a very strong attack - we recommend the Wandering Wight’s Spirit Attack, or the Azure Dust Transformation Spell’s final attack.\nYou can enter the crack in the wall, and on the other side you’ll find a chest containing the Loong Scales. With this item, you’ll be able to uncover the lair of the Loong Dragons.\nHead to the Fright Cliff on the opposite side of the Yellow Wind Ridge from the Valley of Despair, and travel through it to reach an area with the Rockrest Flat Shrine.\nDirectly to the right of this shrine, you can spot a stairway leading up to a large waterfall of sand that's otherwise impassible, and guarded by a tough Spearbone enemy that drops a Spirit.\nWith the Loong Scales, you'll be able to interact with the sandfall and remove it as a barrier, revealing a door behind it to take you into the Black Loong's lair.",
    "promot": "This is an excerpt from the file 'Black_Loong.md', located in the main section titled 'Black Loong'. The section summary is: Black Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Hidden beyond a waterfall of sand in the Fright Cliff, you won't be able to encounter this boss until you obtain a Key Item elswhere in this chapter, Black Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n* **Rewards:** Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1 This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find Black Loong', and the detailed content is as follows:\nMuch like the Red Loong Boss FIght, you will not be able to access and challenge this secret boss until obtaining a special item elswhere in Chapter 2.\nHead through the Sandgate Village and defeat the King of Flowing Sand and his Second Rat Prince son. After defeating the pair (or only the son), head left from the boss arena and into the Valley of Despair.\nOnce you arrive in the large covered valley area, keep to the left to find a large lower platform by a slightly rounded red wall lined with small statues. At this point, if you did not kill the King of Flowing Sand, he’ll summon his other son, the First Rat Prince — otherwise you can use the Pungent Flesh Chunk to summon him yourself.\nWhile fighting the First Rat Prince, you can lure him into performing one of his large slam attacks when facing the rounded wall, and it will cause a crack to appear in the wall. If you are unable to lure the boss into forming a crack in the wall, you can even do so yourself by hitting it with a very strong attack - we recommend the Wandering Wight’s Spirit Attack, or the Azure Dust Transformation Spell’s final attack.\nYou can enter the crack in the wall, and on the other side you’ll find a chest containing the Loong Scales. With this item, you’ll be able to uncover the lair of the Loong Dragons.\nHead to the Fright Cliff on the opposite side of the Yellow Wind Ridge from the Valley of Despair, and travel through it to reach an area with the Rockrest Flat Shrine.\nDirectly to the right of this shrine, you can spot a stairway leading up to a large waterfall of sand that's otherwise impassible, and guarded by a tough Spearbone enemy that drops a Spirit.\nWith the Loong Scales, you'll be able to interact with the sandfall and remove it as a barrier, revealing a door behind it to take you into the Black Loong's lair.",
    "promot_tokens_num": 584
}