{
    "chunk_id": 220875157080,
    "source_file": "Sandgate_Village_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Sandgate Village Walkthrough",
    "h2_title": "Village Entrance",
    "h1_content": "Black Myth: Wukong's Chapter 2 begins at the outskirts of a Village in the Yellow Wind Ridge, which spreads out to reach multiple areas. Below you'll find a guide for the first major area of Yellow Wind Ridge: Sandgate Village, as well as how to defeat its many bosses that include Lang-Li-Guhh-Baw, the Earth Wolf, the King of Flowing Sands and his First and Second Rat Princes.\n* **Jump to A Section:**\n* **Village Entrance**\n* Yaoguai Chief - Lang-Li-Guhh-Baw\n* Yaoguai Chief - Earth Wolf\n* Yaoguai Chief - King of Flowing Sands and Second Rat Prince\n* **Valley of Despair**\n* Yaoguai Chief - First Prince of Flowing Sands\nIn Black Myth Wukong’s second chapter, you’ll leave behind the forests of Black Wind Mountain for the dry sands of the Yellow Wind Ridge. An energetic (yet headless) man ing a Chinese lute (known as a sanxian) will set the stage for this realm, and helpfully revive our Destined One from becoming a pincushion full of arrows.",
    "h2_content": "Make sure to take the time to view the new additions to the Chapter 2’s Shrines menu. Note that you can still freely fast travel back to any Shrine in Chapter 1’s Black Wind Mountain if you missed out on any secrets. The store is also selling very different items than it was in the previous chapter, and you’ll find that the selection will change based on which chapter you are in:\nYellow Wind Ridge Shrine Shop\n---\nAntimiasma Powder (x6) - 180 Will | Shock-Quelling Powder (x6) - 180 Will | Tonifying Decoction (x3) - 360 Will |\nMind Core (x2) - 720 Will | Silk (x2) - 600 Will | Yaoguai Core (x2) - 450 Will |\nLicorice (x5) - 120 Will | Aged Ginseng (x5) - 90 Will | Fragrant Jade Flower (x5) - 120 Will | Purple Lingzhi (x5) - 90 Will\nFire Bellflower (x5) - 120 Will | Jade Lotus (x5) - 90 Will | |\nIn addition, you’ll also have access to crafting a new set of armor since defeating the Black Wind King: The Ebongold Set, which provides better defense and a few bonuses to using your Cloud Step. Also, with the Flame Ebongold from the boss himself, you can use it and other ingredients to craft the Wind Bear Staff!\nBefore heading into the village, it’s time to finally find a use for all those plant materials you’ve been gathering. Look just beyond the shrine for a small ditch running under a wooden bridge. You can explore the left side to find a sloping path up to a green Wisp to absorb, and where a mushroom is actually a Lingzhiling creature in disguise. Watch for its poisonous attacks, and kill it to earn a large variety of mushroom items. The ditch also leads below the town’s large gate, but aside from Fragrant Jade Flower to harvest, there’s not much else down here.\nFollow the ditch through the opposite path under the bridge, and head right to a tunnel. Inside, apart from a green Wisp you can absorb for some Will and a mushroom to harvest, you can spot a grubby yet friendly canine deity.\nThe Xu Dog as he’s known has a problem he needs help with: A large frog has swallowed one of his medicinal formulas, and you’re just the person he’s looking for to get it back.\n### Yaoguai Chief Mini-Boss Fight - Lang-Li-Guhh-Baw\nThe frog in question is the one you may have seen from the pond earlier, down in a large flooded pit nearby. While he has much in common with the other optional frog boss from Black Wind Mountain, he’s got a few new attacks you’ll need to prepare for.\nThis particular boss is infused with the power of lightning, and like the Rat Governor you faced, he’ll try to shock you repeatedly until you suffer from a debuff that increases all your damage taken. Luckily, the Shrine’s shop sells a few Shock-Quelling Powder if you find yourself struggling to survive from these attacks.\nAside from the familiar hand slaps and ground pound he can perform in quick succession, many of his other attacks now have lightning effects, including his sweeping tongue-lash attack. You can dodge this tongue lash by dashing to the side with Cloud Step, and hit from the side for extra damage. Sometimes the tongue lash will shoot out in a straight line, so always dodge the tongue to the sides instead of backward.\nBe sure not to attack too much from the frog’s rear, as its quick hop mule kick can deal a ton of damage with little warning. If you see his arms cross, he’ll bloat his chest out for a frontal assault.\nSeveral of its new electric attacks can deal a flurry of damage if you aren’t prepared to deal with them. The usual tell will be when the frog’s throat swells with electric energy. He will then shoot out dozens of electrified tadpoles — sometimes in a large frontal arc around him, and sometimes he’ll just spew them out and have them scatter around him.\nThese can be incredibly hard to dodge accurately, and is a good case for using the Pillar Stance to gain height off the floor and out of reach of the electric tadpoles.\nIf instead the frog lets loose a giant croak and raises its body up, it will summon a lightning storm that will rain down around the arena. Look for the signs of an imminent strike to dodge around them as they crash down.\nIf you’re having trouble dealing with his many lightning attacks, remember to use Immobilize whenever you see him charge up to interrupt the attack entirely, limiting how much he can actually try to electrify you.\nOnce you defeat this frog boss, he’ll drop the Evil Repelling Medicament formula. Return it to the Xu dog back outside the pit. Not only will he reward you with 2 Evil Repelling Medicament for your trouble, but you’ll also unlock the ability to create all sorts of consumables yourself at any Shrine. With all the materials you’ve been harvesting, you can stock up on defensive, offensive, and status reducing consumables.\nLang-Li-Guhh-Baw\nBefore leaving the area, be sure to look around the rim of the pit past where the Xu Dog was, and you can find a high ledge path leading to a small altar with a giant statue head, and a **Meditation Spot** in front of it, granting you a free Spark Skill Point.\nThe Altar, Sandgate Village Meditation Spot\nReturning in the direction of the main Sandgate Village, you’ll find that the large doorway is sealed with a host of Rat Archers stationed on the roof where you can’t hit them.\nInstead, stay out of their range and look for a small hilltop altar to the right that holds a chest, and you can find 3x **Tiny Piece of Gold** and 2x **Silk** inside.\nJust beyond the chest, you can spot another large open plain. Head to the right and down the hill onto a long wooden walkway, where you’ll find a path leading back to where the Xu Dog was, and a green Wisp to grab for its Will.\nTake the left path to reach the next open area where you’ll face off against both a Rat Soldier and a Rat Governor. Lure the Soldier out of range of the Governor’s lightning attacks to take them on separately, and don’t move yourself out too far, as more enemies and archers are waiting up ahead.\nYou should also inspect the raised altar on the wooden platform here, as you can find a turtle-shaped box that holds **Laurel Buds** inside, a new Soak for your Gourd.\nA large door stands to the right, and in front of it is a two-headed Rat Captain. These foes are incredibly ferocious, both with their heavy blade, and their unique head combo:\nOne head emits a smoky fog, and the other shoots fire. In reality, the blinding smoke can actually be ignited by the second head to cause huge explosions, so stay away from the smoke at all costs.\nThey can also ignite their blade to deal increased fire damage, and even defeating them is dangerous, as they’ll start spewing smoke and fire uncontrollably until they explode and damage everything around them. On the plus side, they don’t respawn, so you’ll only have to deal with the two in this area once.\nPutting the large door to the right on pause for a moment, turn your attention to the large valley in the opposite direction where the second Rat Captain patrols. The ridge above is crawling with multiple Rat Archers, plus another Rat Archer on the rooftop to the left will make trying to take him on a pain.\nInstead, use Cloud Step to race past, and climb the hill to take out the archers and avoid the Soldier.\nOnce the archers are out of the way, you can take out the stray Soldier and then defeat the Captain so he won’t respawn anymore. As for the archer on the roof, look for a high hill on a ledge where the grass comes right up to a roof you can jump to reach the rooftop, letting you defeat the archer plus another nearby on the other side. There’s even a green Wisp here to absorb for some Will.\nWith everyone around the valley pathway defeated, be sure to look back toward that doorway we aren’t opening yet. The large ruined house has a wall with an entrance from the side the Rat Captain was on, and inside you should be able to find and absorb a green Wisp for some will and recharge your Gourd.\nHead up the hill checking the houses. One has a Rat Soldier waiting to ambush you in the back, as well as another green Wisp inside. Higher up past where the Rat Archers were is a larger and open building with some Licorice.\nAt the top of the hill is one last shack, where you’ll find a big chest holding a **Blood of the Iron Bull** , 1 **Small Piece of Gold** , and 4 **Tiny Piece of Gold**. Plus, if you circle around the back, you can harvest a Fragrant Jade Flower.\nHeading back down the hill towards the path at the bottom, be sure to stop by a lone shack far apart from the others. You’ll hear some whispering as you draw close, and a voice will speak out as you interact with the shack, telling you to go away for fear the two-headed Rat Captains will find them. Keep talking with the mysterious voice, and after you’ve rid the area of captains, they’ll thank you, and mention they may go off in search of the missing Third Prince somewhere in the West.\nHeading to the left of the lone shack, you’ll find a gate guarded by a Rat Governor and another Archer on the rooftops that connects to the one you climbed earlier. Defeat them to gain access to a large open field inside the Village’s main area. From across the field, a voice pleading to be freed calls out, but in your way is a large loping creature that will want to engage you first.\n### Yaoguai Chief Mini-Boss Fight - Earth Wolf\nThis strange looking yaoguai has a lot of rushing attacks that are hard to get a sense of due to its attack patterns, and you’ll want to utilize your Immobilize spell for help interrupting these when possible.\nIt will often start the fight with a leaping attack, using its head to ram into you as it rolls when it hits the ground. Wait until it comes crashing down to dodge, then move along with it to keep attacking as it rights itself.\nIt can also try to perform a short distance pounce to land on top of you, which moves much quicker than its headbutt leap. If you can evade this one, it will waste time looking around to find that it missed its grab, letting you get your hits in.\nHowever, if you get locked in the grab, you’ll be tossed up in the air and land right on its bony back and horns, taking major damage as it shakes you off. Watch for both of its paws to reach out to know when to dodge this move.\nThe Earth Wolf can also perform two short lunging bite attacks in fairly quick succession, moving itself forward with each bite to try and lock onto you.\nIf you see the boss angle its head and raise its arm up, be ready for a shoulder charge dash as it slides along the ground to try and tackle you. Stick to dodging away and to the side and wait until the tackle is done to get in your counters.\nThough it can often rise up on its hind legs to slash at you with its front claws, certain times its wild swings will make it crash forward to land belly up. After a moment it will thrash around and try to damage you if close, but with an exposed unarmored part of its body, you can try freezing it in place and expending a charged attack - preferably with the Smash or Pillar Style to slam down on its ribs for extra damage.\nYou can also get an opportune strike after dodging its grab by using that moment to hit it hard with a Spirit attack from the Wandering Wight, and big enough hits can cause it to fall on its belly as well.\nWith enough damage dealt, the Earth Wolf will fall, revealing its Spirit to be claimed by you. You can look around the arena to harvest some Jade Lotus in the pond, or check the back of the houses to find other materials like Aged Ginseng.\nEarth Wolf\nBe sure to head on over to the altar with the tiger statue to find the source of the person calling for help — it’s the same friendly Horse Guai you may have met in Chapter 1 by a Meditation Point right after Guanyin Temple. He’ll be thankful for your arrival, but stresses that he’ll be okay and can slip out on his own. Chat him up to learn more about the rats of this region, and then take him at his word and leave him to make his own way out.\nBe sure to open up the gate nearby to unlock a shortcut back to the Village Entrance. As an added bonus, all the Rat Archers posted on the gate’s roof have jumped down, and you can ambush the entire group. Your Sage’s Relic should now indicate an enemy who has a Spirit you can absorb, and sure enough you can spot a tougher Rat Archer than the rest with blue flames. Defeat him, and you’ll be able to absorb the Rat Archer Spirit. As an added bonus, all the Rat Archers will no longer spawn here!\nSince they’re all gone, head through the gate the archers were guarding and stick to the right side to find a path up to a chest, which you can loot to get 1 **Small Piece of Gold** and 3 **Tiny Piece of Gold**.\nNow it’s time to finally open that door the Rat Captains were guarding. In the next scene, you’ll spot the next major boss fight: a tiny Rat King and his oversized son.",
    "promot": "This is an excerpt from the file 'Sandgate_Village_Walkthrough.md', located in the main section titled 'Sandgate Village Walkthrough'. The section summary is: Black Myth: Wukong's Chapter 2 begins at the outskirts of a Village in the Yellow Wind Ridge, which spreads out to reach multiple areas. Below you'll find a guide for the first major area of Yellow Wind Ridge: Sandgate Village, as well as how to defeat its many bosses that include Lang-Li-Guhh-Baw, the Earth Wolf, the King of Flowing Sands and his First and Second Rat Princes.\n* **Jump to A Section:**\n* **Village Entrance**\n* Yaoguai Chief - Lang-Li-Guhh-Baw\n* Yaoguai Chief - Earth Wolf\n* Yaoguai Chief - King of Flowing Sands and Second Rat Prince\n* **Valley of Despair**\n* Yaoguai Chief - First Prince of Flowing Sands\nIn Black Myth Wukong’s second chapter, you’ll leave behind the forests of Black Wind Mountain for the dry sands of the Yellow Wind Ridge. An energetic (yet headless) man ing a Chinese lute (known as a sanxian) will set the stage for this realm, and helpfully revive our Destined One from becoming a pincushion full of arrows. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Village Entrance', and the detailed content is as follows:\nMake sure to take the time to view the new additions to the Chapter 2’s Shrines menu. Note that you can still freely fast travel back to any Shrine in Chapter 1’s Black Wind Mountain if you missed out on any secrets. The store is also selling very different items than it was in the previous chapter, and you’ll find that the selection will change based on which chapter you are in:\nYellow Wind Ridge Shrine Shop\n---\nAntimiasma Powder (x6) - 180 Will | Shock-Quelling Powder (x6) - 180 Will | Tonifying Decoction (x3) - 360 Will |\nMind Core (x2) - 720 Will | Silk (x2) - 600 Will | Yaoguai Core (x2) - 450 Will |\nLicorice (x5) - 120 Will | Aged Ginseng (x5) - 90 Will | Fragrant Jade Flower (x5) - 120 Will | Purple Lingzhi (x5) - 90 Will\nFire Bellflower (x5) - 120 Will | Jade Lotus (x5) - 90 Will | |\nIn addition, you’ll also have access to crafting a new set of armor since defeating the Black Wind King: The Ebongold Set, which provides better defense and a few bonuses to using your Cloud Step. Also, with the Flame Ebongold from the boss himself, you can use it and other ingredients to craft the Wind Bear Staff!\nBefore heading into the village, it’s time to finally find a use for all those plant materials you’ve been gathering. Look just beyond the shrine for a small ditch running under a wooden bridge. You can explore the left side to find a sloping path up to a green Wisp to absorb, and where a mushroom is actually a Lingzhiling creature in disguise. Watch for its poisonous attacks, and kill it to earn a large variety of mushroom items. The ditch also leads below the town’s large gate, but aside from Fragrant Jade Flower to harvest, there’s not much else down here.\nFollow the ditch through the opposite path under the bridge, and head right to a tunnel. Inside, apart from a green Wisp you can absorb for some Will and a mushroom to harvest, you can spot a grubby yet friendly canine deity.\nThe Xu Dog as he’s known has a problem he needs help with: A large frog has swallowed one of his medicinal formulas, and you’re just the person he’s looking for to get it back.\n### Yaoguai Chief Mini-Boss Fight - Lang-Li-Guhh-Baw\nThe frog in question is the one you may have seen from the pond earlier, down in a large flooded pit nearby. While he has much in common with the other optional frog boss from Black Wind Mountain, he’s got a few new attacks you’ll need to prepare for.\nThis particular boss is infused with the power of lightning, and like the Rat Governor you faced, he’ll try to shock you repeatedly until you suffer from a debuff that increases all your damage taken. Luckily, the Shrine’s shop sells a few Shock-Quelling Powder if you find yourself struggling to survive from these attacks.\nAside from the familiar hand slaps and ground pound he can perform in quick succession, many of his other attacks now have lightning effects, including his sweeping tongue-lash attack. You can dodge this tongue lash by dashing to the side with Cloud Step, and hit from the side for extra damage. Sometimes the tongue lash will shoot out in a straight line, so always dodge the tongue to the sides instead of backward.\nBe sure not to attack too much from the frog’s rear, as its quick hop mule kick can deal a ton of damage with little warning. If you see his arms cross, he’ll bloat his chest out for a frontal assault.\nSeveral of its new electric attacks can deal a flurry of damage if you aren’t prepared to deal with them. The usual tell will be when the frog’s throat swells with electric energy. He will then shoot out dozens of electrified tadpoles — sometimes in a large frontal arc around him, and sometimes he’ll just spew them out and have them scatter around him.\nThese can be incredibly hard to dodge accurately, and is a good case for using the Pillar Stance to gain height off the floor and out of reach of the electric tadpoles.\nIf instead the frog lets loose a giant croak and raises its body up, it will summon a lightning storm that will rain down around the arena. Look for the signs of an imminent strike to dodge around them as they crash down.\nIf you’re having trouble dealing with his many lightning attacks, remember to use Immobilize whenever you see him charge up to interrupt the attack entirely, limiting how much he can actually try to electrify you.\nOnce you defeat this frog boss, he’ll drop the Evil Repelling Medicament formula. Return it to the Xu dog back outside the pit. Not only will he reward you with 2 Evil Repelling Medicament for your trouble, but you’ll also unlock the ability to create all sorts of consumables yourself at any Shrine. With all the materials you’ve been harvesting, you can stock up on defensive, offensive, and status reducing consumables.\nLang-Li-Guhh-Baw\nBefore leaving the area, be sure to look around the rim of the pit past where the Xu Dog was, and you can find a high ledge path leading to a small altar with a giant statue head, and a **Meditation Spot** in front of it, granting you a free Spark Skill Point.\nThe Altar, Sandgate Village Meditation Spot\nReturning in the direction of the main Sandgate Village, you’ll find that the large doorway is sealed with a host of Rat Archers stationed on the roof where you can’t hit them.\nInstead, stay out of their range and look for a small hilltop altar to the right that holds a chest, and you can find 3x **Tiny Piece of Gold** and 2x **Silk** inside.\nJust beyond the chest, you can spot another large open plain. Head to the right and down the hill onto a long wooden walkway, where you’ll find a path leading back to where the Xu Dog was, and a green Wisp to grab for its Will.\nTake the left path to reach the next open area where you’ll face off against both a Rat Soldier and a Rat Governor. Lure the Soldier out of range of the Governor’s lightning attacks to take them on separately, and don’t move yourself out too far, as more enemies and archers are waiting up ahead.\nYou should also inspect the raised altar on the wooden platform here, as you can find a turtle-shaped box that holds **Laurel Buds** inside, a new Soak for your Gourd.\nA large door stands to the right, and in front of it is a two-headed Rat Captain. These foes are incredibly ferocious, both with their heavy blade, and their unique head combo:\nOne head emits a smoky fog, and the other shoots fire. In reality, the blinding smoke can actually be ignited by the second head to cause huge explosions, so stay away from the smoke at all costs.\nThey can also ignite their blade to deal increased fire damage, and even defeating them is dangerous, as they’ll start spewing smoke and fire uncontrollably until they explode and damage everything around them. On the plus side, they don’t respawn, so you’ll only have to deal with the two in this area once.\nPutting the large door to the right on pause for a moment, turn your attention to the large valley in the opposite direction where the second Rat Captain patrols. The ridge above is crawling with multiple Rat Archers, plus another Rat Archer on the rooftop to the left will make trying to take him on a pain.\nInstead, use Cloud Step to race past, and climb the hill to take out the archers and avoid the Soldier.\nOnce the archers are out of the way, you can take out the stray Soldier and then defeat the Captain so he won’t respawn anymore. As for the archer on the roof, look for a high hill on a ledge where the grass comes right up to a roof you can jump to reach the rooftop, letting you defeat the archer plus another nearby on the other side. There’s even a green Wisp here to absorb for some Will.\nWith everyone around the valley pathway defeated, be sure to look back toward that doorway we aren’t opening yet. The large ruined house has a wall with an entrance from the side the Rat Captain was on, and inside you should be able to find and absorb a green Wisp for some will and recharge your Gourd.\nHead up the hill checking the houses. One has a Rat Soldier waiting to ambush you in the back, as well as another green Wisp inside. Higher up past where the Rat Archers were is a larger and open building with some Licorice.\nAt the top of the hill is one last shack, where you’ll find a big chest holding a **Blood of the Iron Bull** , 1 **Small Piece of Gold** , and 4 **Tiny Piece of Gold**. Plus, if you circle around the back, you can harvest a Fragrant Jade Flower.\nHeading back down the hill towards the path at the bottom, be sure to stop by a lone shack far apart from the others. You’ll hear some whispering as you draw close, and a voice will speak out as you interact with the shack, telling you to go away for fear the two-headed Rat Captains will find them. Keep talking with the mysterious voice, and after you’ve rid the area of captains, they’ll thank you, and mention they may go off in search of the missing Third Prince somewhere in the West.\nHeading to the left of the lone shack, you’ll find a gate guarded by a Rat Governor and another Archer on the rooftops that connects to the one you climbed earlier. Defeat them to gain access to a large open field inside the Village’s main area. From across the field, a voice pleading to be freed calls out, but in your way is a large loping creature that will want to engage you first.\n### Yaoguai Chief Mini-Boss Fight - Earth Wolf\nThis strange looking yaoguai has a lot of rushing attacks that are hard to get a sense of due to its attack patterns, and you’ll want to utilize your Immobilize spell for help interrupting these when possible.\nIt will often start the fight with a leaping attack, using its head to ram into you as it rolls when it hits the ground. Wait until it comes crashing down to dodge, then move along with it to keep attacking as it rights itself.\nIt can also try to perform a short distance pounce to land on top of you, which moves much quicker than its headbutt leap. If you can evade this one, it will waste time looking around to find that it missed its grab, letting you get your hits in.\nHowever, if you get locked in the grab, you’ll be tossed up in the air and land right on its bony back and horns, taking major damage as it shakes you off. Watch for both of its paws to reach out to know when to dodge this move.\nThe Earth Wolf can also perform two short lunging bite attacks in fairly quick succession, moving itself forward with each bite to try and lock onto you.\nIf you see the boss angle its head and raise its arm up, be ready for a shoulder charge dash as it slides along the ground to try and tackle you. Stick to dodging away and to the side and wait until the tackle is done to get in your counters.\nThough it can often rise up on its hind legs to slash at you with its front claws, certain times its wild swings will make it crash forward to land belly up. After a moment it will thrash around and try to damage you if close, but with an exposed unarmored part of its body, you can try freezing it in place and expending a charged attack - preferably with the Smash or Pillar Style to slam down on its ribs for extra damage.\nYou can also get an opportune strike after dodging its grab by using that moment to hit it hard with a Spirit attack from the Wandering Wight, and big enough hits can cause it to fall on its belly as well.\nWith enough damage dealt, the Earth Wolf will fall, revealing its Spirit to be claimed by you. You can look around the arena to harvest some Jade Lotus in the pond, or check the back of the houses to find other materials like Aged Ginseng.\nEarth Wolf\nBe sure to head on over to the altar with the tiger statue to find the source of the person calling for help — it’s the same friendly Horse Guai you may have met in Chapter 1 by a Meditation Point right after Guanyin Temple. He’ll be thankful for your arrival, but stresses that he’ll be okay and can slip out on his own. Chat him up to learn more about the rats of this region, and then take him at his word and leave him to make his own way out.\nBe sure to open up the gate nearby to unlock a shortcut back to the Village Entrance. As an added bonus, all the Rat Archers posted on the gate’s roof have jumped down, and you can ambush the entire group. Your Sage’s Relic should now indicate an enemy who has a Spirit you can absorb, and sure enough you can spot a tougher Rat Archer than the rest with blue flames. Defeat him, and you’ll be able to absorb the Rat Archer Spirit. As an added bonus, all the Rat Archers will no longer spawn here!\nSince they’re all gone, head through the gate the archers were guarding and stick to the right side to find a path up to a chest, which you can loot to get 1 **Small Piece of Gold** and 3 **Tiny Piece of Gold**.\nNow it’s time to finally open that door the Rat Captains were guarding. In the next scene, you’ll spot the next major boss fight: a tiny Rat King and his oversized son.",
    "promot_tokens_num": 3226
}