{
    "chunk_id": 333906787946,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Fright Cliff Walkthrough",
    "h2_title": "Squall Hideout",
    "h1_content": "Fright Cliff is one of two possible second main regions of Chapter 2 in the Yellow Wind Ridge of Black Myth: Wukong. Below you'll find a guide for the Fright Cliff Region and its side quests for the Man-in-Stone and Yellow-Robed Squire, as well as how to defeat its many bosses that include the Mother of Stones and Stone Vanguard to get the Sterness of Stone.\n* **Jump to A Section:**\n* **Squall Hideout**\n* Yaoguai Chief - Mother of Stones\n* **Rockrest Flat**\n* Yaoguai King - Stone Vanguard\n* **Rock Crash Platform**\nFright Cliff is one of the two sub-regions you’ll need to explore in Chapter 2 of Black Myth Wukong in order to unlock the large sealed doors that lead to the end of the chapter. You can first reach this area by heading through the Sandgate Village and defeating the King of Flowing Sands and Second Rat Prince, and then crossing the bridge to the right of the sealed door.\nAs you cross the bridge, you can harvest some Licorice on the other side, and look to the left to spot a large archway in the distance, with a whirling black tornado even further left in a canyon separating the Fright Cliffs from the Crouching Tiger Temple.\nHeading toward the archway in the distance, you can find a green Wisp to absorb on the left side of the broken rock pathway, and on the right is a new type of enemy that will try to ambush you. This Pitstone is a mass of rock and skulls on legs, and will try to use its weight to jump down on you, and perform somersaults to use its momentum to slam into you. If they prove to be a problem to evade, consider using the Thrust Stance to charge up attacks from a distance and shatter them.\nAt the foot of the large archway stands another new enemy, the Spearbone. These warriors with horse skull heads adorned with brambles are very durable enemies, and will roar before stabbing and slashing with their hefty spears. Since they are slow to hit, engage in light attack combos and watch their moments to know when to dodge or try a strike through.\nAs you enter the Fright Cliff proper, another Pitstone enemy waits up the path, with a Blazebone enemy on a ledge to the right to try and pepper you with projectiles.\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.",
    "h2_content": "### The First Buddha’s Eyeball\nJust up the sloping path, you should spot the smoke trail of the Fright Cliff’s Shrine up ahead, and just before it, ominous chanting. The chanting comes from a large buddha head statue in the ground, and by interacting with it, you can claim the Buddha’s Eyeball. In fact, there are six of them to find the Fright Cliff, and we’ll track them all down before long, as they can unlock a secret boss fight!\nAfter resting at the Shrine, you’ll have two paths - one leading into a darkened area on the left, and the brighter path along the cliffs to the right with a narrow ravine.\nIf you head left first, you’ll find a small pathway where a Bladebone will spew projectiles at you from a scaffold you can’t reach, but you can duck into and find a green Wisp to absorb in a small room.\nHead past the ranged attacker above (note the Aged Ginseng on the left is actually a Ginsengling), and go through a doorway to spy a large cave entrance up ahead. Stick to the right to find a sloping path back, and a new stony enemy variant will burrow out of the ground.\nPalestones, like Pitstones, are durable bulky enemies who will try to spin and bash into you with their sharp quartz shells to deal a lot of damage. Even worse, they’ll shake violently to shoot quartz projectiles out around them, and then target you even at a distance. Luckily, a charged hardy smack can severely wound them, so keep your distance and strafe until charged to cut them down to size.\nLook at the top of the ridge near where the Palestone emerged, and you can find a chest to open above the doorway you came through that holds 1 **Small Piece of Gold** and 3 **Tiny Piece of Gold**. Nearby, you can also find a wooden walkway taking you along the scaffolding that leads to the ranged Bladeblone that was harassing you earlier so you can deal with it.\nThe large cave entrance has a few paths, with the outer one on the right leading past another Pitstone to a wooden coffin chest holding 3 **Silk** and some **Will**.\n### The Second Buddha’s Eyeball\nIgnore the middle path leading into the main cave entrance for the moment, and head toward the large open cave area to the left by following some braziers. They’ll lead toward a large ominous statue in the dark. More Palestones will try to ambush you here, and they guard another stone statue head at the foot of the larger statue’s altar. Examine it to gain another Buddha’s Eyeball.\nHead back to the Squall Hideout Shrine, and this time stay out in the sun to explore the other half of this area. The far right side has several enemies patrolling around, including a shield-bearing Spearbone that has a lot more defense than the Rat Soldier. You’ll want to chip away at the shield with charged heavy strikes until he’s defenseless before Immobilizing him, and dodging the shield charges and bashes.\nLook for a large sloping path upward on the far side of the valley that’s guarded by a Blazebone on a ledge, and head past to find a lone Pitstone by the cliff edge that guards another wooden chest. Open it and you’ll find a **Mind Core** , 3 **Silk** , and more **Will**.\nReturning back down the slope, you’ll find a small crevice cutting through the area, with ruins above on the right. Stick to these ruins for the moment so you don’t get ambushed by ranged attackers when exploring the crevice.\nStart by luring the shieldless Spearbone out of range of the Blazebones above, then climb the stairs to rush down the projectile throwers. Be sure to look at the ruined home at the first landing below the first Blazebone for a yellow chest that has 2 **Yaoguai Core** and 3 **Tiny Piece of Gold**.\n### The Third Buddha’s Eyeball\nFight your way to the top of the stairs and keep staff spinning to deflect the ranged attacks until all the Blazebones are dead. At the end of this high raised wooden platform you’ll find another of the giant statue heads, allowing you to take its Buhdda’s Eyeball.\nAs you grab the eye, you may hear someone calling out to you from down below. Backtrack down to the crevice entrance, and head under the bridge, while watching for ambushes by a new stone enemy variant. The Poisestone is a much smaller and more agile version of the Palestone, able to dash around and expel poison projectiles. Defeating it will remove the stone body, but the legs will survive, and start to deploy devastating kicks if you don’t lock them down and destroy them.\nAt the end of the crevice, you’ll find an unusual looking stone. He’s actually a Man-in-Stone, and claims to have been trapped within the rock form. He’s betting on one of the rock guai in the large cave nearby to hold the secrets to reversing his fate, and asks you to seek it out.\n### The Fourth Buddha’s Eyeball\nAs you leave the crevice with the Man-in-Stone, stick to the left wall going up to find several paths leading toward the large cave. Halfway up this sloping path just above where the Man-in-Stone is in the crevice below, you’ll find another of the large stone heads chanting, and can claim it’s Buddha’s Eyeball.\nNow take one of the side paths to return to the large cave entrance, and look for a tunnel with some torches and a faint green light. The dark cave tunnel holds a green Wisp you can absorb to refill a bit of your Gourd, but beware, as the place is the perfect ambush spot.\nAdvance cautiously to spy a Poisestone and two Bladebones on some scaffolding awaiting your arrival. Use Cloudstep to ambush the weaker enemies first, then slam into the Poisestone with a charged hit to put it down.\nNear this defensive outpost is another tunnel exit, and you can step out quickly to find a Spearbone with a shield, who guards the outdoor path that connects back down to the crevice. Back in the cave, you can check the left wall to find another green Wisp to absorb, and note the golden trail of a nearby Shrine at another tunnel exit up ahead. It’s not a bad idea to activate and rest at this **Rockrest Flat Shrine** first, considering the quest we still have to finish the cave first that can be tough.\nLook for the continuing cave path left of the exit that heads up a grassy slope, and collect the Fire Bellflower before you reach an open area with a Poisetone seemingly praying at an altar on the left with a green Wisp.\nYou’ll soon be ambushed by another Poisestone nearby, but this one is wreathed in blue flames and is much stronger. On the plus side, defeating it will earn you the Poisestone Spirit to transform into!\nAt the end of the cave path, you’ll find the object of the Man-in-Stone’s quest - an even larger statue embedded with shining blue crystals. Don’t get too enraptured that you miss a Poisestone along the walls trying to ambush you, though.\n### The Fifth Buddha’s Eyeball\nUpon reaching the end of the large cave system where you’ll find the Mother of Stones, look for a large opening to the right to exit back outside and onto a cliff edge. There’s a raised platform here, and you’ll find another statue head to harvest its Buddha Eyeball.\n### Yaoguai Chief Mini-Boss Fight - Mother of Stones\nThis boss battle is an interesting one, simply because the giant crystal-embedded statue known as the Mother of Stones doesn’t actually fight you. It doesn’t really move at all, but it has a lot of health to slowly chip through.\nWhat will fight you, however, is the army of Palestones you can spot embedded in the ground and walls all around you. Make no mistake, this will be an endurance battle, as you’ll need to survive repeated encounters with more and more Palestones.\nAfter taking enough damage, the Mother of Stones will let out a roar, signaling a Palestone will quickly appear to defend her. That’s your cue to immediately break off your attack, regain your stamina, and be ready to dodge the incoming stone monster. Survival will hinge on how well you can deal with each wave while taking minimal damage, and understanding their melee and ranged attacks.\nOnce you’ve defeated two waves of single Palestones each, the third wave will consist of two Palestones at the same time. This can be a huge problem fast if they gang up on you with alternating attacks. Deflecting their ranged quartz missiles isn’t too bad… until you’re also dealing with one trying to body slam you.\nThis is the time to use everything in your arsenal to stay alive. Make sure you’re using your Spirit attacks to focus fire a target, unleash any stored Focus Points, and use Immobilize or Cloud Step to stay out of danger.\nThere’s one last wave of two after this, for a total of six Palestones for the whole fight. Again, don’t hold back, and use your Transformation Spell to power down at least one of the enemies as quickly as possible so you aren’t overwhelmed. Don’t be afraid to back well off and heal to stay out of range of their projectiles.\nOnce all six Palestones are down, there’s nothing left that the Mother of Stones can do, so keep smacking it until the boss breaks apart. You’ll be awarded the **Stone Essence** Key Item, as well as some Stone Spirits and Yaoguai Cores.\nMother of Stones\nRest up, and then return to the Man-in-Stone. You may want to also clear out the Bladebones above him just so they don’t harass you as you try to turn in the Stone Essence.\nOnce you hand it over, the Man-in-Stone will burst out of the ground and declare you gullible for just giving it to him. That’s not very nice, and it sounds like he deserves a beatdown.\nWhile he technically has a boss health bar and everything, he’s kind of a pushover, barely having much more health than a regular Pinstone, and only doing their regular attacks anyway. Simply Immobilize him, rack up some Focus Points, and deliver a charged strike to send him packing.\nRealizing the error of his ways, the Man-in-Stone will promptly burrow right back in the ground and plead for mercy. You’ll then be able to re-harvest the Stone Essence from him, which will turn into the **Azure Dust Transformation Spell**! Finally, the slow yet sturdy power of the Rock Guai is yours to command in battle!\nMan-in-Stone\nUnlike the Red Waves wolf transformation, you’ll be extremely slow, unable to dodge, and overall be a pretty big target. On the plus side, you’ll be immune to all status effects while transformed, and deal incredible damage that staggers most enemies. Instead of Might building on attack, you’ll build it while taking damage, allowing you to soak blows and unleash a powerful jump attack spell in return!\nAs an added bonus, if you keep hassling the Man-in-Stone, he’ll promise to prepare wares to sell the next time you visit. Be sure to take him up on this offer, as he’ll have a decent selection of (very high-priced) goods!\nMan-in-Stone's Shop\n---\nBlood of the Iron Bull - 3280 Will | Gold Ridge Beast - 12800 Will\nIron Pellet - 6480 Will |\nGoldflora Hairpin - 12800 Will |\nSobering Stone - 6480 Will |",
    "promot": "This is an excerpt from the file 'Fright_Cliff_Walkthrough.md', located in the main section titled 'Fright Cliff Walkthrough'. The section summary is: Fright Cliff is one of two possible second main regions of Chapter 2 in the Yellow Wind Ridge of Black Myth: Wukong. Below you'll find a guide for the Fright Cliff Region and its side quests for the Man-in-Stone and Yellow-Robed Squire, as well as how to defeat its many bosses that include the Mother of Stones and Stone Vanguard to get the Sterness of Stone.\n* **Jump to A Section:**\n* **Squall Hideout**\n* Yaoguai Chief - Mother of Stones\n* **Rockrest Flat**\n* Yaoguai King - Stone Vanguard\n* **Rock Crash Platform**\nFright Cliff is one of the two sub-regions you’ll need to explore in Chapter 2 of Black Myth Wukong in order to unlock the large sealed doors that lead to the end of the chapter. You can first reach this area by heading through the Sandgate Village and defeating the King of Flowing Sands and Second Rat Prince, and then crossing the bridge to the right of the sealed door.\nAs you cross the bridge, you can harvest some Licorice on the other side, and look to the left to spot a large archway in the distance, with a whirling black tornado even further left in a canyon separating the Fright Cliffs from the Crouching Tiger Temple.\nHeading toward the archway in the distance, you can find a green Wisp to absorb on the left side of the broken rock pathway, and on the right is a new type of enemy that will try to ambush you. This Pitstone is a mass of rock and skulls on legs, and will try to use its weight to jump down on you, and perform somersaults to use its momentum to slam into you. If they prove to be a problem to evade, consider using the Thrust Stance to charge up attacks from a distance and shatter them.\nAt the foot of the large archway stands another new enemy, the Spearbone. These warriors with horse skull heads adorned with brambles are very durable enemies, and will roar before stabbing and slashing with their hefty spears. Since they are slow to hit, engage in light attack combos and watch their moments to know when to dodge or try a strike through.\nAs you enter the Fright Cliff proper, another Pitstone enemy waits up the path, with a Blazebone enemy on a ledge to the right to try and pepper you with projectiles.\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Squall Hideout', and the detailed content is as follows:\n### The First Buddha’s Eyeball\nJust up the sloping path, you should spot the smoke trail of the Fright Cliff’s Shrine up ahead, and just before it, ominous chanting. The chanting comes from a large buddha head statue in the ground, and by interacting with it, you can claim the Buddha’s Eyeball. In fact, there are six of them to find the Fright Cliff, and we’ll track them all down before long, as they can unlock a secret boss fight!\nAfter resting at the Shrine, you’ll have two paths - one leading into a darkened area on the left, and the brighter path along the cliffs to the right with a narrow ravine.\nIf you head left first, you’ll find a small pathway where a Bladebone will spew projectiles at you from a scaffold you can’t reach, but you can duck into and find a green Wisp to absorb in a small room.\nHead past the ranged attacker above (note the Aged Ginseng on the left is actually a Ginsengling), and go through a doorway to spy a large cave entrance up ahead. Stick to the right to find a sloping path back, and a new stony enemy variant will burrow out of the ground.\nPalestones, like Pitstones, are durable bulky enemies who will try to spin and bash into you with their sharp quartz shells to deal a lot of damage. Even worse, they’ll shake violently to shoot quartz projectiles out around them, and then target you even at a distance. Luckily, a charged hardy smack can severely wound them, so keep your distance and strafe until charged to cut them down to size.\nLook at the top of the ridge near where the Palestone emerged, and you can find a chest to open above the doorway you came through that holds 1 **Small Piece of Gold** and 3 **Tiny Piece of Gold**. Nearby, you can also find a wooden walkway taking you along the scaffolding that leads to the ranged Bladeblone that was harassing you earlier so you can deal with it.\nThe large cave entrance has a few paths, with the outer one on the right leading past another Pitstone to a wooden coffin chest holding 3 **Silk** and some **Will**.\n### The Second Buddha’s Eyeball\nIgnore the middle path leading into the main cave entrance for the moment, and head toward the large open cave area to the left by following some braziers. They’ll lead toward a large ominous statue in the dark. More Palestones will try to ambush you here, and they guard another stone statue head at the foot of the larger statue’s altar. Examine it to gain another Buddha’s Eyeball.\nHead back to the Squall Hideout Shrine, and this time stay out in the sun to explore the other half of this area. The far right side has several enemies patrolling around, including a shield-bearing Spearbone that has a lot more defense than the Rat Soldier. You’ll want to chip away at the shield with charged heavy strikes until he’s defenseless before Immobilizing him, and dodging the shield charges and bashes.\nLook for a large sloping path upward on the far side of the valley that’s guarded by a Blazebone on a ledge, and head past to find a lone Pitstone by the cliff edge that guards another wooden chest. Open it and you’ll find a **Mind Core** , 3 **Silk** , and more **Will**.\nReturning back down the slope, you’ll find a small crevice cutting through the area, with ruins above on the right. Stick to these ruins for the moment so you don’t get ambushed by ranged attackers when exploring the crevice.\nStart by luring the shieldless Spearbone out of range of the Blazebones above, then climb the stairs to rush down the projectile throwers. Be sure to look at the ruined home at the first landing below the first Blazebone for a yellow chest that has 2 **Yaoguai Core** and 3 **Tiny Piece of Gold**.\n### The Third Buddha’s Eyeball\nFight your way to the top of the stairs and keep staff spinning to deflect the ranged attacks until all the Blazebones are dead. At the end of this high raised wooden platform you’ll find another of the giant statue heads, allowing you to take its Buhdda’s Eyeball.\nAs you grab the eye, you may hear someone calling out to you from down below. Backtrack down to the crevice entrance, and head under the bridge, while watching for ambushes by a new stone enemy variant. The Poisestone is a much smaller and more agile version of the Palestone, able to dash around and expel poison projectiles. Defeating it will remove the stone body, but the legs will survive, and start to deploy devastating kicks if you don’t lock them down and destroy them.\nAt the end of the crevice, you’ll find an unusual looking stone. He’s actually a Man-in-Stone, and claims to have been trapped within the rock form. He’s betting on one of the rock guai in the large cave nearby to hold the secrets to reversing his fate, and asks you to seek it out.\n### The Fourth Buddha’s Eyeball\nAs you leave the crevice with the Man-in-Stone, stick to the left wall going up to find several paths leading toward the large cave. Halfway up this sloping path just above where the Man-in-Stone is in the crevice below, you’ll find another of the large stone heads chanting, and can claim it’s Buddha’s Eyeball.\nNow take one of the side paths to return to the large cave entrance, and look for a tunnel with some torches and a faint green light. The dark cave tunnel holds a green Wisp you can absorb to refill a bit of your Gourd, but beware, as the place is the perfect ambush spot.\nAdvance cautiously to spy a Poisestone and two Bladebones on some scaffolding awaiting your arrival. Use Cloudstep to ambush the weaker enemies first, then slam into the Poisestone with a charged hit to put it down.\nNear this defensive outpost is another tunnel exit, and you can step out quickly to find a Spearbone with a shield, who guards the outdoor path that connects back down to the crevice. Back in the cave, you can check the left wall to find another green Wisp to absorb, and note the golden trail of a nearby Shrine at another tunnel exit up ahead. It’s not a bad idea to activate and rest at this **Rockrest Flat Shrine** first, considering the quest we still have to finish the cave first that can be tough.\nLook for the continuing cave path left of the exit that heads up a grassy slope, and collect the Fire Bellflower before you reach an open area with a Poisetone seemingly praying at an altar on the left with a green Wisp.\nYou’ll soon be ambushed by another Poisestone nearby, but this one is wreathed in blue flames and is much stronger. On the plus side, defeating it will earn you the Poisestone Spirit to transform into!\nAt the end of the cave path, you’ll find the object of the Man-in-Stone’s quest - an even larger statue embedded with shining blue crystals. Don’t get too enraptured that you miss a Poisestone along the walls trying to ambush you, though.\n### The Fifth Buddha’s Eyeball\nUpon reaching the end of the large cave system where you’ll find the Mother of Stones, look for a large opening to the right to exit back outside and onto a cliff edge. There’s a raised platform here, and you’ll find another statue head to harvest its Buddha Eyeball.\n### Yaoguai Chief Mini-Boss Fight - Mother of Stones\nThis boss battle is an interesting one, simply because the giant crystal-embedded statue known as the Mother of Stones doesn’t actually fight you. It doesn’t really move at all, but it has a lot of health to slowly chip through.\nWhat will fight you, however, is the army of Palestones you can spot embedded in the ground and walls all around you. Make no mistake, this will be an endurance battle, as you’ll need to survive repeated encounters with more and more Palestones.\nAfter taking enough damage, the Mother of Stones will let out a roar, signaling a Palestone will quickly appear to defend her. That’s your cue to immediately break off your attack, regain your stamina, and be ready to dodge the incoming stone monster. Survival will hinge on how well you can deal with each wave while taking minimal damage, and understanding their melee and ranged attacks.\nOnce you’ve defeated two waves of single Palestones each, the third wave will consist of two Palestones at the same time. This can be a huge problem fast if they gang up on you with alternating attacks. Deflecting their ranged quartz missiles isn’t too bad… until you’re also dealing with one trying to body slam you.\nThis is the time to use everything in your arsenal to stay alive. Make sure you’re using your Spirit attacks to focus fire a target, unleash any stored Focus Points, and use Immobilize or Cloud Step to stay out of danger.\nThere’s one last wave of two after this, for a total of six Palestones for the whole fight. Again, don’t hold back, and use your Transformation Spell to power down at least one of the enemies as quickly as possible so you aren’t overwhelmed. Don’t be afraid to back well off and heal to stay out of range of their projectiles.\nOnce all six Palestones are down, there’s nothing left that the Mother of Stones can do, so keep smacking it until the boss breaks apart. You’ll be awarded the **Stone Essence** Key Item, as well as some Stone Spirits and Yaoguai Cores.\nMother of Stones\nRest up, and then return to the Man-in-Stone. You may want to also clear out the Bladebones above him just so they don’t harass you as you try to turn in the Stone Essence.\nOnce you hand it over, the Man-in-Stone will burst out of the ground and declare you gullible for just giving it to him. That’s not very nice, and it sounds like he deserves a beatdown.\nWhile he technically has a boss health bar and everything, he’s kind of a pushover, barely having much more health than a regular Pinstone, and only doing their regular attacks anyway. Simply Immobilize him, rack up some Focus Points, and deliver a charged strike to send him packing.\nRealizing the error of his ways, the Man-in-Stone will promptly burrow right back in the ground and plead for mercy. You’ll then be able to re-harvest the Stone Essence from him, which will turn into the **Azure Dust Transformation Spell**! Finally, the slow yet sturdy power of the Rock Guai is yours to command in battle!\nMan-in-Stone\nUnlike the Red Waves wolf transformation, you’ll be extremely slow, unable to dodge, and overall be a pretty big target. On the plus side, you’ll be immune to all status effects while transformed, and deal incredible damage that staggers most enemies. Instead of Might building on attack, you’ll build it while taking damage, allowing you to soak blows and unleash a powerful jump attack spell in return!\nAs an added bonus, if you keep hassling the Man-in-Stone, he’ll promise to prepare wares to sell the next time you visit. Be sure to take him up on this offer, as he’ll have a decent selection of (very high-priced) goods!\nMan-in-Stone's Shop\n---\nBlood of the Iron Bull - 3280 Will | Gold Ridge Beast - 12800 Will\nIron Pellet - 6480 Will |\nGoldflora Hairpin - 12800 Will |\nSobering Stone - 6480 Will |",
    "promot_tokens_num": 3060
}