{
    "chunk_id": 741415327730,
    "source_file": "Keeper_of_the_Flaming_Mountains_and_Yin-Yang_Fish.md",
    "content_type": "one and two",
    "h1_title": "Keeper of the Flaming Mountains and Yin-Yang Fish",
    "h2_title": "Keeper of the Flaming Mountains and Yin-Yang Fish Boss Fight and Guide",
    "h1_content": "The Keeper of the Flaming Mountains is a Character boss, while the Yin-Yang Fish is a Yaoguai King you'll fight at the start of The Emerald Hall in Chapter 5 in Black Myth: Wukong. The Keeper of the Flaming Mountains is a master of deception and uses his Yin-Yang ability to produce more than just the Yin-Yang Fish in this showdown.",
    "h2_content": "The Keeper of the Flaming Mountains will transport you to another place, in a monochrome illusion where he uses the power of yin-yang. Zhu Bajie will be there to help you at first, so focus on attacking the Keeper of the Flaming Mountains as quickly as you can. This is a two-phase fight, and as you might expect, the second phase is where the action really begins.\nIn the first phase, try to hold off on using your spells as much as you can. Instead, try to be aggressive and relentlessly attack the Keeper of the Flaming Mountains while he's on the ground.\nHe will start to attack using white projectiles, which can be dodged or outrun. When you've got his health down to around 60-70%, he will use the white and black orbs to summon undead enemies.\nThe white revenants are large enemies with clubs, while the black revenants are archers. These are the ones you want to target, as their ranged attacks can be annoying and do the most damage. Clear these revenants out as quickly as possible, to get it back to a fight against just the Keeper of the Flaming Mountains.\nWhen you've got his health down to around 30%, Zhu Bajie will leave you to take him on one-on-one. The aim is still to just attack normally to get his health bar down quickly.\nWhen he's almost dead, he will then summon Ma Tianba for you to fight against.\n### Missable Transformation Spell\nAs we mentioned earlier, at the start of Furnace Valley there is a dead cart. You need to pull the string and exhaust the dialogue from the horse guai Ma Tianba before you defeat him in this fight. Otherwise, you will miss out on the Dark Thunder Transformation Spell. Once you've beaten the Keeper of the Flaming Mountains and the Yin-Yang Fish, return to the cart and pull the string to get the Transformation Spell.\nMa Tianba uses a whip and has his own health bar that resembles a normal enemy's health bar. The fight is fairly straightforward in this first phase, but as soon as you've defeated the horse guai, the Keeper of the Flaming Mountains drops the Yin-Yang Fish into the water.\nThe giant creature soon emerges and will begin attacking. It has a variety of moves that you'll see it perform during the fight. But the main thing is now you should make use of all your spells and transformations that you saved from the first round.\nYou'll see the Yin-Yang Fish rear itself up from the water and spray a jet at you, or flip itself up and over, to try and hit you with a tail flick. Staying close to it will stop it from being able to hit you with the jet spray, but will make it more likely to try and tail-whip you.\nIt will also use projectiles and throw out orbs to chase you down. These can be dodged or outrun in a similar manner to that of the Keeper of the Flaming Mountain's attacks.\nWhen you've knocked its health down to almost halfway, it will begin to move quite erratically and cover a large amount of distance across the arena. Use Cloudstep to catch up to it and sneakily attack and Immobilize to temporarily halt it from darting off.\nThis is also when it will begin to float up in the air and throw the projectiles down. You'll need to dodge in quick succession to avoid these.\nKeeper of the Flaming Mountains",
    "promot": "This is an excerpt from the file 'Keeper_of_the_Flaming_Mountains_and_Yin-Yang_Fish.md', located in the main section titled 'Keeper of the Flaming Mountains and Yin-Yang Fish'. The section summary is: The Keeper of the Flaming Mountains is a Character boss, while the Yin-Yang Fish is a Yaoguai King you'll fight at the start of The Emerald Hall in Chapter 5 in Black Myth: Wukong. The Keeper of the Flaming Mountains is a master of deception and uses his Yin-Yang ability to produce more than just the Yin-Yang Fish in this showdown. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Keeper of the Flaming Mountains and Yin-Yang Fish Boss Fight and Guide', and the detailed content is as follows:\nThe Keeper of the Flaming Mountains will transport you to another place, in a monochrome illusion where he uses the power of yin-yang. Zhu Bajie will be there to help you at first, so focus on attacking the Keeper of the Flaming Mountains as quickly as you can. This is a two-phase fight, and as you might expect, the second phase is where the action really begins.\nIn the first phase, try to hold off on using your spells as much as you can. Instead, try to be aggressive and relentlessly attack the Keeper of the Flaming Mountains while he's on the ground.\nHe will start to attack using white projectiles, which can be dodged or outrun. When you've got his health down to around 60-70%, he will use the white and black orbs to summon undead enemies.\nThe white revenants are large enemies with clubs, while the black revenants are archers. These are the ones you want to target, as their ranged attacks can be annoying and do the most damage. Clear these revenants out as quickly as possible, to get it back to a fight against just the Keeper of the Flaming Mountains.\nWhen you've got his health down to around 30%, Zhu Bajie will leave you to take him on one-on-one. The aim is still to just attack normally to get his health bar down quickly.\nWhen he's almost dead, he will then summon Ma Tianba for you to fight against.\n### Missable Transformation Spell\nAs we mentioned earlier, at the start of Furnace Valley there is a dead cart. You need to pull the string and exhaust the dialogue from the horse guai Ma Tianba before you defeat him in this fight. Otherwise, you will miss out on the Dark Thunder Transformation Spell. Once you've beaten the Keeper of the Flaming Mountains and the Yin-Yang Fish, return to the cart and pull the string to get the Transformation Spell.\nMa Tianba uses a whip and has his own health bar that resembles a normal enemy's health bar. The fight is fairly straightforward in this first phase, but as soon as you've defeated the horse guai, the Keeper of the Flaming Mountains drops the Yin-Yang Fish into the water.\nThe giant creature soon emerges and will begin attacking. It has a variety of moves that you'll see it perform during the fight. But the main thing is now you should make use of all your spells and transformations that you saved from the first round.\nYou'll see the Yin-Yang Fish rear itself up from the water and spray a jet at you, or flip itself up and over, to try and hit you with a tail flick. Staying close to it will stop it from being able to hit you with the jet spray, but will make it more likely to try and tail-whip you.\nIt will also use projectiles and throw out orbs to chase you down. These can be dodged or outrun in a similar manner to that of the Keeper of the Flaming Mountain's attacks.\nWhen you've knocked its health down to almost halfway, it will begin to move quite erratically and cover a large amount of distance across the arena. Use Cloudstep to catch up to it and sneakily attack and Immobilize to temporarily halt it from darting off.\nThis is also when it will begin to float up in the air and throw the projectiles down. You'll need to dodge in quick succession to avoid these.\nKeeper of the Flaming Mountains",
    "promot_tokens_num": 878
}