{
    "chunk_id": 219374894131,
    "source_file": "Sandgate_Village_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Sandgate Village Walkthrough",
    "h2_title": "Yellow Wind Ridge",
    "h1_content": "Black Myth: Wukong's Chapter 2 begins at the outskirts of a Village in the Yellow Wind Ridge, which spreads out to reach multiple areas. Below you'll find a guide for the first major area of Yellow Wind Ridge: Sandgate Village, as well as how to defeat its many bosses that include Lang-Li-Guhh-Baw, the Earth Wolf, the King of Flowing Sands and his First and Second Rat Princes.\n* **Jump to A Section:**\n* **Village Entrance**\n* Yaoguai Chief - Lang-Li-Guhh-Baw\n* Yaoguai Chief - Earth Wolf\n* Yaoguai Chief - King of Flowing Sands and Second Rat Prince\n* **Valley of Despair**\n* Yaoguai Chief - First Prince of Flowing Sands\nIn Black Myth Wukong’s second chapter, you’ll leave behind the forests of Black Wind Mountain for the dry sands of the Yellow Wind Ridge. An energetic (yet headless) man ing a Chinese lute (known as a sanxian) will set the stage for this realm, and helpfully revive our Destined One from becoming a pincushion full of arrows.",
    "h2_content": "When you regain control, head into the stagnant shallow pool of water, where you’ll find a few Jade Lotus to harvest. Over on the right, the source of the arrows you became riddled with will become apparent, as a nearby ridge is lined with Rat Archers who will fire long salvos of flaming arrows from above.\nSprint past them along the water until you can find a small area to climb up onto, where a Rat Soldier will engage you from the left. Be sure to strafe around to keep the archers between you and the soldier, and bait out his shield slam before hitting him with a heavy attack to shatter his shield (the shield’s health appears as a white bar above his health bar).\nCross the small wooden bridge to find another Rat Soldier below the two Rat Archers, and try to lure him away and out of sight if possible. To take on the archers, make use of your Cloud Step to evade their fire and take out the top targets before working your way down, using your staff spin to deflect while waiting for your Cloud Step to recharge. Beware, as they can also toss grenades that can explode in your face with little warning.\nA large stone arch behind the archers has a new violet Licorice plant you can harvest, and the stone stairs beyond lead to an altar with a special **Lambbrew Drink** for your Gourd. Unlike the instant heal of the Coconut Wine, it will heal a small amount at first, but a larger portion of your health bar over time. However, you’ll also find that it can only be upgraded once, compared to the multiple tiers of health increase that you can invest in the other drink.\nHead back down to the pond, and you’ll find the waterway leads on a bit past several Croaky frog enemies, as well as a new kind of Rat standing by the shore. This Rat Governor wields an electric staff, which he can charge up and zap you from a distance with after a flourish, or perform a backwards jump to zap you in mid-air. If you take enough shock damage, you’ll reach a state where all incoming damage is doubled, so avoid these blasts at all costs and shut him down with Immobilize.\nPast the Rat Governor, you may see a flooded pit below with a large Toad Yaoguai, but for now it’s better to return to where the first Rat Soldier was and look for a path up into the hills that skirts this pit.\nKeep following it along some wooden scaffolding above a ravine leading back to the pit, and you’ll see a settlement up ahead, plus the first of the Keeper’s Shrines guarded by another Rat Soldier.",
    "promot": "This is an excerpt from the file 'Sandgate_Village_Walkthrough.md', located in the main section titled 'Sandgate Village Walkthrough'. The section summary is: Black Myth: Wukong's Chapter 2 begins at the outskirts of a Village in the Yellow Wind Ridge, which spreads out to reach multiple areas. Below you'll find a guide for the first major area of Yellow Wind Ridge: Sandgate Village, as well as how to defeat its many bosses that include Lang-Li-Guhh-Baw, the Earth Wolf, the King of Flowing Sands and his First and Second Rat Princes.\n* **Jump to A Section:**\n* **Village Entrance**\n* Yaoguai Chief - Lang-Li-Guhh-Baw\n* Yaoguai Chief - Earth Wolf\n* Yaoguai Chief - King of Flowing Sands and Second Rat Prince\n* **Valley of Despair**\n* Yaoguai Chief - First Prince of Flowing Sands\nIn Black Myth Wukong’s second chapter, you’ll leave behind the forests of Black Wind Mountain for the dry sands of the Yellow Wind Ridge. An energetic (yet headless) man ing a Chinese lute (known as a sanxian) will set the stage for this realm, and helpfully revive our Destined One from becoming a pincushion full of arrows. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Yellow Wind Ridge', and the detailed content is as follows:\nWhen you regain control, head into the stagnant shallow pool of water, where you’ll find a few Jade Lotus to harvest. Over on the right, the source of the arrows you became riddled with will become apparent, as a nearby ridge is lined with Rat Archers who will fire long salvos of flaming arrows from above.\nSprint past them along the water until you can find a small area to climb up onto, where a Rat Soldier will engage you from the left. Be sure to strafe around to keep the archers between you and the soldier, and bait out his shield slam before hitting him with a heavy attack to shatter his shield (the shield’s health appears as a white bar above his health bar).\nCross the small wooden bridge to find another Rat Soldier below the two Rat Archers, and try to lure him away and out of sight if possible. To take on the archers, make use of your Cloud Step to evade their fire and take out the top targets before working your way down, using your staff spin to deflect while waiting for your Cloud Step to recharge. Beware, as they can also toss grenades that can explode in your face with little warning.\nA large stone arch behind the archers has a new violet Licorice plant you can harvest, and the stone stairs beyond lead to an altar with a special **Lambbrew Drink** for your Gourd. Unlike the instant heal of the Coconut Wine, it will heal a small amount at first, but a larger portion of your health bar over time. However, you’ll also find that it can only be upgraded once, compared to the multiple tiers of health increase that you can invest in the other drink.\nHead back down to the pond, and you’ll find the waterway leads on a bit past several Croaky frog enemies, as well as a new kind of Rat standing by the shore. This Rat Governor wields an electric staff, which he can charge up and zap you from a distance with after a flourish, or perform a backwards jump to zap you in mid-air. If you take enough shock damage, you’ll reach a state where all incoming damage is doubled, so avoid these blasts at all costs and shut him down with Immobilize.\nPast the Rat Governor, you may see a flooded pit below with a large Toad Yaoguai, but for now it’s better to return to where the first Rat Soldier was and look for a path up into the hills that skirts this pit.\nKeep following it along some wooden scaffolding above a ravine leading back to the pit, and you’ll see a settlement up ahead, plus the first of the Keeper’s Shrines guarded by another Rat Soldier.",
    "promot_tokens_num": 853
}