{
    "chunk_id": 447094150784,
    "source_file": "Red_Tides.md",
    "content_type": "one and two",
    "h1_title": "Red Tides",
    "h2_title": "Black Myth: Wukong Red Tides Location",
    "h1_content": "Red Tides is one of the Transformation Spells found within Black Myth: Wukong. It is one of the most powerful Transformations you can find within the game's early chapters, thanks to its extremely strong heavy attacks.\nThe Spell allows you to transform into a wolf guai and inflict Scorch Bane on the enemy with each attack. Red Tides' moveset is as follows:\n* **Light Attack: Moon Dance - Continuously slash at the enemy building up Focus.** This is a fast flurry of swings with Red Tides' blade that can stun-lock an enemy and catch them off guard from behind.\n* **Heavy Attack: Moon Chase - Unleash a series of dash attacks.** This attack can be performed with or without focus to dash across an area, performing a potent strike as you do so.\n* **Follow Dodge With Heavy Attack - Perform a powerful set of slams after dodging.** This is Red Tides' strongest move, consisting of a slam. Several vertical slams can devastate an opponent's or boss' health bar and can be performed by repeatedly performing a Heavy Attack after using the first one following a dodge.",
    "h2_content": "Red Tides can be obtained by defeating Guangzhi in Forest of Wolves - Outside the Forest area in Black Wind Mountain. He is located at the far back, past the small bridge in the forest.\nThis is an optional boss, and with him being accessible so early in the game, you may struggle. However, our Guangzhi boss guide will help you out.\nWith the Transformation, you can equip it and switch to it at any point from the Shrine. Simply choose 'Reignite The Sparks' and 'Set Spells'.\nRed Tides",
    "promot": "This is an excerpt from the file 'Red_Tides.md', located in the main section titled 'Red Tides'. The section summary is: Red Tides is one of the Transformation Spells found within Black Myth: Wukong. It is one of the most powerful Transformations you can find within the game's early chapters, thanks to its extremely strong heavy attacks.\nThe Spell allows you to transform into a wolf guai and inflict Scorch Bane on the enemy with each attack. Red Tides' moveset is as follows:\n* **Light Attack: Moon Dance - Continuously slash at the enemy building up Focus.** This is a fast flurry of swings with Red Tides' blade that can stun-lock an enemy and catch them off guard from behind.\n* **Heavy Attack: Moon Chase - Unleash a series of dash attacks.** This attack can be performed with or without focus to dash across an area, performing a potent strike as you do so.\n* **Follow Dodge With Heavy Attack - Perform a powerful set of slams after dodging.** This is Red Tides' strongest move, consisting of a slam. Several vertical slams can devastate an opponent's or boss' health bar and can be performed by repeatedly performing a Heavy Attack after using the first one following a dodge. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Red Tides Location', and the detailed content is as follows:\nRed Tides can be obtained by defeating Guangzhi in Forest of Wolves - Outside the Forest area in Black Wind Mountain. He is located at the far back, past the small bridge in the forest.\nThis is an optional boss, and with him being accessible so early in the game, you may struggle. However, our Guangzhi boss guide will help you out.\nWith the Transformation, you can equip it and switch to it at any point from the Shrine. Simply choose 'Reignite The Sparks' and 'Set Spells'.\nRed Tides",
    "promot_tokens_num": 412
}