{
    "chunk_id": 325218924338,
    "source_file": "Buddha's_Right_Hand.md",
    "content_type": "one and two",
    "h1_title": "Buddha's Right Hand",
    "h2_title": "Where to Find the Buddha's Right Hand",
    "h1_content": "The Buddha's Right Hand is a required Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the middle section of The Webbed Hollow, this creepy long hand is more than it seems, and blocks the passage down to the Lower Hollow.\n* Rewards: Buddha's Right Hand (Key Item), Past-Echo, Fine Gold Thread, Cold Iron Leaves, 2274 Experience, 1933 Will",
    "h2_content": "The Buddha's Right Hand is an main boss and non-missable encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down to the Vedure Bridge Shrine and defeating the Centipede Guai in the Bonevault, follow the linear path up to the Cliff of Oblivion.\nJust past the Shrine, you'll find a narrow passageway with a creepy hand holding a mirror, but this is actually the boss fight you seek!",
    "promot": "This is an excerpt from the file 'Buddha's_Right_Hand.md', located in the main section titled 'Buddha's Right Hand'. The section summary is: The Buddha's Right Hand is a required Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the middle section of The Webbed Hollow, this creepy long hand is more than it seems, and blocks the passage down to the Lower Hollow.\n* Rewards: Buddha's Right Hand (Key Item), Past-Echo, Fine Gold Thread, Cold Iron Leaves, 2274 Experience, 1933 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find the Buddha's Right Hand', and the detailed content is as follows:\nThe Buddha's Right Hand is an main boss and non-missable encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down to the Vedure Bridge Shrine and defeating the Centipede Guai in the Bonevault, follow the linear path up to the Cliff of Oblivion.\nJust past the Shrine, you'll find a narrow passageway with a creepy hand holding a mirror, but this is actually the boss fight you seek!",
    "promot_tokens_num": 262
}