{
    "chunk_id": 698755624196,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Forest of Wolves Walkthrough",
    "h2_title": "Outside the Forest",
    "h1_content": "Black Myth: Wukong's Chapter 1 begins with a prologue that takes place during a pivotal scene in the story of the Monkey King, Sun Wukong. Below you'll find a guide to the tutorial, and for the first major area of Black Wind Mountain: The Forest of Wolves, as well as how to defeat its many bosses that include the Bullguard, Gaugnzhi and Yaoguai King Lingxuzi.\n* **Jump to A Section:**\n* **Front Hills**\n* Yaoguai Chief - Bullguard\n* **Outside the Forest**\n* Yaoguai Chief - Guangzhi\n* **Guanyin Temple**\n* Yaoguai King - Lingxuzi\n# Prologue\nUpon beginning your journey, you’ll be thrust into the role of the mythical Sun Wukong as he rebels against the Court of Heaven and its Heavenly Kings. Undaunted by their army, Sun Wukong calls them out, prompting the nephew of the Jade Emperor, Erlang Shen, to meet him in combat.",
    "h2_content": "As you begin to leave the Shrine, the Keeper will stop and warn you of the dangers to come in this next area, and opt to give you a way to do some scouting first.\nYou’ll be transformed into a small Golden Cicada, which will allow you to fly around the next area to get a look at the dangers to come before you face them yourself. However, your flight time will be limited by the meter slowly fading in the bottom left, and whenever you run out of juice (or manually de-transform) you may find yourself in hot water, so how much you actually want to explore in this form is up to you.\nThe main path through is area is a very straightforward one, as you can simply follow the straight path past the first two Wolf guards near the Shrine, to a axe-wielding Wolf Stalwart by a small bridge over a stream, and then straight through a tunnel that’s guarded by an extremely tough (and very optional) mini-boss with a giant head.\nIn fact, this Wandering Wight is tougher than most things you’ll face in the whole chapter, so don’t feel like you need to stop and contend with this foe if you’d rather get stronger and gain access to more abilities first. Be sure to check out our guide on How to Defeat the Wandering Wight when you do.\nThere’s more optional things to explore in this wide area however, starting by taking the path to the left past the first two Wolves near the Shrine. Past several fallen trees, some **Purple Lingzhi** and **Aged Ginseng** , you can reach a small peak with broken pillars and a Wolf guarding some pots to break for Will.\nNear this peak is a bridge, where you’ll find a Bandit Chief with a large sword guarding a chest. He can perform some surprisingly agile lunging attacks, and his multi-hit sword swings can deal a lot of damage. Each of his combos end with a large downward slam, and gives you a wide opening to begin your counter-attack as he struggles to pull his blade out of the ground. For as tough as he is, he luckily won’t respawn when defeated.\nOnce he’s gone, help yourself to the chest to find 2 **Evil Repelling Medicament** and 5 **Tiny Piece of Gold**!\nThe bridge is guarded by a lone Wolf Archer, and a great time to test out the Destined One’s staff twirl ability. By holding down the L2/LT button, you can move your staff quickly to deflect incoming arrows. The Wolf will usually begin with a barrage of quick arrow shots, so be sure to keep holding the button down rather than tapping it until he stops. The move costs stamina to maintain so you can’t block shots forever — as soon as the arrows stop flying, dash across and defeat him before he finds more arrows.\nThere are many paths to go from here - either continuing to the far side of the stream, or heading back to keep exploring the previous side, including a path up to a high plateau with some **Aged Ginseng**. On the slope leading back down to the stream, another ginseng plant hides a surprise, as an earthen elemental Ginsengling Yaoguai will uncover itself with the ginseng growing from its head.\nThese monsters are surprisingly tough, and can slam their hands into the ground to grow poison roots that spread outward — so don’t be afraid to reposition yourself to fight somewhere else. Defeating them will earn you much more crafting materials than picking normal plants.\nFrom here, you can cross the stream to battle some more Wolf enemies on the other side, or look for a small path to the left leading up to a large waterfall with some **Jade Lotus** and another Crow Diviner enemy meditating by the falls.\nThe far side of the stream has many more materials to collect, and most importantly, a path leading from the bridge where the archer was to a small archway where another extremely important yet optional mini-boss awaits you.\n### Yaoguai Chief Mini-Boss Fight - Guangzhi\nThis Yaoguai Chief is a lot more intimidating than the Bullguard, but thankfully much more approachable than the Wandering Wight nearby, even with his fearsome looking fiery twinblade. Remember that you can purchase some Cooling Powder should you find yourself being lit on fire too much, as well as Evil Repelling Medicant to boost your damage absorption.\nThe flashing of his fiery weapon may seem impossible to dodge, but the key to this fight is understanding exactly when his attacks actually land so that you can dodge around them. Guangzhi usually starts by charging forth for a combo attack, but each attack will cause him to jump into the air with a flourish before actually attacking with downward swings. Wait to dodge all three swing attacks and then hit him with some of your own while he tries to recover.\nIf he starts to whirl his fiery blade in circles around him, be ready but don’t panic as his attack is yet to come — wait for him to raise the blade and twirl it high before swinging it from side to side in two slower hits.\nAnother scary move that may take a bit of practice to understand is his pogo jump: Watch for him to raise his weapon high and vertical over his head before slamming it down, and then somersaulting forward in quick succession to bounce off the ground off his weapon. After a short pause, he’ll leap up to slam down for a third attack, and then even higher up for one last pogo slam explosion. With the last two attacks being spaced out, stand your ground to wait for the drop to dodge around, and cast Immobilize once he’s grounded to pin him down while you unleash your attacks.\nAt range, he can still be a major problem as you learn his moves, as he can strike from a distance with very little warning. If you see him somersault backward and out of range of your strikes, don’t blindly rush in. He’ll pause for a moment, and then toss his twinblade at you like a boomerang that requires dodging as it spins toward you, and back to his hand.\nHe can also prepare a flourish before holding his weapon straight up at his side while in a small crouch. If you notice this new stance, be ready to dodge the instant he moves, as he’ll dash forward at an alarming speed, and then dash back to his original spot to try and catch you off-guard.\nAnother quick moving attack has a lengthy start up, as he’ll keep somersaulting backward and leaping to build up momentum, jumping high and pausing in the air before slamming forward with weapon blazing. If you have the Pillar Style unlocked, you can actually hold your Heavy Attack button to lift yourself off the ground and avoid the attack entirely! He’ll waste time twirling his blade after this strike, making it a good time to get your own hits in.\nRemember to apply your Immobilize spell when it serves you best — interrupting his charged up attacks or after a combo when he’s not up in the air so you can lay into him, and use it whenever the spell recharges. With enough damage dealt, the boss will fall, leaving his weapon embedded in the ground nearby.\nGuangzhi\nPick up the fiery blade, and you’ll learn a Transformation Spell: **Red Tides**. Now you’ll be able to transform into the very boss you defeated, and use his own abilities in combat against your enemies.\nTransformation Spells are very powerful, and essentially give you a separate health and might bar to work with. Might will decay fairly quickly over time, and even more if you charge up the transformation’s focus bar to employ special spell attacks. For this particular spell, you’ll be able to use Guangzhi’s spinning light attacks, and charge a heavy attack for his quick dashes. With a full focus bar, you can use Might on spell after dodging to employ his powerful pogo jump attack!",
    "promot": "This is an excerpt from the file 'Forest_of_Wolves_Walkthrough.md', located in the main section titled 'Forest of Wolves Walkthrough'. The section summary is: Black Myth: Wukong's Chapter 1 begins with a prologue that takes place during a pivotal scene in the story of the Monkey King, Sun Wukong. Below you'll find a guide to the tutorial, and for the first major area of Black Wind Mountain: The Forest of Wolves, as well as how to defeat its many bosses that include the Bullguard, Gaugnzhi and Yaoguai King Lingxuzi.\n* **Jump to A Section:**\n* **Front Hills**\n* Yaoguai Chief - Bullguard\n* **Outside the Forest**\n* Yaoguai Chief - Guangzhi\n* **Guanyin Temple**\n* Yaoguai King - Lingxuzi\n# Prologue\nUpon beginning your journey, you’ll be thrust into the role of the mythical Sun Wukong as he rebels against the Court of Heaven and its Heavenly Kings. Undaunted by their army, Sun Wukong calls them out, prompting the nephew of the Jade Emperor, Erlang Shen, to meet him in combat. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Outside the Forest', and the detailed content is as follows:\nAs you begin to leave the Shrine, the Keeper will stop and warn you of the dangers to come in this next area, and opt to give you a way to do some scouting first.\nYou’ll be transformed into a small Golden Cicada, which will allow you to fly around the next area to get a look at the dangers to come before you face them yourself. However, your flight time will be limited by the meter slowly fading in the bottom left, and whenever you run out of juice (or manually de-transform) you may find yourself in hot water, so how much you actually want to explore in this form is up to you.\nThe main path through is area is a very straightforward one, as you can simply follow the straight path past the first two Wolf guards near the Shrine, to a axe-wielding Wolf Stalwart by a small bridge over a stream, and then straight through a tunnel that’s guarded by an extremely tough (and very optional) mini-boss with a giant head.\nIn fact, this Wandering Wight is tougher than most things you’ll face in the whole chapter, so don’t feel like you need to stop and contend with this foe if you’d rather get stronger and gain access to more abilities first. Be sure to check out our guide on How to Defeat the Wandering Wight when you do.\nThere’s more optional things to explore in this wide area however, starting by taking the path to the left past the first two Wolves near the Shrine. Past several fallen trees, some **Purple Lingzhi** and **Aged Ginseng** , you can reach a small peak with broken pillars and a Wolf guarding some pots to break for Will.\nNear this peak is a bridge, where you’ll find a Bandit Chief with a large sword guarding a chest. He can perform some surprisingly agile lunging attacks, and his multi-hit sword swings can deal a lot of damage. Each of his combos end with a large downward slam, and gives you a wide opening to begin your counter-attack as he struggles to pull his blade out of the ground. For as tough as he is, he luckily won’t respawn when defeated.\nOnce he’s gone, help yourself to the chest to find 2 **Evil Repelling Medicament** and 5 **Tiny Piece of Gold**!\nThe bridge is guarded by a lone Wolf Archer, and a great time to test out the Destined One’s staff twirl ability. By holding down the L2/LT button, you can move your staff quickly to deflect incoming arrows. The Wolf will usually begin with a barrage of quick arrow shots, so be sure to keep holding the button down rather than tapping it until he stops. The move costs stamina to maintain so you can’t block shots forever — as soon as the arrows stop flying, dash across and defeat him before he finds more arrows.\nThere are many paths to go from here - either continuing to the far side of the stream, or heading back to keep exploring the previous side, including a path up to a high plateau with some **Aged Ginseng**. On the slope leading back down to the stream, another ginseng plant hides a surprise, as an earthen elemental Ginsengling Yaoguai will uncover itself with the ginseng growing from its head.\nThese monsters are surprisingly tough, and can slam their hands into the ground to grow poison roots that spread outward — so don’t be afraid to reposition yourself to fight somewhere else. Defeating them will earn you much more crafting materials than picking normal plants.\nFrom here, you can cross the stream to battle some more Wolf enemies on the other side, or look for a small path to the left leading up to a large waterfall with some **Jade Lotus** and another Crow Diviner enemy meditating by the falls.\nThe far side of the stream has many more materials to collect, and most importantly, a path leading from the bridge where the archer was to a small archway where another extremely important yet optional mini-boss awaits you.\n### Yaoguai Chief Mini-Boss Fight - Guangzhi\nThis Yaoguai Chief is a lot more intimidating than the Bullguard, but thankfully much more approachable than the Wandering Wight nearby, even with his fearsome looking fiery twinblade. Remember that you can purchase some Cooling Powder should you find yourself being lit on fire too much, as well as Evil Repelling Medicant to boost your damage absorption.\nThe flashing of his fiery weapon may seem impossible to dodge, but the key to this fight is understanding exactly when his attacks actually land so that you can dodge around them. Guangzhi usually starts by charging forth for a combo attack, but each attack will cause him to jump into the air with a flourish before actually attacking with downward swings. Wait to dodge all three swing attacks and then hit him with some of your own while he tries to recover.\nIf he starts to whirl his fiery blade in circles around him, be ready but don’t panic as his attack is yet to come — wait for him to raise the blade and twirl it high before swinging it from side to side in two slower hits.\nAnother scary move that may take a bit of practice to understand is his pogo jump: Watch for him to raise his weapon high and vertical over his head before slamming it down, and then somersaulting forward in quick succession to bounce off the ground off his weapon. After a short pause, he’ll leap up to slam down for a third attack, and then even higher up for one last pogo slam explosion. With the last two attacks being spaced out, stand your ground to wait for the drop to dodge around, and cast Immobilize once he’s grounded to pin him down while you unleash your attacks.\nAt range, he can still be a major problem as you learn his moves, as he can strike from a distance with very little warning. If you see him somersault backward and out of range of your strikes, don’t blindly rush in. He’ll pause for a moment, and then toss his twinblade at you like a boomerang that requires dodging as it spins toward you, and back to his hand.\nHe can also prepare a flourish before holding his weapon straight up at his side while in a small crouch. If you notice this new stance, be ready to dodge the instant he moves, as he’ll dash forward at an alarming speed, and then dash back to his original spot to try and catch you off-guard.\nAnother quick moving attack has a lengthy start up, as he’ll keep somersaulting backward and leaping to build up momentum, jumping high and pausing in the air before slamming forward with weapon blazing. If you have the Pillar Style unlocked, you can actually hold your Heavy Attack button to lift yourself off the ground and avoid the attack entirely! He’ll waste time twirling his blade after this strike, making it a good time to get your own hits in.\nRemember to apply your Immobilize spell when it serves you best — interrupting his charged up attacks or after a combo when he’s not up in the air so you can lay into him, and use it whenever the spell recharges. With enough damage dealt, the boss will fall, leaving his weapon embedded in the ground nearby.\nGuangzhi\nPick up the fiery blade, and you’ll learn a Transformation Spell: **Red Tides**. Now you’ll be able to transform into the very boss you defeated, and use his own abilities in combat against your enemies.\nTransformation Spells are very powerful, and essentially give you a separate health and might bar to work with. Might will decay fairly quickly over time, and even more if you charge up the transformation’s focus bar to employ special spell attacks. For this particular spell, you’ll be able to use Guangzhi’s spinning light attacks, and charge a heavy attack for his quick dashes. With a full focus bar, you can use Might on spell after dodging to employ his powerful pogo jump attack!",
    "promot_tokens_num": 1913
}