{
    "chunk_id": 611074713948,
    "source_file": "Shigandang.md",
    "content_type": "one and two",
    "h1_title": "Shigandang",
    "h2_title": "Where to Find Shigandang",
    "h1_content": "Shigandang is a secret optional Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Secretly buried not far from another Yaoguai King, you'll need to seek out six Buddha Statue Eyeballs to unlock this boss.\n* **Rewards:** Heart of Stone, Skhanda of Feeling, Mind Core x1, Yaoguai Core x2, 1652 Experience, 1371 Will",
    "h2_content": "It's possible to locate Shigandang without realizing what he is, as this boss is actually hiding in another Yaoguai King's arena. Travel through the Fright Cliff to Rockrest Flat, and enter the archway to the left to where the Vanguard of Stone\") dwells. As you enter, you may notice a large rock that on closer inspection has many carved heads on it. To activate it, you'll need to seek out six statue heads around the Fright Cliff and retrieve their Buddha's Eyeballs:\n* Upon first entering the Fright Cliff, travel up the sloping path, and you should spot the smoke trail of the Fright Cliff’s Shrine. Just before it, you can hear ominous chanting. The chanting comes from a large Buddha head statue in the ground, and by interacting with it, you can claim the Buddha’s Eyeball.\n* From the Squall Hideout Shrine, take the left path up to a darkened area leading into a large cave. Ignore the middle path leading into the main cave entrance for the moment, and head toward the large open cave area to the left by following some braziers. They’ll lead toward a large ominous statue in the dark. More Palestones will try to ambush you here, and they guard another stone statue head at the foot of the larger statue’s altar. Examine it to gain another Buddha’s Eyeball.\n* Return to the Squall Hideout Shrine, and instead stick to the far right side of the open valley and up to some ruins. Fight your way to the top of the stairs and keep staff spinning to deflect the ranged attacks until all the Blazebones are dead. At the end of this high raised wooden platform you’ll find another of the giant statue heads, allowing you to take its Buddhas Eyeball.\n* Located just across the crevice from the previous Buddha statue head, look for a pathway along a ridge left of the crevice to find a Buddha's Eyeball to claim here.\n* Between the Squall Hideout and Rockrest Flat Shrines, you can find a large cave and tunnel leading to the Mother of Stones Yaoguai Chief fight. Take a right when looking at the boss to find a cave exit onto a small raised platform, and you'll find a statue head here.\n* Finally, when resting at the Rockrest Flat Shrine, you need only advance forward toward the entrance to the Stone Vanguard / Shigandang Boss Fights to find the final statue and Buddha's Eyeball.",
    "promot": "This is an excerpt from the file 'Shigandang.md', located in the main section titled 'Shigandang'. The section summary is: Shigandang is a secret optional Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Secretly buried not far from another Yaoguai King, you'll need to seek out six Buddha Statue Eyeballs to unlock this boss.\n* **Rewards:** Heart of Stone, Skhanda of Feeling, Mind Core x1, Yaoguai Core x2, 1652 Experience, 1371 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find Shigandang', and the detailed content is as follows:\nIt's possible to locate Shigandang without realizing what he is, as this boss is actually hiding in another Yaoguai King's arena. Travel through the Fright Cliff to Rockrest Flat, and enter the archway to the left to where the Vanguard of Stone\") dwells. As you enter, you may notice a large rock that on closer inspection has many carved heads on it. To activate it, you'll need to seek out six statue heads around the Fright Cliff and retrieve their Buddha's Eyeballs:\n* Upon first entering the Fright Cliff, travel up the sloping path, and you should spot the smoke trail of the Fright Cliff’s Shrine. Just before it, you can hear ominous chanting. The chanting comes from a large Buddha head statue in the ground, and by interacting with it, you can claim the Buddha’s Eyeball.\n* From the Squall Hideout Shrine, take the left path up to a darkened area leading into a large cave. Ignore the middle path leading into the main cave entrance for the moment, and head toward the large open cave area to the left by following some braziers. They’ll lead toward a large ominous statue in the dark. More Palestones will try to ambush you here, and they guard another stone statue head at the foot of the larger statue’s altar. Examine it to gain another Buddha’s Eyeball.\n* Return to the Squall Hideout Shrine, and instead stick to the far right side of the open valley and up to some ruins. Fight your way to the top of the stairs and keep staff spinning to deflect the ranged attacks until all the Blazebones are dead. At the end of this high raised wooden platform you’ll find another of the giant statue heads, allowing you to take its Buddhas Eyeball.\n* Located just across the crevice from the previous Buddha statue head, look for a pathway along a ridge left of the crevice to find a Buddha's Eyeball to claim here.\n* Between the Squall Hideout and Rockrest Flat Shrines, you can find a large cave and tunnel leading to the Mother of Stones Yaoguai Chief fight. Take a right when looking at the boss to find a cave exit onto a small raised platform, and you'll find a statue head here.\n* Finally, when resting at the Rockrest Flat Shrine, you need only advance forward toward the entrance to the Stone Vanguard / Shigandang Boss Fights to find the final statue and Buddha's Eyeball.",
    "promot_tokens_num": 674
}