{
    "chunk_id": 876718020537,
    "source_file": "Zhu_Bajie_(Boss_Fight).md",
    "content_type": "one and two",
    "h1_title": "Zhu Bajie (Boss Fight)",
    "h2_title": "Where to Find Zhu Bajie",
    "h1_content": "Zhu Bajie is an allied character who will accompany you through much of your journey in Black Myth Wukong, however there will come a time when you are forced to defeat him in combat in order to progress the story. Upon reaching Chapter 4 in the Webbed Hollow, he will become bewitched, and will need your help to free himself of the lure of the Crimson Spider.\n* Rewards: Blood Stained Needle, Jade Moon Rabbit Curio, Fine Gold Thread, 3410 Experience x2, 2578-2612 Will x2",
    "h2_content": "Zhu Bajie's boss fight is a two-part main boss and non-missable encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down to the Lower Hollow, follow the linear path to reach the Hut of Immortality, where you'll have your first fight against him.\nAfter his first defeat, Zhu Bajie will retreat from the hut, and create a new pathway outside from the shrine to a large muddy area where the second fight will begin.",
    "promot": "This is an excerpt from the file 'Zhu_Bajie_(Boss_Fight).md', located in the main section titled 'Zhu Bajie (Boss Fight)'. The section summary is: Zhu Bajie is an allied character who will accompany you through much of your journey in Black Myth Wukong, however there will come a time when you are forced to defeat him in combat in order to progress the story. Upon reaching Chapter 4 in the Webbed Hollow, he will become bewitched, and will need your help to free himself of the lure of the Crimson Spider.\n* Rewards: Blood Stained Needle, Jade Moon Rabbit Curio, Fine Gold Thread, 3410 Experience x2, 2578-2612 Will x2 This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find Zhu Bajie', and the detailed content is as follows:\nZhu Bajie's boss fight is a two-part main boss and non-missable encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down to the Lower Hollow, follow the linear path to reach the Hut of Immortality, where you'll have your first fight against him.\nAfter his first defeat, Zhu Bajie will retreat from the hut, and create a new pathway outside from the shrine to a large muddy area where the second fight will begin.",
    "promot_tokens_num": 293
}