{
    "chunk_id": 675899962408,
    "source_file": "Yellow_Sand_Formation_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Yellow Sand Formation Walkthrough",
    "h2_title": "Windrest Hamlet",
    "h1_content": "The Yellow Sand Formation is final main region of Chapter 2 in the Yellow Wind Ridge of Black Myth: Wukong. Below you'll find a guide both for exploring the optional area of the Windrest Hamlet and the Tiger's Acolyte, as well as the final main boss fight against the Yellow Wind Sage.\n* **Jump to A Section:**\n* **Windrest Bridge**\n* **Windrest Hamlet**\n* Yaoguai Chief - Tiger's Acolyte\n* **Windseal Gate**\n* Yaoguai Chief - Gore-Eye Daoist\n* Yaoguai King - Yellow Wind Sage\nThe Yellow Wind Formation is the final sub-region you’ll need to explore in Chapter 2 of Black Myth Wukong to reach the Chapter Boss, but also includes a large optional village area of Windrest, and several paths leading to the boss from sealed stone doors. With multiple entrances and exits to this area, we’ll start with the first Shrine on the other side of the Crouching Tiger Temple.\nOnce the Tiger Vanguard boss has been defeated, you can exit the temple by heading down the steps on the far side.\nA large area has a sloping path leading up to the right, with several plants to harvest including Aged Ginseng, Fragrant Jade Flowers, and a Lingzhiling in disguise.\nFurther up, you’ll find a Rat Soldier and Rat Archer guarding a large statue embedded in the rock wall with a small turtle chest at its altar. Clear out the foes, and then open it to find a **Copper Pill** Soak for your Gourd. This one in particular has an impressive effect to negate the cost of Rock Solid when used soon after using the gourd.",
    "h2_content": "While you’ve technically traveled through most of Windrest at this point, there’s still one last section across another stone bridge. Like before, it’s guarded by another Spearbone, along with a few Withered Corpses and a Blazebone shooting projectiles from the far side of the bridge.\nLure the melee attackers away from the ranged support and deal with them first before you cross, and the Blazebone will have little in the way of defending itself. Check the interior of the home near it, and you can claim a green Wisp for some Will.\nHead down the path around the homes, and you can find a wooden chest with 3 **Yaoguai Core** in an open area near a very long bridge leading back across the ravine toward Fright Cliff. However, a lone and imposing figure will block you as you try to cross the bridge.\n### Yaoguai Chief Mini-Boss Fight - Tiger’s Acolyte\nA follower of the Tiger Vanguard, the strange man will call out for his missing son before violently attacking you. And just like his master, he’s incredibly ferocious, and it can be hard to anticipate his attacks, let alone whether he’ll attack with his very long sword or very long claws.\nThe battle will often begin with him lowering his sword, only to leap forward at blinding speed to attack with both sword and claw at once, rolling past you as he does, and then performing a follow up slash as he finishes his roll. This means you’ll want to dodge past him as he approaches, so you can safely distance yourself from the following slash and then attack him back.\nHowever, if he suddenly pivots after his slash to face away, be ready for him to perform a large overhand swing as he twists to face you. Though it's a vertical strike, it has a great deal of reach, sending a tremor along the ground from its force.\nUnfortunately, this isn’t even his only unpredictable leaping attack, as he can also just vault at you at top speed from a fair distance without a hint of preparation and cleave you with his sword for massive damage.\nOne leaping attack with a bit more warning will come when he jumps high into the air first, moving right above you before slamming down with his sword. The impact will be fierce, and even trying to use Rock Solid will simply send both of you stumbling back, so dodging is the better call here. It’s also a good idea to use Immobilize here, as there’s a good chance he’ll pull his sword out of the ground while performing a horizontal slash with incredible reach in a wide arc.\nWhile he has a varied assortment of combo attacks, some use only the sword and some only his claw. His most used claw attack will come when he holds it behind him and it begins to shine with a gold gleam. He’ll rush forward with a swipe, and then follow it shortly with a leg stomp, and then roll forward to end with a quick forward slash attack.\nIf you see him rush forward with his claw raised back, prepare for a rapid combo of four quick slashes, followed by a stab with his claws.\nIf possible, you can try to go Rock Solid when he jabs, otherwise he’ll quickly pull backwards and retreat before you can try to retaliate — which often leads to one if his leaping attacks.\nWhen he favors his sword, things won’t get any easier. Watch for him to hold his sword sideways across his body and a quick gleam. He’ll pull into a rapid stab attack with the sword that moves very fast — but it is possible to evade it using the Pillar Stance by raising yourself above the stab and then retaliating with a charged hit.\nWhen he holds his sword back behind him, he’ll launch into two fast upward slashes, which usually ends with him taking the aforementioned stance before his thrust attack.\nIf he holds his sword back without moving, he’ll charge up for a combo attack consisting of two quick horizontal slashes, and then a short jump into the air to land with a downward slash attack. Retaliate cautiously if he doesn’t move away, and be ready for him to assume his next stance.\nHe can also charge at you with his sword behind his back in a sheathed stance, and then quickly slash forward with a follow up jab for a two-hit strike. The jabs are straight ahead, which you can dodge around to the side and punish.\nOn rare occasions, he may even go for a varied combo of his own using all the weapons at his disposal. Starting with a forward kick, he’ll launch into three spinning slash attacks with a reverse grip, followed by a quick claw swipe and upward sword swing all in quick succession. When he stops to raise his sword up, that’s your moment to stagger him with a heavy hit of your own to stop him in his tracks.\nIf your health is dropping fast, remember you can use a Transformation Spell to rely on a secondary health bar to stay alive. Either the Red Tides or Azure Dust can work well in this fight, depending on if you want to match his agility in your wolf form, or tank his hits and then smash into him when he stops attacking. It’s also not a bad idea to try the Pluck of Many, as his smaller size makes him vulnerable to getting overwhelmed and staggered on all sides.\nWhen the Tiger’s Acolyte falls, he’ll drop a curious Key Item, the **Old-Rattle Drum** , as well as leaving behind the Tiger’s Acolyte Spirit to absorb. The child’s toy actually serves an important purpose to unlock another boss. You’ll need it to commune with a child’s spirit in various spots around the Yellow Wind Ridge, with the first being a short backtrack away.\nTiger's Acolyte\nReturn across the bridge to the Windrest Hamlet Shrine and pass back through the large gate, immediately taking a left to the large house surrounded by sitting Withering Corpses. A visual cue will appear along with the voice of a child beckoning you, and you’ll be able to use the Rattle-Drum in front of the house. Be warned, as doing so will provoke all the nearby corpses to attack you, but you’ll also get some interesting dialogue from the child.\nHead back to the bridge where you fought the Tiger’s Acolyte, and cross to the far side. You’ll enter a large cave here, and a few Swift Bats will appear to harass you.\nAfter taking them out, look for an opening in the cave wall where a large column is, and at its base will be a small chest near a Blazebone firing projectiles at you. Loot the chest after defeating it to gain a new Curio - the **Glazed Reliquary**.\nJust past the box, you can find stairs down to a path leading out the cave, putting you on a ledge right above where you fought the Stone Vanguard in the Fright Cliff!\nThis is actually a very opportune time to challenge the hidden Shiandang Yaoguai King boss in this same arena by putting the six Buddha Eyeballs in the large rock nearby — if you haven’t challenged him already.\nSpeaking of opportune times, you should also head back through the Rockrest Flats to the Drunk Boar, and give him the Sobering Stone you found in the village. He’ll thank you for it, but complain of hunger next, and talk about setting off in search of a meal. Keep speaking until he mentions the Temple of Crouching Tiger, so you’ll know where to find him.\nBe sure to travel back to the Crouching Tiger Temple entrance next, and look for him near the top of the stairs to the right — opposite where the Meditation Spot is. He’ll be resting against the far wall, and complaining about the meat. What he really wants now is some Jade Lotus. You should already have plenty of that stored away, but if not, you can easily find some in most pools of water, especially the large pool where you first entered the chapter.\nGive it to him, and he’ll give you a cryptic message about the Realm of Gold located where the sun sets, but it’s not a lot to go on. He also mentions the Yellow Wind Guai said “our senior brother gave me a piece of gold. I’ll need it here when the time’s right.” The Boar thinks the time is right to try it now.\nIt’s a bit of a riddle, but the “senior brother” was the First Prince of Flowing Sand that you fought in the Valley of Despair, who just happened to drop the Arhat Gold Piece. All that’s left is to bring it to the right place, which happens to be back where you first encountered the Boar Guai.\nHowever, when you approach the field, you’ll find him off to the right on the stairs leading to the large door. He’ll become angry that you have the gold, and try to fight you for it.\nShould you manage to best him in combat, he’ll offer to help you unlock this “Realm of Gold”, and open the doorway up the stairs that will lead you to another memory - a Secret Area known as the **Kingdom of Sahali**.\nWe highly recommend checking this place out before taking on the Chapter 2 Boss, as much like Chapter 1, its reward can greatly help you in that battle, and you’ll also find a Meditation Spot in this secret area!",
    "promot": "This is an excerpt from the file 'Yellow_Sand_Formation_Walkthrough.md', located in the main section titled 'Yellow Sand Formation Walkthrough'. The section summary is: The Yellow Sand Formation is final main region of Chapter 2 in the Yellow Wind Ridge of Black Myth: Wukong. Below you'll find a guide both for exploring the optional area of the Windrest Hamlet and the Tiger's Acolyte, as well as the final main boss fight against the Yellow Wind Sage.\n* **Jump to A Section:**\n* **Windrest Bridge**\n* **Windrest Hamlet**\n* Yaoguai Chief - Tiger's Acolyte\n* **Windseal Gate**\n* Yaoguai Chief - Gore-Eye Daoist\n* Yaoguai King - Yellow Wind Sage\nThe Yellow Wind Formation is the final sub-region you’ll need to explore in Chapter 2 of Black Myth Wukong to reach the Chapter Boss, but also includes a large optional village area of Windrest, and several paths leading to the boss from sealed stone doors. With multiple entrances and exits to this area, we’ll start with the first Shrine on the other side of the Crouching Tiger Temple.\nOnce the Tiger Vanguard boss has been defeated, you can exit the temple by heading down the steps on the far side.\nA large area has a sloping path leading up to the right, with several plants to harvest including Aged Ginseng, Fragrant Jade Flowers, and a Lingzhiling in disguise.\nFurther up, you’ll find a Rat Soldier and Rat Archer guarding a large statue embedded in the rock wall with a small turtle chest at its altar. Clear out the foes, and then open it to find a **Copper Pill** Soak for your Gourd. This one in particular has an impressive effect to negate the cost of Rock Solid when used soon after using the gourd. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Windrest Hamlet', and the detailed content is as follows:\nWhile you’ve technically traveled through most of Windrest at this point, there’s still one last section across another stone bridge. Like before, it’s guarded by another Spearbone, along with a few Withered Corpses and a Blazebone shooting projectiles from the far side of the bridge.\nLure the melee attackers away from the ranged support and deal with them first before you cross, and the Blazebone will have little in the way of defending itself. Check the interior of the home near it, and you can claim a green Wisp for some Will.\nHead down the path around the homes, and you can find a wooden chest with 3 **Yaoguai Core** in an open area near a very long bridge leading back across the ravine toward Fright Cliff. However, a lone and imposing figure will block you as you try to cross the bridge.\n### Yaoguai Chief Mini-Boss Fight - Tiger’s Acolyte\nA follower of the Tiger Vanguard, the strange man will call out for his missing son before violently attacking you. And just like his master, he’s incredibly ferocious, and it can be hard to anticipate his attacks, let alone whether he’ll attack with his very long sword or very long claws.\nThe battle will often begin with him lowering his sword, only to leap forward at blinding speed to attack with both sword and claw at once, rolling past you as he does, and then performing a follow up slash as he finishes his roll. This means you’ll want to dodge past him as he approaches, so you can safely distance yourself from the following slash and then attack him back.\nHowever, if he suddenly pivots after his slash to face away, be ready for him to perform a large overhand swing as he twists to face you. Though it's a vertical strike, it has a great deal of reach, sending a tremor along the ground from its force.\nUnfortunately, this isn’t even his only unpredictable leaping attack, as he can also just vault at you at top speed from a fair distance without a hint of preparation and cleave you with his sword for massive damage.\nOne leaping attack with a bit more warning will come when he jumps high into the air first, moving right above you before slamming down with his sword. The impact will be fierce, and even trying to use Rock Solid will simply send both of you stumbling back, so dodging is the better call here. It’s also a good idea to use Immobilize here, as there’s a good chance he’ll pull his sword out of the ground while performing a horizontal slash with incredible reach in a wide arc.\nWhile he has a varied assortment of combo attacks, some use only the sword and some only his claw. His most used claw attack will come when he holds it behind him and it begins to shine with a gold gleam. He’ll rush forward with a swipe, and then follow it shortly with a leg stomp, and then roll forward to end with a quick forward slash attack.\nIf you see him rush forward with his claw raised back, prepare for a rapid combo of four quick slashes, followed by a stab with his claws.\nIf possible, you can try to go Rock Solid when he jabs, otherwise he’ll quickly pull backwards and retreat before you can try to retaliate — which often leads to one if his leaping attacks.\nWhen he favors his sword, things won’t get any easier. Watch for him to hold his sword sideways across his body and a quick gleam. He’ll pull into a rapid stab attack with the sword that moves very fast — but it is possible to evade it using the Pillar Stance by raising yourself above the stab and then retaliating with a charged hit.\nWhen he holds his sword back behind him, he’ll launch into two fast upward slashes, which usually ends with him taking the aforementioned stance before his thrust attack.\nIf he holds his sword back without moving, he’ll charge up for a combo attack consisting of two quick horizontal slashes, and then a short jump into the air to land with a downward slash attack. Retaliate cautiously if he doesn’t move away, and be ready for him to assume his next stance.\nHe can also charge at you with his sword behind his back in a sheathed stance, and then quickly slash forward with a follow up jab for a two-hit strike. The jabs are straight ahead, which you can dodge around to the side and punish.\nOn rare occasions, he may even go for a varied combo of his own using all the weapons at his disposal. Starting with a forward kick, he’ll launch into three spinning slash attacks with a reverse grip, followed by a quick claw swipe and upward sword swing all in quick succession. When he stops to raise his sword up, that’s your moment to stagger him with a heavy hit of your own to stop him in his tracks.\nIf your health is dropping fast, remember you can use a Transformation Spell to rely on a secondary health bar to stay alive. Either the Red Tides or Azure Dust can work well in this fight, depending on if you want to match his agility in your wolf form, or tank his hits and then smash into him when he stops attacking. It’s also not a bad idea to try the Pluck of Many, as his smaller size makes him vulnerable to getting overwhelmed and staggered on all sides.\nWhen the Tiger’s Acolyte falls, he’ll drop a curious Key Item, the **Old-Rattle Drum** , as well as leaving behind the Tiger’s Acolyte Spirit to absorb. The child’s toy actually serves an important purpose to unlock another boss. You’ll need it to commune with a child’s spirit in various spots around the Yellow Wind Ridge, with the first being a short backtrack away.\nTiger's Acolyte\nReturn across the bridge to the Windrest Hamlet Shrine and pass back through the large gate, immediately taking a left to the large house surrounded by sitting Withering Corpses. A visual cue will appear along with the voice of a child beckoning you, and you’ll be able to use the Rattle-Drum in front of the house. Be warned, as doing so will provoke all the nearby corpses to attack you, but you’ll also get some interesting dialogue from the child.\nHead back to the bridge where you fought the Tiger’s Acolyte, and cross to the far side. You’ll enter a large cave here, and a few Swift Bats will appear to harass you.\nAfter taking them out, look for an opening in the cave wall where a large column is, and at its base will be a small chest near a Blazebone firing projectiles at you. Loot the chest after defeating it to gain a new Curio - the **Glazed Reliquary**.\nJust past the box, you can find stairs down to a path leading out the cave, putting you on a ledge right above where you fought the Stone Vanguard in the Fright Cliff!\nThis is actually a very opportune time to challenge the hidden Shiandang Yaoguai King boss in this same arena by putting the six Buddha Eyeballs in the large rock nearby — if you haven’t challenged him already.\nSpeaking of opportune times, you should also head back through the Rockrest Flats to the Drunk Boar, and give him the Sobering Stone you found in the village. He’ll thank you for it, but complain of hunger next, and talk about setting off in search of a meal. Keep speaking until he mentions the Temple of Crouching Tiger, so you’ll know where to find him.\nBe sure to travel back to the Crouching Tiger Temple entrance next, and look for him near the top of the stairs to the right — opposite where the Meditation Spot is. He’ll be resting against the far wall, and complaining about the meat. What he really wants now is some Jade Lotus. You should already have plenty of that stored away, but if not, you can easily find some in most pools of water, especially the large pool where you first entered the chapter.\nGive it to him, and he’ll give you a cryptic message about the Realm of Gold located where the sun sets, but it’s not a lot to go on. He also mentions the Yellow Wind Guai said “our senior brother gave me a piece of gold. I’ll need it here when the time’s right.” The Boar thinks the time is right to try it now.\nIt’s a bit of a riddle, but the “senior brother” was the First Prince of Flowing Sand that you fought in the Valley of Despair, who just happened to drop the Arhat Gold Piece. All that’s left is to bring it to the right place, which happens to be back where you first encountered the Boar Guai.\nHowever, when you approach the field, you’ll find him off to the right on the stairs leading to the large door. He’ll become angry that you have the gold, and try to fight you for it.\nShould you manage to best him in combat, he’ll offer to help you unlock this “Realm of Gold”, and open the doorway up the stairs that will lead you to another memory - a Secret Area known as the **Kingdom of Sahali**.\nWe highly recommend checking this place out before taking on the Chapter 2 Boss, as much like Chapter 1, its reward can greatly help you in that battle, and you’ll also find a Meditation Spot in this secret area!",
    "promot_tokens_num": 2359
}