{
    "chunk_id": 285031610063,
    "source_file": "Skandha_of_Choice.md",
    "content_type": "one and two",
    "h1_title": "Skandha of Choice",
    "h2_title": "Where to use the Skandha of Choice in Black Myth: Wukong",
    "h1_content": "Skandha of Choice is one of the Key Items found late in Black Myth: Wukong. While you can't use it initially, once you reach Chapter 6, you can unlock a big stat boost for the rest of your run and your New Game Plus through.\n_\"Once hidden inside the Buddha's head, this treasure has a secret yet to be revealed.\"_\nThe Skandha of Choice can be found in the Lower Hollow in The Webbed Hollow by the Purifying Spring Shrine. From the Shrine, head forwards and into the large body of water nearby. To your left you can find the Buddha statue head and the item.\nSkandha of Choice",
    "h2_content": "The Skandha of Choice can be used alongside the Skandha of Form, Skandha of Feeling, and Skandha of Thought <meta />in Mount Huago in Chapter 6. Upon accessing the Cloud ability in this chapter, you can head towards a massive enemy in the distance - the Son of Stones. Fly past this boss, to find a small path leading to the Giant Shigandang.\nDefeating this boss with the four Skandhas in your inventory will give you the Skandha of Consciousness. With all five Skandhas, you can visit Xu Dog in Yellow Wind Ridge and show him the Skandhas. In return, he will give you the Five Skandhas Pill - a big upgrade to your stats.",
    "promot": "This is an excerpt from the file 'Skandha_of_Choice.md', located in the main section titled 'Skandha of Choice'. The section summary is: Skandha of Choice is one of the Key Items found late in Black Myth: Wukong. While you can't use it initially, once you reach Chapter 6, you can unlock a big stat boost for the rest of your run and your New Game Plus through.\n_\"Once hidden inside the Buddha's head, this treasure has a secret yet to be revealed.\"_\nThe Skandha of Choice can be found in the Lower Hollow in The Webbed Hollow by the Purifying Spring Shrine. From the Shrine, head forwards and into the large body of water nearby. To your left you can find the Buddha statue head and the item.\nSkandha of Choice This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to use the Skandha of Choice in Black Myth: Wukong', and the detailed content is as follows:\nThe Skandha of Choice can be used alongside the Skandha of Form, Skandha of Feeling, and Skandha of Thought <meta />in Mount Huago in Chapter 6. Upon accessing the Cloud ability in this chapter, you can head towards a massive enemy in the distance - the Son of Stones. Fly past this boss, to find a small path leading to the Giant Shigandang.\nDefeating this boss with the four Skandhas in your inventory will give you the Skandha of Consciousness. With all five Skandhas, you can visit Xu Dog in Yellow Wind Ridge and show him the Skandhas. In return, he will give you the Five Skandhas Pill - a big upgrade to your stats.",
    "promot_tokens_num": 368
}