{
    "chunk_id": 109568331151,
    "source_file": "Chapter_4_Secret-Purple_Cloud_Mountain_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Chapter 4 Secret - Purple Cloud Mountain Walkthrough",
    "h2_title": "Cloudnest Peak",
    "h1_content": "The Purple Cloud Mountain is a Secret Area found in Chapter 4's Webbed Hollow of Black Myth Wukong. Below you'll find a guide to accessing the mountain by defeating the Venom Daoist, and how to complete Hong Yi the Snake Guai's quest to defeat the Daoist Mi and Duskveil, as well as the formidable Scorpionlord.\n* **Jump to a Section:**\n* How to Access Purple Cloud Mountain\n* **Valley of Blooms**\n* **Bounds of Deity's Abode**\n* Yaoguai King - The Scorpionlord\n* **Petalfall Hamlet**\n* Yaoguai Chief - Daoist Mi\n* **Cloudnest Peak**\n* Yaoguai King - The Duskveil\nThis Chapter 4 Secret can only be accessed by finding and defeating the Venom Daoist in two different locations, and will transport you to a different location to fight a secret Yaoguai King and repair a Vessel that is instrumental in defeating the Hundred-Eyed Daoist Master.",
    "h2_content": "As the Daoist Mi falls, the snake woman will beg you to defeat the creature that lies at the peak. Return through the hamlet to rest at the Cloudnest Peak Shrine, and ready yourself to take on the final boss of this area.\nWarning - if you haven't already, be sure you have already defeated The Scorpionlord and Daoist Mi, as defeating the final boss of this secret area may cause them to disappear!\nHead up the stairs lined with peculiar statues, and enter the large arena at the base of the peak. As you do, something corrupted will emerge from the fleshy mass covering the peak, and you'll find yourself locked in combat with the horror known as The Duskveil.",
    "promot": "This is an excerpt from the file 'Chapter_4_Secret-Purple_Cloud_Mountain_Walkthrough.md', located in the main section titled 'Chapter 4 Secret - Purple Cloud Mountain Walkthrough'. The section summary is: The Purple Cloud Mountain is a Secret Area found in Chapter 4's Webbed Hollow of Black Myth Wukong. Below you'll find a guide to accessing the mountain by defeating the Venom Daoist, and how to complete Hong Yi the Snake Guai's quest to defeat the Daoist Mi and Duskveil, as well as the formidable Scorpionlord.\n* **Jump to a Section:**\n* How to Access Purple Cloud Mountain\n* **Valley of Blooms**\n* **Bounds of Deity's Abode**\n* Yaoguai King - The Scorpionlord\n* **Petalfall Hamlet**\n* Yaoguai Chief - Daoist Mi\n* **Cloudnest Peak**\n* Yaoguai King - The Duskveil\nThis Chapter 4 Secret can only be accessed by finding and defeating the Venom Daoist in two different locations, and will transport you to a different location to fight a secret Yaoguai King and repair a Vessel that is instrumental in defeating the Hundred-Eyed Daoist Master. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Cloudnest Peak', and the detailed content is as follows:\nAs the Daoist Mi falls, the snake woman will beg you to defeat the creature that lies at the peak. Return through the hamlet to rest at the Cloudnest Peak Shrine, and ready yourself to take on the final boss of this area.\nWarning - if you haven't already, be sure you have already defeated The Scorpionlord and Daoist Mi, as defeating the final boss of this secret area may cause them to disappear!\nHead up the stairs lined with peculiar statues, and enter the large arena at the base of the peak. As you do, something corrupted will emerge from the fleshy mass covering the peak, and you'll find yourself locked in combat with the horror known as The Duskveil.",
    "promot_tokens_num": 436
}