{
    "chunk_id": 539178407486,
    "source_file": "Tridacna_Pendant.md",
    "content_type": "one and two",
    "h1_title": "Tridacna Pendant",
    "h2_title": "Black Myth: Wukong Tridacna Pendant Location",
    "h1_content": "The Tridacna Pendant is one of the various Curios pieces of equipment you can find in Black Myth: Wukong. This large Curios item offers a universal buff that can be useful for almost anyone practically.\nWith the Tridacna Pendant equipped, all of your spell cooldowns will be reduced slightly, which is key when fighting some of the bosses in Chapter 2 and beyond, as the difficulty ramps up.\nLike the rest of the Curios items in Black Myth: Wukong, this one can't be upgraded, so you are stuck with its basic level of strength. Therefore, you will want to switch to other Curios items if you want a better ability or want one that fits your build more.",
    "h2_content": "The Tridacna Pendant can be found by defeating Black Loong behind the sand waterfall at Fright Cliff \\- Rockrest Flat Shrine in Yellow Wind Ridge. This will require you to defeat the First Prince of Flowing Sands, and collect the Loong Scales from behind the wall next to the arena.\nThis wall can be broken by the boss' attacks or a really powerful attack from one of the Transformation Spells after the fight. You can then take the Loong Scales to the Sand Wall and enter the secret area. Our video guide on how to get behind the Sand Wall below will help you out. You can also use our pages for the individual bosses, locations, and items linked above\nTridacna Pendant\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "promot": "This is an excerpt from the file 'Tridacna_Pendant.md', located in the main section titled 'Tridacna Pendant'. The section summary is: The Tridacna Pendant is one of the various Curios pieces of equipment you can find in Black Myth: Wukong. This large Curios item offers a universal buff that can be useful for almost anyone practically.\nWith the Tridacna Pendant equipped, all of your spell cooldowns will be reduced slightly, which is key when fighting some of the bosses in Chapter 2 and beyond, as the difficulty ramps up.\nLike the rest of the Curios items in Black Myth: Wukong, this one can't be upgraded, so you are stuck with its basic level of strength. Therefore, you will want to switch to other Curios items if you want a better ability or want one that fits your build more. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Tridacna Pendant Location', and the detailed content is as follows:\nThe Tridacna Pendant can be found by defeating Black Loong behind the sand waterfall at Fright Cliff \\- Rockrest Flat Shrine in Yellow Wind Ridge. This will require you to defeat the First Prince of Flowing Sands, and collect the Loong Scales from behind the wall next to the arena.\nThis wall can be broken by the boss' attacks or a really powerful attack from one of the Transformation Spells after the fight. You can then take the Loong Scales to the Sand Wall and enter the secret area. Our video guide on how to get behind the Sand Wall below will help you out. You can also use our pages for the individual bosses, locations, and items linked above\nTridacna Pendant\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "promot_tokens_num": 421
}