{
    "chunk_id": 297563021298,
    "source_file": "Keeness_of_Tiger.md",
    "content_type": "one and two",
    "h1_title": "Keeness of Tiger",
    "h2_title": "Where To Use The Keeness of Tiger in Black Myth: Wukong",
    "h1_content": "Keeness of Tiger is one of the main Key Items in Black Myth: Wukong's Yellow Wind Ridge area. It is a mandatory item you will come across throughout the chapter, as you need it to progress towards the chapter's final boss: the Yellow Wind Sage.\nThe Keeness of Tiger can be found in the Crouching Tiger Temple: Temple Entrance Shrine area. You will get it automatically after defeating the Tiger Vanguard boss. This boss can't be skipped so you don't have to worry about missing out on the item.\nKeeness of Tiger\nFor a full guide through the Crouching Tiger Temple area, be sure to read through our Crouching Tiger Temple Walkthrough in Chapter 2 - Yellow Sand, Desolate Dusk.\nBefore that, however, you can find out where the Keeness of Tiger can be used below.",
    "h2_content": "The Keeness of Tiger can be used on the Tallies located in Chapter 2 - Yellow Wind Ridge to access the path under the Crouching Tiger Temple, and open the locked doors at Sandgate Village - Valley of Despair and Yellow Sand Formation - Windrest Gate Shrines. You will need to use this in conjunction with the Sterness of Stone Key Item, which can be found at Fright Cliff upon defeating the Stone Vanguard.\nThe easiest one of these Tallies to find is the one at the Crouching Tiger Temple, as it is in the arena where you fought the Tiger Vanguard.\nThe first gate can be found right next to the Sandgate Village - Valley of Despair Shrine.\nThen, the second can be found at the bottom of the sand hill leading on from the Fright Cliff - Rock Clash Platform Shrine, which is just after the Stone Vanguard fight.\nFor an even more detailed walkthrough of these areas beyond the Tallies, be sure to check out our full walkthrough.",
    "promot": "This is an excerpt from the file 'Keeness_of_Tiger.md', located in the main section titled 'Keeness of Tiger'. The section summary is: Keeness of Tiger is one of the main Key Items in Black Myth: Wukong's Yellow Wind Ridge area. It is a mandatory item you will come across throughout the chapter, as you need it to progress towards the chapter's final boss: the Yellow Wind Sage.\nThe Keeness of Tiger can be found in the Crouching Tiger Temple: Temple Entrance Shrine area. You will get it automatically after defeating the Tiger Vanguard boss. This boss can't be skipped so you don't have to worry about missing out on the item.\nKeeness of Tiger\nFor a full guide through the Crouching Tiger Temple area, be sure to read through our Crouching Tiger Temple Walkthrough in Chapter 2 - Yellow Sand, Desolate Dusk.\nBefore that, however, you can find out where the Keeness of Tiger can be used below. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where To Use The Keeness of Tiger in Black Myth: Wukong', and the detailed content is as follows:\nThe Keeness of Tiger can be used on the Tallies located in Chapter 2 - Yellow Wind Ridge to access the path under the Crouching Tiger Temple, and open the locked doors at Sandgate Village - Valley of Despair and Yellow Sand Formation - Windrest Gate Shrines. You will need to use this in conjunction with the Sterness of Stone Key Item, which can be found at Fright Cliff upon defeating the Stone Vanguard.\nThe easiest one of these Tallies to find is the one at the Crouching Tiger Temple, as it is in the arena where you fought the Tiger Vanguard.\nThe first gate can be found right next to the Sandgate Village - Valley of Despair Shrine.\nThen, the second can be found at the bottom of the sand hill leading on from the Fright Cliff - Rock Clash Platform Shrine, which is just after the Stone Vanguard fight.\nFor an even more detailed walkthrough of these areas beyond the Tallies, be sure to check out our full walkthrough.",
    "promot_tokens_num": 448
}