{
    "chunk_id": 877073482537,
    "source_file": "Father_of_Stones.md",
    "content_type": "one and two",
    "h1_title": "Father of Stones",
    "h2_title": "Father of Stones Boss Fight and Guide",
    "h1_content": "Father of Stones is a Yaoguai Chief you'll fight soon after you reach the Heights of Ember in Chapter 5 of Black Myth: Wukong.",
    "h2_content": "Just like fights against other stone bosses, it's best to skip elemental damage and go for pure attack power in this fight. You want your attacks to be heavy and hit hard, and for your defense to be up as much as possible.\nFather of Stones will use a variety of attacks in this fight, however, he's limited by the fact that he's holding a skeleton in one arm. This means he'll only ever try to hit you with one arm, giving you more opportunity to evade attacks or dodge them.\nThe first thing to watch out for is him swinging his arms in a combination move. He will lazily swing an arm at you a few times. But these can be dodged or missed entirely if you step back far enough. Alternatively, he will reach out to try and hit you, and often falls down straight away after performing the attack. As it takes a little while for him to recover, you can get your own combo of attacks in here.\nHe will sometimes leap in the air and try to land on you. Again, these can be dodged and ignored by stepping back. This is actually the case for most of his attacks, so bait him out to hit you and then take advantage of the slow recovery. If you stand behind him too long though, he'll sit down and quickly push himself toward you, rolling over and over to try and catch you.\nThe most dangerous of his attacks are the kicks that spark and send out a line of fire in your direction and when he roars. As soon as he opens his mouth, jump or step back to avoid the immediate area around him, where his roars will hit. Otherwise, this will knock you back and damage you.\nThe way to approach this fight is to build up your combos and then land a finishing blow on him as often as you can. When you attack like this, the heavy blow will knock him over and leave him vulnerable to a beat down.\nWhen you've bested him, collect the Father of Stones Spirit he leaves behind.\nFather of Stones",
    "promot": "This is an excerpt from the file 'Father_of_Stones.md', located in the main section titled 'Father of Stones'. The section summary is: Father of Stones is a Yaoguai Chief you'll fight soon after you reach the Heights of Ember in Chapter 5 of Black Myth: Wukong. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Father of Stones Boss Fight and Guide', and the detailed content is as follows:\nJust like fights against other stone bosses, it's best to skip elemental damage and go for pure attack power in this fight. You want your attacks to be heavy and hit hard, and for your defense to be up as much as possible.\nFather of Stones will use a variety of attacks in this fight, however, he's limited by the fact that he's holding a skeleton in one arm. This means he'll only ever try to hit you with one arm, giving you more opportunity to evade attacks or dodge them.\nThe first thing to watch out for is him swinging his arms in a combination move. He will lazily swing an arm at you a few times. But these can be dodged or missed entirely if you step back far enough. Alternatively, he will reach out to try and hit you, and often falls down straight away after performing the attack. As it takes a little while for him to recover, you can get your own combo of attacks in here.\nHe will sometimes leap in the air and try to land on you. Again, these can be dodged and ignored by stepping back. This is actually the case for most of his attacks, so bait him out to hit you and then take advantage of the slow recovery. If you stand behind him too long though, he'll sit down and quickly push himself toward you, rolling over and over to try and catch you.\nThe most dangerous of his attacks are the kicks that spark and send out a line of fire in your direction and when he roars. As soon as he opens his mouth, jump or step back to avoid the immediate area around him, where his roars will hit. Otherwise, this will knock you back and damage you.\nThe way to approach this fight is to build up your combos and then land a finishing blow on him as often as you can. When you attack like this, the heavy blow will knock him over and leave him vulnerable to a beat down.\nWhen you've bested him, collect the Father of Stones Spirit he leaves behind.\nFather of Stones",
    "promot_tokens_num": 509
}