{
    "chunk_id": 254804851895,
    "source_file": "Chu-Bai_Spear.md",
    "content_type": "one and two",
    "h1_title": "Chu-Bai Spear",
    "h2_title": "Black Myth: Wukong Chu-Bai Spear Location",
    "h1_content": "The Chu-Bai Spear is a weapon in Black Myth: Wukong. It comes with solid stats, damage, and a unique effect like many of the other Weapons in the game.\nThe weapon comes with 75 damage, and the following unique effect:\n* Integrate spear techniques into light attack combo and increases the damage dealt by Thrust stance moves",
    "h2_content": "The Chu-Bai Spear can be found in Chapter 3 - The New West after completing the Prisoner's questline in the Pagoda Realm.\nChu-Bai Spear\nWeapons can be crafted throughout the game from the Shrines throughout the game's six chapters. Crafting weapons will require Will and various Crafting Materials from the game's locales and enemies. To craft the Chu-Bai Spear you will need:\n* 1 Chubai Spearhead\")\n* 4 Refined Iron Sand\n* 8 Yaoguai Core\n* 21,000 Will\nFor even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Armor and Gear locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.",
    "promot": "This is an excerpt from the file 'Chu-Bai_Spear.md', located in the main section titled 'Chu-Bai Spear'. The section summary is: The Chu-Bai Spear is a weapon in Black Myth: Wukong. It comes with solid stats, damage, and a unique effect like many of the other Weapons in the game.\nThe weapon comes with 75 damage, and the following unique effect:\n* Integrate spear techniques into light attack combo and increases the damage dealt by Thrust stance moves This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Chu-Bai Spear Location', and the detailed content is as follows:\nThe Chu-Bai Spear can be found in Chapter 3 - The New West after completing the Prisoner's questline in the Pagoda Realm.\nChu-Bai Spear\nWeapons can be crafted throughout the game from the Shrines throughout the game's six chapters. Crafting weapons will require Will and various Crafting Materials from the game's locales and enemies. To craft the Chu-Bai Spear you will need:\n* 1 Chubai Spearhead\")\n* 4 Refined Iron Sand\n* 8 Yaoguai Core\n* 21,000 Will\nFor even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Armor and Gear locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.",
    "promot_tokens_num": 333
}