{
    "chunk_id": 4026979499,
    "source_file": "Giant_Shigandang.md",
    "content_type": "one and two",
    "h1_title": "Giant Shigandang",
    "h2_title": "How to Find the Giant Shigandang",
    "h1_content": "Giant Shigandangis one of the optional Yaoguai Kings you can fight in Chapter 6 of Black Myth: Wukong\"). It's the only Yaoguai King that will be recorded in your Journal in Chapter 6. Unlocking it will require collecting Skandhas across the 5 previous chapters.",
    "h2_content": "To be able to summon it, you'll need to have collected the Skandhas through the previous Chapters. If you haven't already got your hands on these Skandhas, follow our guide to collecting them all here.\nGo to the clearing behind where you fought the Son of Stones, just off to the left. You'll see some water, a large rock to the left of it, and two golden trees on either side of the rock. You want to go to the right of the water to find the secret area that will take you to the hidden boss.\nYou'll need to ascend quite high up, but where the path reaches a dead end, up above there's an opening in the cliff that you can pass through. Follow this until you enter an area that's slightly covered and pass through this tunnel.\nAs you emerge in the wide open space, a Giant Shigandang will appear.",
    "promot": "This is an excerpt from the file 'Giant_Shigandang.md', located in the main section titled 'Giant Shigandang'. The section summary is: Giant Shigandangis one of the optional Yaoguai Kings you can fight in Chapter 6 of Black Myth: Wukong\"). It's the only Yaoguai King that will be recorded in your Journal in Chapter 6. Unlocking it will require collecting Skandhas across the 5 previous chapters. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'How to Find the Giant Shigandang', and the detailed content is as follows:\nTo be able to summon it, you'll need to have collected the Skandhas through the previous Chapters. If you haven't already got your hands on these Skandhas, follow our guide to collecting them all here.\nGo to the clearing behind where you fought the Son of Stones, just off to the left. You'll see some water, a large rock to the left of it, and two golden trees on either side of the rock. You want to go to the right of the water to find the secret area that will take you to the hidden boss.\nYou'll need to ascend quite high up, but where the path reaches a dead end, up above there's an opening in the cliff that you can pass through. Follow this until you enter an area that's slightly covered and pass through this tunnel.\nAs you emerge in the wide open space, a Giant Shigandang will appear.",
    "promot_tokens_num": 319
}