{
    "chunk_id": 442370258928,
    "source_file": "Yellow_Loong.md",
    "content_type": "one and two",
    "h1_title": "Yellow Loong",
    "h2_title": "Where to Find Yellow Loong",
    "h1_content": "Yellow Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 4 of Black Myth Wukong. Hiding across several rope bridges outside the middle of the Webbed Hollow, this boss can't be activated until you obtain a Key Item in the previous chapter. Yellow Loong is the final of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n* Rewards: Golden Lining Transformation Spell, Sea-Supporting Tendon, Golden Carp Curio, Kun Steel, Loong Pearl, Mind Core, 6998 Experience, 5049 Will",
    "h2_content": "As an optional secret boss, Yellow Loong can be found once you reach the end of the Middle of the Webbed Hollow, shortly after defeating the Right Hand of Buddha, and crossing its corpse.\nYou can find a rope bridge to the left after dropping down, leading to a second rope bridge full of Clawed Cocoons (we recommend using Cloud Step to bypass them) leading outside the hollow.\nFollow the path up, and you'll reach a Shrine at the Relief of the Fallen Loong, and above will be a pavilion where the boss waits.\nHowever, in order to activate this secret boss, you'll need to obtain the Loong Scales from the Yellow Wind Ridge in Chapter 2.\nHead through the Sandgate Village and defeat the King of Flowing Sand and his Second Rat Prince son. After defeating the pair (or only the son), head left from the boss arena and into the Valley of Despair.\nOnce you arrive in the large covered valley area, keep to the left to find a large lower platform by a slightly rounded red wall lined with small statues. At this point, if you did not kill the King of Flowing Sand, he’ll summon his other son, the First Rat Prince — otherwise you can use the Pungent Flesh Chunk to summon him yourself.\nWhile fighting the First Rat Prince, you can lure him into performing one of his large slam attacks when facing the rounded wall, and it will cause a crack to appear in the wall. If you are unable to lure the boss into forming a crack in the wall, you can even do so yourself by hitting it with a very strong attack - we recommend the Wandering Wight’s Spirit Attack, or the Azure Dust Transformation Spell’s final attack.\nYou can enter the crack in the wall, and on the other side you’ll find a chest containing the Loong Scales. With this item, you’ll be able to unlock the boss.",
    "promot": "This is an excerpt from the file 'Yellow_Loong.md', located in the main section titled 'Yellow Loong'. The section summary is: Yellow Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 4 of Black Myth Wukong. Hiding across several rope bridges outside the middle of the Webbed Hollow, this boss can't be activated until you obtain a Key Item in the previous chapter. Yellow Loong is the final of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n* Rewards: Golden Lining Transformation Spell, Sea-Supporting Tendon, Golden Carp Curio, Kun Steel, Loong Pearl, Mind Core, 6998 Experience, 5049 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find Yellow Loong', and the detailed content is as follows:\nAs an optional secret boss, Yellow Loong can be found once you reach the end of the Middle of the Webbed Hollow, shortly after defeating the Right Hand of Buddha, and crossing its corpse.\nYou can find a rope bridge to the left after dropping down, leading to a second rope bridge full of Clawed Cocoons (we recommend using Cloud Step to bypass them) leading outside the hollow.\nFollow the path up, and you'll reach a Shrine at the Relief of the Fallen Loong, and above will be a pavilion where the boss waits.\nHowever, in order to activate this secret boss, you'll need to obtain the Loong Scales from the Yellow Wind Ridge in Chapter 2.\nHead through the Sandgate Village and defeat the King of Flowing Sand and his Second Rat Prince son. After defeating the pair (or only the son), head left from the boss arena and into the Valley of Despair.\nOnce you arrive in the large covered valley area, keep to the left to find a large lower platform by a slightly rounded red wall lined with small statues. At this point, if you did not kill the King of Flowing Sand, he’ll summon his other son, the First Rat Prince — otherwise you can use the Pungent Flesh Chunk to summon him yourself.\nWhile fighting the First Rat Prince, you can lure him into performing one of his large slam attacks when facing the rounded wall, and it will cause a crack to appear in the wall. If you are unable to lure the boss into forming a crack in the wall, you can even do so yourself by hitting it with a very strong attack - we recommend the Wandering Wight’s Spirit Attack, or the Azure Dust Transformation Spell’s final attack.\nYou can enter the crack in the wall, and on the other side you’ll find a chest containing the Loong Scales. With this item, you’ll be able to unlock the boss.",
    "promot_tokens_num": 575
}