{
    "chunk_id": 896924135886,
    "source_file": "Rat_Sage_Staff.md",
    "content_type": "one and two",
    "h1_title": "Rat Sage Staff",
    "h2_title": "Black Myth: Wukong Rat Sage Staff Location",
    "h1_content": "The Rat Sage Staff Staff is an Epic weapon in Black Myth: Wukong. It comes with solid stats, damage, and a decent, albeit easily outbeaten unique effect compared to the other Weapons in the game.\nThe weapon comes with a respectable 66 damage, and the unique effect of making the fourth move of a light attack combo and the mobile staff spin stir up a whirlwind of sands, increasing attack range and damage.",
    "h2_content": "The Rat Sage Staff can be found in Chapter 2 - Yellow Wind Ridge upon defeating Yellow Wind Sage at the end of the chapter. This is a mandatory boss that is at the end of the chapter, so you can't miss him.\nRat Sage Staff\nWeapons can be crafted throughout the game from the Shrines throughout the game's six chapters. Crafting weapons will require Will and various Crafting Materials from the game's locales and enemies. To craft the Rat Sage Staff you will need:\n* 1 Samadhi Wind Agate\n* 4 Refined Iron Sand\n* 8 Yaoguai Core\n* 21,000 Will\nFor even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Armor and Gear locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.",
    "promot": "This is an excerpt from the file 'Rat_Sage_Staff.md', located in the main section titled 'Rat Sage Staff'. The section summary is: The Rat Sage Staff Staff is an Epic weapon in Black Myth: Wukong. It comes with solid stats, damage, and a decent, albeit easily outbeaten unique effect compared to the other Weapons in the game.\nThe weapon comes with a respectable 66 damage, and the unique effect of making the fourth move of a light attack combo and the mobile staff spin stir up a whirlwind of sands, increasing attack range and damage. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Rat Sage Staff Location', and the detailed content is as follows:\nThe Rat Sage Staff can be found in Chapter 2 - Yellow Wind Ridge upon defeating Yellow Wind Sage at the end of the chapter. This is a mandatory boss that is at the end of the chapter, so you can't miss him.\nRat Sage Staff\nWeapons can be crafted throughout the game from the Shrines throughout the game's six chapters. Crafting weapons will require Will and various Crafting Materials from the game's locales and enemies. To craft the Rat Sage Staff you will need:\n* 1 Samadhi Wind Agate\n* 4 Refined Iron Sand\n* 8 Yaoguai Core\n* 21,000 Will\nFor even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Armor and Gear locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.",
    "promot_tokens_num": 365
}