{
    "chunk_id": 802893337318,
    "source_file": "Virtuous_Bamboo_Engraving.md",
    "content_type": "one and two",
    "h1_title": "Virtuous Bamboo Engraving",
    "h2_title": "Black Myth: Wukong Virtuous Bamboo Engraving Location",
    "h1_content": "The Virtuous Bamboo Engraving is one of the many Curios items you can find in Black Myth: Wukong. Like the rest of these items, once found, it can be equipped from the Equipment menu.\nWith the Virtuous Bamboo Engraving equipped your Might recovery rate is slightly increased.\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, the item will stay at its current power throughout the game. If you want a better buff or something else to fit your build, you will need to switch it out.",
    "h2_content": "The Virtuous Bamboo Engraving Curios item can be found randomly by defeating Snake Heads enemies in The Webbed Hollow. The best spot to farm it is at the Temple of Yellow Flowers entrance.\nVirtuous Bamboo Engraving\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "promot": "This is an excerpt from the file 'Virtuous_Bamboo_Engraving.md', located in the main section titled 'Virtuous Bamboo Engraving'. The section summary is: The Virtuous Bamboo Engraving is one of the many Curios items you can find in Black Myth: Wukong. Like the rest of these items, once found, it can be equipped from the Equipment menu.\nWith the Virtuous Bamboo Engraving equipped your Might recovery rate is slightly increased.\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, the item will stay at its current power throughout the game. If you want a better buff or something else to fit your build, you will need to switch it out. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Virtuous Bamboo Engraving Location', and the detailed content is as follows:\nThe Virtuous Bamboo Engraving Curios item can be found randomly by defeating Snake Heads enemies in The Webbed Hollow. The best spot to farm it is at the Temple of Yellow Flowers entrance.\nVirtuous Bamboo Engraving\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "promot_tokens_num": 303
}