{
    "chunk_id": 761364281728,
    "source_file": "Secret_Bosses_in_Black_Myth_Wukong.md",
    "content_type": "one and two",
    "h1_title": "Secret Bosses in Black Myth Wukong",
    "h2_title": "Erlang, the Sacred Divinity",
    "h1_content": "Black Myth: Wukong has a wealth of secrets to discover, from Transformation Spells to hidden Key Items and, of course, bosses. While some secret bosses can be found through exploration, others are well-hidden and require completing NPC questlines, collecting multiple items, or even fighting mini-bosses to make them emerge. Here's a breakdown of all the secret bosses in the game, organised by chapter.\nSecret Bosses in Chapter 1| Secret Bosses in Chapter 2| Secret Bosses in Chapter 3\n---|---|---\nSecret Bosses in Chapter 4| Secret Bosses in Chapter 5| Secret Bosses in Chapter 6\n# Secret Bosses in Chapter 1\nChapter 1 has two secret bosses for you to take on. The first can be found in the chapter's secret area Secret: Ancient Guanyin Temple; the second, you'll find behind a waterfall, but only after collecting the Loong Scales from Chapter 2.",
    "h2_content": "In Chapter 3 of the game, you may have already visited The Great Pagoda. This is where tapestries are hung after you've completed chapters of the game.\nHowever, there is a final spot that can be unlocked if you meet the right conditions. You'll need to finish the secret areas from each chapter by beating the final bosses in each one and finish the questline for the Green-Capped Martialist from Chapter 3.\nWhen you return to The Great Pagoda, a cutscene will  as you head toward the top of the room. You'll also unlock the secret area, which is Mount Mei. Waiting for you here, is Erlang, the Sacred Divinity.\nYou can head to Mount Mei as soon as you complete the secret areas and the Treasure Hunter quest. But we've included these bosses as part of Chapter 6, as we'd recommend completing the game first and then pressing CONTINUE, going to Mount Mei and beating the secret bosses there. Beating the final boss again after doing this will unlock the true ending of the game.\nErlang, the Sacred Divinity",
    "promot": "This is an excerpt from the file 'Secret_Bosses_in_Black_Myth_Wukong.md', located in the main section titled 'Secret Bosses in Black Myth Wukong'. The section summary is: Black Myth: Wukong has a wealth of secrets to discover, from Transformation Spells to hidden Key Items and, of course, bosses. While some secret bosses can be found through exploration, others are well-hidden and require completing NPC questlines, collecting multiple items, or even fighting mini-bosses to make them emerge. Here's a breakdown of all the secret bosses in the game, organised by chapter.\nSecret Bosses in Chapter 1| Secret Bosses in Chapter 2| Secret Bosses in Chapter 3\n---|---|---\nSecret Bosses in Chapter 4| Secret Bosses in Chapter 5| Secret Bosses in Chapter 6\n# Secret Bosses in Chapter 1\nChapter 1 has two secret bosses for you to take on. The first can be found in the chapter's secret area Secret: Ancient Guanyin Temple; the second, you'll find behind a waterfall, but only after collecting the Loong Scales from Chapter 2. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Erlang, the Sacred Divinity', and the detailed content is as follows:\nIn Chapter 3 of the game, you may have already visited The Great Pagoda. This is where tapestries are hung after you've completed chapters of the game.\nHowever, there is a final spot that can be unlocked if you meet the right conditions. You'll need to finish the secret areas from each chapter by beating the final bosses in each one and finish the questline for the Green-Capped Martialist from Chapter 3.\nWhen you return to The Great Pagoda, a cutscene will  as you head toward the top of the room. You'll also unlock the secret area, which is Mount Mei. Waiting for you here, is Erlang, the Sacred Divinity.\nYou can head to Mount Mei as soon as you complete the secret areas and the Treasure Hunter quest. But we've included these bosses as part of Chapter 6, as we'd recommend completing the game first and then pressing CONTINUE, going to Mount Mei and beating the secret bosses there. Beating the final boss again after doing this will unlock the true ending of the game.\nErlang, the Sacred Divinity",
    "promot_tokens_num": 504
}