{
    "chunk_id": 707052831458,
    "source_file": "How_to_Unlock_the_Secret_Loong_Dragon_Bosses.md",
    "content_type": "one and two",
    "h1_title": "How to Unlock the Secret Loong Dragon Bosses",
    "h2_title": "How to Find Cyan Loong - Chapter 3 Dragon Boss",
    "h1_content": "Chapter 1 of Black Myth: Wukong has more than one secret boss for you to find, and one of these is a Dragon that's tucked away behind a waterfall. Getting to the boss, however, requires finding a key item that you can't get until Chapter 2. This isn't the only Loong boss you can find in the game, so if you want to access the secret area, and know the whereabouts of the Loong Dragon Bosses, here's everything you need to know.\n* How to Get the Loong Scales\n* How to Find the Chapter 1 Secret Dragon Boss\n* How to Find the Chapter 2 Secret Boss\n* How to Find Chapter 3 Dragon Boss\n* How to Find the Chapter 4 Secret Boss",
    "h2_content": "This one is slightly different than the bosses you'll find in Chapters 1 and 2, as there's nothing you need to interact with. Instead,  through Chapter 3 until you reach the Bitter Lake and the Turtle Island Keeper's Shrine.\nYou'll need to wait until you can interact with the Shrine, but when you can, turn and face the water. As you walk toward it, you'll hear a voice again. Look toward the edge of the cliff and down to the left slightly, to see a Dragon Statue that sits by the water.\nAs you approach the statue, it will come to life and you'll be thrown into a fight against Cyan Loong. When you've beaten him, a Treasure Chest will appear in the nearby waterfall, which contains Breath of Fire Soak and Mountain-Shaking Core. You'll also unlock the crafting recipe for the mythical Golden Loong Staff.\nCyan Loong",
    "promot": "This is an excerpt from the file 'How_to_Unlock_the_Secret_Loong_Dragon_Bosses.md', located in the main section titled 'How to Unlock the Secret Loong Dragon Bosses'. The section summary is: Chapter 1 of Black Myth: Wukong has more than one secret boss for you to find, and one of these is a Dragon that's tucked away behind a waterfall. Getting to the boss, however, requires finding a key item that you can't get until Chapter 2. This isn't the only Loong boss you can find in the game, so if you want to access the secret area, and know the whereabouts of the Loong Dragon Bosses, here's everything you need to know.\n* How to Get the Loong Scales\n* How to Find the Chapter 1 Secret Dragon Boss\n* How to Find the Chapter 2 Secret Boss\n* How to Find Chapter 3 Dragon Boss\n* How to Find the Chapter 4 Secret Boss This excerpt merges content from both the main and sub-sections. The sub-section is titled 'How to Find Cyan Loong - Chapter 3 Dragon Boss', and the detailed content is as follows:\nThis one is slightly different than the bosses you'll find in Chapters 1 and 2, as there's nothing you need to interact with. Instead,  through Chapter 3 until you reach the Bitter Lake and the Turtle Island Keeper's Shrine.\nYou'll need to wait until you can interact with the Shrine, but when you can, turn and face the water. As you walk toward it, you'll hear a voice again. Look toward the edge of the cliff and down to the left slightly, to see a Dragon Statue that sits by the water.\nAs you approach the statue, it will come to life and you'll be thrown into a fight against Cyan Loong. When you've beaten him, a Treasure Chest will appear in the nearby waterfall, which contains Breath of Fire Soak and Mountain-Shaking Core. You'll also unlock the crafting recipe for the mythical Golden Loong Staff.\nCyan Loong",
    "promot_tokens_num": 429
}