{
    "chunk_id": 404844952645,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Forest of Wolves Walkthrough",
    "h2_title": "Yaoguai King Boss Fight - Lingxuzi",
    "h1_content": "Black Myth: Wukong's Chapter 1 begins with a prologue that takes place during a pivotal scene in the story of the Monkey King, Sun Wukong. Below you'll find a guide to the tutorial, and for the first major area of Black Wind Mountain: The Forest of Wolves, as well as how to defeat its many bosses that include the Bullguard, Gaugnzhi and Yaoguai King Lingxuzi.\n* **Jump to A Section:**\n* **Front Hills**\n* Yaoguai Chief - Bullguard\n* **Outside the Forest**\n* Yaoguai Chief - Guangzhi\n* **Guanyin Temple**\n* Yaoguai King - Lingxuzi\n# Prologue\nUpon beginning your journey, you’ll be thrust into the role of the mythical Sun Wukong as he rebels against the Court of Heaven and its Heavenly Kings. Undaunted by their army, Sun Wukong calls them out, prompting the nephew of the Jade Emperor, Erlang Shen, to meet him in combat.",
    "h2_content": "Compared to Lingxuzi, the last wolf boss you fought may as well have been a puppy. This Yaoguai King is a large hulking beast of a wolf that hits as hard as he is big. Luckily, for all his size, his attacks come with clear telegraphs to help you dodge and counter his moves.\nHe’ll usually start the fight with a big leaping strike, falling to the ground with one slash, and then quickly following up with a second slash from his other claw. Unfortunately, he’s a pretty evasive foe, and finding the right moments to counter attack can be tricky.\nCertain times, he’ll dodge back after his attacks, but if he pauses to lick his claws, that’s your cue to sprint in (gaining a bonus from the Pilgrim Set) and attack with a quick light combo. Sometimes he may appear to charge the air around him — which means he’s preparing for a damaging howl. That’s your cue to simply run back a few paces to stand outside his range.\nTry not to get disoriented as he strafes before many of his attacks - which can sometimes end in a strafing lunge where he swipes upward as he slides toward you.\nOnce he stops running, watch for him to raise a claw. These attacks are usually simple swipes with a big delay, so wait for the claw to descend before dodging and attacking. His two-hit attacks only come from his leaps, so as long as he’s stationary, his attacks will be easier to anticipate.\nSometimes, Lingxuzi can dive at you face first, moving his open jaws up before biting down. You need only dodge his face, meaning you can dodge right into his arms and keep attacking.\nHis most threatening attack comes when he disengages from the fight and jump to a nearby rooftop. He’ll jump around a bit, and then leap high into the air to bellyflop onto you, causing a large shockwave that you’ll need to time well and dodge or take a ton of damage.\nHe also has an uppercut grab he can sometimes employ after a dashing strike that’s hard to see coming, which can launch you into the air for a multi-hit attack that can deal a scary amount of damage. This move comes when he’s hunched over and growls, but he won’t raise his claw until it’s too late to dodge!\nOnce you’ve got him back on the ground, try utilizing your new Red Waves spell to fight a wolf with a wolf, and unleash the fiery spin attacks while still making sure to dodge his swipes. Even though you have a new separate health bar, you’ll be able to unleash more damage in this form if you don’t spend the entire time taking damage.\nRemember you can also employ the Immobilize spell to keep him penned in if he strafes too much to hit, or you can use it to shut down his damaging roar or swipes so that you can interrupt his attack and hit him with a charged strike.\nWith his slow attacks, he’ll be easier to read than Guangzhi, making this battle one of patience and getting your hits in where you can before falling back to wait for the next attack you can dodge and punish. Once the mighty Lingxuzi falls, you’ll earn the **Grey Wolf Mask** and a **Mind Core** — a unique upgrade material.\nLingxuzi\nThe Keeper will encourage you to look around now that he’s been defeated, and aside from more mushrooms and jade lotus to harvest in one corner, you can check the far right corner from the entrance to the arena to find a large chest that houses 2 **Tiny Piece of Gold** , and 3 **Yarn**.\nThe biggest reward waits up the stairs in the main building. Look to the left for a small gold pot placed before an altar with a large statue, and open it to find a **Celestial Jade Lotus Pill**. This is a collectible upgrade that will greatly increase your Maximum Health much more than investing a skill point!\nBlack Wind Mountain Celestial Jade Lotus Pill\nWhen you’re ready to move on, exit through the back of the building to find a new Shrine at the start of Chapter 1’s next region: **The Bamboo Grove**.\nForest of Wolves Complete",
    "promot": "This is an excerpt from the file 'Forest_of_Wolves_Walkthrough.md', located in the main section titled 'Forest of Wolves Walkthrough'. The section summary is: Black Myth: Wukong's Chapter 1 begins with a prologue that takes place during a pivotal scene in the story of the Monkey King, Sun Wukong. Below you'll find a guide to the tutorial, and for the first major area of Black Wind Mountain: The Forest of Wolves, as well as how to defeat its many bosses that include the Bullguard, Gaugnzhi and Yaoguai King Lingxuzi.\n* **Jump to A Section:**\n* **Front Hills**\n* Yaoguai Chief - Bullguard\n* **Outside the Forest**\n* Yaoguai Chief - Guangzhi\n* **Guanyin Temple**\n* Yaoguai King - Lingxuzi\n# Prologue\nUpon beginning your journey, you’ll be thrust into the role of the mythical Sun Wukong as he rebels against the Court of Heaven and its Heavenly Kings. Undaunted by their army, Sun Wukong calls them out, prompting the nephew of the Jade Emperor, Erlang Shen, to meet him in combat. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Yaoguai King Boss Fight - Lingxuzi', and the detailed content is as follows:\nCompared to Lingxuzi, the last wolf boss you fought may as well have been a puppy. This Yaoguai King is a large hulking beast of a wolf that hits as hard as he is big. Luckily, for all his size, his attacks come with clear telegraphs to help you dodge and counter his moves.\nHe’ll usually start the fight with a big leaping strike, falling to the ground with one slash, and then quickly following up with a second slash from his other claw. Unfortunately, he’s a pretty evasive foe, and finding the right moments to counter attack can be tricky.\nCertain times, he’ll dodge back after his attacks, but if he pauses to lick his claws, that’s your cue to sprint in (gaining a bonus from the Pilgrim Set) and attack with a quick light combo. Sometimes he may appear to charge the air around him — which means he’s preparing for a damaging howl. That’s your cue to simply run back a few paces to stand outside his range.\nTry not to get disoriented as he strafes before many of his attacks - which can sometimes end in a strafing lunge where he swipes upward as he slides toward you.\nOnce he stops running, watch for him to raise a claw. These attacks are usually simple swipes with a big delay, so wait for the claw to descend before dodging and attacking. His two-hit attacks only come from his leaps, so as long as he’s stationary, his attacks will be easier to anticipate.\nSometimes, Lingxuzi can dive at you face first, moving his open jaws up before biting down. You need only dodge his face, meaning you can dodge right into his arms and keep attacking.\nHis most threatening attack comes when he disengages from the fight and jump to a nearby rooftop. He’ll jump around a bit, and then leap high into the air to bellyflop onto you, causing a large shockwave that you’ll need to time well and dodge or take a ton of damage.\nHe also has an uppercut grab he can sometimes employ after a dashing strike that’s hard to see coming, which can launch you into the air for a multi-hit attack that can deal a scary amount of damage. This move comes when he’s hunched over and growls, but he won’t raise his claw until it’s too late to dodge!\nOnce you’ve got him back on the ground, try utilizing your new Red Waves spell to fight a wolf with a wolf, and unleash the fiery spin attacks while still making sure to dodge his swipes. Even though you have a new separate health bar, you’ll be able to unleash more damage in this form if you don’t spend the entire time taking damage.\nRemember you can also employ the Immobilize spell to keep him penned in if he strafes too much to hit, or you can use it to shut down his damaging roar or swipes so that you can interrupt his attack and hit him with a charged strike.\nWith his slow attacks, he’ll be easier to read than Guangzhi, making this battle one of patience and getting your hits in where you can before falling back to wait for the next attack you can dodge and punish. Once the mighty Lingxuzi falls, you’ll earn the **Grey Wolf Mask** and a **Mind Core** — a unique upgrade material.\nLingxuzi\nThe Keeper will encourage you to look around now that he’s been defeated, and aside from more mushrooms and jade lotus to harvest in one corner, you can check the far right corner from the entrance to the arena to find a large chest that houses 2 **Tiny Piece of Gold** , and 3 **Yarn**.\nThe biggest reward waits up the stairs in the main building. Look to the left for a small gold pot placed before an altar with a large statue, and open it to find a **Celestial Jade Lotus Pill**. This is a collectible upgrade that will greatly increase your Maximum Health much more than investing a skill point!\nBlack Wind Mountain Celestial Jade Lotus Pill\nWhen you’re ready to move on, exit through the back of the building to find a new Shrine at the start of Chapter 1’s next region: **The Bamboo Grove**.\nForest of Wolves Complete",
    "promot_tokens_num": 1169
}