{
    "chunk_id": 230572586313,
    "source_file": "Chapter_5-Golden_Child,_Crimson_Blood.md",
    "content_type": "one and two",
    "h1_title": "Chapter 5 - Golden Child, Crimson Blood",
    "h2_title": "Chapter 5 Walkthrough Sections",
    "h1_content": "Golden Child, Crimson Blood is the fifth Chapter of Black Myth: Wukong, taking place in The Flaming Mountains where five element carts guard the mysteries of the region. This Walkthrough is divided up by the major regions in this chapter marked by Shrines, and includes guides to help you through each area, where to find important treasures and key items, and how to defeat the many required and optional bosses you'll find along the way.",
    "h2_content": "Chapter 5 of Black Myth: Wukong takes place in The Flaming Mountains, where lava flows and the paths are covered in ash. With the help of familiar faces, the Destined One treads the treacherous path to come face to face with the Bull King.\nThis walkthrough covers the following sections:\n*  **Woods of Ember**\n*  **Furnace Valley**\n*  **Field of Fire**\n*  **Chapter 5 Secret - Bishui Cave**",
    "promot": "This is an excerpt from the file 'Chapter_5-Golden_Child,_Crimson_Blood.md', located in the main section titled 'Chapter 5 - Golden Child, Crimson Blood'. The section summary is: Golden Child, Crimson Blood is the fifth Chapter of Black Myth: Wukong, taking place in The Flaming Mountains where five element carts guard the mysteries of the region. This Walkthrough is divided up by the major regions in this chapter marked by Shrines, and includes guides to help you through each area, where to find important treasures and key items, and how to defeat the many required and optional bosses you'll find along the way. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Chapter 5 Walkthrough Sections', and the detailed content is as follows:\nChapter 5 of Black Myth: Wukong takes place in The Flaming Mountains, where lava flows and the paths are covered in ash. With the help of familiar faces, the Destined One treads the treacherous path to come face to face with the Bull King.\nThis walkthrough covers the following sections:\n*  **Woods of Ember**\n*  **Furnace Valley**\n*  **Field of Fire**\n*  **Chapter 5 Secret - Bishui Cave**",
    "promot_tokens_num": 269
}