{
    "chunk_id": 821545716684,
    "source_file": "Crimson-Silver_Cart.md",
    "content_type": "one and two",
    "h1_title": "Crimson-Silver Cart",
    "h2_title": "Crimson Silver Cart Boss Fight and Guide",
    "h1_content": "Crimson-Silver Cart is a Yaoguai Chief boss fight that you'll go up against after defeating the Keeper of the Flaming Mountains and the Yin-Yang Fish in The Emerald Hall during Chapter 5 in Black Myth: Wukong. Blocking the pathway from top of the mountain, the cart is just one of the Five Element Carts you'll need to fight in this Chapter.\nFrom The Emerald Hall altar, go right and continue along the main path head up the stairs and onto the ashen path. Follow it up and around to the left, crossing over the bridge and heading toward the archway in the distance.\nStep through the archway and look to the left to see a treasure chest. Open this to find Blood of the Iron Bull and gold pieces. Proceed up the stairs to the right, past the bull guard, and fire will start to rain down on you -- which you know means another cart is not far off!\nTake the stairs up to the right and follow these up and into the dark cave. Then go right again, and up the next set of stairs to find the Crimson-Silver Cart",
    "h2_content": "If you've exhausted all the dialogue with the Pale-Axe Stalwart so far, the first thing you'll notice is that you've got his help when it comes to beating this boss.\nThe only real difference between this fight and the one with the previous carts is that the Crimson-Silver Cart has a wider area that it attacks in. Not only will it shoot flames out at the bottom all around it, but it will also roll around and try to mow you down.\nAs soon as you see smoke start to build around it, you'll want to move out of its way, because this is when the fire is coming. Beyond that, you'll also notice tweaks to the punching attacks. Rather than just slamming its fists down once, it will try to land a combo of punches.\nTo make the fight easier, use Immobilize to keep the cart locked in place. That way, you and the Pale-Axe Stalwart can work together to quickly whittle down its health.\nCrimson-Silver Cart",
    "promot": "This is an excerpt from the file 'Crimson-Silver_Cart.md', located in the main section titled 'Crimson-Silver Cart'. The section summary is: Crimson-Silver Cart is a Yaoguai Chief boss fight that you'll go up against after defeating the Keeper of the Flaming Mountains and the Yin-Yang Fish in The Emerald Hall during Chapter 5 in Black Myth: Wukong. Blocking the pathway from top of the mountain, the cart is just one of the Five Element Carts you'll need to fight in this Chapter.\nFrom The Emerald Hall altar, go right and continue along the main path head up the stairs and onto the ashen path. Follow it up and around to the left, crossing over the bridge and heading toward the archway in the distance.\nStep through the archway and look to the left to see a treasure chest. Open this to find Blood of the Iron Bull and gold pieces. Proceed up the stairs to the right, past the bull guard, and fire will start to rain down on you -- which you know means another cart is not far off!\nTake the stairs up to the right and follow these up and into the dark cave. Then go right again, and up the next set of stairs to find the Crimson-Silver Cart This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Crimson Silver Cart Boss Fight and Guide', and the detailed content is as follows:\nIf you've exhausted all the dialogue with the Pale-Axe Stalwart so far, the first thing you'll notice is that you've got his help when it comes to beating this boss.\nThe only real difference between this fight and the one with the previous carts is that the Crimson-Silver Cart has a wider area that it attacks in. Not only will it shoot flames out at the bottom all around it, but it will also roll around and try to mow you down.\nAs soon as you see smoke start to build around it, you'll want to move out of its way, because this is when the fire is coming. Beyond that, you'll also notice tweaks to the punching attacks. Rather than just slamming its fists down once, it will try to land a combo of punches.\nTo make the fight easier, use Immobilize to keep the cart locked in place. That way, you and the Pale-Axe Stalwart can work together to quickly whittle down its health.\nCrimson-Silver Cart",
    "promot_tokens_num": 505
}