{
    "chunk_id": 938035687036,
    "source_file": "Copper_Pill.md",
    "content_type": "one and two",
    "h1_title": "Copper Pill",
    "h2_title": "Black Myth: Wukong Copper Pill Location",
    "h1_content": "Copper Pill is one of the Epic Soaks for your Gourds in Black Myth: Wukong. The Soak's ability is rather specialised, useful for specific spell builds or when adopting a particular style, over some of the other Soaks, which have a more general use.\nWith the Copper Pill Soak equipped, after using the gourd, the next Rock Solid cast costs no mana for a short duration. If you are using the Rock Solid spell, then this can be an incredibly useful addition to your build, giving you free uses of the spell, without needing to refill your mana as much. However, if you are not using the spell, then other Soaks will be more worthwhile.\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get to Rock Solid will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor",
    "h2_content": "The Copper Pill Soak can be found by a statue on the hill after the Tiger Vanguard fight at Crouching Tiger Temple \\- Temple Entrance in Yellow Wind Ridge. Simply follow the hill and inside a small box on the Shrine, you can find the Soak.\nThis location is along the main story path through this chapter, so the chances of you missing it, unlike some of the other secrets in the game, are incredibly low.\nSoaks are far more plentiful than the Drinks for your Gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "promot": "This is an excerpt from the file 'Copper_Pill.md', located in the main section titled 'Copper Pill'. The section summary is: Copper Pill is one of the Epic Soaks for your Gourds in Black Myth: Wukong. The Soak's ability is rather specialised, useful for specific spell builds or when adopting a particular style, over some of the other Soaks, which have a more general use.\nWith the Copper Pill Soak equipped, after using the gourd, the next Rock Solid cast costs no mana for a short duration. If you are using the Rock Solid spell, then this can be an incredibly useful addition to your build, giving you free uses of the spell, without needing to refill your mana as much. However, if you are not using the spell, then other Soaks will be more worthwhile.\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get to Rock Solid will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Copper Pill Location', and the detailed content is as follows:\nThe Copper Pill Soak can be found by a statue on the hill after the Tiger Vanguard fight at Crouching Tiger Temple \\- Temple Entrance in Yellow Wind Ridge. Simply follow the hill and inside a small box on the Shrine, you can find the Soak.\nThis location is along the main story path through this chapter, so the chances of you missing it, unlike some of the other secrets in the game, are incredibly low.\nSoaks are far more plentiful than the Drinks for your Gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "promot_tokens_num": 431
}