{
    "chunk_id": 314994927810,
    "source_file": "How_to_Find_the_Five_Skandhas_and_Unlock_a_Secret_Boss.md",
    "content_type": "one and two",
    "h1_title": "How to Find the Five Skandhas and Unlock a Secret Boss",
    "h2_title": "How to Find the Skandha of Feeling",
    "h1_content": "One of the earliest Key Items you might stumble across in Black Myth: Wukong is the Skandha of Form. However, it's not until the later stages of the game that this item becomes useful. There are 5 Skandhas to collect throughout the chapters, with 4 unlocking a secret boss in Chapter 6. Here's everything you need to know to get your hands on them.\n1. Skandha of Form\n2. Skandha of Feeling\n3. Skandha of Thought\n4. Skandha of Choice\n5. Use the Four Skandhas\n6. Skandha of Consciousness\n7. How to Use the Five Skandhas",
    "h2_content": "* **Location: Chapter 2 (Yellow Wind Ridge, Fright Cliff, Rockrest Flat).**\nThis one can be obtained after finding the secret boss Shigandang in Chapter 2.\nTo fight Shigandang, you'll need to collect the 6 Buddha's Eyeballs. Deliver these to the area near Rockret Flat, where you'll fight the Stone Vanguard and Shigandang will appear.\nWhen you've beaten the boss, it'll drop the Skandha of Feeling.",
    "promot": "This is an excerpt from the file 'How_to_Find_the_Five_Skandhas_and_Unlock_a_Secret_Boss.md', located in the main section titled 'How to Find the Five Skandhas and Unlock a Secret Boss'. The section summary is: One of the earliest Key Items you might stumble across in Black Myth: Wukong is the Skandha of Form. However, it's not until the later stages of the game that this item becomes useful. There are 5 Skandhas to collect throughout the chapters, with 4 unlocking a secret boss in Chapter 6. Here's everything you need to know to get your hands on them.\n1. Skandha of Form\n2. Skandha of Feeling\n3. Skandha of Thought\n4. Skandha of Choice\n5. Use the Four Skandhas\n6. Skandha of Consciousness\n7. How to Use the Five Skandhas This excerpt merges content from both the main and sub-sections. The sub-section is titled 'How to Find the Skandha of Feeling', and the detailed content is as follows:\n* **Location: Chapter 2 (Yellow Wind Ridge, Fright Cliff, Rockrest Flat).**\nThis one can be obtained after finding the secret boss Shigandang in Chapter 2.\nTo fight Shigandang, you'll need to collect the 6 Buddha's Eyeballs. Deliver these to the area near Rockret Flat, where you'll fight the Stone Vanguard and Shigandang will appear.\nWhen you've beaten the boss, it'll drop the Skandha of Feeling.",
    "promot_tokens_num": 336
}