{
    "chunk_id": 476610475545,
    "source_file": "The_Spirit_of_Captain_Void-Illusion.md",
    "content_type": "one and two",
    "h1_title": "The Spirit of Captain Void-Illusion",
    "h2_title": "Where to use The Spirit of Captain Void-Illusion in Black Myth: Wukong",
    "h1_content": "The Spirit of Captain Void-Illusion is one of the Key Items in Black Myth: Wukong's The New West region. This is the only Spirit in The New West that isn't obtained by killing a boss.\n_\"A unique cluster of will that cannot be cultivated. Why not gather it and explore its potential elsewhere?\"_\nThe Spirit of Captain Void-Illusion can be found at the Valley of Ecstasy - Longevity Road Shrine in The New West. From the Shrine, head to the right and around to the back corner of the area. Here you can find the body of Captain Void-Illusion, where you can take the Spirit.\nThe Spirit of Captain Void-Illusion",
    "h2_content": "The Spirit of Captain Void-Illusion can be used in conjunction with The Spirit of Captain Lotus-Vision, The Spirit of Captain Wise-Voice, and The Spirit of Captain Kalpa-Wave in The New West at the prisoner in the first cell at the base of the Pagoda Realm. With all of these items, you can return to the prisoner to obtain the Chubai Spearhead.\nThis material can be used to craft one of the higher-end Weapons in the game.",
    "promot": "This is an excerpt from the file 'The_Spirit_of_Captain_Void-Illusion.md', located in the main section titled 'The Spirit of Captain Void-Illusion'. The section summary is: The Spirit of Captain Void-Illusion is one of the Key Items in Black Myth: Wukong's The New West region. This is the only Spirit in The New West that isn't obtained by killing a boss.\n_\"A unique cluster of will that cannot be cultivated. Why not gather it and explore its potential elsewhere?\"_\nThe Spirit of Captain Void-Illusion can be found at the Valley of Ecstasy - Longevity Road Shrine in The New West. From the Shrine, head to the right and around to the back corner of the area. Here you can find the body of Captain Void-Illusion, where you can take the Spirit.\nThe Spirit of Captain Void-Illusion This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to use The Spirit of Captain Void-Illusion in Black Myth: Wukong', and the detailed content is as follows:\nThe Spirit of Captain Void-Illusion can be used in conjunction with The Spirit of Captain Lotus-Vision, The Spirit of Captain Wise-Voice, and The Spirit of Captain Kalpa-Wave in The New West at the prisoner in the first cell at the base of the Pagoda Realm. With all of these items, you can return to the prisoner to obtain the Chubai Spearhead.\nThis material can be used to craft one of the higher-end Weapons in the game.",
    "promot_tokens_num": 326
}