{
    "chunk_id": 266387559009,
    "source_file": "Immortal_Blessing_Gourd.md",
    "content_type": "one and two",
    "h1_title": "Immortal Blessing Gourd",
    "h2_title": "Black Myth: Wukong Immortal Blessing Gourd location",
    "h1_content": "The Immortal Blessing Gourd is one of the strongest Gourds in Black Myth: Wukong, with one of the most unique abilities out of the entire range of them. Due to its strength, and the fact it has 8 uses by default, the Immortal Blessing Gourd can't be upgraded.\nWhen you have the Legendary Immortal Blessing Gourd equipped, your health recovery is actually halved. However, your attack is increased for a short duration after using it, allowing you to deal significantly more damage than you would normally. This is a huge tradeoff, however, so it won't be for everyone, and you may want to opt for another Gourd in the game or the traditional Old Gourd, which you can upgrade to the Supreme Gourd.",
    "h2_content": "The Immortal Blessing Gourd can be bought from the Shen Monkey Vendor in Black Wind Mountain from the start of Chapter 5 onwards. You will need to obtain the Buddha's Right Hand material) from the boss of the same name in The Webbed Hollow, as well as the Buddha's Left Hand from Baw-Li-Guhh-Baw in The Webbed Hollow's Lower Hollow.\nBuddha's Right Hand is a mandatory boss during the chapter, so you can't miss them. However, Baw-Li-Guhh-Baw is completely optional, found by the Lower Hollow Shrine. Our walkthrough of the Lower Hollow will take you through how you can find him from the boss fight with the Buddha's Right Hand.\nWith both of these bosses defeated, at the start of Chapter 5, you can return to the Shen Monkey Vendor to buy the Immortal Blessing Gourd.\nImmortal Blessing Gourd\nFor even more guides and tips on finding all the Gourd customisation items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, Awaken Wine Worm locations, and Luoija Fragrant Vine locations.",
    "promot": "This is an excerpt from the file 'Immortal_Blessing_Gourd.md', located in the main section titled 'Immortal Blessing Gourd'. The section summary is: The Immortal Blessing Gourd is one of the strongest Gourds in Black Myth: Wukong, with one of the most unique abilities out of the entire range of them. Due to its strength, and the fact it has 8 uses by default, the Immortal Blessing Gourd can't be upgraded.\nWhen you have the Legendary Immortal Blessing Gourd equipped, your health recovery is actually halved. However, your attack is increased for a short duration after using it, allowing you to deal significantly more damage than you would normally. This is a huge tradeoff, however, so it won't be for everyone, and you may want to opt for another Gourd in the game or the traditional Old Gourd, which you can upgrade to the Supreme Gourd. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Immortal Blessing Gourd location', and the detailed content is as follows:\nThe Immortal Blessing Gourd can be bought from the Shen Monkey Vendor in Black Wind Mountain from the start of Chapter 5 onwards. You will need to obtain the Buddha's Right Hand material) from the boss of the same name in The Webbed Hollow, as well as the Buddha's Left Hand from Baw-Li-Guhh-Baw in The Webbed Hollow's Lower Hollow.\nBuddha's Right Hand is a mandatory boss during the chapter, so you can't miss them. However, Baw-Li-Guhh-Baw is completely optional, found by the Lower Hollow Shrine. Our walkthrough of the Lower Hollow will take you through how you can find him from the boss fight with the Buddha's Right Hand.\nWith both of these bosses defeated, at the start of Chapter 5, you can return to the Shen Monkey Vendor to buy the Immortal Blessing Gourd.\nImmortal Blessing Gourd\nFor even more guides and tips on finding all the Gourd customisation items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, Awaken Wine Worm locations, and Luoija Fragrant Vine locations.",
    "promot_tokens_num": 478
}