{
    "chunk_id": 84237919487,
    "source_file": "How_to_Unlock_the_Chapter_4_Secret_Area.md",
    "content_type": "one and two",
    "h1_title": "How to Unlock the Chapter 4 Secret Area",
    "h2_title": "How to Find the Venom Daoist",
    "h1_content": "The secrets continue into Chapter 4 of Black Myth: Wukong, with an entire hidden area called the Purple Cloud Mountain to discover. If you want to be able to access this, there are actions you'll need to take early on in the level, which involve defeating the Venom Doaist mini-boss. Want to know the right path to follow in the Webbed Hollow to get started? Here's how to do it.\n* How to Find the Venom Daoist\n* How to Find the Venom Daoist for the Second Time",
    "h2_content": "After the fight with the Second Sister in Estate of the Zhu, you’ll drop down into a hole that will take you to the Upper Hollow. From here, go up the slope toward the Upper Hollow Shrine.\nJust behind the shrine sits a torch and a wooden path that goes off to the right. Take this path and head up the stairs, then follow it until you get to the end, where there's a small drop down.\nYou should now see a large rock in the middle of the room with white eggs near it. Drop down and head right, sticking as close to the rock as possible.\nThere is a torch here by a broken wooden path. It will seem like a dead end beyond this torch, and a large pit below, but you can drop down safely.\nIgnore the tree branch in front and turn to the right, dropping down from the edge of the wooden ledge. Turn left, and you'll start to see white sacs lining the path. Head toward these and follow the path around to the left. Be careful as you go through here, as the sacs will open and insects will appear.\nIn the next room, continue on past the archer, and through the opening in the rocks on the right. You'll be immediately met with a giant mass of web, where you'll want to go left and continue following the path where the white sacs are.\nPass through here to enter a bigger room, with a set of stairs leading up to the next level. Go up here and follow the winding path along the right.\nWhen you get to the top, you'll see it branch off to the left (where the torch is) and continue onward. Stick to the path going onward, and follow this around to the right. This will bring you to your next shrine, which is the Pool of Shattered Jade Keeper's Shrine.\nFrom here, go right and continue following the path lined with spider sacs. As you reach the other side, you'll see a large white sac in the middle.\nGo near it and a health bar will appear for the Old Cocoon. Hit it to destroy it, and eventually reveal the Venom Daoist. When you beat him, he'll run off and allude to settling the score with you once he's reached his full mastery.\n### Warning: Missable Gear!\nAt the end of this fight, you can potentially receive the Venomous Armguard, but you'll need to approach the fight in a specific way to achieve this. The Venom Daoist has 6 arms on his back, and you'll need to break the bottom 4 for him to drop the armguards. If you kill him before doing this, he won't drop anything. Use the lowest damage weapon that you have, and focus your attacks on his back. If you're having trouble with it, use Immobolize to keep him still.",
    "promot": "This is an excerpt from the file 'How_to_Unlock_the_Chapter_4_Secret_Area.md', located in the main section titled 'How to Unlock the Chapter 4 Secret Area'. The section summary is: The secrets continue into Chapter 4 of Black Myth: Wukong, with an entire hidden area called the Purple Cloud Mountain to discover. If you want to be able to access this, there are actions you'll need to take early on in the level, which involve defeating the Venom Doaist mini-boss. Want to know the right path to follow in the Webbed Hollow to get started? Here's how to do it.\n* How to Find the Venom Daoist\n* How to Find the Venom Daoist for the Second Time This excerpt merges content from both the main and sub-sections. The sub-section is titled 'How to Find the Venom Daoist', and the detailed content is as follows:\nAfter the fight with the Second Sister in Estate of the Zhu, you’ll drop down into a hole that will take you to the Upper Hollow. From here, go up the slope toward the Upper Hollow Shrine.\nJust behind the shrine sits a torch and a wooden path that goes off to the right. Take this path and head up the stairs, then follow it until you get to the end, where there's a small drop down.\nYou should now see a large rock in the middle of the room with white eggs near it. Drop down and head right, sticking as close to the rock as possible.\nThere is a torch here by a broken wooden path. It will seem like a dead end beyond this torch, and a large pit below, but you can drop down safely.\nIgnore the tree branch in front and turn to the right, dropping down from the edge of the wooden ledge. Turn left, and you'll start to see white sacs lining the path. Head toward these and follow the path around to the left. Be careful as you go through here, as the sacs will open and insects will appear.\nIn the next room, continue on past the archer, and through the opening in the rocks on the right. You'll be immediately met with a giant mass of web, where you'll want to go left and continue following the path where the white sacs are.\nPass through here to enter a bigger room, with a set of stairs leading up to the next level. Go up here and follow the winding path along the right.\nWhen you get to the top, you'll see it branch off to the left (where the torch is) and continue onward. Stick to the path going onward, and follow this around to the right. This will bring you to your next shrine, which is the Pool of Shattered Jade Keeper's Shrine.\nFrom here, go right and continue following the path lined with spider sacs. As you reach the other side, you'll see a large white sac in the middle.\nGo near it and a health bar will appear for the Old Cocoon. Hit it to destroy it, and eventually reveal the Venom Daoist. When you beat him, he'll run off and allude to settling the score with you once he's reached his full mastery.\n### Warning: Missable Gear!\nAt the end of this fight, you can potentially receive the Venomous Armguard, but you'll need to approach the fight in a specific way to achieve this. The Venom Daoist has 6 arms on his back, and you'll need to break the bottom 4 for him to drop the armguards. If you kill him before doing this, he won't drop anything. Use the lowest damage weapon that you have, and focus your attacks on his back. If you're having trouble with it, use Immobolize to keep him still.",
    "promot_tokens_num": 771
}