{
    "chunk_id": 689021540738,
    "source_file": "Endings_Explained.md",
    "content_type": "one and two",
    "h1_title": "Endings Explained",
    "h2_title": "The Story So Far",
    "h1_content": "Black Myth: Wukong has two endings and you can experience both in one through if you complete them in the right order. One is the ending that happens naturally at the end of the game but is considered the bad ending, while the other is a secret ending only achieved by finding and completing several hidden areas and a side quest. On this page, we'll detail what both of the endings mean for The Destined One.",
    "h2_content": "Black Myth: Wukong begins with Wukong fighting Erlang, The Sacred Divinity, and the Heavenly Kings. Despite putting up a good fight, Erlang and the kings are too strong, and Wukong runs off to the woods.\nErlang manages to catch up to Wukong and causes him to fall. And so, at the top of a mountain, Sun Wukong's story comes to an end and he's shown trapped inside of a rock.\nWe cut to The Old Monkey teaching a group about the tales of Sun Wukong, and he mentions the six relics where Wukong split himself. There is just one monkey who can venture through the lands to try and collect each of the Six Senses of the Great Sage, known as The Destined One.",
    "promot": "This is an excerpt from the file 'Endings_Explained.md', located in the main section titled 'Endings Explained'. The section summary is: Black Myth: Wukong has two endings and you can experience both in one through if you complete them in the right order. One is the ending that happens naturally at the end of the game but is considered the bad ending, while the other is a secret ending only achieved by finding and completing several hidden areas and a side quest. On this page, we'll detail what both of the endings mean for The Destined One. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'The Story So Far', and the detailed content is as follows:\nBlack Myth: Wukong begins with Wukong fighting Erlang, The Sacred Divinity, and the Heavenly Kings. Despite putting up a good fight, Erlang and the kings are too strong, and Wukong runs off to the woods.\nErlang manages to catch up to Wukong and causes him to fall. And so, at the top of a mountain, Sun Wukong's story comes to an end and he's shown trapped inside of a rock.\nWe cut to The Old Monkey teaching a group about the tales of Sun Wukong, and he mentions the six relics where Wukong split himself. There is just one monkey who can venture through the lands to try and collect each of the Six Senses of the Great Sage, known as The Destined One.",
    "promot_tokens_num": 312
}