{
    "chunk_id": 871383033854,
    "source_file": "Bitter_Lake_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Bitter Lake Walkthrough",
    "h2_title": "Yaoguai Chief Miniboss Fight - Apramana Bat",
    "h1_content": "The Bitter Lake is the third main region of Chapter 3 in The New West in Black Myth: Wukong. Below you'll find a guide for the Bitter Lake Region, including how to defeat Kang-Jin Star and the Cyan Loong on Turtle Island, and how to navigate the North Shore to unlock the Zodiac Village and defeat the Apramana Bat -- plus where to find the four Buddha Statues.\n*     * Yaoguai King - Kang-Jin Star\n* **Turtle Island**\n* Yaoguai King - Cyan Loong\n* **North Shore of the Bitter Lake**\n* Boss Fight - Chen Loong\n* Yaoguai Chief - Apramana Bat\n* **Precept Corridor**\nLeaving the Warding Temple where you learned the Ring of Fire Spell from the Ancient Master, you'll have to slide down a long slope to reach a mountaintop where a giant pair of cymbals have been wedged into a mountain peak.\nAs you draw close, you'll hear a voice coming from the cymbals, who is arguing with a woman refusing to let the trapped person out. With a loud gong, the trapped \"Admiral\" will use the cymbal to awaken a giant turtle whose mountainous shell you're actually standing on.\nAs the turtle begins to swim through the Bitter Seal, the woman will become aware of your presence, starting this new region off with a bang of a boss fight.",
    "h2_content": "The Apramana Bat is a larger gold variant of the lesser Apramana Bats you've encountered, and while some moves will be similar, this boss can dish out damage quickly while remaining frustratingly out of reach. Still, when it does get close enough to strike, a well-timed Rock Solid deflection can send it crashing to the ground, and is useful to have for this fight. It can also use frozen winds to deal chilling attacks you should be ready for, so have warming medicine on hand or consider equipping a Curio that reduces frostbite, and consider trying the Ring of Fire to warm yourself up.\nWhen on the ground, the Apramana Bat can slam its wings down, and create a huge gust of cold air that will billow out for an extended period. Evade this by dodging and sprinting to the side so you can perform a flank attack.\nIt can also charge up its wings by twisting its body, and will launch into two or three spin attacks by waving its wings around in a vortex as it flies at you several times.\nOnce it's tired of staying on the ground, it will often spread its wings wide to create another gust of freezing wind in a huge radius as it propels itself back into the air, where it can perform a number of attacks.\nIt's most common attack in the air is spreading its wings wide before beating them together, creating a cross slash projectile down at your location that requires some quick dodging.\nIf you see its legs extend upwards (similar to the lesser variants) it's preparing to slam down its talons on you in a quick downward slam. However, deflecting with Rock Solid will send it flying backward, only to topple out of the sky and provide you a moment to sprint over and retaliate.\nIf you aren't getting enough time in, consider using Immobilize to keep him grounded, and use the Pillar Stance to extend your height as it tries to take off.\nOnce you've gotten it on the ground for an extended period to dish out damage, be mindful not to get overconfident. If you see it hunch over and turn completely gold, it will use its own rock solid deflection to make your attack bounce off.\nListen for the sound cue of your attack being deflected, and it will quickly rise up and extend a bladed wing up in the air before slamming it down on you. You can turn the tables with your own deflection (though it will send you sliding back), or dodge to the side and bash it with a Spirit Attack.\nZhu Bajie can be a big boon for this fight, as the bat will largely focus on you with its ranged flying attacks, and as it drops to the ground between attacks, the little pig guy will be right there waiting for score some free hits. Don't be afraid to fall back either and wait for him to heal you as needed, but otherwise you can bait out several of the Apramana Bats ranged attacks without having to worry too much about closing the distance until the opportunity presents itself, allowing your sidekick to chip away in the meantime.\nOnce defeated, you'll gain a journal entry, experience, and some materials for your victory, but the Apramana Bat itself will retreat, and fly off into the distance. This won't be the last you see of it...\nApramana Bat\nNow that the bat is gone, return to the skull of the Serpent General and interact with it. You'll then see Turtle General look over and mourn his fallen friend, causing a giant glowing green tear to fall.\nBe sure to head back near the Northern Shore Shrine, and you'll find his glowing green tear. It is actually a **Turtle Tear Gourd Soak** , and can be incredibly useful as the only surefire means of restoring your mana when using your Gourd!\nBack at the remains of Snake General, you can find a small path leading up to the left from his bones.\nHead up the path toward a series of stone stairs, but be ready to deal with a new wolf enemy, the Wolf Guardian. Much like Wolf Assassins, they are highly mobile and can dart in and out of combat with their large sickles, but between you and your companion, he won't last long.\nAs you head up the stone stairs, look for a small pathway on the left where Zhu Bajie will point out a small enclosure. Be ready to deal with both a Falcon Fan-Maker and Cyan Bat. Shut down the Falcon with Immobilize so you can quickly remove the bat, and then focus your attention on defeating the stronger falcon enemy.\nWith both of them down, you'll find that they were guarding a **Luojia Fragrant Vine** , which you can now bring back to the Zodiac Village instead of going all the way back to Chapter 1!\nNorth Shore of the Bitter Lake Luojia Fragrant Vine\nAt the top of the stone stair path, there's a small side path leading back to a spot with a Ginsengling overlooking the enclosure, and a tunnel. Take the tunnel, and you'll find a shortcut back toward the North Shore Shrine, but first you'll need to deal with a few Monk Supporters holding their heavy stones.\nThe closest one in the tunnel entrance guards a **Treasure Chest** with a Mind Cor and materials inside, but try to take them on one at a time to make things easier. Follow the tunnel path to find a green Wisp, and it will empty out right at the larger tunnel entrance leading to the next main area.\nBeware of another tentacle abomination monk waiting for you as you drop down, and then head through the tunnel passage as it begins to narrow.\nOnce you reach a fork in the tunnel, take the left exit to head outside, where you'll find a **Treasure Chest** on the right by a large mural, and several Frozen Corpses on a wooden platform to the left.\nHead back inside the tunnel and take the right path, and you'll find a bridge to cross with a green Wisp to absorb, and the next Shrine to rest at.",
    "promot": "This is an excerpt from the file 'Bitter_Lake_Walkthrough.md', located in the main section titled 'Bitter Lake Walkthrough'. The section summary is: The Bitter Lake is the third main region of Chapter 3 in The New West in Black Myth: Wukong. Below you'll find a guide for the Bitter Lake Region, including how to defeat Kang-Jin Star and the Cyan Loong on Turtle Island, and how to navigate the North Shore to unlock the Zodiac Village and defeat the Apramana Bat -- plus where to find the four Buddha Statues.\n*     * Yaoguai King - Kang-Jin Star\n* **Turtle Island**\n* Yaoguai King - Cyan Loong\n* **North Shore of the Bitter Lake**\n* Boss Fight - Chen Loong\n* Yaoguai Chief - Apramana Bat\n* **Precept Corridor**\nLeaving the Warding Temple where you learned the Ring of Fire Spell from the Ancient Master, you'll have to slide down a long slope to reach a mountaintop where a giant pair of cymbals have been wedged into a mountain peak.\nAs you draw close, you'll hear a voice coming from the cymbals, who is arguing with a woman refusing to let the trapped person out. With a loud gong, the trapped \"Admiral\" will use the cymbal to awaken a giant turtle whose mountainous shell you're actually standing on.\nAs the turtle begins to swim through the Bitter Seal, the woman will become aware of your presence, starting this new region off with a bang of a boss fight. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Yaoguai Chief Miniboss Fight - Apramana Bat', and the detailed content is as follows:\nThe Apramana Bat is a larger gold variant of the lesser Apramana Bats you've encountered, and while some moves will be similar, this boss can dish out damage quickly while remaining frustratingly out of reach. Still, when it does get close enough to strike, a well-timed Rock Solid deflection can send it crashing to the ground, and is useful to have for this fight. It can also use frozen winds to deal chilling attacks you should be ready for, so have warming medicine on hand or consider equipping a Curio that reduces frostbite, and consider trying the Ring of Fire to warm yourself up.\nWhen on the ground, the Apramana Bat can slam its wings down, and create a huge gust of cold air that will billow out for an extended period. Evade this by dodging and sprinting to the side so you can perform a flank attack.\nIt can also charge up its wings by twisting its body, and will launch into two or three spin attacks by waving its wings around in a vortex as it flies at you several times.\nOnce it's tired of staying on the ground, it will often spread its wings wide to create another gust of freezing wind in a huge radius as it propels itself back into the air, where it can perform a number of attacks.\nIt's most common attack in the air is spreading its wings wide before beating them together, creating a cross slash projectile down at your location that requires some quick dodging.\nIf you see its legs extend upwards (similar to the lesser variants) it's preparing to slam down its talons on you in a quick downward slam. However, deflecting with Rock Solid will send it flying backward, only to topple out of the sky and provide you a moment to sprint over and retaliate.\nIf you aren't getting enough time in, consider using Immobilize to keep him grounded, and use the Pillar Stance to extend your height as it tries to take off.\nOnce you've gotten it on the ground for an extended period to dish out damage, be mindful not to get overconfident. If you see it hunch over and turn completely gold, it will use its own rock solid deflection to make your attack bounce off.\nListen for the sound cue of your attack being deflected, and it will quickly rise up and extend a bladed wing up in the air before slamming it down on you. You can turn the tables with your own deflection (though it will send you sliding back), or dodge to the side and bash it with a Spirit Attack.\nZhu Bajie can be a big boon for this fight, as the bat will largely focus on you with its ranged flying attacks, and as it drops to the ground between attacks, the little pig guy will be right there waiting for score some free hits. Don't be afraid to fall back either and wait for him to heal you as needed, but otherwise you can bait out several of the Apramana Bats ranged attacks without having to worry too much about closing the distance until the opportunity presents itself, allowing your sidekick to chip away in the meantime.\nOnce defeated, you'll gain a journal entry, experience, and some materials for your victory, but the Apramana Bat itself will retreat, and fly off into the distance. This won't be the last you see of it...\nApramana Bat\nNow that the bat is gone, return to the skull of the Serpent General and interact with it. You'll then see Turtle General look over and mourn his fallen friend, causing a giant glowing green tear to fall.\nBe sure to head back near the Northern Shore Shrine, and you'll find his glowing green tear. It is actually a **Turtle Tear Gourd Soak** , and can be incredibly useful as the only surefire means of restoring your mana when using your Gourd!\nBack at the remains of Snake General, you can find a small path leading up to the left from his bones.\nHead up the path toward a series of stone stairs, but be ready to deal with a new wolf enemy, the Wolf Guardian. Much like Wolf Assassins, they are highly mobile and can dart in and out of combat with their large sickles, but between you and your companion, he won't last long.\nAs you head up the stone stairs, look for a small pathway on the left where Zhu Bajie will point out a small enclosure. Be ready to deal with both a Falcon Fan-Maker and Cyan Bat. Shut down the Falcon with Immobilize so you can quickly remove the bat, and then focus your attention on defeating the stronger falcon enemy.\nWith both of them down, you'll find that they were guarding a **Luojia Fragrant Vine** , which you can now bring back to the Zodiac Village instead of going all the way back to Chapter 1!\nNorth Shore of the Bitter Lake Luojia Fragrant Vine\nAt the top of the stone stair path, there's a small side path leading back to a spot with a Ginsengling overlooking the enclosure, and a tunnel. Take the tunnel, and you'll find a shortcut back toward the North Shore Shrine, but first you'll need to deal with a few Monk Supporters holding their heavy stones.\nThe closest one in the tunnel entrance guards a **Treasure Chest** with a Mind Cor and materials inside, but try to take them on one at a time to make things easier. Follow the tunnel path to find a green Wisp, and it will empty out right at the larger tunnel entrance leading to the next main area.\nBeware of another tentacle abomination monk waiting for you as you drop down, and then head through the tunnel passage as it begins to narrow.\nOnce you reach a fork in the tunnel, take the left exit to head outside, where you'll find a **Treasure Chest** on the right by a large mural, and several Frozen Corpses on a wooden platform to the left.\nHead back inside the tunnel and take the right path, and you'll find a bridge to cross with a green Wisp to absorb, and the next Shrine to rest at.",
    "promot_tokens_num": 1625
}