{
    "chunk_id": 25346328744,
    "source_file": "Tiger_Tally.md",
    "content_type": "one and two",
    "h1_title": "Tiger Tally",
    "h2_title": "Black Myth: Wukong Tiger Tally Location",
    "h1_content": "The Tiger Tally is another tiger-themed item you can find in Chapter 2 of Black Myth: Wukong, specifically a Curios item. It is one of the harder Curios items to find as it is located within the secret area of Chapter 2.\nWith the Tiger Tally equipped, you will get the following buff: Upon successful hits with light attack combo, moderately increases attack for a short duration. This is a specialized effect, requiring a trigger to activate, but the damage buff is decent, and most of the time you will be landing a full light attack combo in a fight anyway.\nAll Curios items in Black Myth: Wukong can't be upgraded, so you aren't able to increase their power or potency. Therefore, you will want to switch to other Curios items to better fit your build as you . This can be done at any point from the Equipment menu.",
    "h2_content": "The Tiger Tally Curios can be found within the secret Kingdom of Sahali area in Yellow Wind Ridge. In this area, you will need to defeat another \"Tiger Vanguard\") to progress, which will drop the Curios.\nTo get access to the Kingdom of Sahali, you will need to complete the Drunken Boar quest and obtain the Sobering Stone, a Jade Lotus\"), and the Arhat Gold Piece. Our guide linked here, or our video guide below can help you get through this somewhat confusing quest.\nTiger Tally\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "promot": "This is an excerpt from the file 'Tiger_Tally.md', located in the main section titled 'Tiger Tally'. The section summary is: The Tiger Tally is another tiger-themed item you can find in Chapter 2 of Black Myth: Wukong, specifically a Curios item. It is one of the harder Curios items to find as it is located within the secret area of Chapter 2.\nWith the Tiger Tally equipped, you will get the following buff: Upon successful hits with light attack combo, moderately increases attack for a short duration. This is a specialized effect, requiring a trigger to activate, but the damage buff is decent, and most of the time you will be landing a full light attack combo in a fight anyway.\nAll Curios items in Black Myth: Wukong can't be upgraded, so you aren't able to increase their power or potency. Therefore, you will want to switch to other Curios items to better fit your build as you . This can be done at any point from the Equipment menu. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Tiger Tally Location', and the detailed content is as follows:\nThe Tiger Tally Curios can be found within the secret Kingdom of Sahali area in Yellow Wind Ridge. In this area, you will need to defeat another \"Tiger Vanguard\") to progress, which will drop the Curios.\nTo get access to the Kingdom of Sahali, you will need to complete the Drunken Boar quest and obtain the Sobering Stone, a Jade Lotus\"), and the Arhat Gold Piece. Our guide linked here, or our video guide below can help you get through this somewhat confusing quest.\nTiger Tally\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "promot_tokens_num": 414
}