{
    "chunk_id": 219867461181,
    "source_file": "Yellow_Wind_Sage.md",
    "content_type": "one and two",
    "h1_title": "Yellow Wind Sage",
    "h2_title": "Where to Find the Yellow Wind Sage",
    "h1_content": "The Yellow Wind Sage is a required Yaoguai King and the final boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Located at the center of the large black tornado in the Yellow Wind Formation in the center of the region, you'll need two Key Items to open a path to him.\n* **Rewards:** Samahdi Wind Agate, Cold Iron Leaves x2, Refined Iron Sand x1, Silk x5, Yaoguai Core x2, Mind Core x1, 2583 Experience, 1944 Will",
    "h2_content": "As the main objective of Chapter 2's Yellow Wind Ridge, you'll need to defeat the Yellow Wind Sage to put a stop to the chaos in this region. However, the sage has locked himself within the center of the Yellow Wind Formation area, and each door leading to him is locked requiring two Key Items.\nThe Sterness of Stone can be gained by defeating the Stone Vanguard in the Fright Cliff Region.\nThe Keeness of Tiger can be gained by defeating the Tiger Vanguard in the Crouching Tiger Temple Region.\nWith both pieces, you can open the door where you defeated the King of Flowing Sands, or open up the temple cellar in the Crouching Tiger Temple, or slide down past the Rock Crash Platform to the Windseal Gate.",
    "promot": "This is an excerpt from the file 'Yellow_Wind_Sage.md', located in the main section titled 'Yellow Wind Sage'. The section summary is: The Yellow Wind Sage is a required Yaoguai King and the final boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Located at the center of the large black tornado in the Yellow Wind Formation in the center of the region, you'll need two Key Items to open a path to him.\n* **Rewards:** Samahdi Wind Agate, Cold Iron Leaves x2, Refined Iron Sand x1, Silk x5, Yaoguai Core x2, Mind Core x1, 2583 Experience, 1944 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find the Yellow Wind Sage', and the detailed content is as follows:\nAs the main objective of Chapter 2's Yellow Wind Ridge, you'll need to defeat the Yellow Wind Sage to put a stop to the chaos in this region. However, the sage has locked himself within the center of the Yellow Wind Formation area, and each door leading to him is locked requiring two Key Items.\nThe Sterness of Stone can be gained by defeating the Stone Vanguard in the Fright Cliff Region.\nThe Keeness of Tiger can be gained by defeating the Tiger Vanguard in the Crouching Tiger Temple Region.\nWith both pieces, you can open the door where you defeated the King of Flowing Sands, or open up the temple cellar in the Crouching Tiger Temple, or slide down past the Rock Crash Platform to the Windseal Gate.",
    "promot_tokens_num": 334
}