{
    "chunk_id": 476036443270,
    "source_file": "How_to_Unlock_the_Chapter_1_Secret_Area.md",
    "content_type": "one and two",
    "h1_title": "How to Unlock the Chapter 1 Secret Area",
    "h2_title": "Bell 1",
    "h1_content": "Black Myth: Wukong is full of secrets, including hidden areas that can only be unlocked through solving a puzzle or finding a key item. One such secret area is in Chapter 1 and requires ringing three bells to access it. On this page, you'll find information on how to find each of the three bells and what awaits you in the hidden temple.",
    "h2_content": "The first bell can be found in the Forest of Wolves. Start from the **Keeper's Shrine at Outside the Forest** and head straight up.\nGo past the two wolves and where the path branches off, then go right toward the bridge and the lone wolf guarding it.\nAt the bridge, you'll see a large rock on the other side. Go around the rock and to the other side to find a path lined with fires.\nFollow the fires toward the entrance to the arena where you'll need to fight Yaoguai Chief Guangzhi. You'll need to defeat him to gain access to the area and ring the bell. It can be found at the back of the arena.",
    "promot": "This is an excerpt from the file 'How_to_Unlock_the_Chapter_1_Secret_Area.md', located in the main section titled 'How to Unlock the Chapter 1 Secret Area'. The section summary is: Black Myth: Wukong is full of secrets, including hidden areas that can only be unlocked through solving a puzzle or finding a key item. One such secret area is in Chapter 1 and requires ringing three bells to access it. On this page, you'll find information on how to find each of the three bells and what awaits you in the hidden temple. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Bell 1', and the detailed content is as follows:\nThe first bell can be found in the Forest of Wolves. Start from the **Keeper's Shrine at Outside the Forest** and head straight up.\nGo past the two wolves and where the path branches off, then go right toward the bridge and the lone wolf guarding it.\nAt the bridge, you'll see a large rock on the other side. Go around the rock and to the other side to find a path lined with fires.\nFollow the fires toward the entrance to the arena where you'll need to fight Yaoguai Chief Guangzhi. You'll need to defeat him to gain access to the area and ring the bell. It can be found at the back of the arena.",
    "promot_tokens_num": 286
}