{
    "chunk_id": 969106379030,
    "source_file": "Tri-Point_Double-Edged_Spear.md",
    "content_type": "one and two",
    "h1_title": "Tri-Point Double-Edged Spear",
    "h2_title": "Black Myth: Wukong Tri-Point Double-Edged Spear Location",
    "h1_content": "The Tri-Point Double-Edged Spear is a weapon in Black Myth: Wukong. It comes with solid stats, damage, and a unique effect like many of the other Weapons in the game. It is one of the best weapons in the game.\nThe weapon comes with 135 damage, 6% Critical Hit Chance, and the following unique effect:\n* Integrate spear techniques into light attack combo and increases the damage dealt by Thrust Stance moves. Upon performing Forceful Thrust shoots swords from the staff to attack",
    "h2_content": "The Tri-Point Double-Edged Spear is unlocked upon getting the secret ending in the game. A full written walkthrough of the secret ending is here), and the video guide is below:\nTri-Point Double-Edged Spear\nWeapons can be crafted throughout the game from the Shrines throughout the game's six chapters. Crafting weapons will require Will and various Crafting Materials from the game's locales and enemies. However, the Tri-Point Double-Edged Spear can't be crafted.\nFor even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Armor and Gear locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.",
    "promot": "This is an excerpt from the file 'Tri-Point_Double-Edged_Spear.md', located in the main section titled 'Tri-Point Double-Edged Spear'. The section summary is: The Tri-Point Double-Edged Spear is a weapon in Black Myth: Wukong. It comes with solid stats, damage, and a unique effect like many of the other Weapons in the game. It is one of the best weapons in the game.\nThe weapon comes with 135 damage, 6% Critical Hit Chance, and the following unique effect:\n* Integrate spear techniques into light attack combo and increases the damage dealt by Thrust Stance moves. Upon performing Forceful Thrust shoots swords from the staff to attack This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Tri-Point Double-Edged Spear Location', and the detailed content is as follows:\nThe Tri-Point Double-Edged Spear is unlocked upon getting the secret ending in the game. A full written walkthrough of the secret ending is here), and the video guide is below:\nTri-Point Double-Edged Spear\nWeapons can be crafted throughout the game from the Shrines throughout the game's six chapters. Crafting weapons will require Will and various Crafting Materials from the game's locales and enemies. However, the Tri-Point Double-Edged Spear can't be crafted.\nFor even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Armor and Gear locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.",
    "promot_tokens_num": 364
}