{
    "chunk_id": 152078829398,
    "source_file": "Yarn.md",
    "content_type": "one and two",
    "h1_title": "Yarn",
    "h2_title": "Black Myth: Wukong Yarn Locations",
    "h1_content": "Yarn is one of the uncommon Crafting Materials\") in Black Myth: Wukong. It is primarily used to upgrade your Armor and Gear and unlock new sets as you make your way through the game. Compared to many of the other materials in the game, including Silk, which is also needed to upgrade your armor and gear, it is quite common.\nEven still, below, on this page, we will go over the most common places to find Yarn throughout the game. In addition to Silk, the other main materials you will need to find while ing are some of the main boss materials which drop upon killing them. Most mandatory bosses and side bosses will drop one of these Crafting Materials which you can use to get new weapons alongside your new armor sets.",
    "h2_content": "Yarn can be found and obtained in the following places and ways in Black Myth: Wukong:\n* Found in chests\n* Randomly Dropped from Yaoguai Chiefs, Kings, and enemies\n* Bought in the Shrine store\n* Reward for completing chapters of the game\nYarn can be obtained right from the start of the game in Black Wind Mountain. Unlike some of the other Crafting Materials and Medicine Ingredients, there isn't a plant that you can harvest Yarn from. So, all your Yarn will need to be obtained from enemies.\nThankfully, the material is so common you can farm it anywhere by resting at Shrines and respawning the enemies in the area. But, Black Wind Mountain and Yellow Wind Ridge are where you will find it most.\nFor even more resources and guides, check out some of our other breakdown pages for materials to upgrade your gear and stats:\n* Blood of the Iron Bull\n* Mind Core\n* Luojia Fragrant Vine Locations\n* Awaken Wine Worm Locations",
    "promot": "This is an excerpt from the file 'Yarn.md', located in the main section titled 'Yarn'. The section summary is: Yarn is one of the uncommon Crafting Materials\") in Black Myth: Wukong. It is primarily used to upgrade your Armor and Gear and unlock new sets as you make your way through the game. Compared to many of the other materials in the game, including Silk, which is also needed to upgrade your armor and gear, it is quite common.\nEven still, below, on this page, we will go over the most common places to find Yarn throughout the game. In addition to Silk, the other main materials you will need to find while ing are some of the main boss materials which drop upon killing them. Most mandatory bosses and side bosses will drop one of these Crafting Materials which you can use to get new weapons alongside your new armor sets. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Yarn Locations', and the detailed content is as follows:\nYarn can be found and obtained in the following places and ways in Black Myth: Wukong:\n* Found in chests\n* Randomly Dropped from Yaoguai Chiefs, Kings, and enemies\n* Bought in the Shrine store\n* Reward for completing chapters of the game\nYarn can be obtained right from the start of the game in Black Wind Mountain. Unlike some of the other Crafting Materials and Medicine Ingredients, there isn't a plant that you can harvest Yarn from. So, all your Yarn will need to be obtained from enemies.\nThankfully, the material is so common you can farm it anywhere by resting at Shrines and respawning the enemies in the area. But, Black Wind Mountain and Yellow Wind Ridge are where you will find it most.\nFor even more resources and guides, check out some of our other breakdown pages for materials to upgrade your gear and stats:\n* Blood of the Iron Bull\n* Mind Core\n* Luojia Fragrant Vine Locations\n* Awaken Wine Worm Locations",
    "promot_tokens_num": 423
}