{
    "chunk_id": 899894498481,
    "source_file": "Old_Rattle-Drum_Questline.md",
    "content_type": "one and two",
    "h1_title": "Old Rattle-Drum Questline",
    "h2_title": "First Location - Windrest Hamlet",
    "h1_content": "The Rattle-Drum Questline is a hidden side quest in Chapter 2 of Black Myth Wukong, and involves using a specific Old Rattle-Drum Key Item to communicate with the spirit of a boy, and unlock a hidden boss - the Mad Tiger.",
    "h2_content": "The first location you can use the Old-Rattle Drum is close to where you fought the Tiger’s Acolyte, further back in the **Windrest Hamlet**. Return across the bridge to the **Windrest Hamlet Shrine** and pass back through the large gate, immediately taking a left to the **large house surrounded by sitting Withering Corpses**.\nA visual cue will appear along with the **voice of a child** beckoning you, and you’ll be able to use the Rattle-Drum in front of the house. Be warned, as doing so will provoke all the nearby corpses to attack you, but you’ll also get some interesting dialogue from the child.",
    "promot": "This is an excerpt from the file 'Old_Rattle-Drum_Questline.md', located in the main section titled 'Old Rattle-Drum Questline'. The section summary is: The Rattle-Drum Questline is a hidden side quest in Chapter 2 of Black Myth Wukong, and involves using a specific Old Rattle-Drum Key Item to communicate with the spirit of a boy, and unlock a hidden boss - the Mad Tiger. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'First Location - Windrest Hamlet', and the detailed content is as follows:\nThe first location you can use the Old-Rattle Drum is close to where you fought the Tiger’s Acolyte, further back in the **Windrest Hamlet**. Return across the bridge to the **Windrest Hamlet Shrine** and pass back through the large gate, immediately taking a left to the **large house surrounded by sitting Withering Corpses**.\nA visual cue will appear along with the **voice of a child** beckoning you, and you’ll be able to use the Rattle-Drum in front of the house. Be warned, as doing so will provoke all the nearby corpses to attack you, but you’ll also get some interesting dialogue from the child.",
    "promot_tokens_num": 271
}