{
    "chunk_id": 638930553664,
    "source_file": "Ashen_Slumber.md",
    "content_type": "one and two",
    "h1_title": "Ashen Slumber",
    "h2_title": "Black Myth: Wukong Ashen Slumber Location",
    "h1_content": "Ashen Slumber is one of the best Transformation Spells in Black Myth: Wukong for crowd control and dealing sustained damage. It has a solid basic combo, a fantastic heavy attack, and a self-destruct attack that can completely destroy groups of enemies.\nWith it, you can transform into a rat guai, slashing at the enemy while blowing fierce flames at them, inflicting Scorch Bane. Focus built up before transformation can be converted for use afterwards within the rat guai's form.\nAshen Slumber's moveset is as follows:\n* **Light Attack: Chop Wood - Swing the iron blade to build up Focus.** This is a standard four-hit combo.\n* **Heavy Attack: Blow Fire - Hold heavy attack to unleash, consuming Focus to continuously burn enemies ahead.** This is a great crowd-control move, damaging enemies with a continuous stream of fire for several seconds ahead of it.\n* **Spell: Fiery Burst - Upon self-detonation, deals area damage triggers de-transform.** This is a manual de-transform attack that can be activated to have Ashen Slumber blow up.",
    "h2_content": "The Ashen Slumber spell can be found in the first cell within the Pagoda Realm, near the Lower Pagoda Shrine in The New West. However, you will need to interact with the hut in Sandgate Village - Village Entrance, just next to the entrance to the Valley of Despair Shrine area. Its on the first incline up the hill by that large door to the Shrine area.\nFrom there, in The New West, you will need to defeat Captain Lotus-Vision in a secret area by the Upper Pagoda Shrine. Defeating him will give you The Spirit of Captain Lotus-Vision which will deactivate the purple enchantment on the gates in the Pagoda Realm.\nYou can then, enter the gate to obtain the Transformation from the rat guai's body.\nAshen Slumber",
    "promot": "This is an excerpt from the file 'Ashen_Slumber.md', located in the main section titled 'Ashen Slumber'. The section summary is: Ashen Slumber is one of the best Transformation Spells in Black Myth: Wukong for crowd control and dealing sustained damage. It has a solid basic combo, a fantastic heavy attack, and a self-destruct attack that can completely destroy groups of enemies.\nWith it, you can transform into a rat guai, slashing at the enemy while blowing fierce flames at them, inflicting Scorch Bane. Focus built up before transformation can be converted for use afterwards within the rat guai's form.\nAshen Slumber's moveset is as follows:\n* **Light Attack: Chop Wood - Swing the iron blade to build up Focus.** This is a standard four-hit combo.\n* **Heavy Attack: Blow Fire - Hold heavy attack to unleash, consuming Focus to continuously burn enemies ahead.** This is a great crowd-control move, damaging enemies with a continuous stream of fire for several seconds ahead of it.\n* **Spell: Fiery Burst - Upon self-detonation, deals area damage triggers de-transform.** This is a manual de-transform attack that can be activated to have Ashen Slumber blow up. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Ashen Slumber Location', and the detailed content is as follows:\nThe Ashen Slumber spell can be found in the first cell within the Pagoda Realm, near the Lower Pagoda Shrine in The New West. However, you will need to interact with the hut in Sandgate Village - Village Entrance, just next to the entrance to the Valley of Despair Shrine area. Its on the first incline up the hill by that large door to the Shrine area.\nFrom there, in The New West, you will need to defeat Captain Lotus-Vision in a secret area by the Upper Pagoda Shrine. Defeating him will give you The Spirit of Captain Lotus-Vision which will deactivate the purple enchantment on the gates in the Pagoda Realm.\nYou can then, enter the gate to obtain the Transformation from the rat guai's body.\nAshen Slumber",
    "promot_tokens_num": 456
}