{
    "chunk_id": 585235998805,
    "source_file": "Captain_Void-Illusion.md",
    "content_type": "one and two",
    "h1_title": "Captain Void-Illusion",
    "h2_title": "Where to Find Captain Void-Illusion",
    "h1_content": "Captain Void-Illusion is one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Unlike the other Captains, Void-Illusion isn't actually a boss fight, but still has an important item to loot.\n* **Rewards:** Spirit of Captain Void-Illusion",
    "h2_content": "You can find Captain Void-Illusion along the Road of Longevity in the Valley of Ecstasy. From the Shrine, head directly right and up the small hill past a large inacessible tower. You'll find a large corpse of some kind at the base of a statue built into the cliffs ahead.\nThis is actually one of the four Captains that the Pagoda Realm Prisoner spoke of, but it looks like someone beat you to putting this captain out of their misery. You can still interact with the body to claim the Spirit of Captain Void-Illusion. And hey, since they still count as a Yaoguai Chief in the journal, that's one less boss to worry about!\nCaptain Void-Illusion",
    "promot": "This is an excerpt from the file 'Captain_Void-Illusion.md', located in the main section titled 'Captain Void-Illusion'. The section summary is: Captain Void-Illusion is one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Unlike the other Captains, Void-Illusion isn't actually a boss fight, but still has an important item to loot.\n* **Rewards:** Spirit of Captain Void-Illusion This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find Captain Void-Illusion', and the detailed content is as follows:\nYou can find Captain Void-Illusion along the Road of Longevity in the Valley of Ecstasy. From the Shrine, head directly right and up the small hill past a large inacessible tower. You'll find a large corpse of some kind at the base of a statue built into the cliffs ahead.\nThis is actually one of the four Captains that the Pagoda Realm Prisoner spoke of, but it looks like someone beat you to putting this captain out of their misery. You can still interact with the body to claim the Spirit of Captain Void-Illusion. And hey, since they still count as a Yaoguai Chief in the journal, that's one less boss to worry about!\nCaptain Void-Illusion",
    "promot_tokens_num": 283
}