{
    "chunk_id": 608757753622,
    "source_file": "King_of_Flowing_Sands_and_Second_Rat_Prince.md",
    "content_type": "one and two",
    "h1_title": "King of Flowing Sands and Second Rat Prince",
    "h2_title": "Where to Find the King of Flowing Sands and Second Rat Prince",
    "h1_content": "The King of Flowing Sands and Second Rat Prince are a required Yaoguai Chief miniboss that you can encounter in Chapter 2 of Black Myth Wukong. As a required boss fight, you'll encounter them blocking the path leading out of the Sandgate Village, connecting to both the Fright Cliff and Crouching Tiger Temple.\n* Rewards: Pungent Flesh Chunk, Second Rat Prince Spirit, Blood of the Iron Bull, Yaoguai Core x2, Silk x2, Stone Spirit x1, 1102 Experience, 1014 Will",
    "h2_content": "Since you are required to fight this miniboss duo, you won't be able to miss them as you explore Chapter 2 in the Yellow Sand Ridge.\nFrom the Sandgate Village Area, head up and to the right from the Village Entrance Shrine, right from the sealed town gate to find a Rat Governor and two two-headed Rat Captains guarding a low valley. To their right is a large door you can open, triggering the boss fight.",
    "promot": "This is an excerpt from the file 'King_of_Flowing_Sands_and_Second_Rat_Prince.md', located in the main section titled 'King of Flowing Sands and Second Rat Prince'. The section summary is: The King of Flowing Sands and Second Rat Prince are a required Yaoguai Chief miniboss that you can encounter in Chapter 2 of Black Myth Wukong. As a required boss fight, you'll encounter them blocking the path leading out of the Sandgate Village, connecting to both the Fright Cliff and Crouching Tiger Temple.\n* Rewards: Pungent Flesh Chunk, Second Rat Prince Spirit, Blood of the Iron Bull, Yaoguai Core x2, Silk x2, Stone Spirit x1, 1102 Experience, 1014 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find the King of Flowing Sands and Second Rat Prince', and the detailed content is as follows:\nSince you are required to fight this miniboss duo, you won't be able to miss them as you explore Chapter 2 in the Yellow Sand Ridge.\nFrom the Sandgate Village Area, head up and to the right from the Village Entrance Shrine, right from the sealed town gate to find a Rat Governor and two two-headed Rat Captains guarding a low valley. To their right is a large door you can open, triggering the boss fight.",
    "promot_tokens_num": 290
}