{
    "chunk_id": 866278959680,
    "source_file": "The_Spirit_of_Captain_Wise-Voice.md",
    "content_type": "one and two",
    "h1_title": "The Spirit of Captain Wise-Voice",
    "h2_title": "Where to use The Spirit of Captain Wise-Voice in Black Myth: Wukong",
    "h1_content": "The Spirit of Captain Wise-Voice is one of the Key Items found within The New West's Pagoda Realm in Black Myth: Wukong. It is unlocked upon defeating a mandatory boss within the Pagoda Realm, but it can be tricky to know what the item is used for at first glance.\n_\"A unique cluster of will that cannot be cultivated. Why not gather it and explore its potential elsewhere\"_\nThe Spirit of Captain Wise-Voice can be found upon killing Captain Wise-Voice at the top of the mysterious and deadly Pagoda Realm in The New West. Captain Wise-Voice is a mandatory boss, so you can't miss obtaining this item. Our page on the boss has a full breakdown of its moves and how to tackle them.\nThe Spirit of Captain Wise-Voice",
    "h2_content": "The Spirit of Captain Wise-Voice can be used in conjunction with The Spirit of Captain Lotus-Vision, The Spirit of Captain Void-Illusion, and The Spirit of Captain Kalpa-Wave in The New West at the prisoner in the first cell at the base of the Pagoda Realm. With all of these items, you can return to the prisoner to obtain the Chubai Spearhead\").\nThis material can be used to craft one of the higher-end Weapons in the game.",
    "promot": "This is an excerpt from the file 'The_Spirit_of_Captain_Wise-Voice.md', located in the main section titled 'The Spirit of Captain Wise-Voice'. The section summary is: The Spirit of Captain Wise-Voice is one of the Key Items found within The New West's Pagoda Realm in Black Myth: Wukong. It is unlocked upon defeating a mandatory boss within the Pagoda Realm, but it can be tricky to know what the item is used for at first glance.\n_\"A unique cluster of will that cannot be cultivated. Why not gather it and explore its potential elsewhere\"_\nThe Spirit of Captain Wise-Voice can be found upon killing Captain Wise-Voice at the top of the mysterious and deadly Pagoda Realm in The New West. Captain Wise-Voice is a mandatory boss, so you can't miss obtaining this item. Our page on the boss has a full breakdown of its moves and how to tackle them.\nThe Spirit of Captain Wise-Voice This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to use The Spirit of Captain Wise-Voice in Black Myth: Wukong', and the detailed content is as follows:\nThe Spirit of Captain Wise-Voice can be used in conjunction with The Spirit of Captain Lotus-Vision, The Spirit of Captain Void-Illusion, and The Spirit of Captain Kalpa-Wave in The New West at the prisoner in the first cell at the base of the Pagoda Realm. With all of these items, you can return to the prisoner to obtain the Chubai Spearhead\").\nThis material can be used to craft one of the higher-end Weapons in the game.",
    "promot_tokens_num": 341
}