{
    "chunk_id": 942980708051,
    "source_file": "How_to_Unlock_the_Secret_Loong_Dragon_Bosses.md",
    "content_type": "one and two",
    "h1_title": "How to Unlock the Secret Loong Dragon Bosses",
    "h2_title": "How to Find Yellow Loong - Chapter 4 Secret Boss",
    "h1_content": "Chapter 1 of Black Myth: Wukong has more than one secret boss for you to find, and one of these is a Dragon that's tucked away behind a waterfall. Getting to the boss, however, requires finding a key item that you can't get until Chapter 2. This isn't the only Loong boss you can find in the game, so if you want to access the secret area, and know the whereabouts of the Loong Dragon Bosses, here's everything you need to know.\n* How to Get the Loong Scales\n* How to Find the Chapter 1 Secret Dragon Boss\n* How to Find the Chapter 2 Secret Boss\n* How to Find Chapter 3 Dragon Boss\n* How to Find the Chapter 4 Secret Boss",
    "h2_content": "Progress through Chapter 4 until you reach the Cliff of Oblivion Keeper's Shrine. You'll pass through a corridor beyond it, where you'll meet Buddha's Right Hand.\nAfter this fight, the hand will become a bridge that you can use to get down to the lower levels. Go across the hand and the insect body attached to it, then drop down from the wooden path.\nFollow the path around to the right and continue following it as it loops. You'll come to a point where you see a wooden path going off to the left, with a bridge, or the path continues to the right.\nDrop down to the left and head toward the bridge, crossing it to get to the other side. Go up the stairs and through the corridor filled with webs. Up ahead, you'll see a light and cocoons hanging from the ceiling.\nThere's a bridge here you can cross, but you'll need to do it very carefully and avoid being hit by the spiders inside the sacs. You can take them out or just zip across using Cloud Step.\nWhen you get to the other side, continue on to the grassy area, then head to the left to go up the stairs. Follow this path and the voice that has narrated each of the Loong boss encounters so far will begin again.\nThe path will start to wind back up, and there will be stairs on the left and a broken bridge on the right. Head right across the broken boards, to find the Relief of the Fallen Loong Keeper's Shrine.\nFrom here, continue up the stairs to the right and you'll see a figure waiting by the shelter. As you approach, a cutscene will begin and you'll be thrown into the fight against Yellow Loong.\nYellow Loong",
    "promot": "This is an excerpt from the file 'How_to_Unlock_the_Secret_Loong_Dragon_Bosses.md', located in the main section titled 'How to Unlock the Secret Loong Dragon Bosses'. The section summary is: Chapter 1 of Black Myth: Wukong has more than one secret boss for you to find, and one of these is a Dragon that's tucked away behind a waterfall. Getting to the boss, however, requires finding a key item that you can't get until Chapter 2. This isn't the only Loong boss you can find in the game, so if you want to access the secret area, and know the whereabouts of the Loong Dragon Bosses, here's everything you need to know.\n* How to Get the Loong Scales\n* How to Find the Chapter 1 Secret Dragon Boss\n* How to Find the Chapter 2 Secret Boss\n* How to Find Chapter 3 Dragon Boss\n* How to Find the Chapter 4 Secret Boss This excerpt merges content from both the main and sub-sections. The sub-section is titled 'How to Find Yellow Loong - Chapter 4 Secret Boss', and the detailed content is as follows:\nProgress through Chapter 4 until you reach the Cliff of Oblivion Keeper's Shrine. You'll pass through a corridor beyond it, where you'll meet Buddha's Right Hand.\nAfter this fight, the hand will become a bridge that you can use to get down to the lower levels. Go across the hand and the insect body attached to it, then drop down from the wooden path.\nFollow the path around to the right and continue following it as it loops. You'll come to a point where you see a wooden path going off to the left, with a bridge, or the path continues to the right.\nDrop down to the left and head toward the bridge, crossing it to get to the other side. Go up the stairs and through the corridor filled with webs. Up ahead, you'll see a light and cocoons hanging from the ceiling.\nThere's a bridge here you can cross, but you'll need to do it very carefully and avoid being hit by the spiders inside the sacs. You can take them out or just zip across using Cloud Step.\nWhen you get to the other side, continue on to the grassy area, then head to the left to go up the stairs. Follow this path and the voice that has narrated each of the Loong boss encounters so far will begin again.\nThe path will start to wind back up, and there will be stairs on the left and a broken bridge on the right. Head right across the broken boards, to find the Relief of the Fallen Loong Keeper's Shrine.\nFrom here, continue up the stairs to the right and you'll see a figure waiting by the shelter. As you approach, a cutscene will begin and you'll be thrown into the fight against Yellow Loong.\nYellow Loong",
    "promot_tokens_num": 599
}