{
    "chunk_id": 577569232312,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Furnace Valley Walkthrough",
    "h2_title": "Valley Entrance",
    "h1_content": "Furnace Valley is the second major region in Chapter 5 of Black: Myth Wukong. Below, you'll find a detailed walkthrough of all the possible bosses there are to defeat in this section, along with conclusions to side quests, and key items to collect.\n* **Jump to a Section:**\n* **Valley Entrance**\n* Yaoguai Chief - Flint Chief\n* Yaoguai Chief - Cloudy Mist, Misty Cloud\n* **Rakshasa Palace**\n* **The Emerald Hall**\n* Yaoguai King - Keeper of the Flaming Mountains and Yin-Yang Fish\n* Yaoguai Chief - Crimson-Silver Cart\nAfter jumping down from the cliff at the end of Woods of Ember, you'll land in the waters at the start of Furnace Valley. Immediately turn to the right, to pick up the first green Wisp in the region.\nGo straight up toward the valley, but be careful as you explore the area. Some of the rocks in this area glow with lava, and that's because they're actually Searing-Fire enemies. These resemble the Palestones from Chapter 2 and are particularly annoying. They will leap in the air and drop on their back and front to cause explosions. For the sake of unlocking portraits, you can defeat just one and ignore the others.\nContinue straight up, following the gold trail to the Valley Entrance Keeper's Shrine. It's protected by an Earth Rakshasa, so either use heavy attacks to break down its shield, or get behind it to tackle it. When you've dealt with it, activate the Keeper's Shrine.\n### Return to the Pale-Axe Stalwart\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.",
    "h2_content": "Make your way straight up from the Valley Entrance Keeper's Shrine. As you progress along this small pathway, you'll encounter Scorching-Fire enemies, similar to the Searing-Fire ones. These will attempt to hide along the path, so be prepared for them to jump out at you.\nStick to the path, as it curves around to the left. You'll enter a cave, with columns of ruins visible and lava all over the place.\nContinue along the path, where it curves down to the right. Here you'll find another Earth Rakshasa patrolling. Once you've dealt with the fire-breathing Rakshasa, keep going toward the pillar.\nUltimately, you're going to go left to continue on the main path (and you may start to hear characters talk as you approach this pillar), but for now, you'll want to detour and explore the area to the right.\nThe first thing you'll see as you go to the right is the Flamlings that sit in the lava. These will spit fire at you, so it's best to deal with them to remove the ranged attacks while you explore.\n### A Note on Flamlings\nFlamings will drop Flame Ores, which are an important item needed for a secret boss later on in the Chapter, so be sure to tackle each Flamling you find.\nGo for the one on the left first, then continue straight up. Another Flamling will emerge as you tackle this first one, so head for this one straight after. If you keep pushing forward, another batch of Flamlings will emerge, so we'd recommend taking them all down before you head over to the left side of the room and hop into the stream of lava.\nGo into the lava, where you'll see the wall is glowing. This will be the first stream of lava coming from the wall you will have been near when fighting the first Flamling. Just before it, you can find a Purple Lingzhi to harvest, which becomes another fungiman you need to defeat.\nContinue up the stream of lava to find another Flamling and a tree to harvest for a Fire Date. Now go right, where you should see a cart just to the left. There is a green Wisp to collect right by its arm, and a chest opposite it that won't necessarily be visible to you yet. But what will be, is the Tenner guarding it.\nApproach carefully and deal with the Tenner and the Flamlings that will appear as soon as you're close to the cart.\nWhen the area is clear, collect the green Wisps and open the chest to collect Fine Gold Thread and Blood of the Iron Bull.Now approach the cart. This is one of the Five Element Carts, but it's already been dealt with. Get close to its mouth and pull the string when prompted. When you do, you'll hear the voice of Ma Tianba (the horse guai from previous chapters) coming from inside. Keep pulling the string until you've exhausted all dialogue, and then move on. There's nothing more you can do here for now, but we'll return later.\nFace away from the cart and back in the direction you came from. There's more to explore at the moment, before you continue up to the archway you can see in the distance.\nGo left, at the first lava stream you can see running from the ceiling. Take another left, so you're heading back on yourself (just on the lower level) toward where you started Furnace Valley.\nRight at the end of this path, you'll find a Turtle Treasure guarding a chest. This Turtle Treasure holds a Spirit for you to collect once you've beaten it. After grabbing the Turtle Treasure Spirit, open the chest to collect Kun Steel, Knot of Voidness, and Medicines.\nTurtle Treasure Spirit\nBacktrack on yourself and go straight up through the path on the left between the rocks. Head for the lava stream running from the ceiling straight up ahead but stop to kill the last Flamling on the right, just behind the rock, and harvest the Fire Date from the tree on the right.\nWhen you reach the lava, go to the dark corner on the right to collect the green Wisp. As you approach, you'll be jumped by Scorching-Fire rocks, so be prepared. Then, go up the ramp on the left to meet another Earth Rakshasa and take this out.\nHead through the archway, where you'll see another Flamling emerge on the right. Take the Flamling out and look down to the left, below the edge of the cliff where it sat.\nDrop down here, and head right first to collect the Fire Date from the tree. Then go in the opposite direction toward the lava streaming from the ceiling. This is where you can find one of the optional bosses in Chapter 5, the Flint Chief.\n### Yaoguai Chief - Flint Chief\nThe Flint Chief is another rock boss in the game, that will try to use all its might in its attacks, so the moveset will seem familiar.\nA lot of the moves will see the Chief attack with long sweeps or hitting the ground with its fists. Ripples of lava will often follow these attacks, so using the Fireproof Mantle will give you some protection against the fire damage.\nThere are three areas you can concentrate attacks, which are its body and two hands. It's best to target the two hands, as these are actually breakable and by removing them, the Flint Chief becomes a lot more unsteady on its feet. Focus combos, follow-ups, and heavy attacks on its hands to remove them as quickly as possible.\nWhen you've beaten it collect the Flint Chief Spirit it drops and the Fire Date from the tree to the right of the lava flowing from the ceiling.\nFlint Chief\nFollow the lava path back up the archway, collecting more Fire Dates on the way, and be careful of Scorching and Searing-Fire enemies that will pop out along the way.\nWhen you're back up to the arch, continue forward to the top of the slope. The path goes left and right here. Right is the main path, so for now, let's take a look at the left side. As you head over, you'll see an Earth Rakshasa waiting for you that guards a chest. It also has a Spirit for you to collect once you defeat it.\nAs soon as you pass by the torch, a Flamling will appear. Take down the Flamling and Rakshasa, then collect the Earth Rakshasa Spirit. After this, open the chest and collect Celestial Ribbon and a Mind Core.\nEarth Rakshasa Spirit\nNow turn back the other way and continue up the valley. At the top of the path, you'll come to another archway and the start of Rakshasa Palace.\nAs soon as you pass through the archway, the next boss battle will begin and you'll discover who was responsible for the voices you heard earlier.\n### Yaoguai Chief - Cloudy Mist, Misty Cloud\nCloudy Mist and Misty Cloud are another duo that will use different elements to fight you. You'll go up against Cloudy Mist first, who is the creature with the staff.\nIt will mainly shoot lasers from the smaller face on its chest and use projectiles. The way that these attacks appear can vary wildly from one laser at a time, to multiple in a criss-cross pattern. As for the projectiles, you'll see either a few larger balls of mist or multiple tiny ones sent your way.\nThe lasers can be avoided by dodging or jumping over them, and the projectiles can be outrun or you can dodge to stop them hitting you. When there are numerous, we'd recommend outrunning them, and when there are just a few, dodge out of the way. During this fight, you want to stay as close to Cloudy Mist as possible, to remove the advantage of his long-range attacks.\nMisty Cloud will soon appear, though he will look almost see-through initially. He will often pop up as soon as Cloudy Mist has finished a set of moves, hoping to catch you off guard and hit you with his flaming bundle.\nThe key to keeping track of this creature is to see where the cloud moves and jump out of the way when it gets close to you. Misty Cloud favors the use of a flaming bundle, operating it like a hammer and delivering fire attacks.\nAs Cloudy Mist is the first to appear, this should be where you first attack. Things will change when you manage to hit Cloudy Mist enough times that it will send out a bright light as a flashbang that can stun both you and Misty Cloud. For a brief moment, Misty Cloud won't be able to see you and Cloudy Mist will become its eyes.\nWhen this happens, you'll want to focus on dodging the fire attacks from Misty Cloud. These often happen with him dragging the flaming bundle along the floor, to try and create a ripple of flames to get you. Or slamming it down like a hammer. There will be times when he puts the bundle on his back, and he's slow with this move, so you've got plenty of time to attack.\nThe fight can feel quite fast-paced as they swap in and out to attack, so to put an end to their teamwork and slow things down, make use of spells like Immobilize. You should then aim to build as much Focus as possible and look for opportunities to perform heavy attacks. Both bosses can be staggered by this, giving you a chance to whittle down their health.\nCloudy Mist, Misty Cloud\nAfter defeating them collect the Spirit they drop, then continue up the stairs toward the palace.\nMisty Cloud, Cloudy Mist Spirit\nOpen the giant door at the top of the stairs. Go straight ahead and activate the Rakshasa Palace Keeper's Shrine.",
    "promot": "This is an excerpt from the file 'Furnace_Valley_Walkthrough.md', located in the main section titled 'Furnace Valley Walkthrough'. The section summary is: Furnace Valley is the second major region in Chapter 5 of Black: Myth Wukong. Below, you'll find a detailed walkthrough of all the possible bosses there are to defeat in this section, along with conclusions to side quests, and key items to collect.\n* **Jump to a Section:**\n* **Valley Entrance**\n* Yaoguai Chief - Flint Chief\n* Yaoguai Chief - Cloudy Mist, Misty Cloud\n* **Rakshasa Palace**\n* **The Emerald Hall**\n* Yaoguai King - Keeper of the Flaming Mountains and Yin-Yang Fish\n* Yaoguai Chief - Crimson-Silver Cart\nAfter jumping down from the cliff at the end of Woods of Ember, you'll land in the waters at the start of Furnace Valley. Immediately turn to the right, to pick up the first green Wisp in the region.\nGo straight up toward the valley, but be careful as you explore the area. Some of the rocks in this area glow with lava, and that's because they're actually Searing-Fire enemies. These resemble the Palestones from Chapter 2 and are particularly annoying. They will leap in the air and drop on their back and front to cause explosions. For the sake of unlocking portraits, you can defeat just one and ignore the others.\nContinue straight up, following the gold trail to the Valley Entrance Keeper's Shrine. It's protected by an Earth Rakshasa, so either use heavy attacks to break down its shield, or get behind it to tackle it. When you've dealt with it, activate the Keeper's Shrine.\n### Return to the Pale-Axe Stalwart\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Valley Entrance', and the detailed content is as follows:\nMake your way straight up from the Valley Entrance Keeper's Shrine. As you progress along this small pathway, you'll encounter Scorching-Fire enemies, similar to the Searing-Fire ones. These will attempt to hide along the path, so be prepared for them to jump out at you.\nStick to the path, as it curves around to the left. You'll enter a cave, with columns of ruins visible and lava all over the place.\nContinue along the path, where it curves down to the right. Here you'll find another Earth Rakshasa patrolling. Once you've dealt with the fire-breathing Rakshasa, keep going toward the pillar.\nUltimately, you're going to go left to continue on the main path (and you may start to hear characters talk as you approach this pillar), but for now, you'll want to detour and explore the area to the right.\nThe first thing you'll see as you go to the right is the Flamlings that sit in the lava. These will spit fire at you, so it's best to deal with them to remove the ranged attacks while you explore.\n### A Note on Flamlings\nFlamings will drop Flame Ores, which are an important item needed for a secret boss later on in the Chapter, so be sure to tackle each Flamling you find.\nGo for the one on the left first, then continue straight up. Another Flamling will emerge as you tackle this first one, so head for this one straight after. If you keep pushing forward, another batch of Flamlings will emerge, so we'd recommend taking them all down before you head over to the left side of the room and hop into the stream of lava.\nGo into the lava, where you'll see the wall is glowing. This will be the first stream of lava coming from the wall you will have been near when fighting the first Flamling. Just before it, you can find a Purple Lingzhi to harvest, which becomes another fungiman you need to defeat.\nContinue up the stream of lava to find another Flamling and a tree to harvest for a Fire Date. Now go right, where you should see a cart just to the left. There is a green Wisp to collect right by its arm, and a chest opposite it that won't necessarily be visible to you yet. But what will be, is the Tenner guarding it.\nApproach carefully and deal with the Tenner and the Flamlings that will appear as soon as you're close to the cart.\nWhen the area is clear, collect the green Wisps and open the chest to collect Fine Gold Thread and Blood of the Iron Bull.Now approach the cart. This is one of the Five Element Carts, but it's already been dealt with. Get close to its mouth and pull the string when prompted. When you do, you'll hear the voice of Ma Tianba (the horse guai from previous chapters) coming from inside. Keep pulling the string until you've exhausted all dialogue, and then move on. There's nothing more you can do here for now, but we'll return later.\nFace away from the cart and back in the direction you came from. There's more to explore at the moment, before you continue up to the archway you can see in the distance.\nGo left, at the first lava stream you can see running from the ceiling. Take another left, so you're heading back on yourself (just on the lower level) toward where you started Furnace Valley.\nRight at the end of this path, you'll find a Turtle Treasure guarding a chest. This Turtle Treasure holds a Spirit for you to collect once you've beaten it. After grabbing the Turtle Treasure Spirit, open the chest to collect Kun Steel, Knot of Voidness, and Medicines.\nTurtle Treasure Spirit\nBacktrack on yourself and go straight up through the path on the left between the rocks. Head for the lava stream running from the ceiling straight up ahead but stop to kill the last Flamling on the right, just behind the rock, and harvest the Fire Date from the tree on the right.\nWhen you reach the lava, go to the dark corner on the right to collect the green Wisp. As you approach, you'll be jumped by Scorching-Fire rocks, so be prepared. Then, go up the ramp on the left to meet another Earth Rakshasa and take this out.\nHead through the archway, where you'll see another Flamling emerge on the right. Take the Flamling out and look down to the left, below the edge of the cliff where it sat.\nDrop down here, and head right first to collect the Fire Date from the tree. Then go in the opposite direction toward the lava streaming from the ceiling. This is where you can find one of the optional bosses in Chapter 5, the Flint Chief.\n### Yaoguai Chief - Flint Chief\nThe Flint Chief is another rock boss in the game, that will try to use all its might in its attacks, so the moveset will seem familiar.\nA lot of the moves will see the Chief attack with long sweeps or hitting the ground with its fists. Ripples of lava will often follow these attacks, so using the Fireproof Mantle will give you some protection against the fire damage.\nThere are three areas you can concentrate attacks, which are its body and two hands. It's best to target the two hands, as these are actually breakable and by removing them, the Flint Chief becomes a lot more unsteady on its feet. Focus combos, follow-ups, and heavy attacks on its hands to remove them as quickly as possible.\nWhen you've beaten it collect the Flint Chief Spirit it drops and the Fire Date from the tree to the right of the lava flowing from the ceiling.\nFlint Chief\nFollow the lava path back up the archway, collecting more Fire Dates on the way, and be careful of Scorching and Searing-Fire enemies that will pop out along the way.\nWhen you're back up to the arch, continue forward to the top of the slope. The path goes left and right here. Right is the main path, so for now, let's take a look at the left side. As you head over, you'll see an Earth Rakshasa waiting for you that guards a chest. It also has a Spirit for you to collect once you defeat it.\nAs soon as you pass by the torch, a Flamling will appear. Take down the Flamling and Rakshasa, then collect the Earth Rakshasa Spirit. After this, open the chest and collect Celestial Ribbon and a Mind Core.\nEarth Rakshasa Spirit\nNow turn back the other way and continue up the valley. At the top of the path, you'll come to another archway and the start of Rakshasa Palace.\nAs soon as you pass through the archway, the next boss battle will begin and you'll discover who was responsible for the voices you heard earlier.\n### Yaoguai Chief - Cloudy Mist, Misty Cloud\nCloudy Mist and Misty Cloud are another duo that will use different elements to fight you. You'll go up against Cloudy Mist first, who is the creature with the staff.\nIt will mainly shoot lasers from the smaller face on its chest and use projectiles. The way that these attacks appear can vary wildly from one laser at a time, to multiple in a criss-cross pattern. As for the projectiles, you'll see either a few larger balls of mist or multiple tiny ones sent your way.\nThe lasers can be avoided by dodging or jumping over them, and the projectiles can be outrun or you can dodge to stop them hitting you. When there are numerous, we'd recommend outrunning them, and when there are just a few, dodge out of the way. During this fight, you want to stay as close to Cloudy Mist as possible, to remove the advantage of his long-range attacks.\nMisty Cloud will soon appear, though he will look almost see-through initially. He will often pop up as soon as Cloudy Mist has finished a set of moves, hoping to catch you off guard and hit you with his flaming bundle.\nThe key to keeping track of this creature is to see where the cloud moves and jump out of the way when it gets close to you. Misty Cloud favors the use of a flaming bundle, operating it like a hammer and delivering fire attacks.\nAs Cloudy Mist is the first to appear, this should be where you first attack. Things will change when you manage to hit Cloudy Mist enough times that it will send out a bright light as a flashbang that can stun both you and Misty Cloud. For a brief moment, Misty Cloud won't be able to see you and Cloudy Mist will become its eyes.\nWhen this happens, you'll want to focus on dodging the fire attacks from Misty Cloud. These often happen with him dragging the flaming bundle along the floor, to try and create a ripple of flames to get you. Or slamming it down like a hammer. There will be times when he puts the bundle on his back, and he's slow with this move, so you've got plenty of time to attack.\nThe fight can feel quite fast-paced as they swap in and out to attack, so to put an end to their teamwork and slow things down, make use of spells like Immobilize. You should then aim to build as much Focus as possible and look for opportunities to perform heavy attacks. Both bosses can be staggered by this, giving you a chance to whittle down their health.\nCloudy Mist, Misty Cloud\nAfter defeating them collect the Spirit they drop, then continue up the stairs toward the palace.\nMisty Cloud, Cloudy Mist Spirit\nOpen the giant door at the top of the stairs. Go straight ahead and activate the Rakshasa Palace Keeper's Shrine.",
    "promot_tokens_num": 2489
}