{
    "chunk_id": 217324426915,
    "source_file": "Flint_Vanguard.md",
    "content_type": "one and two",
    "h1_title": "Flint Vanguard",
    "h2_title": "Flint Vanguard Boss Fight and Guide",
    "h1_content": "Flint Vanguard is one of the optional Yaoguai Chief boss fights Chapter 5 in Black Myth: Wukong. This is the second of the stone bosses in Chapter 5, and another that will drop a Samadhi Fire Crystal.",
    "h2_content": "The fight with the Flint Vanguard is sadly not a one-on-one as Searing and Scorching-Fire enemies will accompany it. These will emerge as soon as you approach, and it's worth clearing them out first so you don't have to think about them while attacking the Flint Vanguard. To do this, run around the outskirts of the Flint Vanguard and bait the creatures into attacking you, then run into the middle of the rock circle to bring out the miniboss.\nWhen it comes to the Flint Vanguard, the main thing to watch out for is its thick rocky arms. It will punch down using these, creating pools of lava where they land. To counter these attacks, use Body-Cooling Powder and your Fireproof Mantle.\nWhenever you're close to the Flint Vanguard, it will go into combo punches. These are typical punches to the ground, and occasionally it will slam both arms down together. These can be dodged, and you'll be able to keep close to the Vanguard temporarily until pools of lava appear -- that's when you want to dash away.\nIt shifts to ranged attacks when you try to create distance, in the form of fireballs. This will just be a single shot each time, so it's easiest to dodge. It will also attempt to close the gap by flying over to you and smashing down.\nWhen it starts to get enranged, it will slam its fists down and shake its head, sending out a barrage of fireballs. Run around when this occurs, to avoid as much of the fireballs as possible.\nGenerally, you want to stick close to the Vanguard, dodge the punches, and build up focus to perform heavy attacks. You can knock it over like this, where it will be on all fours, so you can target it while it's vulnerable.\nWhen the Flint Vanguard is down, be sure to collect the Flint Vanguard Spirit it drops. There's also a green Wisp you can pick up, that's just to the left of the clearing.\nFlint Vanguard",
    "promot": "This is an excerpt from the file 'Flint_Vanguard.md', located in the main section titled 'Flint Vanguard'. The section summary is: Flint Vanguard is one of the optional Yaoguai Chief boss fights Chapter 5 in Black Myth: Wukong. This is the second of the stone bosses in Chapter 5, and another that will drop a Samadhi Fire Crystal. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Flint Vanguard Boss Fight and Guide', and the detailed content is as follows:\nThe fight with the Flint Vanguard is sadly not a one-on-one as Searing and Scorching-Fire enemies will accompany it. These will emerge as soon as you approach, and it's worth clearing them out first so you don't have to think about them while attacking the Flint Vanguard. To do this, run around the outskirts of the Flint Vanguard and bait the creatures into attacking you, then run into the middle of the rock circle to bring out the miniboss.\nWhen it comes to the Flint Vanguard, the main thing to watch out for is its thick rocky arms. It will punch down using these, creating pools of lava where they land. To counter these attacks, use Body-Cooling Powder and your Fireproof Mantle.\nWhenever you're close to the Flint Vanguard, it will go into combo punches. These are typical punches to the ground, and occasionally it will slam both arms down together. These can be dodged, and you'll be able to keep close to the Vanguard temporarily until pools of lava appear -- that's when you want to dash away.\nIt shifts to ranged attacks when you try to create distance, in the form of fireballs. This will just be a single shot each time, so it's easiest to dodge. It will also attempt to close the gap by flying over to you and smashing down.\nWhen it starts to get enranged, it will slam its fists down and shake its head, sending out a barrage of fireballs. Run around when this occurs, to avoid as much of the fireballs as possible.\nGenerally, you want to stick close to the Vanguard, dodge the punches, and build up focus to perform heavy attacks. You can knock it over like this, where it will be on all fours, so you can target it while it's vulnerable.\nWhen the Flint Vanguard is down, be sure to collect the Flint Vanguard Spirit it drops. There's also a green Wisp you can pick up, that's just to the left of the clearing.\nFlint Vanguard",
    "promot_tokens_num": 520
}