{
    "chunk_id": 464491526159,
    "source_file": "Mad_Tiger.md",
    "content_type": "one and two",
    "h1_title": "Mad Tiger",
    "h2_title": "Where to Find the Mad Tiger",
    "h1_content": "The Mad Tiger is an optional secret Yaoguai Chief miniboss that you can encounter deep in a well in Chapter 2 of Black Myth Wukong. Not to be confused with his brother, the Tiger Vanguard of the Crouching Tiger Temple, you can only reach this boss by following the trail of a ghostly boy using the Old Rattle-Drum Key Item.\n* Rewards: Mad Tiger Spirit, Blood of the Iron Bull, Yaoguai Core x1, Stone Spirit x1, 1102 Experience, 1023 Will, Plaguebane Gourd (in chest)",
    "h2_content": "After defeating the Tiger’s Acolyte\"), you’ll gain the Old-Rattle Drum, which appears to have belonged to the Acolyte’s son, but no other details are provided. You will need to find three areas where you can use the drum to summon a spirit, in locations all across the Yellow Wind Ridge. The only clue you’ll have is that entering the correct area will cause your vision to warp, and the ghostly voice of a boy calling out to you.\n* The first location is further back in the Windrest Hamlet. Return across the bridge to the Windrest Hamlet Shrine and pass back through the large gate, immediately taking a left to the large house surrounded by sitting Withering Corpses.\n* The second location on the path down from the sealed stone door where you fought the King of Flowing Sand and his Second Rat Prince son. Head down from the door towards a bridge, but take a right to pass through a ruined building overhang where there’s a long roof-like walkway and several Withering Corpses milling about.\n* The final location is back in the area where you fought the Earth Wolf and rescued the Horse Guai who was tied up by the large statue in Sandgate Village. Look to the left of that statue altar, and you’ll find a small field around the back with a concerning amount of skeletons, and a well.\nUsing the Rattle-Drum here one final time will cause the spirit of the boy to appear before you, and invite you to hop down the well to meet a “friend”. Unfortunately, if the dull echoing roars coming from somewhere below are any indication, you’re not going to meet a friendly face down there.",
    "promot": "This is an excerpt from the file 'Mad_Tiger.md', located in the main section titled 'Mad Tiger'. The section summary is: The Mad Tiger is an optional secret Yaoguai Chief miniboss that you can encounter deep in a well in Chapter 2 of Black Myth Wukong. Not to be confused with his brother, the Tiger Vanguard of the Crouching Tiger Temple, you can only reach this boss by following the trail of a ghostly boy using the Old Rattle-Drum Key Item.\n* Rewards: Mad Tiger Spirit, Blood of the Iron Bull, Yaoguai Core x1, Stone Spirit x1, 1102 Experience, 1023 Will, Plaguebane Gourd (in chest) This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find the Mad Tiger', and the detailed content is as follows:\nAfter defeating the Tiger’s Acolyte\"), you’ll gain the Old-Rattle Drum, which appears to have belonged to the Acolyte’s son, but no other details are provided. You will need to find three areas where you can use the drum to summon a spirit, in locations all across the Yellow Wind Ridge. The only clue you’ll have is that entering the correct area will cause your vision to warp, and the ghostly voice of a boy calling out to you.\n* The first location is further back in the Windrest Hamlet. Return across the bridge to the Windrest Hamlet Shrine and pass back through the large gate, immediately taking a left to the large house surrounded by sitting Withering Corpses.\n* The second location on the path down from the sealed stone door where you fought the King of Flowing Sand and his Second Rat Prince son. Head down from the door towards a bridge, but take a right to pass through a ruined building overhang where there’s a long roof-like walkway and several Withering Corpses milling about.\n* The final location is back in the area where you fought the Earth Wolf and rescued the Horse Guai who was tied up by the large statue in Sandgate Village. Look to the left of that statue altar, and you’ll find a small field around the back with a concerning amount of skeletons, and a well.\nUsing the Rattle-Drum here one final time will cause the spirit of the boy to appear before you, and invite you to hop down the well to meet a “friend”. Unfortunately, if the dull echoing roars coming from somewhere below are any indication, you’re not going to meet a friendly face down there.",
    "promot_tokens_num": 528
}