{
    "chunk_id": 297965841696,
    "source_file": "How_to_Unlock_the_Chapter_1_Secret_Area.md",
    "content_type": "one and two",
    "h1_title": "How to Unlock the Chapter 1 Secret Area",
    "h2_title": "How to Find the Three Bells",
    "h1_content": "Black Myth: Wukong is full of secrets, including hidden areas that can only be unlocked through solving a puzzle or finding a key item. One such secret area is in Chapter 1 and requires ringing three bells to access it. On this page, you'll find information on how to find each of the three bells and what awaits you in the hidden temple.",
    "h2_content": "If you've been exploring every part of Chapter 1 thoroughly, you’ll likely encounter two of the bells before you’re even told about them. That being said, you might not have rung them. It’s not until the fight with the Whiteclad Noble that you’ll hear a riddle and then be prompted to find the three bells. If you're not sure where to find them all, here's where you need to look:",
    "promot": "This is an excerpt from the file 'How_to_Unlock_the_Chapter_1_Secret_Area.md', located in the main section titled 'How to Unlock the Chapter 1 Secret Area'. The section summary is: Black Myth: Wukong is full of secrets, including hidden areas that can only be unlocked through solving a puzzle or finding a key item. One such secret area is in Chapter 1 and requires ringing three bells to access it. On this page, you'll find information on how to find each of the three bells and what awaits you in the hidden temple. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'How to Find the Three Bells', and the detailed content is as follows:\nIf you've been exploring every part of Chapter 1 thoroughly, you’ll likely encounter two of the bells before you’re even told about them. That being said, you might not have rung them. It’s not until the fight with the Whiteclad Noble that you’ll hear a riddle and then be prompted to find the three bells. If you're not sure where to find them all, here's where you need to look:",
    "promot_tokens_num": 242
}