{
    "chunk_id": 575466984303,
    "source_file": "Temple_of_Yellow_Flowers_Walkthrough.md",
    "content_type": "two",
    "h1_title": "Temple of Yellow Flowers Walkthrough",
    "h2_title": "Yaoguai King Boss Fight - Hundred-Eyed Daoist Master",
    "content": "The first time you approach this boss fight, you'll see the depths of the depraved power the Hundred-Eyed Daoist Master possesses as he absorbs the Violet Spider into his being against her will. He'll transform into a centipede demon, using a large sword that he can imbue with electrical power to deal a ton of damage, and is also capable of both electrical blast attacks, and a few sneaky poison strikes. Because of this, it's better to have Shock-Quelling Powder on hand, but also be prepared to dip into your inventory to use Antimiasma medicine when its needed (which shouldn't be too often). \n\nAs mentioned previously, it is extremely recommended that you complete the Purple Cloud Mountain Secret Area and get the Weaver's Needle Vessel, as you'll find defeating the boss in his final phase to be extremely difficult without it, more-so than any of the previous chapter bosses. \n\n\n\nWhen the battle begins, the Violet Spider's daughters will launch into battle and try to battle with the Hundred-Eyed Daoist. You should absolutely use this period to help them out whenever possible and get your own hits in until the spiders are all defeated, but don't worry too much if you end up dying your first attempt. Even though the Spider Sisters won't reappear for subsequent attempts, The boss health bar will be permanently lowered by 15%, which is a pretty big boon to work with. \n\nOddly enough, there's actually two small areas on either side of the arena you can't reach the first time due to the cutscene, but can explore before attacking him on subsequent attempts. To the right, you'll find some Daoists guarding a **Treasure Chest** with materials, and on the left you'll find a small pathway leading to the side of the arena with a green Wisp to absorb.\n\n\n\nOnce the fight settles down to a 1v1, you'll get a better idea of his many attacks and how best to avoid them. He has a number of different sword sweep attacks he can do when you try a frontal assault, slicing downwards with a forward and backward slash, then spinning around quickly to perform a third hit. \n\n\n\nHe often follows this up by sending out the three paper talismans that float around his free hand to electrically charge the area in front of him before blasting it with a lightning strike, but by dodging to the side you can score several free hits as he draws out the animation. \n\n\n\nMost times, he'll also begin the fight with stamping down with his two front talons, following up with a quick sword slash, and will then imbue his sword with lightning for a moment, before triggering a delayed downward slash to electrify you. \n\n\n\nHowever, if you notice him swap to a reverse grip for his sword early on while leaning his head back, he'll quickly launch out a poison spray in a wide arc you'll need to quickly dodge behind him, or be ready to pop an antimiasma pill. \n\n\n\nIf he instead lets his sword float around the talismans to become imbued with lightning, be ready for him to toss the sword directly at you with quick speed. You'll have a moment to close the distance and get some hits in, but be ready when you see him raise his arms wide and begin to spin around as he advances, as his sword will reappear in his hand to perform two quick downward slashes, and then imbue his sword for a final slash (but you can deflect the two earlier slashes to stagger him). \n\n\n\nSpeaking of deflecting, it you favor the Rock Solid spell, do be warned that the Hundred-Eyed Daoist has a particular distaste for the skill. After you successfully use it to deflect his attacks, there's a good chance that he'll notice the move and say he \"forbids\" as he burrows into the ground. \n\n\n\nHe'll then start coming for you while burrowed, which you can see by the disturbed earth heading in your direction. As lightning strikes, he'll leap out in an unblockable grab that deals major damage, and the timing can prove fairly difficult to dodge when you can't see or target him. We recommend running away while panning the camera behind you, and the exact moment you see a larger lightning strike behind you, dodge forward to avoid him as he bursts upward. \n\n\n\nHis other burrowing attack is equally damaging, though it comes less often. He'll start by tossing his sword at you, which will continue to spin wildly in a small circle near your position. As soon as you dodge it, immediately sprint away, as his tail will burst forth around the sword, spraying poison in nearly every direction. \n\n\n\nThe attack won't stop there, as once he re-burrows, you'll need to keep your eyes and ears peeled. After a brief moment, his electrified sword will come hurtling in from a corner of the arena with a small lightning strike noise, and you'll need to dodge it as it embeds itself in the ground. Stay clear of the impact site, as the boss will then burrow out to grab it and perform a quick double slash with the electrified blade before spinning about (at which you should then hop in and attack). \n\n\n\nAs the fight rages on, expect him to employ a wider variety of both sword and electric attacks with his talismans, employing new combos to slice or slam, and then shoot out electric blasts or imbue his sword for bigger hits. One move to be wary of seems easy enough at first, as he'll charge up his sword by holding it close to his left side, and then unleash an upward lighting slash to his right. However, he'll immediately grab at you with his free hand, and squeeze the life out of you if you are too close to him following that first slash. \n\n\n\nIf he stabs his sword into the ground in front of him, he's actually hoping to bait you into deflecting your attack, which he'll counter with a charged electric stab. The good news is you can deflect him right back, just be ready for him to get mad and burrow down in response. \n\n\n\nHe can also hold his sword high up above him while charging it with lightning strikes. After a delay, he'll begin slashing the air in your direction, unleashing a low projectile wave followed by a diagonal slash wave, and then charge up his sword before jabbing it ahead to send a beam of lightning straight at you. It's better to keep your distance the moment you see him charging up, then dodge the three blasts before moving back in to fight. \n\n\n\nFinally, if he sheathes his sword entirely to concentrate on sending his electric talismans at you, prepare for a length barrage. As he performs a gesture with his hands low, he'll bring them up as he explodes with energy, and then send a salvo of electric talismans flying at you. \n\nIf caught off guard, it's very hard to escape them once you first get staggered, but if you see the attack coming, step back and refresh your stamina, and then start spinning your staff to deflect the barrage until he's done. \n\n\n\nYou'll need to learn this fight carefully, as things will only get harder in the final phase, and you'll need as much of your healing gourd as possible. The good news is that despite his tendency to burrow after you deflect him, many of his attacks - even his poison spewing and many of his point-blank electrical talisman attacks can all be deflected by Rock Solid to stagger him. If you follow up with a charged 4 Focus Point hit, he may even fall to the ground, giving you a huge window to take out his health -- but we recommend saving your Transformation for the last part. \n\n\n\nOnce you've gotten him to around 25% of his health (right between the \"M\" and \"a\" in \"Master\", he'll clutch his head for an extended moment, and that's your cue to back off, as he'll no longer take damage for the moment. When he stabs the ground with his sword again, this time he'll channel a spell to bathe the arena in a golden dome. This is actually a great time to use any consumables you have on hand to buff yourself up, restore cooldowns or get back some Focus for the final phase. \n\nDespite this, the new phase won't actually begin until he grabs his sword again and charges at you, twisting his tail to slam down on you, and following up with two slow sword swings. Only then will a short cutscene , and his true curse comes into . \n\nAt this point, he'll no longer use his sword, focusing entirely on his electric fists and tail, and somehow dealing even more damage in the process. To make matters worse, he'll massively reduce your maximum stamina while in this golden dome. \n\n\n\nTo free yourself, you'll need to use the Weaver's Needle Vessel. It will take a moment to work so be prepared to dodge his next attack while the needle begins to shoot all around him. \n\n\n\nOnce it hits, he'll be knocked to the ground, the curse will be broken, and you'll get a massive opportunity to attack him with everything you've got! Still, don't expect him to go down without a fight after the stun wears off. He's got more tricks than ever, and is able to create huge blasts that can end the fight quickly if you don't react fast. \n\n\n\nHis most common attack comes when he spreads his hands wide as they glow yellow. He'll lunge toward you, bringing up both hands to create a giant tremor in front of him, but it can be deflected with Rock Solid (he'll no longer burrow to retaliate so that's one less thing to worry about). \n\n\n\nHe'll also constantly end his three electric talismans out to distract you. Sometimes he'll shoot them straight out with a punch to add damage with a blast, but he can also hold them in front of him to create an even bigger blast, or send it around his back to slam down with his tail. \n\n\n\nThese attacks can be followed up often by him raising up on his claws while holding his electric orb high. After a moment, he'll slam everything down to create a massive shockwave that you need to either run from, or dodge at just the right moment (your Pillar Stance won't save you here). The good news is this blast leaves him very vulnerable for several moments afterward, once you get the dodge timing down. \n\n\n\nIf you see him perform an extravagant twisting somersault through the air, don't be dazzled, as he'll chain this feinting maneuver into a quick grab once he touches back on the ground and take a few step, lunging extra distance to try and yank you forward and take off a huge portion of your health with his crazy unblockable grab attack. \n\n\n\nThis is a good time to use your best Transformation Spell to help whittle down his health, especially if you're worried about the grab or are electrified and need to retreat. The Golden Lining transformation is a good bet for its shock resistance, and many of his massive attacks are slow enough that you can \"see through\" them to build up focus points and blast him back. If you haven't beaten Yellow Loong or aren't sure about his moves, you can also use Hoarfrost or Umbral Abyss to try freezing him, just be sure to keep on top of dodging his big blasts. \n\nThe last piece of his health bar is by far the scariest to take down, and you'll need to constantly be watching his electrified talismans to anticipate where his next big blast is coming from. If you have extra mana, you can also try going for the Pluck of Mana, or just focus on more Immobilizations and Rock Solid Deflections. \n\nOnce you've finally defeated the Hundred-Eyed Daoist Master, you'll be treated to the finale of the Spider Sisters and their mother. Note that you'll now gain all the Yaoguai Chief entries for the First, Third, Fourth, and Fifth Sister (despite you not having actually fought against them). \n\nHundred-Eyed Daoist Master\n\n\n\nWith a bittersweet ending to this chapter, you'll gain the next piece of the Great Sage's Senses - the Envious Tongue, which has some interesting talents you can pick from: \n\n  * **Refreshing Taste** \\- After consuming medicine, increases the Critical Hit Chance of the next attack.\n  * **Spread the Word** \\- Immobilize affects all enemies around the target.\n  * **Tongue of a Connoisseur** \\- Each equipped Soak slightly increases the Health recovery of the Drink.\n\nLeaving the Webbed Hollow behind, your next stop will take you to the fiery wasteland of the **Flaming Mountains** in search of the fifth relic. \n\nTemple of Yellow Flowers Complete",
    "promot": "This excerpt is taken from the file \"Temple_of_Yellow_Flowers_Walkthrough.md\", within the section \"Temple of Yellow Flowers Walkthrough\" and the sub-section \"Yaoguai King Boss Fight - Hundred-Eyed Daoist Master\". The content is presented below:\n\nThe first time you approach this boss fight, you'll see the depths of the depraved power the Hundred-Eyed Daoist Master possesses as he absorbs the Violet Spider into his being against her will. He'll transform into a centipede demon, using a large sword that he can imbue with electrical power to deal a ton of damage, and is also capable of both electrical blast attacks, and a few sneaky poison strikes. Because of this, it's better to have Shock-Quelling Powder on hand, but also be prepared to dip into your inventory to use Antimiasma medicine when its needed (which shouldn't be too often). \n\nAs mentioned previously, it is extremely recommended that you complete the Purple Cloud Mountain Secret Area and get the Weaver's Needle Vessel, as you'll find defeating the boss in his final phase to be extremely difficult without it, more-so than any of the previous chapter bosses. \n\n\n\nWhen the battle begins, the Violet Spider's daughters will launch into battle and try to battle with the Hundred-Eyed Daoist. You should absolutely use this period to help them out whenever possible and get your own hits in until the spiders are all defeated, but don't worry too much if you end up dying your first attempt. Even though the Spider Sisters won't reappear for subsequent attempts, The boss health bar will be permanently lowered by 15%, which is a pretty big boon to work with. \n\nOddly enough, there's actually two small areas on either side of the arena you can't reach the first time due to the cutscene, but can explore before attacking him on subsequent attempts. To the right, you'll find some Daoists guarding a **Treasure Chest** with materials, and on the left you'll find a small pathway leading to the side of the arena with a green Wisp to absorb.\n\n\n\nOnce the fight settles down to a 1v1, you'll get a better idea of his many attacks and how best to avoid them. He has a number of different sword sweep attacks he can do when you try a frontal assault, slicing downwards with a forward and backward slash, then spinning around quickly to perform a third hit. \n\n\n\nHe often follows this up by sending out the three paper talismans that float around his free hand to electrically charge the area in front of him before blasting it with a lightning strike, but by dodging to the side you can score several free hits as he draws out the animation. \n\n\n\nMost times, he'll also begin the fight with stamping down with his two front talons, following up with a quick sword slash, and will then imbue his sword with lightning for a moment, before triggering a delayed downward slash to electrify you. \n\n\n\nHowever, if you notice him swap to a reverse grip for his sword early on while leaning his head back, he'll quickly launch out a poison spray in a wide arc you'll need to quickly dodge behind him, or be ready to pop an antimiasma pill. \n\n\n\nIf he instead lets his sword float around the talismans to become imbued with lightning, be ready for him to toss the sword directly at you with quick speed. You'll have a moment to close the distance and get some hits in, but be ready when you see him raise his arms wide and begin to spin around as he advances, as his sword will reappear in his hand to perform two quick downward slashes, and then imbue his sword for a final slash (but you can deflect the two earlier slashes to stagger him). \n\n\n\nSpeaking of deflecting, it you favor the Rock Solid spell, do be warned that the Hundred-Eyed Daoist has a particular distaste for the skill. After you successfully use it to deflect his attacks, there's a good chance that he'll notice the move and say he \"forbids\" as he burrows into the ground. \n\n\n\nHe'll then start coming for you while burrowed, which you can see by the disturbed earth heading in your direction. As lightning strikes, he'll leap out in an unblockable grab that deals major damage, and the timing can prove fairly difficult to dodge when you can't see or target him. We recommend running away while panning the camera behind you, and the exact moment you see a larger lightning strike behind you, dodge forward to avoid him as he bursts upward. \n\n\n\nHis other burrowing attack is equally damaging, though it comes less often. He'll start by tossing his sword at you, which will continue to spin wildly in a small circle near your position. As soon as you dodge it, immediately sprint away, as his tail will burst forth around the sword, spraying poison in nearly every direction. \n\n\n\nThe attack won't stop there, as once he re-burrows, you'll need to keep your eyes and ears peeled. After a brief moment, his electrified sword will come hurtling in from a corner of the arena with a small lightning strike noise, and you'll need to dodge it as it embeds itself in the ground. Stay clear of the impact site, as the boss will then burrow out to grab it and perform a quick double slash with the electrified blade before spinning about (at which you should then hop in and attack). \n\n\n\nAs the fight rages on, expect him to employ a wider variety of both sword and electric attacks with his talismans, employing new combos to slice or slam, and then shoot out electric blasts or imbue his sword for bigger hits. One move to be wary of seems easy enough at first, as he'll charge up his sword by holding it close to his left side, and then unleash an upward lighting slash to his right. However, he'll immediately grab at you with his free hand, and squeeze the life out of you if you are too close to him following that first slash. \n\n\n\nIf he stabs his sword into the ground in front of him, he's actually hoping to bait you into deflecting your attack, which he'll counter with a charged electric stab. The good news is you can deflect him right back, just be ready for him to get mad and burrow down in response. \n\n\n\nHe can also hold his sword high up above him while charging it with lightning strikes. After a delay, he'll begin slashing the air in your direction, unleashing a low projectile wave followed by a diagonal slash wave, and then charge up his sword before jabbing it ahead to send a beam of lightning straight at you. It's better to keep your distance the moment you see him charging up, then dodge the three blasts before moving back in to fight. \n\n\n\nFinally, if he sheathes his sword entirely to concentrate on sending his electric talismans at you, prepare for a length barrage. As he performs a gesture with his hands low, he'll bring them up as he explodes with energy, and then send a salvo of electric talismans flying at you. \n\nIf caught off guard, it's very hard to escape them once you first get staggered, but if you see the attack coming, step back and refresh your stamina, and then start spinning your staff to deflect the barrage until he's done. \n\n\n\nYou'll need to learn this fight carefully, as things will only get harder in the final phase, and you'll need as much of your healing gourd as possible. The good news is that despite his tendency to burrow after you deflect him, many of his attacks - even his poison spewing and many of his point-blank electrical talisman attacks can all be deflected by Rock Solid to stagger him. If you follow up with a charged 4 Focus Point hit, he may even fall to the ground, giving you a huge window to take out his health -- but we recommend saving your Transformation for the last part. \n\n\n\nOnce you've gotten him to around 25% of his health (right between the \"M\" and \"a\" in \"Master\", he'll clutch his head for an extended moment, and that's your cue to back off, as he'll no longer take damage for the moment. When he stabs the ground with his sword again, this time he'll channel a spell to bathe the arena in a golden dome. This is actually a great time to use any consumables you have on hand to buff yourself up, restore cooldowns or get back some Focus for the final phase. \n\nDespite this, the new phase won't actually begin until he grabs his sword again and charges at you, twisting his tail to slam down on you, and following up with two slow sword swings. Only then will a short cutscene , and his true curse comes into . \n\nAt this point, he'll no longer use his sword, focusing entirely on his electric fists and tail, and somehow dealing even more damage in the process. To make matters worse, he'll massively reduce your maximum stamina while in this golden dome. \n\n\n\nTo free yourself, you'll need to use the Weaver's Needle Vessel. It will take a moment to work so be prepared to dodge his next attack while the needle begins to shoot all around him. \n\n\n\nOnce it hits, he'll be knocked to the ground, the curse will be broken, and you'll get a massive opportunity to attack him with everything you've got! Still, don't expect him to go down without a fight after the stun wears off. He's got more tricks than ever, and is able to create huge blasts that can end the fight quickly if you don't react fast. \n\n\n\nHis most common attack comes when he spreads his hands wide as they glow yellow. He'll lunge toward you, bringing up both hands to create a giant tremor in front of him, but it can be deflected with Rock Solid (he'll no longer burrow to retaliate so that's one less thing to worry about). \n\n\n\nHe'll also constantly end his three electric talismans out to distract you. Sometimes he'll shoot them straight out with a punch to add damage with a blast, but he can also hold them in front of him to create an even bigger blast, or send it around his back to slam down with his tail. \n\n\n\nThese attacks can be followed up often by him raising up on his claws while holding his electric orb high. After a moment, he'll slam everything down to create a massive shockwave that you need to either run from, or dodge at just the right moment (your Pillar Stance won't save you here). The good news is this blast leaves him very vulnerable for several moments afterward, once you get the dodge timing down. \n\n\n\nIf you see him perform an extravagant twisting somersault through the air, don't be dazzled, as he'll chain this feinting maneuver into a quick grab once he touches back on the ground and take a few step, lunging extra distance to try and yank you forward and take off a huge portion of your health with his crazy unblockable grab attack. \n\n\n\nThis is a good time to use your best Transformation Spell to help whittle down his health, especially if you're worried about the grab or are electrified and need to retreat. The Golden Lining transformation is a good bet for its shock resistance, and many of his massive attacks are slow enough that you can \"see through\" them to build up focus points and blast him back. If you haven't beaten Yellow Loong or aren't sure about his moves, you can also use Hoarfrost or Umbral Abyss to try freezing him, just be sure to keep on top of dodging his big blasts. \n\nThe last piece of his health bar is by far the scariest to take down, and you'll need to constantly be watching his electrified talismans to anticipate where his next big blast is coming from. If you have extra mana, you can also try going for the Pluck of Mana, or just focus on more Immobilizations and Rock Solid Deflections. \n\nOnce you've finally defeated the Hundred-Eyed Daoist Master, you'll be treated to the finale of the Spider Sisters and their mother. Note that you'll now gain all the Yaoguai Chief entries for the First, Third, Fourth, and Fifth Sister (despite you not having actually fought against them). \n\nHundred-Eyed Daoist Master\n\n\n\nWith a bittersweet ending to this chapter, you'll gain the next piece of the Great Sage's Senses - the Envious Tongue, which has some interesting talents you can pick from: \n\n  * **Refreshing Taste** \\- After consuming medicine, increases the Critical Hit Chance of the next attack.\n  * **Spread the Word** \\- Immobilize affects all enemies around the target.\n  * **Tongue of a Connoisseur** \\- Each equipped Soak slightly increases the Health recovery of the Drink.\n\nLeaving the Webbed Hollow behind, your next stop will take you to the fiery wasteland of the **Flaming Mountains** in search of the fifth relic. \n\nTemple of Yellow Flowers Complete",
    "promot_tokens_num": 2715
}