{
    "chunk_id": 826974521064,
    "source_file": "Proto-Amourworm.md",
    "content_type": "one and two",
    "h1_title": "Proto-Amourworm",
    "h2_title": "Where to use the Proto-Amourworm in Black Myth: Wukong",
    "h1_content": "The Proto-Amourworm is one of the many Key Items you can find in the latter half of Black Myth: Wukong, specifically within The Webbed Hollow. The item is incredibly important to Chen Loong's questline in The New West.\n_\"Every boon has its bane, every loss leads to gain.\"_\nYou can find the Proto-Amourworm In The Webbed Hollow at The Verdure Bridge Shrine. Head towards the lanterns that are nearby and go down the pathway to the right. Behind here you can find some chests and another area further back. In this back area you will find the Elder Amourworm and upon its defeat, it will drop the item.\nProto-Amourworm",
    "h2_content": "The Proto-Amourworm can be given to Chen Loong in The New West's Zodiac Realm after you have defeated him and given him the Special-made Bone-Strengthening Pellet. Upon giving this to him, you can rest at a Shrine and find three baskets next to him.\nHere you can grow items, once you find enough Rice Cocoons within The Webbed Hollow, using the Seeds you collect throughout your journey.",
    "promot": "This is an excerpt from the file 'Proto-Amourworm.md', located in the main section titled 'Proto-Amourworm'. The section summary is: The Proto-Amourworm is one of the many Key Items you can find in the latter half of Black Myth: Wukong, specifically within The Webbed Hollow. The item is incredibly important to Chen Loong's questline in The New West.\n_\"Every boon has its bane, every loss leads to gain.\"_\nYou can find the Proto-Amourworm In The Webbed Hollow at The Verdure Bridge Shrine. Head towards the lanterns that are nearby and go down the pathway to the right. Behind here you can find some chests and another area further back. In this back area you will find the Elder Amourworm and upon its defeat, it will drop the item.\nProto-Amourworm This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to use the Proto-Amourworm in Black Myth: Wukong', and the detailed content is as follows:\nThe Proto-Amourworm can be given to Chen Loong in The New West's Zodiac Realm after you have defeated him and given him the Special-made Bone-Strengthening Pellet. Upon giving this to him, you can rest at a Shrine and find three baskets next to him.\nHere you can grow items, once you find enough Rice Cocoons within The Webbed Hollow, using the Seeds you collect throughout your journey.",
    "promot_tokens_num": 303
}