{
    "chunk_id": 590986825280,
    "source_file": "Secrets_in_Black_Myth_Wukong.md",
    "content_type": "one and two",
    "h1_title": "Secrets in Black Myth Wukong",
    "h2_title": "The Druken Boar and the Kindgom of Sahali",
    "h1_content": "If you only stick to the main story in Black Myth: Wukong, you're going to miss out on a lot of the content the game has to offer. The world is packed with secrets including NPCs and their side quests that reward unique items, hidden areas, and secret bosses. If you want to fill out every record in your journal and collect all of those trophies, here's a list of all the secrets we've found across the chapters.\n### Guide in Progress\nThis page is currently in progress, so we'll keep adding secrets along the way! Check back later for more information.\n**Click on the links below to jump to:**\nChapter 1 Secrets| Chapter 2 Secrets| Chapter 3 Secrets\n---|---|---\nChapter 4 Secrets| Chapter 5 Secrets| Chapter 6 Secrets\n# Chapter 1 Secrets\nThe secrets start from the very first chapter of the game, and there's not one but two hidden bosses to uncover as you explore. The first is Elder Jinchi and the second is Red Loong. There are also Transformation Spells and missable Spirits that you'll want to bag before you wrap up the chapter.",
    "h2_content": "The drunken boar (or the Yellow-Robed Squire as he's officially known) can be tricky to find, tucked away at the back of Rockrest Flat. But if you want to unlock the chapter's hidden area, you must complete his side quest. The questline has multiple steps, which start with you needing to bring him a Sobering Stone, either from the Windrest Hamlet or from the Man-in-Stone (once he becomes a merchant).\nWhen he's sobered up, find him again at the Crouching Tiger Temple and bring him a Jade Lotus. After one more interaction with him, back at Rockrest Flat, you'll have to fight him to enter the secret Kingdom of Sahali.\n### Relevant Guide Pages\n* Drunken Boar Questline\n* Yellow-Robed Squire Fight\n* How to Unlock the Chapter 2 Secret Area\n* Chapter 2 Secret - Kingdom of Sahali Walkthrough",
    "promot": "This is an excerpt from the file 'Secrets_in_Black_Myth_Wukong.md', located in the main section titled 'Secrets in Black Myth Wukong'. The section summary is: If you only stick to the main story in Black Myth: Wukong, you're going to miss out on a lot of the content the game has to offer. The world is packed with secrets including NPCs and their side quests that reward unique items, hidden areas, and secret bosses. If you want to fill out every record in your journal and collect all of those trophies, here's a list of all the secrets we've found across the chapters.\n### Guide in Progress\nThis page is currently in progress, so we'll keep adding secrets along the way! Check back later for more information.\n**Click on the links below to jump to:**\nChapter 1 Secrets| Chapter 2 Secrets| Chapter 3 Secrets\n---|---|---\nChapter 4 Secrets| Chapter 5 Secrets| Chapter 6 Secrets\n# Chapter 1 Secrets\nThe secrets start from the very first chapter of the game, and there's not one but two hidden bosses to uncover as you explore. The first is Elder Jinchi and the second is Red Loong. There are also Transformation Spells and missable Spirits that you'll want to bag before you wrap up the chapter. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'The Druken Boar and the Kindgom of Sahali', and the detailed content is as follows:\nThe drunken boar (or the Yellow-Robed Squire as he's officially known) can be tricky to find, tucked away at the back of Rockrest Flat. But if you want to unlock the chapter's hidden area, you must complete his side quest. The questline has multiple steps, which start with you needing to bring him a Sobering Stone, either from the Windrest Hamlet or from the Man-in-Stone (once he becomes a merchant).\nWhen he's sobered up, find him again at the Crouching Tiger Temple and bring him a Jade Lotus. After one more interaction with him, back at Rockrest Flat, you'll have to fight him to enter the secret Kingdom of Sahali.\n### Relevant Guide Pages\n* Drunken Boar Questline\n* Yellow-Robed Squire Fight\n* How to Unlock the Chapter 2 Secret Area\n* Chapter 2 Secret - Kingdom of Sahali Walkthrough",
    "promot_tokens_num": 510
}