{
    "chunk_id": 503291046539,
    "source_file": "How_to_Unlock_the_Zodiac_Village_and_Upgrade_Armor.md",
    "content_type": "one and two",
    "h1_title": "How to Unlock the Zodiac Village and Upgrade Armor",
    "h2_title": "Request Medicines from Xu Dog",
    "h1_content": "If you're tired of hopping from shrine to shrine to see NPCs, or you're wondering how to upgrade armor in Black Myth: Wukong, then Zodiac Village is the place for you. This central hub for NPCs can be unlocked in Chapter 3 and will introduce a new smithing character to cater to all your armor and weapon needs, along with additional perks from those you've already met.\n* How to Unlock Zodiac Village\n* How to Upgrade Armor\n* Challenge Yin Tiger\n* Request Medicines from Xu Dog\n* How to Use Seeds and Harvest Ingredients",
    "h2_content": "Interacting with Xu Dog in the Painted Realm now offers the option to Request Medicine. Each time you do this, Xu Dog will provide you with potions.\nYou'll need to wait a little while before new medicines are available, but you'll know when they are if the red dot next to Request Medicines appears.",
    "promot": "This is an excerpt from the file 'How_to_Unlock_the_Zodiac_Village_and_Upgrade_Armor.md', located in the main section titled 'How to Unlock the Zodiac Village and Upgrade Armor'. The section summary is: If you're tired of hopping from shrine to shrine to see NPCs, or you're wondering how to upgrade armor in Black Myth: Wukong, then Zodiac Village is the place for you. This central hub for NPCs can be unlocked in Chapter 3 and will introduce a new smithing character to cater to all your armor and weapon needs, along with additional perks from those you've already met.\n* How to Unlock Zodiac Village\n* How to Upgrade Armor\n* Challenge Yin Tiger\n* Request Medicines from Xu Dog\n* How to Use Seeds and Harvest Ingredients This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Request Medicines from Xu Dog', and the detailed content is as follows:\nInteracting with Xu Dog in the Painted Realm now offers the option to Request Medicine. Each time you do this, Xu Dog will provide you with potions.\nYou'll need to wait a little while before new medicines are available, but you'll know when they are if the red dot next to Request Medicines appears.",
    "promot_tokens_num": 259
}