{
    "chunk_id": 316507092212,
    "source_file": "Webbed_Hollow-Lower_Hollow_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Webbed Hollow - Lower Hollow Walkthrough",
    "h2_title": "Hut of Immortality",
    "h1_content": "The Webbed Hollow is the second main area of Black Myth: Wukong's Chapter 4, concluding with the lower portion of the large underground cave system. Below you'll find a guide for the third and final lower area of The Webbed Hollow, including where to find the secret Yellow Loong and frog boss, and rescue Zhu Bajie from the clutches of the Violet Spider.\n* **Jump to a Section**\n* **Relief of the Fallen Loong**\n* **Lower Hollow**\n* Yaoguai Chief - Baw-Li-Guhh-Baw\n* **Hut of Immortality**\n* Boss Fight - Zhu Bajie\n* **The Purifying Spring**\n* **The Gathering Cave**\n* Yaoguai Queen - Violet Spider\nDue to the length, complexity, and number of bosses scattered throughout the Webbed Hollow section of Chapter 4, this particular region walkthrough will be split up into three parts with each section largely covering a major floor level of the hollow.",
    "h2_content": "As you exit the tunnel passage, you'll find another Shrine close by. This is a good time to stock up on items, medicine, and upgrade gear or craft as needed, because the fights are only getting harder from here on out.\nOnce you're ready, head through the gate to join the party, and it seems your just in time to meet the not-so-lucky groom.",
    "promot": "This is an excerpt from the file 'Webbed_Hollow-Lower_Hollow_Walkthrough.md', located in the main section titled 'Webbed Hollow - Lower Hollow Walkthrough'. The section summary is: The Webbed Hollow is the second main area of Black Myth: Wukong's Chapter 4, concluding with the lower portion of the large underground cave system. Below you'll find a guide for the third and final lower area of The Webbed Hollow, including where to find the secret Yellow Loong and frog boss, and rescue Zhu Bajie from the clutches of the Violet Spider.\n* **Jump to a Section**\n* **Relief of the Fallen Loong**\n* **Lower Hollow**\n* Yaoguai Chief - Baw-Li-Guhh-Baw\n* **Hut of Immortality**\n* Boss Fight - Zhu Bajie\n* **The Purifying Spring**\n* **The Gathering Cave**\n* Yaoguai Queen - Violet Spider\nDue to the length, complexity, and number of bosses scattered throughout the Webbed Hollow section of Chapter 4, this particular region walkthrough will be split up into three parts with each section largely covering a major floor level of the hollow. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Hut of Immortality', and the detailed content is as follows:\nAs you exit the tunnel passage, you'll find another Shrine close by. This is a good time to stock up on items, medicine, and upgrade gear or craft as needed, because the fights are only getting harder from here on out.\nOnce you're ready, head through the gate to join the party, and it seems your just in time to meet the not-so-lucky groom.",
    "promot_tokens_num": 357
}