{
    "chunk_id": 173851861487,
    "source_file": "Red_Loong.md",
    "content_type": "one and two",
    "h1_title": "Red Loong",
    "h2_title": "Yaoguai King Boss Battle - Red Loong",
    "h1_content": "Red Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Hidden away in the Forest of Wolves, you won't be able to encounter this boss until you obtain a Key Item later in the game, and this boss is and appropriate challenging fight far stronger than anything else in Black Wind Mountain. Red Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n* **Rewards:** Boshan Censer, Thunder Tail, Loong Pearl x1, Mind Core x1, Silk x3, 1652 Experience, 1376 Will",
    "h2_content": "The Red Loong is a fearsome red dragon imbued with the power of electricity, which is both his greatest strength and weakness once you know how to exploit it. It’s important to note that while you can face this boss once you find the required Key Item early in Chapter 2, you may want to wait until after completing Chapter 2, or even starting Chapter 3, due to the difficulty of this encounter. In particular, it’s a good idea to stock up on medicine to increase your shock resistance, and buy the Thunderbolt Horn Soak from the Shen Monkey as well.\nRed Loong will use its electricity imbued attacks to wreak havoc on you, but can also perform a variety of powerful melee attacks. Be wary of his ability to fly over to you and slash at you as he pivots.\nOther times, he’ll slam down his front claws in quick succession, creating lightning spots that will detonate in the area after a short moment, requiring you to quickly dodge away or risk taking major shock damage. Take too much, and you’ll be taking double damage until you use medication to remove the effect.\nHe also has a wicked and electrified bladed tail that he can use to quickly spin around and slash you with, but can be deflected with a well-timed Rock Solid spell. There’s a few different ways he can use his tail, either for a slow rotating blade slash in front of him, or with a quick jab at your position.\nIf you try to attack from behind, he can even leap up to face you while slashing his tail below him in a retreating strike to stop you from pursuing him.\nHe can also use simple claw swipes, which more often than not will create more lightning spots that detonate after a short delay. Always dodge to the opposite side of his swipe so you can retaliate with attacks and not get shocked.\nRed Loong can also employ a deadly extended combo, first lunging at you with two claw swipes to create lightning spots, and then leaping into the air to feint around to the other side of you while swinging his tail below — all while finally landing behind you to attack as the lightning detonates on the other side.\nWith enough sustained damage, you can eventually stagger and knock down the Red Loong, which is your big moment to maximize your damage output.\nLook for the four electric pots that crackle and sparkle on the back of the dragon. You’ll want to aim a large heavy hit directly on these whenever possible. Targeting them isn’t always easy, as you can only really lock on to the center of his body, which may not specifically point you at the pots on his back.\nFor your best chance, we recommend swapping to the Pillar Stance, and unleashing a big charge attack when facing his back. With 2-3 Focus Points banked, you have a good chance of slamming your staff down right on his back and hitting one or more pots. Should you connect, you’ll deal a huge amount of damage to Red Loong in a single burst, causing an explosion in the process.\nBe wary though, if you are unable to cause this big damage hit, Red Loong will awaken and trigger his own electric explosion as he rises, and you’ll want to retreat well away before this happens.\nUnfortunately, there’s other times when he can detonate a similar explosion even when not getting back from a stun, and it’s hard to tell when this will happen, other than him remaining still and charging the pots on his back for a long moment.\nThe rest of this fight will rely on your ability to stagger him back into this state, and maximize the damage to the pots on his back. Make use of Spirits with big hits like the Wandering Wight, and the Azure Dust Transformation spell to score big hits that knock him back, and you’ll have a better chance of stunning him again.\nIf you find yourself struggling to hit the pots, make sure you attack him when he’s stunned where his back is facing, and not his belly, as you’ll get a better angle that way. You can also quickly take a Tiger Subduing Pellet right when he becomes stunned to maximize your damage output on his weak point.\nWhen the Red Loong finally falls as you explode his pots for good, you’ll earn plenty of rewards, including a Loong Pearl, Mind Core, 3 Silk, 1376 Will, and 1652 Experience. In addition to this, you can find a gold chest nearby that contains a Boshan Censer curio, and a Thunder Tail weapon material — one of two Loong materials needed to craft the Loongwreathe Staff!",
    "promot": "This is an excerpt from the file 'Red_Loong.md', located in the main section titled 'Red Loong'. The section summary is: Red Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Hidden away in the Forest of Wolves, you won't be able to encounter this boss until you obtain a Key Item later in the game, and this boss is and appropriate challenging fight far stronger than anything else in Black Wind Mountain. Red Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n* **Rewards:** Boshan Censer, Thunder Tail, Loong Pearl x1, Mind Core x1, Silk x3, 1652 Experience, 1376 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Yaoguai King Boss Battle - Red Loong', and the detailed content is as follows:\nThe Red Loong is a fearsome red dragon imbued with the power of electricity, which is both his greatest strength and weakness once you know how to exploit it. It’s important to note that while you can face this boss once you find the required Key Item early in Chapter 2, you may want to wait until after completing Chapter 2, or even starting Chapter 3, due to the difficulty of this encounter. In particular, it’s a good idea to stock up on medicine to increase your shock resistance, and buy the Thunderbolt Horn Soak from the Shen Monkey as well.\nRed Loong will use its electricity imbued attacks to wreak havoc on you, but can also perform a variety of powerful melee attacks. Be wary of his ability to fly over to you and slash at you as he pivots.\nOther times, he’ll slam down his front claws in quick succession, creating lightning spots that will detonate in the area after a short moment, requiring you to quickly dodge away or risk taking major shock damage. Take too much, and you’ll be taking double damage until you use medication to remove the effect.\nHe also has a wicked and electrified bladed tail that he can use to quickly spin around and slash you with, but can be deflected with a well-timed Rock Solid spell. There’s a few different ways he can use his tail, either for a slow rotating blade slash in front of him, or with a quick jab at your position.\nIf you try to attack from behind, he can even leap up to face you while slashing his tail below him in a retreating strike to stop you from pursuing him.\nHe can also use simple claw swipes, which more often than not will create more lightning spots that detonate after a short delay. Always dodge to the opposite side of his swipe so you can retaliate with attacks and not get shocked.\nRed Loong can also employ a deadly extended combo, first lunging at you with two claw swipes to create lightning spots, and then leaping into the air to feint around to the other side of you while swinging his tail below — all while finally landing behind you to attack as the lightning detonates on the other side.\nWith enough sustained damage, you can eventually stagger and knock down the Red Loong, which is your big moment to maximize your damage output.\nLook for the four electric pots that crackle and sparkle on the back of the dragon. You’ll want to aim a large heavy hit directly on these whenever possible. Targeting them isn’t always easy, as you can only really lock on to the center of his body, which may not specifically point you at the pots on his back.\nFor your best chance, we recommend swapping to the Pillar Stance, and unleashing a big charge attack when facing his back. With 2-3 Focus Points banked, you have a good chance of slamming your staff down right on his back and hitting one or more pots. Should you connect, you’ll deal a huge amount of damage to Red Loong in a single burst, causing an explosion in the process.\nBe wary though, if you are unable to cause this big damage hit, Red Loong will awaken and trigger his own electric explosion as he rises, and you’ll want to retreat well away before this happens.\nUnfortunately, there’s other times when he can detonate a similar explosion even when not getting back from a stun, and it’s hard to tell when this will happen, other than him remaining still and charging the pots on his back for a long moment.\nThe rest of this fight will rely on your ability to stagger him back into this state, and maximize the damage to the pots on his back. Make use of Spirits with big hits like the Wandering Wight, and the Azure Dust Transformation spell to score big hits that knock him back, and you’ll have a better chance of stunning him again.\nIf you find yourself struggling to hit the pots, make sure you attack him when he’s stunned where his back is facing, and not his belly, as you’ll get a better angle that way. You can also quickly take a Tiger Subduing Pellet right when he becomes stunned to maximize your damage output on his weak point.\nWhen the Red Loong finally falls as you explode his pots for good, you’ll earn plenty of rewards, including a Loong Pearl, Mind Core, 3 Silk, 1376 Will, and 1652 Experience. In addition to this, you can find a gold chest nearby that contains a Boshan Censer curio, and a Thunder Tail weapon material — one of two Loong materials needed to craft the Loongwreathe Staff!",
    "promot_tokens_num": 1154
}