{
    "chunk_id": 730724588241,
    "source_file": "Guanyin's_Willow_Leaf.md",
    "content_type": "one and two",
    "h1_title": "Guanyin's Willow Leaf",
    "h2_title": "Black Myth: Wukong Guanyin's Willow Leaf Location",
    "h1_content": "The Guanyin's Willow Leaf is one of the only Mythical Soaks for your Gourds in Black Myth: Wukong. The Soak's ability is particularly strong.\nWith the Guanyin's Willow Leaf Soak equipped, all Gourd uses will be recovered upon resurrection within a battle.\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor.",
    "h2_content": "The Guanyin's Willow Leaf Soak can be found at the Shen Monkey Vendor in Bamboo Grove in Black Wind Mountain in your New Game Plus through. When you revisit him, you can purchase it for 14,400 Will.\nGuanyin's Willow Leaf\nSoaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "promot": "This is an excerpt from the file 'Guanyin's_Willow_Leaf.md', located in the main section titled 'Guanyin's Willow Leaf'. The section summary is: The Guanyin's Willow Leaf is one of the only Mythical Soaks for your Gourds in Black Myth: Wukong. The Soak's ability is particularly strong.\nWith the Guanyin's Willow Leaf Soak equipped, all Gourd uses will be recovered upon resurrection within a battle.\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Guanyin's Willow Leaf Location', and the detailed content is as follows:\nThe Guanyin's Willow Leaf Soak can be found at the Shen Monkey Vendor in Bamboo Grove in Black Wind Mountain in your New Game Plus through. When you revisit him, you can purchase it for 14,400 Will.\nGuanyin's Willow Leaf\nSoaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "promot_tokens_num": 327
}