{
    "chunk_id": 323523768221,
    "source_file": "Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Walkthrough",
    "h2_title": "Chapter 6 - Unfinished",
    "h1_content": "IGN's Walkthrough for Black Myth: Wukong will guide you through the legendary adventure of the Destined One, following in the footsteps of Sun Wukong and his Journey to the West, and features and in-depth walkthrough for every main chapter and region within, where to find treasure and gear, and how to seek out and defeat the many Yaoguai Bosses.\nIn Black Myth: Wukong, you'll need to trek across deadly regions divided up by chapters that you can freely travel between once unlocking Shrines to rest at. Between these shrines you'll have to fight against deadly Yaoguai creatures, and uncover both optional and required Yaoguai Chief \"minibosses\" and Yaoguai King bosses at the end of each region. Every area is also home to many secrets, including treasures, characters and hidden questlines, and even secret bosses.\nThis Walkthrough is divided up by chapter and the major regions within marked by Shrines, and includes guides to help you through each area, where to find important treasures and key items, and how to defeat the many required and optional bosses you'll find along the way.\nDon't miss these guides as you get started:\n* Things Black Myth Wukong Doesn't Tell You\n* Essential Tips and Tricks\n* Best Skills to Unlock\n# Black Myth: Wukong Walkthrough Sections\nSee the links below to get started with help for a particular section:",
    "h2_content": "* Foothills\n* Water Curtain Cave\n* Chapter 3 Secret - Mount Mei\n* Endings Explained",
    "promot": "This is an excerpt from the file 'Walkthrough.md', located in the main section titled 'Walkthrough'. The section summary is: IGN's Walkthrough for Black Myth: Wukong will guide you through the legendary adventure of the Destined One, following in the footsteps of Sun Wukong and his Journey to the West, and features and in-depth walkthrough for every main chapter and region within, where to find treasure and gear, and how to seek out and defeat the many Yaoguai Bosses.\nIn Black Myth: Wukong, you'll need to trek across deadly regions divided up by chapters that you can freely travel between once unlocking Shrines to rest at. Between these shrines you'll have to fight against deadly Yaoguai creatures, and uncover both optional and required Yaoguai Chief \"minibosses\" and Yaoguai King bosses at the end of each region. Every area is also home to many secrets, including treasures, characters and hidden questlines, and even secret bosses.\nThis Walkthrough is divided up by chapter and the major regions within marked by Shrines, and includes guides to help you through each area, where to find important treasures and key items, and how to defeat the many required and optional bosses you'll find along the way.\nDon't miss these guides as you get started:\n* Things Black Myth Wukong Doesn't Tell You\n* Essential Tips and Tricks\n* Best Skills to Unlock\n# Black Myth: Wukong Walkthrough Sections\nSee the links below to get started with help for a particular section: This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Chapter 6 - Unfinished', and the detailed content is as follows:\n* Foothills\n* Water Curtain Cave\n* Chapter 3 Secret - Mount Mei\n* Endings Explained",
    "promot_tokens_num": 376
}