{
    "chunk_id": 358916749115,
    "source_file": "Essential_Tips_and_Tricks.md",
    "content_type": "one and two",
    "h1_title": "Essential Tips and Tricks",
    "h2_title": "General Tips",
    "h1_content": "Black Myth: Wukong is a challenging action game with some RPG elements, and whether you consider yourself a combat expert or not, there's a lot of essential tips and tricks to learn as you follow in the footsteps of Sun Wukong. Below you'll find important tips for both exploration and combat to start you on the right foot.\n* **Jump to:**\n* **General Tips**\n* **Combat Tips**\n* Exploration Tips**",
    "h2_content": "* **Harvest everything you see.** You'll find plants to harvest early in your adventure, but they won't have much use until you reach Chapter 2 and find someone to teach you how to craft your own medicines. Don't wait until then to begin harvesting though—it's still worth grabbing any you find so you can craft as much as you need when the option is available. The more supplies you have in stock, the more advantages you can bring into a fight, including buffs to attack power, damage negation, and resistance!\n* **Experiment with different styles and stances.** Since you can reset your skills at any point when resting at a Shrine, try experimenting with different styles or favoring specific stances if you run into a roadblock. There's skills to improve just about anything, and there's no wrong answer to investing in a particular tree.\n* **Upgrade and customize your gourd.** Your healing gourd can have a lot of customization the deeper you get into your adventure. You'll be able to find different Gourds that can have a certain amount of use or extra effect, Drinks that can heal you all at once or over time, and Soaks that provide additional effects along with the health boost. Try tailoring the Soak or Drink to your current challenge: a higher health boost at the cost of healing over time is better when exploring versus going against a fast-paced boss, and certain soaks may allow you to gain resistance to a certain enemy attack.\n* **Once your Gourd has been upgraded to absorb Spirits, you can also gain an additional benefit: Absorbing Green Wisps**. Not only does this get you Will, but replenishes an additional use for your Gourd. If you defeat a tough enemy or Miniboss that leaves behind its Spirit, you'll replenish your entire Gourd once it's claimed!\n* **Not every enemy respawns when you rest at a Shrine.** Certain unique enemies or encounters, or those who grant a Spirit when killed won't respawn. The same goes for very tough enemies like the Bandit Chief in the Forest of Wolves, and the Wolf Assassins in the Black Wind Cave.\n* **Equipping a Spirit isn't just about using their attack.** Each Spirit also provides a passive buff when you aren't using the Spirit Attack, which you can tailor to augment your style -- like dealing more damage when at low health, or increasing your defense if you find yourself getting hit too much.\n* **Check-in at Shrines regularly to see new stock.** New items become available after clearing areas of taking down bosses. It's especially important to stop in at Shrines are big fights to see what new Armor and Equipment is available.\n* **Upgrade your staff when you can.** The staff is the only weapon you'll need to use, but you'll be able to follow different branches and upgrade it to have certain effects and buffs from your Keeper's Shrine. Always check what you're running with if you're struggling with bosses. Some staffs will give you buffs to stances or spells. But if you're not using those particular ones, you might as well swap to another version of the staff.",
    "promot": "This is an excerpt from the file 'Essential_Tips_and_Tricks.md', located in the main section titled 'Essential Tips and Tricks'. The section summary is: Black Myth: Wukong is a challenging action game with some RPG elements, and whether you consider yourself a combat expert or not, there's a lot of essential tips and tricks to learn as you follow in the footsteps of Sun Wukong. Below you'll find important tips for both exploration and combat to start you on the right foot.\n* **Jump to:**\n* **General Tips**\n* **Combat Tips**\n* Exploration Tips** This excerpt merges content from both the main and sub-sections. The sub-section is titled 'General Tips', and the detailed content is as follows:\n* **Harvest everything you see.** You'll find plants to harvest early in your adventure, but they won't have much use until you reach Chapter 2 and find someone to teach you how to craft your own medicines. Don't wait until then to begin harvesting though—it's still worth grabbing any you find so you can craft as much as you need when the option is available. The more supplies you have in stock, the more advantages you can bring into a fight, including buffs to attack power, damage negation, and resistance!\n* **Experiment with different styles and stances.** Since you can reset your skills at any point when resting at a Shrine, try experimenting with different styles or favoring specific stances if you run into a roadblock. There's skills to improve just about anything, and there's no wrong answer to investing in a particular tree.\n* **Upgrade and customize your gourd.** Your healing gourd can have a lot of customization the deeper you get into your adventure. You'll be able to find different Gourds that can have a certain amount of use or extra effect, Drinks that can heal you all at once or over time, and Soaks that provide additional effects along with the health boost. Try tailoring the Soak or Drink to your current challenge: a higher health boost at the cost of healing over time is better when exploring versus going against a fast-paced boss, and certain soaks may allow you to gain resistance to a certain enemy attack.\n* **Once your Gourd has been upgraded to absorb Spirits, you can also gain an additional benefit: Absorbing Green Wisps**. Not only does this get you Will, but replenishes an additional use for your Gourd. If you defeat a tough enemy or Miniboss that leaves behind its Spirit, you'll replenish your entire Gourd once it's claimed!\n* **Not every enemy respawns when you rest at a Shrine.** Certain unique enemies or encounters, or those who grant a Spirit when killed won't respawn. The same goes for very tough enemies like the Bandit Chief in the Forest of Wolves, and the Wolf Assassins in the Black Wind Cave.\n* **Equipping a Spirit isn't just about using their attack.** Each Spirit also provides a passive buff when you aren't using the Spirit Attack, which you can tailor to augment your style -- like dealing more damage when at low health, or increasing your defense if you find yourself getting hit too much.\n* **Check-in at Shrines regularly to see new stock.** New items become available after clearing areas of taking down bosses. It's especially important to stop in at Shrines are big fights to see what new Armor and Equipment is available.\n* **Upgrade your staff when you can.** The staff is the only weapon you'll need to use, but you'll be able to follow different branches and upgrade it to have certain effects and buffs from your Keeper's Shrine. Always check what you're running with if you're struggling with bosses. Some staffs will give you buffs to stances or spells. But if you're not using those particular ones, you might as well swap to another version of the staff.",
    "promot_tokens_num": 802
}