{
    "chunk_id": 860836117538,
    "source_file": "How_to_Unlock_the_Secret_Loong_Dragon_Bosses.md",
    "content_type": "one and two",
    "h1_title": "How to Unlock the Secret Loong Dragon Bosses",
    "h2_title": "How to Find Red Loong - Chapter 1 Secret Dragon Boss",
    "h1_content": "Chapter 1 of Black Myth: Wukong has more than one secret boss for you to find, and one of these is a Dragon that's tucked away behind a waterfall. Getting to the boss, however, requires finding a key item that you can't get until Chapter 2. This isn't the only Loong boss you can find in the game, so if you want to access the secret area, and know the whereabouts of the Loong Dragon Bosses, here's everything you need to know.\n* How to Get the Loong Scales\n* How to Find the Chapter 1 Secret Dragon Boss\n* How to Find the Chapter 2 Secret Boss\n* How to Find Chapter 3 Dragon Boss\n* How to Find the Chapter 4 Secret Boss",
    "h2_content": "You’ll need to return to Chapter 1 and the Black Wind Mountain once you have the Loong Scales. Use a Keeper’s Shrine to return to Outside the Forest. From here, head straight up toward the two wolves.\nTake the first left, past the big stone rock. And then follow it around to the right. This will bring you to the section of the path, where there’s a small bridge going right and a chest on the left. Head down toward the chest, and a voice should start speaking to you.\nFrom here, you should be able to see the waterfall up ahead. This is where you need to head for. Take the path down, and go toward the stream. Then turn left, and you can climb up the green mossy rocks.\nJump over the tree branch and head toward the waterfall and the enemy waiting outside of it. If you have the Loong Scales, you’ll see an Examine prompt appear, but you’ll need to deal with the nearby enemy first. When the area is clear, press Examine to make the waterfall disappear and a hole in the wall will appear.\nGo toward it and through it to enter the secret Loong Claw Grove area to fight Red Loong.\nRed Loong",
    "promot": "This is an excerpt from the file 'How_to_Unlock_the_Secret_Loong_Dragon_Bosses.md', located in the main section titled 'How to Unlock the Secret Loong Dragon Bosses'. The section summary is: Chapter 1 of Black Myth: Wukong has more than one secret boss for you to find, and one of these is a Dragon that's tucked away behind a waterfall. Getting to the boss, however, requires finding a key item that you can't get until Chapter 2. This isn't the only Loong boss you can find in the game, so if you want to access the secret area, and know the whereabouts of the Loong Dragon Bosses, here's everything you need to know.\n* How to Get the Loong Scales\n* How to Find the Chapter 1 Secret Dragon Boss\n* How to Find the Chapter 2 Secret Boss\n* How to Find Chapter 3 Dragon Boss\n* How to Find the Chapter 4 Secret Boss This excerpt merges content from both the main and sub-sections. The sub-section is titled 'How to Find Red Loong - Chapter 1 Secret Dragon Boss', and the detailed content is as follows:\nYou’ll need to return to Chapter 1 and the Black Wind Mountain once you have the Loong Scales. Use a Keeper’s Shrine to return to Outside the Forest. From here, head straight up toward the two wolves.\nTake the first left, past the big stone rock. And then follow it around to the right. This will bring you to the section of the path, where there’s a small bridge going right and a chest on the left. Head down toward the chest, and a voice should start speaking to you.\nFrom here, you should be able to see the waterfall up ahead. This is where you need to head for. Take the path down, and go toward the stream. Then turn left, and you can climb up the green mossy rocks.\nJump over the tree branch and head toward the waterfall and the enemy waiting outside of it. If you have the Loong Scales, you’ll see an Examine prompt appear, but you’ll need to deal with the nearby enemy first. When the area is clear, press Examine to make the waterfall disappear and a hole in the wall will appear.\nGo toward it and through it to enter the secret Loong Claw Grove area to fight Red Loong.\nRed Loong",
    "promot_tokens_num": 496
}