{
    "chunk_id": 168003592966,
    "source_file": "Temple_of_Yellow_Flowers_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Temple of Yellow Flowers Walkthrough",
    "h2_title": "Forest of Ferocity",
    "h1_content": "The Temple of Yellow Flowers is the final main area of Black Myth: Wukong's Chapter 4, located high above the Webbed Hollow on. Below you'll find a guide for the final area of The Webbed Hollow, including how to track down the Violet Spider and defeat the Hundred-Eyed Daoist Master, as well as getting a rematch with the Venom Daoist to unlock a Secret Area, and finding the last Purple Talisman Altar.\n* **Jump to a Section**\n* **Mountain Trail**\n* **Forest of Ferocity**\n* Yaoguai Chief - Commander Beetle\n* **Temple Entrance**\n* Yaoguai Chief - Fungiwoman\n* Boss Fight - Venom Daoist\n* **Court of Illumination**\n* Boss Fight - Supreme Inspector\n* Yaoguai King - Hundred-Eyed Daoist Master\nAfter defeating the Violet Spider, you'll have to escape her spider swarm as she retreats, but luckily you'll be plucked to safety by the one Spider Sister that seems to be on your side.\nWhen you untangle yourself from the webbing, you'll find yourself high above the Webbed Hollow, on a mountain path leading to a large temple filled with Daoist martial artists.",
    "h2_content": "After resting at the Forest of Ferocity Shrine, you'll see a group of Daoists off to the right practicing, with more voices coming from somewhere further up.\nFirst, you should head left to defeat a Snake Herbalist, and then explore a far cliff where a small ledge holds a **Meditation Spot** where you can get a free Skill Point.\nThe Height, Forest of Ferocity Meditation Spot\nNext, take the right path to defeat the group of Sword Daoists practicing, and beyond them you'll find two more Worm Practitioners by a broken building with a green Wisp. Defeat them both, and you should gain the **Virtuous Bamboo Engraving Curio**.\nLook for a main stone path cutting through the forest, leading past another group of Daoists before the road curves right where a Snake Herbalist patrols.\nFollow the pathway, and you'll find a set of stairs leading up to a large courtyard where a tough Yaoguai Chief is training a large group of Sword Daoists.",
    "promot": "This is an excerpt from the file 'Temple_of_Yellow_Flowers_Walkthrough.md', located in the main section titled 'Temple of Yellow Flowers Walkthrough'. The section summary is: The Temple of Yellow Flowers is the final main area of Black Myth: Wukong's Chapter 4, located high above the Webbed Hollow on. Below you'll find a guide for the final area of The Webbed Hollow, including how to track down the Violet Spider and defeat the Hundred-Eyed Daoist Master, as well as getting a rematch with the Venom Daoist to unlock a Secret Area, and finding the last Purple Talisman Altar.\n* **Jump to a Section**\n* **Mountain Trail**\n* **Forest of Ferocity**\n* Yaoguai Chief - Commander Beetle\n* **Temple Entrance**\n* Yaoguai Chief - Fungiwoman\n* Boss Fight - Venom Daoist\n* **Court of Illumination**\n* Boss Fight - Supreme Inspector\n* Yaoguai King - Hundred-Eyed Daoist Master\nAfter defeating the Violet Spider, you'll have to escape her spider swarm as she retreats, but luckily you'll be plucked to safety by the one Spider Sister that seems to be on your side.\nWhen you untangle yourself from the webbing, you'll find yourself high above the Webbed Hollow, on a mountain path leading to a large temple filled with Daoist martial artists. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Forest of Ferocity', and the detailed content is as follows:\nAfter resting at the Forest of Ferocity Shrine, you'll see a group of Daoists off to the right practicing, with more voices coming from somewhere further up.\nFirst, you should head left to defeat a Snake Herbalist, and then explore a far cliff where a small ledge holds a **Meditation Spot** where you can get a free Skill Point.\nThe Height, Forest of Ferocity Meditation Spot\nNext, take the right path to defeat the group of Sword Daoists practicing, and beyond them you'll find two more Worm Practitioners by a broken building with a green Wisp. Defeat them both, and you should gain the **Virtuous Bamboo Engraving Curio**.\nLook for a main stone path cutting through the forest, leading past another group of Daoists before the road curves right where a Snake Herbalist patrols.\nFollow the pathway, and you'll find a set of stairs leading up to a large courtyard where a tough Yaoguai Chief is training a large group of Sword Daoists.",
    "promot_tokens_num": 532
}