{
    "chunk_id": 587975532892,
    "source_file": "How_to_Unlock_the_Chapter_1_Secret_Area.md",
    "content_type": "one and two",
    "h1_title": "How to Unlock the Chapter 1 Secret Area",
    "h2_title": "Bell 2",
    "h1_content": "Black Myth: Wukong is full of secrets, including hidden areas that can only be unlocked through solving a puzzle or finding a key item. One such secret area is in Chapter 1 and requires ringing three bells to access it. On this page, you'll find information on how to find each of the three bells and what awaits you in the hidden temple.",
    "h2_content": "The second bell can be found in Bamboo Grove. Start from the Snake Trail Keepers Shrine and take the stairs up and go across the bridge.\nFollow this path down and past the river until you loop underneath the bridge you just crossed. Stick to the path until you reach the open area with the bamboo, and look for the path straight up ahead.\nFollow the fires again as they curve off slightly to the right, to reach the arena where you'll need to fight Yaoguai Chief Guangmou.\nOnce you've beaten Guangmou, take the stairs at the back of the arena up the bell and ring it.",
    "promot": "This is an excerpt from the file 'How_to_Unlock_the_Chapter_1_Secret_Area.md', located in the main section titled 'How to Unlock the Chapter 1 Secret Area'. The section summary is: Black Myth: Wukong is full of secrets, including hidden areas that can only be unlocked through solving a puzzle or finding a key item. One such secret area is in Chapter 1 and requires ringing three bells to access it. On this page, you'll find information on how to find each of the three bells and what awaits you in the hidden temple. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Bell 2', and the detailed content is as follows:\nThe second bell can be found in Bamboo Grove. Start from the Snake Trail Keepers Shrine and take the stairs up and go across the bridge.\nFollow this path down and past the river until you loop underneath the bridge you just crossed. Stick to the path until you reach the open area with the bamboo, and look for the path straight up ahead.\nFollow the fires again as they curve off slightly to the right, to reach the arena where you'll need to fight Yaoguai Chief Guangmou.\nOnce you've beaten Guangmou, take the stairs at the back of the arena up the bell and ring it.",
    "promot_tokens_num": 274
}