{
    "chunk_id": 349797615529,
    "source_file": "Zhu_Bajie_(Boss_Fight).md",
    "content_type": "one and two",
    "h1_title": "Zhu Bajie (Boss Fight)",
    "h2_title": "Zhu Bajie Boss Fight and Guide - Second Encounter",
    "h1_content": "Zhu Bajie is an allied character who will accompany you through much of your journey in Black Myth Wukong, however there will come a time when you are forced to defeat him in combat in order to progress the story. Upon reaching Chapter 4 in the Webbed Hollow, he will become bewitched, and will need your help to free himself of the lure of the Crimson Spider.\n* Rewards: Blood Stained Needle, Jade Moon Rabbit Curio, Fine Gold Thread, 3410 Experience x2, 2578-2612 Will x2",
    "h2_content": "For this encounter, the pig clearly has the home field advantage, and he'll remind you every step of the way with a wide variety of painful moves that are extremely hard to dodge.\nThis is because fighting in the mud will drastically slow any dodge roll you try to make to get out of the way of his attacks. You can alleviate this somewhat with the help of one of the Sages Relic's passive buffs, or a particular gourd soak, but they won't put you back on even footing.\nThis means you'll have to be even more precise in your dodging, and using spells like Immobilize, Rock Solid, or Cloud Step to avoid attacks you can't roll away from in time.\nThe most important thing to note is that the mud hinders your ability to dodge, but it does **not** slow your ability to sprint. This means there are several situations and attacks where it can be preferable to run instead of waiting for a last second evade, so try to remember that option during this fight.\nIf there's any good news, its that for the first half of the fight, he'll continue to use most of the same moves as he did in the Hut of Immortality. Though you will have to be more precise in your dodging, you'll at least have an idea of what to expect.\nA few moves will be altered slightly, as instead of tearing up the ground with his rake, he can send muddy projectiles your way instead, which seem to have a more more narrow arc to compensate for your diminished evasion.\nHe can also still spin into a tornado (which you should try to sprint away from rather than dodge), and getting hit by it can send you flying. However, he won't get dizzy this time around, so prepare for him to quickly move into his next move rather than standing around for awhile.\nOne new move (and herald of things to come) will often appear after one of his jumping slash attacks. Once he hits the ground, he'll use his own transformation attack to turn into a giant muddy carp, which will quickly roll forward to try and flatten you, but you can dodge under it with some timing.\nFight carefully, and take note of which of his rake attacks swing fast, vs the ones that take time to swing around to dodge at the right times, or have a focus point in reserve to use a Thrust Stance varied combo and get out of his attack range.\nOnce you take off half his health bar, things will get real messy fast. Zhu Bajie will go back to his roots, in a sense, and transform into a giant boar that just can't wait to roll around in the mud with you.\nIn this form, he'll start by performing a series of charge attacks after stamping the ground to cause muddy geysers to erupt all around.\nWhen he begins to charge, you can still sprint out of the way, but you'll need to act fast.\nSpot dodging can also work here, and if you try to perform a Rock Solid Deflect, you'll be knocked backward, but he'll often stumble to the ground as well, letting you get up and get some hits in before he regains his footing.\nBoar Bajie has a lot of wide swinging attacks to be wary of, often shifting his body weight to slam his head to the side or swing it upwards.\nHe can also dive at you in a diving tackle that can be very damaging if it lands, and you'll need to dodge as he lands, but be ready for him to rise up and turn to hit you with his hind legs in a mule kick attack.\nAfter taking a bit of damage, Boar Bajie will eventually let out a huge roar, starting a very long and terrifying phase. He'll begin to transform into different beasts, which have their own attacks you'll need to adapt to.\nHe'll start by transforming into a giant carp fish, which will wiggle a bit before leaping high into the air. Immediately get onto your Pillar Stance before he slams down on the ground, as it will release a shockwave across the mud that's hard to dodge given the conditions of the arena. You'll only have a moment to land your Pillar Stance smash, but after that you should only be focused on evasion (you won't be able to Immobilize his transformations).\nIn his carp form, he'll swim about for a moment to try ramming you, and will then back off before swimming forward to dive at you, going under the mud as he does. It'll be hard to anticipate when he surfaces, so be ready to evade at a moment's notice.\nOnce he's out of the mud and on the surface, he'll transform again, this time into a large rhino, and begin to charge at you. If this wasn't bad enough, he'll summon two copies to charge just behind him on either side, making dodging extremely risky.\nThe only good news is that the copies don't seem to alter their path once they start the charge, but Zhu Bajie will, so you'll need to be careful about timing your dodges and not rolling into a path of a copy. Rock Solid will only move you backward, and won't be too much help if it traps you in front of him.\nOnce he charges for a third time, he'll lose the clones, and then transform back into a fish for a moment. Wait for him to dive through the air past you, and he'll then rocket toward you as a giant glob of mud.\nDodge or deflect if you can't move fast enough, and be ready for his boar form to reappear dazed and winded from the phase. This is your big opportunity to hit him with all the focus points you've stored up, as well as any powerful Spirit Attacks you can unleash.\nOne last thing to remember is that while you may have problems dodging, the same isn't always true for your Transformation Spells. In a pinch, they can be used to give you a level of evasion your can't achieve on your own, so long as you don't act too reckless and waste your might.\nThis will be a tough fight to survive, and may take more than a few tries to understand how to survive his biggest attacks. At the very least, this phase only lasts for one half of his health bar.\nOnce you manage to burn down the rest of his health, you'll finally be able to free Zhu Bajie from the bewitching effect of the needle that was stabbed into his head, thanks to the mirror you found on the Right Hand of Buddha.\nZhu Bajie\nUnfortunately, the spiders aren't done with him, and he'll be whisked away, leaving you with his **Blood-Stained Needle** and the **Jade Moon Rabbit Curio**.",
    "promot": "This is an excerpt from the file 'Zhu_Bajie_(Boss_Fight).md', located in the main section titled 'Zhu Bajie (Boss Fight)'. The section summary is: Zhu Bajie is an allied character who will accompany you through much of your journey in Black Myth Wukong, however there will come a time when you are forced to defeat him in combat in order to progress the story. Upon reaching Chapter 4 in the Webbed Hollow, he will become bewitched, and will need your help to free himself of the lure of the Crimson Spider.\n* Rewards: Blood Stained Needle, Jade Moon Rabbit Curio, Fine Gold Thread, 3410 Experience x2, 2578-2612 Will x2 This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Zhu Bajie Boss Fight and Guide - Second Encounter', and the detailed content is as follows:\nFor this encounter, the pig clearly has the home field advantage, and he'll remind you every step of the way with a wide variety of painful moves that are extremely hard to dodge.\nThis is because fighting in the mud will drastically slow any dodge roll you try to make to get out of the way of his attacks. You can alleviate this somewhat with the help of one of the Sages Relic's passive buffs, or a particular gourd soak, but they won't put you back on even footing.\nThis means you'll have to be even more precise in your dodging, and using spells like Immobilize, Rock Solid, or Cloud Step to avoid attacks you can't roll away from in time.\nThe most important thing to note is that the mud hinders your ability to dodge, but it does **not** slow your ability to sprint. This means there are several situations and attacks where it can be preferable to run instead of waiting for a last second evade, so try to remember that option during this fight.\nIf there's any good news, its that for the first half of the fight, he'll continue to use most of the same moves as he did in the Hut of Immortality. Though you will have to be more precise in your dodging, you'll at least have an idea of what to expect.\nA few moves will be altered slightly, as instead of tearing up the ground with his rake, he can send muddy projectiles your way instead, which seem to have a more more narrow arc to compensate for your diminished evasion.\nHe can also still spin into a tornado (which you should try to sprint away from rather than dodge), and getting hit by it can send you flying. However, he won't get dizzy this time around, so prepare for him to quickly move into his next move rather than standing around for awhile.\nOne new move (and herald of things to come) will often appear after one of his jumping slash attacks. Once he hits the ground, he'll use his own transformation attack to turn into a giant muddy carp, which will quickly roll forward to try and flatten you, but you can dodge under it with some timing.\nFight carefully, and take note of which of his rake attacks swing fast, vs the ones that take time to swing around to dodge at the right times, or have a focus point in reserve to use a Thrust Stance varied combo and get out of his attack range.\nOnce you take off half his health bar, things will get real messy fast. Zhu Bajie will go back to his roots, in a sense, and transform into a giant boar that just can't wait to roll around in the mud with you.\nIn this form, he'll start by performing a series of charge attacks after stamping the ground to cause muddy geysers to erupt all around.\nWhen he begins to charge, you can still sprint out of the way, but you'll need to act fast.\nSpot dodging can also work here, and if you try to perform a Rock Solid Deflect, you'll be knocked backward, but he'll often stumble to the ground as well, letting you get up and get some hits in before he regains his footing.\nBoar Bajie has a lot of wide swinging attacks to be wary of, often shifting his body weight to slam his head to the side or swing it upwards.\nHe can also dive at you in a diving tackle that can be very damaging if it lands, and you'll need to dodge as he lands, but be ready for him to rise up and turn to hit you with his hind legs in a mule kick attack.\nAfter taking a bit of damage, Boar Bajie will eventually let out a huge roar, starting a very long and terrifying phase. He'll begin to transform into different beasts, which have their own attacks you'll need to adapt to.\nHe'll start by transforming into a giant carp fish, which will wiggle a bit before leaping high into the air. Immediately get onto your Pillar Stance before he slams down on the ground, as it will release a shockwave across the mud that's hard to dodge given the conditions of the arena. You'll only have a moment to land your Pillar Stance smash, but after that you should only be focused on evasion (you won't be able to Immobilize his transformations).\nIn his carp form, he'll swim about for a moment to try ramming you, and will then back off before swimming forward to dive at you, going under the mud as he does. It'll be hard to anticipate when he surfaces, so be ready to evade at a moment's notice.\nOnce he's out of the mud and on the surface, he'll transform again, this time into a large rhino, and begin to charge at you. If this wasn't bad enough, he'll summon two copies to charge just behind him on either side, making dodging extremely risky.\nThe only good news is that the copies don't seem to alter their path once they start the charge, but Zhu Bajie will, so you'll need to be careful about timing your dodges and not rolling into a path of a copy. Rock Solid will only move you backward, and won't be too much help if it traps you in front of him.\nOnce he charges for a third time, he'll lose the clones, and then transform back into a fish for a moment. Wait for him to dive through the air past you, and he'll then rocket toward you as a giant glob of mud.\nDodge or deflect if you can't move fast enough, and be ready for his boar form to reappear dazed and winded from the phase. This is your big opportunity to hit him with all the focus points you've stored up, as well as any powerful Spirit Attacks you can unleash.\nOne last thing to remember is that while you may have problems dodging, the same isn't always true for your Transformation Spells. In a pinch, they can be used to give you a level of evasion your can't achieve on your own, so long as you don't act too reckless and waste your might.\nThis will be a tough fight to survive, and may take more than a few tries to understand how to survive his biggest attacks. At the very least, this phase only lasts for one half of his health bar.\nOnce you manage to burn down the rest of his health, you'll finally be able to free Zhu Bajie from the bewitching effect of the needle that was stabbed into his head, thanks to the mirror you found on the Right Hand of Buddha.\nZhu Bajie\nUnfortunately, the spiders aren't done with him, and he'll be whisked away, leaving you with his **Blood-Stained Needle** and the **Jade Moon Rabbit Curio**.",
    "promot_tokens_num": 1589
}