{
    "chunk_id": 407682550582,
    "source_file": "Agate_Jar.md",
    "content_type": "one and two",
    "h1_title": "Agate Jar",
    "h2_title": "Black Myth: Wukong Agate Jar Location",
    "h1_content": "The Agate Jar is one of the Curios items you can find throughout Black Myth: Wukong. It is one of the strongest early-game Curios' thanks to its effect.\nWith the Agate Jar equipped, you will get a flat-out, moderate defense buff, which is incredibly useful early on in the game.\nThe Curios items in Black Myth: Wukong can't be upgraded, so you can't enhance their buffs in any way. Therefore, if you find a better item for your build, you will want to switch the items out as soon as you can.",
    "h2_content": "The Agate Jar can be found in a box in the arena after fighting the Black Wind King in Black Wind Cave \\- Cave Interior in Black Wind Mountain. Simply defeat the Black Wind King and head over to this box in the arena to get the Agate Jar.\nAgate Jar\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "promot": "This is an excerpt from the file 'Agate_Jar.md', located in the main section titled 'Agate Jar'. The section summary is: The Agate Jar is one of the Curios items you can find throughout Black Myth: Wukong. It is one of the strongest early-game Curios' thanks to its effect.\nWith the Agate Jar equipped, you will get a flat-out, moderate defense buff, which is incredibly useful early on in the game.\nThe Curios items in Black Myth: Wukong can't be upgraded, so you can't enhance their buffs in any way. Therefore, if you find a better item for your build, you will want to switch the items out as soon as you can. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Agate Jar Location', and the detailed content is as follows:\nThe Agate Jar can be found in a box in the arena after fighting the Black Wind King in Black Wind Cave \\- Cave Interior in Black Wind Mountain. Simply defeat the Black Wind King and head over to this box in the arena to get the Agate Jar.\nAgate Jar\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "promot_tokens_num": 296
}