{
    "chunk_id": 531155127084,
    "source_file": "Temple_of_Yellow_Flowers_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Temple of Yellow Flowers Walkthrough",
    "h2_title": "Mountain Trail",
    "h1_content": "The Temple of Yellow Flowers is the final main area of Black Myth: Wukong's Chapter 4, located high above the Webbed Hollow on. Below you'll find a guide for the final area of The Webbed Hollow, including how to track down the Violet Spider and defeat the Hundred-Eyed Daoist Master, as well as getting a rematch with the Venom Daoist to unlock a Secret Area, and finding the last Purple Talisman Altar.\n* **Jump to a Section**\n* **Mountain Trail**\n* **Forest of Ferocity**\n* Yaoguai Chief - Commander Beetle\n* **Temple Entrance**\n* Yaoguai Chief - Fungiwoman\n* Boss Fight - Venom Daoist\n* **Court of Illumination**\n* Boss Fight - Supreme Inspector\n* Yaoguai King - Hundred-Eyed Daoist Master\nAfter defeating the Violet Spider, you'll have to escape her spider swarm as she retreats, but luckily you'll be plucked to safety by the one Spider Sister that seems to be on your side.\nWhen you untangle yourself from the webbing, you'll find yourself high above the Webbed Hollow, on a mountain path leading to a large temple filled with Daoist martial artists.",
    "h2_content": "Waiting for you just above the ridge where you start is a tree that holds a **Luojia Fragrant Vine** , and the Mountain Trail Shrine lies not far after.\nTemple of the Yellow Flowers Luojia Fragrant Vine\nWhile resting at the Shrine, note that you can now craft the Spider Celestial Staff, which boasts an odd additional effect against enemies if you're currently poisoned. In fact, you can actually make this into an effective build by intentionally poisoning yourself with the Deathclaw Soak, and further boosting your skills by equipping the Elder Amourworm Spirit to increase critical hit chance when poisoned, but it is a bit of a risky tradeoff.\nAfter resting at the Shrine, you may start to notice giant pools of blood left by something on the run, meaning the Violet Spider must have come this way.\nAt the top of a short stairway, you'll encounter new enemies guarding a green Wisp - a Sword Daoist. They attack with flowing sword combos and even a wave of force from certain swings, but on the plus side they aren't very durable, and a sustained light attack combo is enough to put them down.\nFurther up the mountain path, you'll encounter a second type of fighter - the Fly-Whisk Daoist. More support than main attacker, they'll harass you with a variety of wind and force projectiles, and while you'll need to dodge the waves, you can deflect the smaller wind projectiles with your staff.\nHeading up the steps to a large balcony, defeat another Fly-Whisk Daoist to find a small turtle-shaped **Treasure Chest** that holds a **Bee Mountain Stone Soak** for your Gourd.\nNear the balcony, you'll find a large plaza where two Spear Daoists guard a building with a green Wisp, while a Snake Herbalist patrols the main path to the left. You'll find he strikes similarly to the Snake Patrollers in Black Wind Mountain, only he can use the poison pot on his back to toss out even more splashes of poison.\nFollow the blood trail that leads to the left and through a dark shaded corridor, and then up to another large open area.\nWhile the blood trail quickly peels off to the right up another narrow pathway, there's a **Treasure Chest** up ahead that's guarded by a creepy half snake, half tiger known as a Snake Sheriff. The weird yaoguai can let loose a loud roar to increase its power, and then it will often raise its claws before leaping at you repeatedly unless deflected.\nAfter defeating the beast, head to the right up the narrow tree-lined trail to find a green Wisp and a few more Daoists guarding the pathway.\nOnce you cross a bridge over the trail below, you'll head through a small tunnel and come out onto another large area lined with murals, one of which has a green Wisp to absorb, and another alcove that holds a **Treasure Chest** guarded by a second Snake Sheriff.\nYou'll also see a hideous creature in monk robes stagger forth by the chest -- a Worm Practitioner. They'll attack haphazardly with a long tendril-like arm to deal poison damage, so you'll want to engage them cautiously.\nAfter grabbing the Treasure Chest they were guarding, head right past a third green Wisp, and through a small ravine guarded by several Daoists to reach a large forested area.",
    "promot": "This is an excerpt from the file 'Temple_of_Yellow_Flowers_Walkthrough.md', located in the main section titled 'Temple of Yellow Flowers Walkthrough'. The section summary is: The Temple of Yellow Flowers is the final main area of Black Myth: Wukong's Chapter 4, located high above the Webbed Hollow on. Below you'll find a guide for the final area of The Webbed Hollow, including how to track down the Violet Spider and defeat the Hundred-Eyed Daoist Master, as well as getting a rematch with the Venom Daoist to unlock a Secret Area, and finding the last Purple Talisman Altar.\n* **Jump to a Section**\n* **Mountain Trail**\n* **Forest of Ferocity**\n* Yaoguai Chief - Commander Beetle\n* **Temple Entrance**\n* Yaoguai Chief - Fungiwoman\n* Boss Fight - Venom Daoist\n* **Court of Illumination**\n* Boss Fight - Supreme Inspector\n* Yaoguai King - Hundred-Eyed Daoist Master\nAfter defeating the Violet Spider, you'll have to escape her spider swarm as she retreats, but luckily you'll be plucked to safety by the one Spider Sister that seems to be on your side.\nWhen you untangle yourself from the webbing, you'll find yourself high above the Webbed Hollow, on a mountain path leading to a large temple filled with Daoist martial artists. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Mountain Trail', and the detailed content is as follows:\nWaiting for you just above the ridge where you start is a tree that holds a **Luojia Fragrant Vine** , and the Mountain Trail Shrine lies not far after.\nTemple of the Yellow Flowers Luojia Fragrant Vine\nWhile resting at the Shrine, note that you can now craft the Spider Celestial Staff, which boasts an odd additional effect against enemies if you're currently poisoned. In fact, you can actually make this into an effective build by intentionally poisoning yourself with the Deathclaw Soak, and further boosting your skills by equipping the Elder Amourworm Spirit to increase critical hit chance when poisoned, but it is a bit of a risky tradeoff.\nAfter resting at the Shrine, you may start to notice giant pools of blood left by something on the run, meaning the Violet Spider must have come this way.\nAt the top of a short stairway, you'll encounter new enemies guarding a green Wisp - a Sword Daoist. They attack with flowing sword combos and even a wave of force from certain swings, but on the plus side they aren't very durable, and a sustained light attack combo is enough to put them down.\nFurther up the mountain path, you'll encounter a second type of fighter - the Fly-Whisk Daoist. More support than main attacker, they'll harass you with a variety of wind and force projectiles, and while you'll need to dodge the waves, you can deflect the smaller wind projectiles with your staff.\nHeading up the steps to a large balcony, defeat another Fly-Whisk Daoist to find a small turtle-shaped **Treasure Chest** that holds a **Bee Mountain Stone Soak** for your Gourd.\nNear the balcony, you'll find a large plaza where two Spear Daoists guard a building with a green Wisp, while a Snake Herbalist patrols the main path to the left. You'll find he strikes similarly to the Snake Patrollers in Black Wind Mountain, only he can use the poison pot on his back to toss out even more splashes of poison.\nFollow the blood trail that leads to the left and through a dark shaded corridor, and then up to another large open area.\nWhile the blood trail quickly peels off to the right up another narrow pathway, there's a **Treasure Chest** up ahead that's guarded by a creepy half snake, half tiger known as a Snake Sheriff. The weird yaoguai can let loose a loud roar to increase its power, and then it will often raise its claws before leaping at you repeatedly unless deflected.\nAfter defeating the beast, head to the right up the narrow tree-lined trail to find a green Wisp and a few more Daoists guarding the pathway.\nOnce you cross a bridge over the trail below, you'll head through a small tunnel and come out onto another large area lined with murals, one of which has a green Wisp to absorb, and another alcove that holds a **Treasure Chest** guarded by a second Snake Sheriff.\nYou'll also see a hideous creature in monk robes stagger forth by the chest -- a Worm Practitioner. They'll attack haphazardly with a long tendril-like arm to deal poison damage, so you'll want to engage them cautiously.\nAfter grabbing the Treasure Chest they were guarding, head right past a third green Wisp, and through a small ravine guarded by several Daoists to reach a large forested area.",
    "promot_tokens_num": 1015
}