{
    "chunk_id": 461797032836,
    "source_file": "Secret_Bosses_in_Black_Myth_Wukong.md",
    "content_type": "one and two",
    "h1_title": "Secret Bosses in Black Myth Wukong",
    "h2_title": "Baw-Lang-Lang",
    "h1_content": "Black Myth: Wukong has a wealth of secrets to discover, from Transformation Spells to hidden Key Items and, of course, bosses. While some secret bosses can be found through exploration, others are well-hidden and require completing NPC questlines, collecting multiple items, or even fighting mini-bosses to make them emerge. Here's a breakdown of all the secret bosses in the game, organised by chapter.\nSecret Bosses in Chapter 1| Secret Bosses in Chapter 2| Secret Bosses in Chapter 3\n---|---|---\nSecret Bosses in Chapter 4| Secret Bosses in Chapter 5| Secret Bosses in Chapter 6\n# Secret Bosses in Chapter 1\nChapter 1 has two secret bosses for you to take on. The first can be found in the chapter's secret area Secret: Ancient Guanyin Temple; the second, you'll find behind a waterfall, but only after collecting the Loong Scales from Chapter 2.",
    "h2_content": "Baw-Lang-Lang can be found at the start of the Bishui Cave but not technically in it. Once you've completed the five cart questline and smashed through the frozen door of the Bishui Cave, you'll want to head inside and down to the left to find another of the frog bosses.\nBaw-Lang-Lang",
    "promot": "This is an excerpt from the file 'Secret_Bosses_in_Black_Myth_Wukong.md', located in the main section titled 'Secret Bosses in Black Myth Wukong'. The section summary is: Black Myth: Wukong has a wealth of secrets to discover, from Transformation Spells to hidden Key Items and, of course, bosses. While some secret bosses can be found through exploration, others are well-hidden and require completing NPC questlines, collecting multiple items, or even fighting mini-bosses to make them emerge. Here's a breakdown of all the secret bosses in the game, organised by chapter.\nSecret Bosses in Chapter 1| Secret Bosses in Chapter 2| Secret Bosses in Chapter 3\n---|---|---\nSecret Bosses in Chapter 4| Secret Bosses in Chapter 5| Secret Bosses in Chapter 6\n# Secret Bosses in Chapter 1\nChapter 1 has two secret bosses for you to take on. The first can be found in the chapter's secret area Secret: Ancient Guanyin Temple; the second, you'll find behind a waterfall, but only after collecting the Loong Scales from Chapter 2. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Baw-Lang-Lang', and the detailed content is as follows:\nBaw-Lang-Lang can be found at the start of the Bishui Cave but not technically in it. Once you've completed the five cart questline and smashed through the frozen door of the Bishui Cave, you'll want to head inside and down to the left to find another of the frog bosses.\nBaw-Lang-Lang",
    "promot_tokens_num": 349
}