{
    "chunk_id": 116658496881,
    "source_file": "Top_Takes_Bottom,_Bottom_Takes_Top.md",
    "content_type": "one and two",
    "h1_title": "Top Takes Bottom, Bottom Takes Top",
    "h2_title": "Top Takes Bottom, Bottom Takes Top Boss Fight and Guide",
    "h1_content": "Top Takes Bottom, Bottom Takes Top are the final duo of fighters you'll go up against in Chapter 5 in Black Myth: Wukong. The familiar duo of Yaoguai Chiefs can be found in the Chapter's secret area.",
    "h2_content": "It turns out that the spiked gold ball is hiding a secret inside, which is two minibosses for you to take on. They will both use a portion of the ball as a shield and have a sword to complement it.\nLike the other pairs of bosses in the chapters, you'll have them attack you in succession. You'll start with Bottom Takes Top, who will cycle through two moves. He'll leap at you -- just dodge back from this -- and then roll into the ball. You can attack him while he regains his composure when he's inside it.\nTo follow this, he'll put his sword away, then jump at you and slam the ball down. He'll then drag it around him. Both of these attacks can be avoided by keeping your distance. Attack when he's getting himself back together, and chip away at his health steadily.\nWhen you've knocked his health bar down, he'll retreat and Top Takes Bottom will take over. She'll jump to get into her half of the ball and spin toward you. This will be quick, but you can dodge out of the way of this. She will also imitate Bottom Takes Top and leap up with her sword, eventually rolling into her half of the ball.\nWhile they do share a lot of the same moves, you'll also find that Top Takes Bottom will throw her sword out like a boomerang, which you'll need to quickly evade. She will also perform an additional leaping attack, where her blade will glow and pools of lava will explode from underneath her. Jump back as soon as you see the blade land and start to glow.\nWhen her health bar is also knocked down slightly, they will start to swap in and out. It can start to get a bit hectic, so use Cloudstep to throw them off, heavy attacks to stagger and knock down their shields, and Immobilize to keep them from zipping about.\nAfter successfully wounding them both enough, you'll see them merge together and form the golden spiked ball. They'll use this to jump up in the air, pull back, and spin to launch themselves toward you. They will keep rolling around the room, and it's just a case of dodging this. However, when they're about to finish, they become significantly more aggressive and will leap up in the air again, slamming the ball down and causing explosions on impact. You'll need to dodge or jump to avoid this. Then the cycle will repeat again until you're able to put an end to them.\nTop Takes Bottom, Bottom Takes Top\n### Don't Miss This Spirit!\nOnce the golden spiked ball has flown off the edge of the Ashen Pass, return to The Emerald Hall. Go past the altar and up the path toward the Ashen Pass. Once you've climbed the first set of stairs, you'll see the golden ball wedged into a rock next to the Flame Rhino Master.  Go all the way up to it and you'll be able to take the Top Takes Bottom, Bottom Takes Top Spirit from inside.\nTop Takes Bottom, Bottom Takes Top Spirit",
    "promot": "This is an excerpt from the file 'Top_Takes_Bottom,_Bottom_Takes_Top.md', located in the main section titled 'Top Takes Bottom, Bottom Takes Top'. The section summary is: Top Takes Bottom, Bottom Takes Top are the final duo of fighters you'll go up against in Chapter 5 in Black Myth: Wukong. The familiar duo of Yaoguai Chiefs can be found in the Chapter's secret area. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Top Takes Bottom, Bottom Takes Top Boss Fight and Guide', and the detailed content is as follows:\nIt turns out that the spiked gold ball is hiding a secret inside, which is two minibosses for you to take on. They will both use a portion of the ball as a shield and have a sword to complement it.\nLike the other pairs of bosses in the chapters, you'll have them attack you in succession. You'll start with Bottom Takes Top, who will cycle through two moves. He'll leap at you -- just dodge back from this -- and then roll into the ball. You can attack him while he regains his composure when he's inside it.\nTo follow this, he'll put his sword away, then jump at you and slam the ball down. He'll then drag it around him. Both of these attacks can be avoided by keeping your distance. Attack when he's getting himself back together, and chip away at his health steadily.\nWhen you've knocked his health bar down, he'll retreat and Top Takes Bottom will take over. She'll jump to get into her half of the ball and spin toward you. This will be quick, but you can dodge out of the way of this. She will also imitate Bottom Takes Top and leap up with her sword, eventually rolling into her half of the ball.\nWhile they do share a lot of the same moves, you'll also find that Top Takes Bottom will throw her sword out like a boomerang, which you'll need to quickly evade. She will also perform an additional leaping attack, where her blade will glow and pools of lava will explode from underneath her. Jump back as soon as you see the blade land and start to glow.\nWhen her health bar is also knocked down slightly, they will start to swap in and out. It can start to get a bit hectic, so use Cloudstep to throw them off, heavy attacks to stagger and knock down their shields, and Immobilize to keep them from zipping about.\nAfter successfully wounding them both enough, you'll see them merge together and form the golden spiked ball. They'll use this to jump up in the air, pull back, and spin to launch themselves toward you. They will keep rolling around the room, and it's just a case of dodging this. However, when they're about to finish, they become significantly more aggressive and will leap up in the air again, slamming the ball down and causing explosions on impact. You'll need to dodge or jump to avoid this. Then the cycle will repeat again until you're able to put an end to them.\nTop Takes Bottom, Bottom Takes Top\n### Don't Miss This Spirit!\nOnce the golden spiked ball has flown off the edge of the Ashen Pass, return to The Emerald Hall. Go past the altar and up the path toward the Ashen Pass. Once you've climbed the first set of stairs, you'll see the golden ball wedged into a rock next to the Flame Rhino Master.  Go all the way up to it and you'll be able to take the Top Takes Bottom, Bottom Takes Top Spirit from inside.\nTop Takes Bottom, Bottom Takes Top Spirit",
    "promot_tokens_num": 751
}