{
    "chunk_id": 422461324500,
    "source_file": "Wandering_Wight.md",
    "content_type": "one and two",
    "h1_title": "Wandering Wight",
    "h2_title": "Where to Find the Wandering Wight",
    "h1_content": "The Wandering Wight is an optional and very challenging Yaoguai Chief boss fight that you can encounter early in Chapter 1 of Black Myth Wukong. The Wight is much tougher than any other bosses you can fight this early in the game, and while it is still possible to defeat them early, it is highly recommended that you level up further before taking them on.\n* Rewards: Wandering Wight Spirit, Cat’s Eye Beads, Stone Spirit, 691 Will, 1,049 Experience",
    "h2_content": "The Wandering Wight is hard to miss as despite it being an optional challenge encounter, he is located along the main path and essentially guards a tunnel entrance leading to Guanyin Temple and the main boss of the Forest of Wolves.\nYou can find him in the Forest of Wolves area by proceeding straight from the Outside the Forest Shrine, and past an axe-wielding Wolf Guai across a small bridge to a large clearing where the hulking giant patrols back and forth. Due to his staggering size, he’s hard to miss!",
    "promot": "This is an excerpt from the file 'Wandering_Wight.md', located in the main section titled 'Wandering Wight'. The section summary is: The Wandering Wight is an optional and very challenging Yaoguai Chief boss fight that you can encounter early in Chapter 1 of Black Myth Wukong. The Wight is much tougher than any other bosses you can fight this early in the game, and while it is still possible to defeat them early, it is highly recommended that you level up further before taking them on.\n* Rewards: Wandering Wight Spirit, Cat’s Eye Beads, Stone Spirit, 691 Will, 1,049 Experience This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find the Wandering Wight', and the detailed content is as follows:\nThe Wandering Wight is hard to miss as despite it being an optional challenge encounter, he is located along the main path and essentially guards a tunnel entrance leading to Guanyin Temple and the main boss of the Forest of Wolves.\nYou can find him in the Forest of Wolves area by proceeding straight from the Outside the Forest Shrine, and past an axe-wielding Wolf Guai across a small bridge to a large clearing where the hulking giant patrols back and forth. Due to his staggering size, he’s hard to miss!",
    "promot_tokens_num": 278
}