{
    "chunk_id": 356106210783,
    "source_file": "Valley_of_Ecstasy_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Valley of Ecstasy Walkthrough",
    "h2_title": "Towers of Karma",
    "h1_content": "The Valley of Ecstasy is the fourth main region of Chapter 3 in The New West in Black Myth: Wukong. Below you'll find a guide for the Valley of Ecstasy Region, including how to reach the valley itself by defeating Non-White, and exploring the different parts of the valley to uncover several Yaoguai Chiefs on the path to the New Thunderclap Temple, and completing the Treasure Hunter's Quest and the Pagoda Realm Prisoner's Quest by defeating the final Captain.\n* **Jump to a Section:**\n* **Mindfulness Cliff**\n* Yaoguai Chief - Non-White\n* Yaoguai Chief - Non-White (Round Two)\n* **Forest of Felicity**\n* Yaoguai Chief - Lang-Li-Guhh-Lang\n* **Brook of Bliss**\n* Yaoguai Chief - Non-Able\n* **Towers of Karma**\n* Yauoguai Chief - Old Ginseng Guai\n* **Longevity Road**\n* Yaoguai Chief - Captain Kalpa-Wave\nAfter you solved the monk's riddle by praying at four Buddha Statues in the Precept Corridor, you'll split up from Zhu Bajie and make your way into the belly button of a large Buddha statue along the cliffs, taking you up a narrow pathway and into the Mindfulness Cliff.",
    "h2_content": "The large forested field beyond the Forest of Felicity's canyon is fairly wide open, and as you exit the canyon you'll find a few small trails leading to the right, left and straight ahead.\nTake the left path first, and past a Monk Supporter enemy you'll be able to find the top of a stream, similar to the Brook of Bliss, that hugs that wraps around the far side of this region.\nThis area has its own Crow Diviner, and while not as durable as the one who dropped the Spirit, he can still employ their new Cloud Step-like abilities to turn almost invisible and attack with chilling force.\nAfter defeating this foe, you can grab a green Wisp on a rock, and then head downstream gathering Jade Lotus Plants as you go. Be ready to be ambushed by a few Croaky enemies after hopping down the falls or taking the nearby stairs, and continue on until the stream ends.\nTo the right of the water, you'll spot the assorted stone monuments that are the titular Towers of Karma, giving the place a cemetery-like quality. A path winds through these small stone pillars, and is guarded by an assortment of Frozen Corpses, Monk Supporters, and a new enemy.\nThis Circus Monkey will use its gong to rally the troops and alert any Frozen Corpses nearby to rise and ambush you. Luckily, he's not too strong on his own and can be taken out quickly before focusing on the others.\n### The Treasure Hunter's Quest - Continued\nJust down the road from the group of enemies, you can spot the strange treasure hunting man sitting on the large roots of a gnarled tree (provided you met him along the Bitter Coast and saved him from the lesser Apramana Bats). Grab the green Wisp nearby, and try to speak to him, only to learn he's apparently freezing to death.\nLuckily, you have a spell to deal with this very predicament: Ring of Fire. If you don't have it currently equipped, just continue on the path going straight to find the Towers of Karma Shrine guarded by another Circus Monkey and his cohorts, and change your spells there after defeating them.\nWhen you cast the Ring of Fire Spell, the man will gratefully hop into the center, the Treasure Hunter will relay a story about a Melon Garden supposedly hidden nearby, and a chubby boy jumping from a cliff. Putting two and two together, you may realize he's talking about the cliff at the edge of the Brook of Bliss, where we found a cave below it. You can now head to this location, but you'll have to fight a very dangerous foe. It's well worth doing, as you'll gain a very important spell for doing so!\nBack at the Towers of Karma Shrine, look ahead to find a large series of statues carved into a wall with a new enemy standing in front of them. This fearsome foe is a Dual-Blade Monk, and has a lot of health and damaging moves (but thankfully won't respawn).\nBe ready for him to toss his blades at you as they boomerang back to him, and then dart up close to attack low with sweeping cuts from his blades. Though he can perform long combos that end in powerful uppercuts, he's not immune to being greatly staggered from a well time Rock Solid, so wait for a good moment to upset his attacks and punish him.\nJust past this Dual-Blade Monk, you can follow the rest of the trail to arrive at a small muddy field with a lone stone monument. The field is full of Aged Ginseng to harvest (and a few Ginsenglings), but one of them in the middle of the field is much more than it seems: A Yaoguai Chief.\n### Yaoguai Chief Miniboss Battle - Old Ginseng Guai\nThis hulking brute isn't as deadly as the Non-Able boss fight, but he does has a few tricks up his sleeve. As you might expect, he can deal a lot of damage with poisonous roots much like the lesser Ginsengling, so having antimiasma medicine on hand is a good strategy.\nMany of the Old Ginseng Guai's attacks are slow and hard-hitting, and the guai himself moves at a fairly slow pace, making him the perfect target for hit and run attacks as needed.\nHe can perform a variety of lurching stomp attacks, many of which will create a small area of poisonous roots. Like the ice frog, you'll want to take back control of the battlefield by reorienting yourself, and use the Thrust Stance to hit him with charged strikes while staying out of the poison.\nIf he winds up his hand to slam it down into the ground, he'll sneakily send roots your way, which he can use to lock you down and make you unable to flee from his next attack or if you're already stuck in some poison -- but using the Pillar Stance can help you evade his binds.\nEven with his slow speed, he's capable of using his stumbling lurches to lunge at you, so be ready for him to attack with an elbow drop with surprising reach, or a flailing kick that sends him staggering toward you.\nMany times, he'll end his flailing by spinning around and then falling backward right on top of you. He'll have his own version of Rock Solid when he does this and flash yellow, so it's better to just evade him entirely.\nBy far his biggest and most threatening move comes when he plants his hand in the ground to grow an increase area of poison roots all around him. The range on this is fairly big, and he'll continue to grow it for some time, giving you a few options: stay well away and heal up, or climb onto your staff (with a full stamina bar) and wait it out.\nAfter he's done creating the root system, he'll finally tear the whole thing up in a massive burst (at which point you can slam down from your Pillar Stance), however in doing so he'll summon a small group of mini Ginsenglings to attack you.\nThey behave much in the same way as regular Ginsenglings do, moving slightly faster than the boss, which can help you lure them away from his attacks. Prioritize taking them out first so you don't get blindsided later, and try the Ashen Slumber transformation spell to detonate yourself near them, or use Spirit Attacks with wide reaches.\nStick to staying in safe spots to keep using Thrust Stance out of the range of his roots, or Pillar Stance above him, and look for his many openings when he tumbles to the ground to press the attack, and he'll fall before long, granting you both the **Old Ginseng Guai Spirit** , Millenium Ginseng Seeds to give to Chen Loong, and the **Ginseng Cape** to wear.\nOld Ginseng Guai\nWith the Yaoguai Chief defeated, be sure to check around behind the large stone monument near where you fought the miniboss. On a small snow-covered table, you can find the **Jade Essence** \\- a new Gourd Drink that allows you to recover mana as well as health!\nFrom the boss area, you can find another path leading back up past a small wooden arch to the upper field of this region. There's a few wandering enemies to put down around here, including a Crow Diviner standing in a field looking over a Ginsengling hiding in the ground, and a green Wisp to absorb nearby.\nYou can also find a higher path leading back to the main road through the valley, and fend off the various Frozen Corpses along the ridgeline path.\nNearing a large gate in the distance, look for a clearing on the left near a large tree and small stone monument where you can find a **Treasure Chest** with materials in it. Just beware of a Lesser Apramana Bat lurking in the bushes nearby that will try to pounce on you.\nEventually you'll come to a much larger gate manned by two Wolf Guardians who will jump down to stop you from entering. Their attacks can come fast and overwhelming on both sides, so try to isolate one with Immobilize and focus fire the other down to take them on one at a time.\nBeyond this large gate lies the final sub-region leading to the New Thunderclap Temple.",
    "promot": "This is an excerpt from the file 'Valley_of_Ecstasy_Walkthrough.md', located in the main section titled 'Valley of Ecstasy Walkthrough'. The section summary is: The Valley of Ecstasy is the fourth main region of Chapter 3 in The New West in Black Myth: Wukong. Below you'll find a guide for the Valley of Ecstasy Region, including how to reach the valley itself by defeating Non-White, and exploring the different parts of the valley to uncover several Yaoguai Chiefs on the path to the New Thunderclap Temple, and completing the Treasure Hunter's Quest and the Pagoda Realm Prisoner's Quest by defeating the final Captain.\n* **Jump to a Section:**\n* **Mindfulness Cliff**\n* Yaoguai Chief - Non-White\n* Yaoguai Chief - Non-White (Round Two)\n* **Forest of Felicity**\n* Yaoguai Chief - Lang-Li-Guhh-Lang\n* **Brook of Bliss**\n* Yaoguai Chief - Non-Able\n* **Towers of Karma**\n* Yauoguai Chief - Old Ginseng Guai\n* **Longevity Road**\n* Yaoguai Chief - Captain Kalpa-Wave\nAfter you solved the monk's riddle by praying at four Buddha Statues in the Precept Corridor, you'll split up from Zhu Bajie and make your way into the belly button of a large Buddha statue along the cliffs, taking you up a narrow pathway and into the Mindfulness Cliff. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Towers of Karma', and the detailed content is as follows:\nThe large forested field beyond the Forest of Felicity's canyon is fairly wide open, and as you exit the canyon you'll find a few small trails leading to the right, left and straight ahead.\nTake the left path first, and past a Monk Supporter enemy you'll be able to find the top of a stream, similar to the Brook of Bliss, that hugs that wraps around the far side of this region.\nThis area has its own Crow Diviner, and while not as durable as the one who dropped the Spirit, he can still employ their new Cloud Step-like abilities to turn almost invisible and attack with chilling force.\nAfter defeating this foe, you can grab a green Wisp on a rock, and then head downstream gathering Jade Lotus Plants as you go. Be ready to be ambushed by a few Croaky enemies after hopping down the falls or taking the nearby stairs, and continue on until the stream ends.\nTo the right of the water, you'll spot the assorted stone monuments that are the titular Towers of Karma, giving the place a cemetery-like quality. A path winds through these small stone pillars, and is guarded by an assortment of Frozen Corpses, Monk Supporters, and a new enemy.\nThis Circus Monkey will use its gong to rally the troops and alert any Frozen Corpses nearby to rise and ambush you. Luckily, he's not too strong on his own and can be taken out quickly before focusing on the others.\n### The Treasure Hunter's Quest - Continued\nJust down the road from the group of enemies, you can spot the strange treasure hunting man sitting on the large roots of a gnarled tree (provided you met him along the Bitter Coast and saved him from the lesser Apramana Bats). Grab the green Wisp nearby, and try to speak to him, only to learn he's apparently freezing to death.\nLuckily, you have a spell to deal with this very predicament: Ring of Fire. If you don't have it currently equipped, just continue on the path going straight to find the Towers of Karma Shrine guarded by another Circus Monkey and his cohorts, and change your spells there after defeating them.\nWhen you cast the Ring of Fire Spell, the man will gratefully hop into the center, the Treasure Hunter will relay a story about a Melon Garden supposedly hidden nearby, and a chubby boy jumping from a cliff. Putting two and two together, you may realize he's talking about the cliff at the edge of the Brook of Bliss, where we found a cave below it. You can now head to this location, but you'll have to fight a very dangerous foe. It's well worth doing, as you'll gain a very important spell for doing so!\nBack at the Towers of Karma Shrine, look ahead to find a large series of statues carved into a wall with a new enemy standing in front of them. This fearsome foe is a Dual-Blade Monk, and has a lot of health and damaging moves (but thankfully won't respawn).\nBe ready for him to toss his blades at you as they boomerang back to him, and then dart up close to attack low with sweeping cuts from his blades. Though he can perform long combos that end in powerful uppercuts, he's not immune to being greatly staggered from a well time Rock Solid, so wait for a good moment to upset his attacks and punish him.\nJust past this Dual-Blade Monk, you can follow the rest of the trail to arrive at a small muddy field with a lone stone monument. The field is full of Aged Ginseng to harvest (and a few Ginsenglings), but one of them in the middle of the field is much more than it seems: A Yaoguai Chief.\n### Yaoguai Chief Miniboss Battle - Old Ginseng Guai\nThis hulking brute isn't as deadly as the Non-Able boss fight, but he does has a few tricks up his sleeve. As you might expect, he can deal a lot of damage with poisonous roots much like the lesser Ginsengling, so having antimiasma medicine on hand is a good strategy.\nMany of the Old Ginseng Guai's attacks are slow and hard-hitting, and the guai himself moves at a fairly slow pace, making him the perfect target for hit and run attacks as needed.\nHe can perform a variety of lurching stomp attacks, many of which will create a small area of poisonous roots. Like the ice frog, you'll want to take back control of the battlefield by reorienting yourself, and use the Thrust Stance to hit him with charged strikes while staying out of the poison.\nIf he winds up his hand to slam it down into the ground, he'll sneakily send roots your way, which he can use to lock you down and make you unable to flee from his next attack or if you're already stuck in some poison -- but using the Pillar Stance can help you evade his binds.\nEven with his slow speed, he's capable of using his stumbling lurches to lunge at you, so be ready for him to attack with an elbow drop with surprising reach, or a flailing kick that sends him staggering toward you.\nMany times, he'll end his flailing by spinning around and then falling backward right on top of you. He'll have his own version of Rock Solid when he does this and flash yellow, so it's better to just evade him entirely.\nBy far his biggest and most threatening move comes when he plants his hand in the ground to grow an increase area of poison roots all around him. The range on this is fairly big, and he'll continue to grow it for some time, giving you a few options: stay well away and heal up, or climb onto your staff (with a full stamina bar) and wait it out.\nAfter he's done creating the root system, he'll finally tear the whole thing up in a massive burst (at which point you can slam down from your Pillar Stance), however in doing so he'll summon a small group of mini Ginsenglings to attack you.\nThey behave much in the same way as regular Ginsenglings do, moving slightly faster than the boss, which can help you lure them away from his attacks. Prioritize taking them out first so you don't get blindsided later, and try the Ashen Slumber transformation spell to detonate yourself near them, or use Spirit Attacks with wide reaches.\nStick to staying in safe spots to keep using Thrust Stance out of the range of his roots, or Pillar Stance above him, and look for his many openings when he tumbles to the ground to press the attack, and he'll fall before long, granting you both the **Old Ginseng Guai Spirit** , Millenium Ginseng Seeds to give to Chen Loong, and the **Ginseng Cape** to wear.\nOld Ginseng Guai\nWith the Yaoguai Chief defeated, be sure to check around behind the large stone monument near where you fought the miniboss. On a small snow-covered table, you can find the **Jade Essence** \\- a new Gourd Drink that allows you to recover mana as well as health!\nFrom the boss area, you can find another path leading back up past a small wooden arch to the upper field of this region. There's a few wandering enemies to put down around here, including a Crow Diviner standing in a field looking over a Ginsengling hiding in the ground, and a green Wisp to absorb nearby.\nYou can also find a higher path leading back to the main road through the valley, and fend off the various Frozen Corpses along the ridgeline path.\nNearing a large gate in the distance, look for a clearing on the left near a large tree and small stone monument where you can find a **Treasure Chest** with materials in it. Just beware of a Lesser Apramana Bat lurking in the bushes nearby that will try to pounce on you.\nEventually you'll come to a much larger gate manned by two Wolf Guardians who will jump down to stop you from entering. Their attacks can come fast and overwhelming on both sides, so try to isolate one with Immobilize and focus fire the other down to take them on one at a time.\nBeyond this large gate lies the final sub-region leading to the New Thunderclap Temple.",
    "promot_tokens_num": 2052
}