{
    "chunk_id": 699046126297,
    "source_file": "Hundred-Eyed_Daoist_Master.md",
    "content_type": "one and two",
    "h1_title": "Hundred-Eyed Daoist Master",
    "h2_title": "Where to Find the Hundred-Eyed Daoist Master",
    "h1_content": "The Hundred-Eyed Daoist Master is a required Yaoguai King boss fight that you can encounter in Chapter 4 of Black Myth Wukong. The leader of the Temple of Yellow Flowers and master of the Spider Guai, he is the final boss of the larger Webbed Hollow region.\n* Rewards: Golden Glowing Eye, Sky-Piercing Horn, Celestial Ribbon, Fine Gold Thread, Gold Tree Core, Kun Steel, Mind Core, 5329 Experience, 3693 Will",
    "h2_content": "The Hundred-Eyed Daoist Master is a main Yaoguai King, and the final boss you'll encounter in Chapter 4. You'll find him by following the blood trail of the Crimson Spider through the Temple of Yellow Flowers.\nOnce you reach the Court of Illumination, you'll find a pathway to the right that leads to a large field where the final boss is located.",
    "promot": "This is an excerpt from the file 'Hundred-Eyed_Daoist_Master.md', located in the main section titled 'Hundred-Eyed Daoist Master'. The section summary is: The Hundred-Eyed Daoist Master is a required Yaoguai King boss fight that you can encounter in Chapter 4 of Black Myth Wukong. The leader of the Temple of Yellow Flowers and master of the Spider Guai, he is the final boss of the larger Webbed Hollow region.\n* Rewards: Golden Glowing Eye, Sky-Piercing Horn, Celestial Ribbon, Fine Gold Thread, Gold Tree Core, Kun Steel, Mind Core, 5329 Experience, 3693 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find the Hundred-Eyed Daoist Master', and the detailed content is as follows:\nThe Hundred-Eyed Daoist Master is a main Yaoguai King, and the final boss you'll encounter in Chapter 4. You'll find him by following the blood trail of the Crimson Spider through the Temple of Yellow Flowers.\nOnce you reach the Court of Illumination, you'll find a pathway to the right that leads to a large field where the final boss is located.",
    "promot_tokens_num": 259
}