{
    "chunk_id": 197893626246,
    "source_file": "Skandha_of_Consciousness.md",
    "content_type": "one and two",
    "h1_title": "Skandha of Consciousness",
    "h2_title": "Where to use the Skandha of Consciousness in Black Myth: Wukong",
    "h1_content": "The Skandha of Consciousness is the final of the Skandha Key Items you will find in the game. It will allow you to unlock the final big reward at the end of the quest. But, the journey to get it is quite long.\n_\"Adaptability alone uncovers significance in subtlety. Once hidden inside the Buddha’s head, this treasure has a secret yet to be revealed.\"_\nThe Skandha of Consciousness can be found in Mount Huago in Chapter 6. Upon accessing the Cloud ability in this chapter, you can head towards a massive enemy in the distance - the Son of Stones. Fly past this boss, to find a small path leading to the Giant Shigandang. To activate the Giant Shigandang, you will need the other four Skandha items scattered throughout the game: Skandha of Form, Skandha of Thought, Skandha of Choice, and Skandha of Feeling.\nUpon its defeat, you will get this final Skandha item.\nSkandha of Consciousness",
    "h2_content": "With the Skandha of Consciousness in your hands, and the Skandha of Form, Skandha of Thought, Skandha of Choice, and Skandha of Feeling, you can now use them at Xu Dog to obtain the Five Skandhas Pill. Visit Xu Dog in Yellow Wind Ridge and show him the Skandhas.\nIn return, he will give you the celestial medicine, boosting your health, mana, and stamina significantly.",
    "promot": "This is an excerpt from the file 'Skandha_of_Consciousness.md', located in the main section titled 'Skandha of Consciousness'. The section summary is: The Skandha of Consciousness is the final of the Skandha Key Items you will find in the game. It will allow you to unlock the final big reward at the end of the quest. But, the journey to get it is quite long.\n_\"Adaptability alone uncovers significance in subtlety. Once hidden inside the Buddha’s head, this treasure has a secret yet to be revealed.\"_\nThe Skandha of Consciousness can be found in Mount Huago in Chapter 6. Upon accessing the Cloud ability in this chapter, you can head towards a massive enemy in the distance - the Son of Stones. Fly past this boss, to find a small path leading to the Giant Shigandang. To activate the Giant Shigandang, you will need the other four Skandha items scattered throughout the game: Skandha of Form, Skandha of Thought, Skandha of Choice, and Skandha of Feeling.\nUpon its defeat, you will get this final Skandha item.\nSkandha of Consciousness This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to use the Skandha of Consciousness in Black Myth: Wukong', and the detailed content is as follows:\nWith the Skandha of Consciousness in your hands, and the Skandha of Form, Skandha of Thought, Skandha of Choice, and Skandha of Feeling, you can now use them at Xu Dog to obtain the Five Skandhas Pill. Visit Xu Dog in Yellow Wind Ridge and show him the Skandhas.\nIn return, he will give you the celestial medicine, boosting your health, mana, and stamina significantly.",
    "promot_tokens_num": 391
}