{
    "chunk_id": 721116260747,
    "source_file": "Secret_Bosses_in_Black_Myth_Wukong.md",
    "content_type": "one and two",
    "h1_title": "Secret Bosses in Black Myth Wukong",
    "h2_title": "Bishui Golden-Eyed Beast",
    "h1_content": "Black Myth: Wukong has a wealth of secrets to discover, from Transformation Spells to hidden Key Items and, of course, bosses. While some secret bosses can be found through exploration, others are well-hidden and require completing NPC questlines, collecting multiple items, or even fighting mini-bosses to make them emerge. Here's a breakdown of all the secret bosses in the game, organised by chapter.\nSecret Bosses in Chapter 1| Secret Bosses in Chapter 2| Secret Bosses in Chapter 3\n---|---|---\nSecret Bosses in Chapter 4| Secret Bosses in Chapter 5| Secret Bosses in Chapter 6\n# Secret Bosses in Chapter 1\nChapter 1 has two secret bosses for you to take on. The first can be found in the chapter's secret area Secret: Ancient Guanyin Temple; the second, you'll find behind a waterfall, but only after collecting the Loong Scales from Chapter 2.",
    "h2_content": "The last of the bosses in Bishui Cave is the Bishui Golden-Eyed Beast beyond the corridor of Fire and Ice.\nBishui Golden-Eyed Beast\n# Secret Bosses in Chapter 6\n### Ending Spoilers!\nAs you enter Chapter 6, you'll be reaching the conclusion of the game. While the last Chapter does have a secret boss, you should proceed with caution as the last secret boss relates to the ending of the game.\nSPOILERS AHEAD!",
    "promot": "This is an excerpt from the file 'Secret_Bosses_in_Black_Myth_Wukong.md', located in the main section titled 'Secret Bosses in Black Myth Wukong'. The section summary is: Black Myth: Wukong has a wealth of secrets to discover, from Transformation Spells to hidden Key Items and, of course, bosses. While some secret bosses can be found through exploration, others are well-hidden and require completing NPC questlines, collecting multiple items, or even fighting mini-bosses to make them emerge. Here's a breakdown of all the secret bosses in the game, organised by chapter.\nSecret Bosses in Chapter 1| Secret Bosses in Chapter 2| Secret Bosses in Chapter 3\n---|---|---\nSecret Bosses in Chapter 4| Secret Bosses in Chapter 5| Secret Bosses in Chapter 6\n# Secret Bosses in Chapter 1\nChapter 1 has two secret bosses for you to take on. The first can be found in the chapter's secret area Secret: Ancient Guanyin Temple; the second, you'll find behind a waterfall, but only after collecting the Loong Scales from Chapter 2. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Bishui Golden-Eyed Beast', and the detailed content is as follows:\nThe last of the bosses in Bishui Cave is the Bishui Golden-Eyed Beast beyond the corridor of Fire and Ice.\nBishui Golden-Eyed Beast\n# Secret Bosses in Chapter 6\n### Ending Spoilers!\nAs you enter Chapter 6, you'll be reaching the conclusion of the game. While the last Chapter does have a secret boss, you should proceed with caution as the last secret boss relates to the ending of the game.\nSPOILERS AHEAD!",
    "promot_tokens_num": 383
}