{
    "chunk_id": 214570850697,
    "source_file": "Rice_Cocoons.md",
    "content_type": "one and two",
    "h1_title": "Rice Cocoons",
    "h2_title": "Where to use Rice Cocoons in Black Myth: Wukong",
    "h1_content": "Rice Cocoons are one of the most common Key Items in Black Myth: Wukong, found often within The Webbed Hollow due to the amount of spider cocoons that are everywhere. They are needed for Chen Loong's quest within The New West.\n_\"Man designs, but the universe decides.\"_\nRice Cocoons can be found randomly from spider cocoons throughout The Webbed Hollow. Simply run around, destroy them, and you should get one or two to drop. If none do, simply rest at a Shrine, respawn the enemies, and try again.\nRice Cocoons",
    "h2_content": "Rice Cocoons can be used with the rice baskets in the Zodiac Realm next to Chen Loong in The New West. These unlock after you have defeated him and given him the Special-made Bone-Strengthening Pellet. Upon visiting the Zodiac Realm, you can then hand him the Proto-Amourworm, which is located in The Webbed Hollow.\nEach of the Rice Cocoons can be used with the seeds you collect throughout your journey to grow new plants of the same name.",
    "promot": "This is an excerpt from the file 'Rice_Cocoons.md', located in the main section titled 'Rice Cocoons'. The section summary is: Rice Cocoons are one of the most common Key Items in Black Myth: Wukong, found often within The Webbed Hollow due to the amount of spider cocoons that are everywhere. They are needed for Chen Loong's quest within The New West.\n_\"Man designs, but the universe decides.\"_\nRice Cocoons can be found randomly from spider cocoons throughout The Webbed Hollow. Simply run around, destroy them, and you should get one or two to drop. If none do, simply rest at a Shrine, respawn the enemies, and try again.\nRice Cocoons This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to use Rice Cocoons in Black Myth: Wukong', and the detailed content is as follows:\nRice Cocoons can be used with the rice baskets in the Zodiac Realm next to Chen Loong in The New West. These unlock after you have defeated him and given him the Special-made Bone-Strengthening Pellet. Upon visiting the Zodiac Realm, you can then hand him the Proto-Amourworm, which is located in The Webbed Hollow.\nEach of the Rice Cocoons can be used with the seeds you collect throughout your journey to grow new plants of the same name.",
    "promot_tokens_num": 290
}