{
    "chunk_id": 446299781091,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Furnace Valley Walkthrough",
    "h2_title": "How to Complete the Old Man's Questline",
    "h1_content": "Furnace Valley is the second major region in Chapter 5 of Black: Myth Wukong. Below, you'll find a detailed walkthrough of all the possible bosses there are to defeat in this section, along with conclusions to side quests, and key items to collect.\n* **Jump to a Section:**\n* **Valley Entrance**\n* Yaoguai Chief - Flint Chief\n* Yaoguai Chief - Cloudy Mist, Misty Cloud\n* **Rakshasa Palace**\n* **The Emerald Hall**\n* Yaoguai King - Keeper of the Flaming Mountains and Yin-Yang Fish\n* Yaoguai Chief - Crimson-Silver Cart\nAfter jumping down from the cliff at the end of Woods of Ember, you'll land in the waters at the start of Furnace Valley. Immediately turn to the right, to pick up the first green Wisp in the region.\nGo straight up toward the valley, but be careful as you explore the area. Some of the rocks in this area glow with lava, and that's because they're actually Searing-Fire enemies. These resemble the Palestones from Chapter 2 and are particularly annoying. They will leap in the air and drop on their back and front to cause explosions. For the sake of unlocking portraits, you can defeat just one and ignore the others.\nContinue straight up, following the gold trail to the Valley Entrance Keeper's Shrine. It's protected by an Earth Rakshasa, so either use heavy attacks to break down its shield, or get behind it to tackle it. When you've dealt with it, activate the Keeper's Shrine.\n### Return to the Pale-Axe Stalwart\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.",
    "h2_content": "Upgrade your Old Gourd to the Medicine Buddha Gourd. When you've done this, speak to him and then examine the flame in the center of the room. Your Gourd will absorb the spirit and become the Supreme Gourd. If the trophy for this side quest doesn't pop, for you, make sure you visit each of the Chapters before and revisit his locations to hear all of his dialogue.\nExit the temple and stick to the lava path on the left. Take out the two giants (the Sea Rakshasa) by aiming for their ankles and knocking them down. Behind the first one, you'll find green Wisps to collect. Meanwhile, for defeating the second one, you'll be rewarded with the Golden Button curio.\nReturn to the stairs where you first left to see the old man. Cross the covered bridge in the center, then take out the bull guard and master by the stairs on the left. Head up here, and activate the next Keeper's Shrine.",
    "promot": "This is an excerpt from the file 'Furnace_Valley_Walkthrough.md', located in the main section titled 'Furnace Valley Walkthrough'. The section summary is: Furnace Valley is the second major region in Chapter 5 of Black: Myth Wukong. Below, you'll find a detailed walkthrough of all the possible bosses there are to defeat in this section, along with conclusions to side quests, and key items to collect.\n* **Jump to a Section:**\n* **Valley Entrance**\n* Yaoguai Chief - Flint Chief\n* Yaoguai Chief - Cloudy Mist, Misty Cloud\n* **Rakshasa Palace**\n* **The Emerald Hall**\n* Yaoguai King - Keeper of the Flaming Mountains and Yin-Yang Fish\n* Yaoguai Chief - Crimson-Silver Cart\nAfter jumping down from the cliff at the end of Woods of Ember, you'll land in the waters at the start of Furnace Valley. Immediately turn to the right, to pick up the first green Wisp in the region.\nGo straight up toward the valley, but be careful as you explore the area. Some of the rocks in this area glow with lava, and that's because they're actually Searing-Fire enemies. These resemble the Palestones from Chapter 2 and are particularly annoying. They will leap in the air and drop on their back and front to cause explosions. For the sake of unlocking portraits, you can defeat just one and ignore the others.\nContinue straight up, following the gold trail to the Valley Entrance Keeper's Shrine. It's protected by an Earth Rakshasa, so either use heavy attacks to break down its shield, or get behind it to tackle it. When you've dealt with it, activate the Keeper's Shrine.\n### Return to the Pale-Axe Stalwart\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'How to Complete the Old Man's Questline', and the detailed content is as follows:\nUpgrade your Old Gourd to the Medicine Buddha Gourd. When you've done this, speak to him and then examine the flame in the center of the room. Your Gourd will absorb the spirit and become the Supreme Gourd. If the trophy for this side quest doesn't pop, for you, make sure you visit each of the Chapters before and revisit his locations to hear all of his dialogue.\nExit the temple and stick to the lava path on the left. Take out the two giants (the Sea Rakshasa) by aiming for their ankles and knocking them down. Behind the first one, you'll find green Wisps to collect. Meanwhile, for defeating the second one, you'll be rewarded with the Golden Button curio.\nReturn to the stairs where you first left to see the old man. Cross the covered bridge in the center, then take out the bull guard and master by the stairs on the left. Head up here, and activate the next Keeper's Shrine.",
    "promot_tokens_num": 676
}