{
    "chunk_id": 650991234353,
    "source_file": "Village_of_Lanxi_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Village of Lanxi Walkthrough",
    "h2_title": "Yaoguai Chief Miniboss Fight - The Second Sister",
    "h1_content": "Black Myth: Wukong's Chapter 4 begins in the darkened outskirts of the Village of Lanxi where the mysterious Webbed Hollow is rumored to be. Below you'll find a guide for the first major area of The Webbed Hollow: the Village of Lanxi, as well as how to navigate the town and defeat the Second Sister.\n* **Jump to a Section**\n* **Estate of the Zhu**\n* Yaoguai Chief - The Second Sister",
    "h2_content": "Taking the form of a giant venomous spider, The Second Sister isn't the toughest boss you'll have faced thus far, but her many legs can sometimes make her movements and attacks hard to read. Luckily, with Zhu Bajie on your side, you'll be able to team up and keep her on the defensive. Make use of the Shrine's store to stock up on Antimiasma Powder.\nMost of The Second Sister's main attack will come from her two front razor-sharp legs, and will be where you will want to focus the bulk (but not all) of your attention. She may often begin the fight by raising up one talon high up to the side, slice down with her two front legs in quick succession, and then rise up into the air to slam down after a delay.\nAnother move she can use at close range is to raise most of her body up on her back legs, and dance down upon you with her front talons to stab the ground multiple times in quick succession. Since it's hard to evade each blow individually, consider using the Thrust Stance to retreat and strike from a distance.\nWhen she follows up her mad dance with a giant leap, roll forward to dodge under her slam, and you'll be able to pivot and unleash an attack of your own.\nShe has a particularly damaging attack where she'll extend both front legs far to the sides, and you'll be able to spot a gleam along them before she thrusts both legs together in a pincer strike. Time it right by using Rock Solid when you spot the legs gleam, and you can knock her back.\nHowever, if you don't see the legs gleam when she spreads them wide, it will be a feint attack, and she'll quickly raise a single talon high that will gleam alone, before slamming it down on your position.\nWhen she starts growling while taking a step back and shaking her body madly, that's your cue to retreat to a safe distance to avoid a spew of poison projectiles in the area in front of her.\nThe Second Sister also has a few unorthodox attacks that can be hard to spot, but easier to punish once you get the hang of them. One of these attacks will start as he twists her body away from you first, and then rapidly spins her body around while launching herself forward, and is better avoided than trying to deflect it.\nAnother move can often happen when trying to flank her or attack on other sides, as she'll simply raise her body up high, and then slam down to the ground to deal massive damage on all sides.\nFinally, she can also perform a small leap and extend her front legs forward like spears as she lands, which may cause you to try and backpedal, only for her to follow up by shooting a quick projectile at you immediately afterward, which is both hard to spot and dodge.\nHer moves can get even more unpredictable when she's low on health, often peppering in quick poison projectiles from her mouth, or somersaulting forward to slash at you. Continue to use the Thrust Stance to keep her talons at bay, and when having trouble, always look for when her front legs subtly shift their shape to become more distinct blades to know when the attack is coming.\nWith Zhu Bajie backing you up (and you can always fall back to let him heal you), The Second Sister won't be able to stand against the two of you for long. After she's been defeated, she'll make a mad dash to flee, but not before flinging something at Zhu Bajie, who shrugs it off, and then runs ahead to chase her down.\nThe Second Sister\nBefore you decide to give chase, let the little pig go and instead be sure to inspect the arena where you fought.\nGo back and check the large building near the door you first came through, and you should be able to spot a glowing pot in the back of the room. Break it, and you'll reveal a new **Awaken Wine Worm** to add to your collection!\nThe Estate of the Zhu Awaken Wine Worm\nYou can find some Fragrant Jade Flower to harvest in the corner of the arena, as well as another large area to the right with two **Treasure Chests** stashed away in opposite corners, and then follow your ally into the next area.\nThere's a large pit in the middle of this courtyard, but before you follow Zhu Bajie down, check the large altar on the other side of the pit, and you'll be able to claim a **Celestial Jade Lotus Pill** to increase your maximum health!\nThe Webbed Hollow Celestial Jade Lotus Pill\nWhen you're ready to move to the next area, jump into the pit, only to find yourself taking a one way trip down to the true **Webbed Hollow** of this realm.\nVillage of Lanxi Complete",
    "promot": "This is an excerpt from the file 'Village_of_Lanxi_Walkthrough.md', located in the main section titled 'Village of Lanxi Walkthrough'. The section summary is: Black Myth: Wukong's Chapter 4 begins in the darkened outskirts of the Village of Lanxi where the mysterious Webbed Hollow is rumored to be. Below you'll find a guide for the first major area of The Webbed Hollow: the Village of Lanxi, as well as how to navigate the town and defeat the Second Sister.\n* **Jump to a Section**\n* **Estate of the Zhu**\n* Yaoguai Chief - The Second Sister This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Yaoguai Chief Miniboss Fight - The Second Sister', and the detailed content is as follows:\nTaking the form of a giant venomous spider, The Second Sister isn't the toughest boss you'll have faced thus far, but her many legs can sometimes make her movements and attacks hard to read. Luckily, with Zhu Bajie on your side, you'll be able to team up and keep her on the defensive. Make use of the Shrine's store to stock up on Antimiasma Powder.\nMost of The Second Sister's main attack will come from her two front razor-sharp legs, and will be where you will want to focus the bulk (but not all) of your attention. She may often begin the fight by raising up one talon high up to the side, slice down with her two front legs in quick succession, and then rise up into the air to slam down after a delay.\nAnother move she can use at close range is to raise most of her body up on her back legs, and dance down upon you with her front talons to stab the ground multiple times in quick succession. Since it's hard to evade each blow individually, consider using the Thrust Stance to retreat and strike from a distance.\nWhen she follows up her mad dance with a giant leap, roll forward to dodge under her slam, and you'll be able to pivot and unleash an attack of your own.\nShe has a particularly damaging attack where she'll extend both front legs far to the sides, and you'll be able to spot a gleam along them before she thrusts both legs together in a pincer strike. Time it right by using Rock Solid when you spot the legs gleam, and you can knock her back.\nHowever, if you don't see the legs gleam when she spreads them wide, it will be a feint attack, and she'll quickly raise a single talon high that will gleam alone, before slamming it down on your position.\nWhen she starts growling while taking a step back and shaking her body madly, that's your cue to retreat to a safe distance to avoid a spew of poison projectiles in the area in front of her.\nThe Second Sister also has a few unorthodox attacks that can be hard to spot, but easier to punish once you get the hang of them. One of these attacks will start as he twists her body away from you first, and then rapidly spins her body around while launching herself forward, and is better avoided than trying to deflect it.\nAnother move can often happen when trying to flank her or attack on other sides, as she'll simply raise her body up high, and then slam down to the ground to deal massive damage on all sides.\nFinally, she can also perform a small leap and extend her front legs forward like spears as she lands, which may cause you to try and backpedal, only for her to follow up by shooting a quick projectile at you immediately afterward, which is both hard to spot and dodge.\nHer moves can get even more unpredictable when she's low on health, often peppering in quick poison projectiles from her mouth, or somersaulting forward to slash at you. Continue to use the Thrust Stance to keep her talons at bay, and when having trouble, always look for when her front legs subtly shift their shape to become more distinct blades to know when the attack is coming.\nWith Zhu Bajie backing you up (and you can always fall back to let him heal you), The Second Sister won't be able to stand against the two of you for long. After she's been defeated, she'll make a mad dash to flee, but not before flinging something at Zhu Bajie, who shrugs it off, and then runs ahead to chase her down.\nThe Second Sister\nBefore you decide to give chase, let the little pig go and instead be sure to inspect the arena where you fought.\nGo back and check the large building near the door you first came through, and you should be able to spot a glowing pot in the back of the room. Break it, and you'll reveal a new **Awaken Wine Worm** to add to your collection!\nThe Estate of the Zhu Awaken Wine Worm\nYou can find some Fragrant Jade Flower to harvest in the corner of the arena, as well as another large area to the right with two **Treasure Chests** stashed away in opposite corners, and then follow your ally into the next area.\nThere's a large pit in the middle of this courtyard, but before you follow Zhu Bajie down, check the large altar on the other side of the pit, and you'll be able to claim a **Celestial Jade Lotus Pill** to increase your maximum health!\nThe Webbed Hollow Celestial Jade Lotus Pill\nWhen you're ready to move to the next area, jump into the pit, only to find yourself taking a one way trip down to the true **Webbed Hollow** of this realm.\nVillage of Lanxi Complete",
    "promot_tokens_num": 1174
}