{
    "chunk_id": 209815933137,
    "source_file": "Valley_of_Ecstasy_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Valley of Ecstasy Walkthrough",
    "h2_title": "Longevity Road",
    "h1_content": "The Valley of Ecstasy is the fourth main region of Chapter 3 in The New West in Black Myth: Wukong. Below you'll find a guide for the Valley of Ecstasy Region, including how to reach the valley itself by defeating Non-White, and exploring the different parts of the valley to uncover several Yaoguai Chiefs on the path to the New Thunderclap Temple, and completing the Treasure Hunter's Quest and the Pagoda Realm Prisoner's Quest by defeating the final Captain.\n* **Jump to a Section:**\n* **Mindfulness Cliff**\n* Yaoguai Chief - Non-White\n* Yaoguai Chief - Non-White (Round Two)\n* **Forest of Felicity**\n* Yaoguai Chief - Lang-Li-Guhh-Lang\n* **Brook of Bliss**\n* Yaoguai Chief - Non-Able\n* **Towers of Karma**\n* Yauoguai Chief - Old Ginseng Guai\n* **Longevity Road**\n* Yaoguai Chief - Captain Kalpa-Wave\nAfter you solved the monk's riddle by praying at four Buddha Statues in the Precept Corridor, you'll split up from Zhu Bajie and make your way into the belly button of a large Buddha statue along the cliffs, taking you up a narrow pathway and into the Mindfulness Cliff.",
    "h2_content": "Heading through the large red gate, you'll find the path curves left toward the Longevity Road Shrine, but a nearby field on the right has an enemy too big to ignore.\nThe Dark-faced Overlord isn't a miniboss, but he does have a lot of health to chip away at. You'll have to repeatedly thwack at his legs while avoiding various stomps or swings with his hellfire arms that can burn you.\nAt range, he can also tear up a huge rock from the ground and throw your way, making him a threat even at a distance (though the rock flies pretty slow).\nDeal enough damage, and the giant will eventually fall to the ground. Use this time to build up several focus points by attacking his head, and Spirit attacks to take more health away.\nAs he struggles to rise, unleash a heavy attack using your Pillar Stance on his head and he'll likely topple back to the ground giving you a bit more time to defeat him.\nBe sure to look around this area after defeating the overlord, and nearby you can spot a tree atop a large rock where a Wolf Guardian lurks over a **Treasure Chest** full of materials you can claim.\nIn the opposite direction, there's another large rock below a tower up above that you can't reach, but you can search the rock for another Lesser Apramana Bat, and nearby you can find a second **Treasure Chest** under a large tree.\nThe most interesting thing around here is just up the small hill past the tower. You'll find a large corpse of some kind at the base of a statue built into the cliffs ahead.\nThis is actually one of the four Captains that the Pagoda Realm Prisoner spoke of, but it looks like someone beat you to putting this captain out of their misery. You can still interact with the body to claim the Spirit of Captain Void-Illusion. And hey, since they still count as a Yaoguai Chief in the journal, that's one less boss to worry about!\nCaptain Void-Illusion\nThere's not too much else in the field around the high tower, but you can find a green Wisp to absorb both behind the tower, and along the nearby cliff wall below a large statue where a Crow Diviner enemy stands.\nHead back to the main road and defeat the various Frozen Corpses while you head toward a large arch where the Shrine is, plus a green Wisp to absorb.\nGuarding the Shrine is another Dual-Blade Monk, who thankfully won't respawn when killed, so feel free to go all out with your spells to overpower him after deflecting an attack to stagger him.\nFrom here, the large main field in front of you hides several more Frozen Corpse ambushes, plus Falcon Fan-Makers who will try and stop you from reaching the New Thunderclap Temple. However, there is one last side area worth checking out.\nLook for a lower path leading left of the Shrine, and you'll find a road leading along the ridge above the Towers of Karma into another wooded area. This place is effectively one big loop, with a lower and upper path to take.\nThe lower path will lead past another Crow Diviner, and up some stairs to an area with several stone monuments where the path diverges.\nA glowing pot can be seen on a small wooden platform, but guarding it is a new formidable opponent. The strangely named Turtle Treasure is a stout skull-faced yaoguai with a large mace it can use to swing in wide arcs or slams, and can also thrust out its belly at you like the Frog Guai bosses, or leap into the air for a butt slam.\nWhat makes them truly dangerous is the more they swing their mace, the more small fires will begin to appear around it. Once the fires have grown, any of their weapon slams will now deal huge explosions that can be a pain to deal with.\nMake use of your spells to keep the foe off-balance and to get away from their explosive attacks, and once they've been defeated, jump and perform a heavy attack to smash the glowing pot on the small wooden platform to gain an Awaken Wine Worm!\nLongevity Road Awaken Wine Worm\nIf you want something to pair with that worm, keep moving along the lower path as it goes up some stairs, and you'll eventually reach the end of this loop, where a small tree stands at the end of a large field with a Luojia Fragrant Vine. However, you'll need to defeat not one but two Falcon Fan-Makers to claim it!\nDefeating the pair is no easy attacks when you consider their hit-and-run tactics, so you may need to even the odds with A Pluck of Many Spell, or use a combination of Cloud Step and Immobilize to isolate and focus fire one of the Falcons, and then take out the second.\nLongevity Road Luojia Fragrant Vine\nOnce you have the vine, take the upper path back toward the Longevity Road Shrine, where you'll encounter a two Crow Diviners - one up on a ledge to lure you, and a friend hiding in the bushes nearby.\nThe most important note is that you can find another Dark-faced Overlord here. Keep focusing on battering his legs to get him to fall and you can attack his skull, and when he dies he'll drop the Gold Spikeplate Curio!\nBe sure to inspect the woods behind where the giant was posted, and you'll find one last Crow Diviner guarding a **Treasure Chest** with some materials inside.\nFinally, with every area explored, it's time to get out of here. Cross the large field past the Longevity Road Shrine and you'll find a passage through the cliffs to the nearby temple.\nAs you approach, a large bloody miasma will block your advance. Once it congeals, you'll find yourself facing the last of the four captains.\n### Yaoguai Chief Miniboss Fight - Captain Kalpa-Wave\nAs the last of the four captains, Kalpa-Wave looks scarier than he actually is, especially once you learn his tricks.\nWith his large towering body, Kapla-Wave has a few physical attacks that generally alternate between stomps of his legs, or a mighty leap that causes him to crash into the ground, but both attacks aren't too bad to deal with.\nWhat really makes Kalpa-Wave unique is his ability to spew blood out. Lots of it. This can take on many forms, and you'll need to know how to deal with each of them.\nOne of the most basic attacks will be when it spews out a group of bloody projectiles from its body. They'll take to the air before arcing slowly over in your direction, but spinning your staff can let you clear them without issue.\nSometimes he'll throw several blood attacks into the mix one after the other to mess you up. Expect these bloody trails to come out in multiple directions (both above and from the sides) to try and confuse you, but remain focused on deflecting them as they arrive.\nOther times he'll mix up his blood projectiles by also creating more blood, which include a stomp attack (or bending down to tilt the wings on its back) that generates a trail of blood heading in your direction. Dodge the blood trails, or they'll burst into a bloody lotus flowers that damage you as they erupt.\nThe real danger isn't the lotus itself, its what it leaves behind. Similar to that Frog Guai's ice attacks coating the area in frost, many of Kalpa-Wave's attacks (including stomps!) will leave behind large pools of blood. Stepping into any of these pools for a second will start to drain your health, so you'll need to steer clear of them at all costs!\nMuch of this fight will come down to being constantly mobile to evade the various pools of blood Kalpa-Wave will create, and find times after deflecting his projectiles to run up and unleash damage on the boss.\nBe especially careful if Captain Kalpa-Wave starts to jump up and down repeatedly. On the third jump, all pools of blood will explode into explosive lotus flowers, meaning you'll need to either be on the move, or use your Pillar Stance to rise above the attacks.\nThe good news is Kalpa-Wave is extremely susceptible to getting knocked down. So long as you build up some focus points with light attacks where possible, you can use your Pillar Stance heavy attack with three focus points built up to send the boss crashing to the ground -- which is the perfect time to Immobilize him on the ground and go wild with Spirit Attacks and Transformations.\nBeyond this, Kalpa-Wave doesn't have too many other variations on his moves, so as long as you avoid those blood pools, you'll be able to cut him down to size, and gain the Spirit of Captain Kalpa-Wave to add to your collection.\nCaptain Kalpa-Wave\nThere's a Shrine at the start of the next area just beyond the entrance gate, and you can use this as the perfect opportunity to return back to the Pagoda Realm.\n### Completing the Pagoda Prisoner's Quest\nHead back to the Lower Pagoda Shrine, and revisit the Pagoda Realm Prisoner (aka, the Third Prince of Flowing Sands). He will be grateful for your work in putting his captains to rest, and will award you the **Chubai Spearhead** , which allows you to craft a spear variant of your trusty staff: the Chu-Bai Spear!\nWith the Valley of Ecstasy officially cleared of threats, you can now begin to explore the final region of **New Thunderclap Temple**.\nValley of Ecstasy Complete",
    "promot": "This is an excerpt from the file 'Valley_of_Ecstasy_Walkthrough.md', located in the main section titled 'Valley of Ecstasy Walkthrough'. The section summary is: The Valley of Ecstasy is the fourth main region of Chapter 3 in The New West in Black Myth: Wukong. Below you'll find a guide for the Valley of Ecstasy Region, including how to reach the valley itself by defeating Non-White, and exploring the different parts of the valley to uncover several Yaoguai Chiefs on the path to the New Thunderclap Temple, and completing the Treasure Hunter's Quest and the Pagoda Realm Prisoner's Quest by defeating the final Captain.\n* **Jump to a Section:**\n* **Mindfulness Cliff**\n* Yaoguai Chief - Non-White\n* Yaoguai Chief - Non-White (Round Two)\n* **Forest of Felicity**\n* Yaoguai Chief - Lang-Li-Guhh-Lang\n* **Brook of Bliss**\n* Yaoguai Chief - Non-Able\n* **Towers of Karma**\n* Yauoguai Chief - Old Ginseng Guai\n* **Longevity Road**\n* Yaoguai Chief - Captain Kalpa-Wave\nAfter you solved the monk's riddle by praying at four Buddha Statues in the Precept Corridor, you'll split up from Zhu Bajie and make your way into the belly button of a large Buddha statue along the cliffs, taking you up a narrow pathway and into the Mindfulness Cliff. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Longevity Road', and the detailed content is as follows:\nHeading through the large red gate, you'll find the path curves left toward the Longevity Road Shrine, but a nearby field on the right has an enemy too big to ignore.\nThe Dark-faced Overlord isn't a miniboss, but he does have a lot of health to chip away at. You'll have to repeatedly thwack at his legs while avoiding various stomps or swings with his hellfire arms that can burn you.\nAt range, he can also tear up a huge rock from the ground and throw your way, making him a threat even at a distance (though the rock flies pretty slow).\nDeal enough damage, and the giant will eventually fall to the ground. Use this time to build up several focus points by attacking his head, and Spirit attacks to take more health away.\nAs he struggles to rise, unleash a heavy attack using your Pillar Stance on his head and he'll likely topple back to the ground giving you a bit more time to defeat him.\nBe sure to look around this area after defeating the overlord, and nearby you can spot a tree atop a large rock where a Wolf Guardian lurks over a **Treasure Chest** full of materials you can claim.\nIn the opposite direction, there's another large rock below a tower up above that you can't reach, but you can search the rock for another Lesser Apramana Bat, and nearby you can find a second **Treasure Chest** under a large tree.\nThe most interesting thing around here is just up the small hill past the tower. You'll find a large corpse of some kind at the base of a statue built into the cliffs ahead.\nThis is actually one of the four Captains that the Pagoda Realm Prisoner spoke of, but it looks like someone beat you to putting this captain out of their misery. You can still interact with the body to claim the Spirit of Captain Void-Illusion. And hey, since they still count as a Yaoguai Chief in the journal, that's one less boss to worry about!\nCaptain Void-Illusion\nThere's not too much else in the field around the high tower, but you can find a green Wisp to absorb both behind the tower, and along the nearby cliff wall below a large statue where a Crow Diviner enemy stands.\nHead back to the main road and defeat the various Frozen Corpses while you head toward a large arch where the Shrine is, plus a green Wisp to absorb.\nGuarding the Shrine is another Dual-Blade Monk, who thankfully won't respawn when killed, so feel free to go all out with your spells to overpower him after deflecting an attack to stagger him.\nFrom here, the large main field in front of you hides several more Frozen Corpse ambushes, plus Falcon Fan-Makers who will try and stop you from reaching the New Thunderclap Temple. However, there is one last side area worth checking out.\nLook for a lower path leading left of the Shrine, and you'll find a road leading along the ridge above the Towers of Karma into another wooded area. This place is effectively one big loop, with a lower and upper path to take.\nThe lower path will lead past another Crow Diviner, and up some stairs to an area with several stone monuments where the path diverges.\nA glowing pot can be seen on a small wooden platform, but guarding it is a new formidable opponent. The strangely named Turtle Treasure is a stout skull-faced yaoguai with a large mace it can use to swing in wide arcs or slams, and can also thrust out its belly at you like the Frog Guai bosses, or leap into the air for a butt slam.\nWhat makes them truly dangerous is the more they swing their mace, the more small fires will begin to appear around it. Once the fires have grown, any of their weapon slams will now deal huge explosions that can be a pain to deal with.\nMake use of your spells to keep the foe off-balance and to get away from their explosive attacks, and once they've been defeated, jump and perform a heavy attack to smash the glowing pot on the small wooden platform to gain an Awaken Wine Worm!\nLongevity Road Awaken Wine Worm\nIf you want something to pair with that worm, keep moving along the lower path as it goes up some stairs, and you'll eventually reach the end of this loop, where a small tree stands at the end of a large field with a Luojia Fragrant Vine. However, you'll need to defeat not one but two Falcon Fan-Makers to claim it!\nDefeating the pair is no easy attacks when you consider their hit-and-run tactics, so you may need to even the odds with A Pluck of Many Spell, or use a combination of Cloud Step and Immobilize to isolate and focus fire one of the Falcons, and then take out the second.\nLongevity Road Luojia Fragrant Vine\nOnce you have the vine, take the upper path back toward the Longevity Road Shrine, where you'll encounter a two Crow Diviners - one up on a ledge to lure you, and a friend hiding in the bushes nearby.\nThe most important note is that you can find another Dark-faced Overlord here. Keep focusing on battering his legs to get him to fall and you can attack his skull, and when he dies he'll drop the Gold Spikeplate Curio!\nBe sure to inspect the woods behind where the giant was posted, and you'll find one last Crow Diviner guarding a **Treasure Chest** with some materials inside.\nFinally, with every area explored, it's time to get out of here. Cross the large field past the Longevity Road Shrine and you'll find a passage through the cliffs to the nearby temple.\nAs you approach, a large bloody miasma will block your advance. Once it congeals, you'll find yourself facing the last of the four captains.\n### Yaoguai Chief Miniboss Fight - Captain Kalpa-Wave\nAs the last of the four captains, Kalpa-Wave looks scarier than he actually is, especially once you learn his tricks.\nWith his large towering body, Kapla-Wave has a few physical attacks that generally alternate between stomps of his legs, or a mighty leap that causes him to crash into the ground, but both attacks aren't too bad to deal with.\nWhat really makes Kalpa-Wave unique is his ability to spew blood out. Lots of it. This can take on many forms, and you'll need to know how to deal with each of them.\nOne of the most basic attacks will be when it spews out a group of bloody projectiles from its body. They'll take to the air before arcing slowly over in your direction, but spinning your staff can let you clear them without issue.\nSometimes he'll throw several blood attacks into the mix one after the other to mess you up. Expect these bloody trails to come out in multiple directions (both above and from the sides) to try and confuse you, but remain focused on deflecting them as they arrive.\nOther times he'll mix up his blood projectiles by also creating more blood, which include a stomp attack (or bending down to tilt the wings on its back) that generates a trail of blood heading in your direction. Dodge the blood trails, or they'll burst into a bloody lotus flowers that damage you as they erupt.\nThe real danger isn't the lotus itself, its what it leaves behind. Similar to that Frog Guai's ice attacks coating the area in frost, many of Kalpa-Wave's attacks (including stomps!) will leave behind large pools of blood. Stepping into any of these pools for a second will start to drain your health, so you'll need to steer clear of them at all costs!\nMuch of this fight will come down to being constantly mobile to evade the various pools of blood Kalpa-Wave will create, and find times after deflecting his projectiles to run up and unleash damage on the boss.\nBe especially careful if Captain Kalpa-Wave starts to jump up and down repeatedly. On the third jump, all pools of blood will explode into explosive lotus flowers, meaning you'll need to either be on the move, or use your Pillar Stance to rise above the attacks.\nThe good news is Kalpa-Wave is extremely susceptible to getting knocked down. So long as you build up some focus points with light attacks where possible, you can use your Pillar Stance heavy attack with three focus points built up to send the boss crashing to the ground -- which is the perfect time to Immobilize him on the ground and go wild with Spirit Attacks and Transformations.\nBeyond this, Kalpa-Wave doesn't have too many other variations on his moves, so as long as you avoid those blood pools, you'll be able to cut him down to size, and gain the Spirit of Captain Kalpa-Wave to add to your collection.\nCaptain Kalpa-Wave\nThere's a Shrine at the start of the next area just beyond the entrance gate, and you can use this as the perfect opportunity to return back to the Pagoda Realm.\n### Completing the Pagoda Prisoner's Quest\nHead back to the Lower Pagoda Shrine, and revisit the Pagoda Realm Prisoner (aka, the Third Prince of Flowing Sands). He will be grateful for your work in putting his captains to rest, and will award you the **Chubai Spearhead** , which allows you to craft a spear variant of your trusty staff: the Chu-Bai Spear!\nWith the Valley of Ecstasy officially cleared of threats, you can now begin to explore the final region of **New Thunderclap Temple**.\nValley of Ecstasy Complete",
    "promot_tokens_num": 2330
}