{
    "chunk_id": 932308820182,
    "source_file": "Webbed_Hollow-Lower_Hollow_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Webbed Hollow - Lower Hollow Walkthrough",
    "h2_title": "Cliff of Oblivion",
    "h1_content": "The Webbed Hollow is the second main area of Black Myth: Wukong's Chapter 4, concluding with the lower portion of the large underground cave system. Below you'll find a guide for the third and final lower area of The Webbed Hollow, including where to find the secret Yellow Loong and frog boss, and rescue Zhu Bajie from the clutches of the Violet Spider.\n* **Jump to a Section**\n* **Relief of the Fallen Loong**\n* **Lower Hollow**\n* Yaoguai Chief - Baw-Li-Guhh-Baw\n* **Hut of Immortality**\n* Boss Fight - Zhu Bajie\n* **The Purifying Spring**\n* **The Gathering Cave**\n* Yaoguai Queen - Violet Spider\nDue to the length, complexity, and number of bosses scattered throughout the Webbed Hollow section of Chapter 4, this particular region walkthrough will be split up into three parts with each section largely covering a major floor level of the hollow.",
    "h2_content": "Now that you've defeated Buddha's Right Hand and created a path with its corpse, the last section of the Webbed Hollow awaits you.\nBefore you drop down the ledge after crossing the corpse of the boss, look for a little ledge leading left, leading to a small cliff area with a small golden pot that contains a **Celestial Taiyi Pill** , increasing your maximum mana.\nThe Webbed Hollow Taiyi Pill\nNow drop down from the body to reach a lower level, where right away you'll be presented with two paths: To the right is a rock bridge lined with a few stone lanterns that leads to the heart of the Lower Hollow, and the main boss. However, there's also a ledge to drop down on the left, which will take you to an optional and lucrative area across a rope bridge, and it helpfully loops back around to drop you back off at this spot.\nWe'll take the rope bridge path first (which may look like its a prime ambush spot, but isn't), leading to a long hall with scaffolding surrounding a large stone disc on the right.\nThere's a few Skeletal Snakes who might creep up on you here, but more important is to check behind the large stone disc through a darkened path to the right, and you'll find a **Treasure Chest** with random materials at the end of a wooden platform.\nUp ahead, you'll find a second rope bridge, and this one is very much a trap. It's surrounded on all sides by hanging cocoons, and sure enough, many of them are Clawed Cocoons in disguise.\nTo make matters worse, there's no invisible walls to stop you from falling to your death when crossing the bridge, which the Clawed Cocoons AND Dragonfly Guai archer at the far end will absolutely use to their advantage to knock you around as you try to cross. While you can use the Thrust Stance to safely poke a few early cocoons, the strategy won't hold very long, and it's almost impossible to target the actual enemies and not the regular cocoons.\nThe easiest way to bamboozle the enemies here and get across without falling is with a bit of subterfuge: Cloud Step. Cast it near the start of the rope bridge, and then sprint all the way to the other end, and don't try to staff spin if any arrows come your way, or you're likely to walk off the side by accident.",
    "promot": "This is an excerpt from the file 'Webbed_Hollow-Lower_Hollow_Walkthrough.md', located in the main section titled 'Webbed Hollow - Lower Hollow Walkthrough'. The section summary is: The Webbed Hollow is the second main area of Black Myth: Wukong's Chapter 4, concluding with the lower portion of the large underground cave system. Below you'll find a guide for the third and final lower area of The Webbed Hollow, including where to find the secret Yellow Loong and frog boss, and rescue Zhu Bajie from the clutches of the Violet Spider.\n* **Jump to a Section**\n* **Relief of the Fallen Loong**\n* **Lower Hollow**\n* Yaoguai Chief - Baw-Li-Guhh-Baw\n* **Hut of Immortality**\n* Boss Fight - Zhu Bajie\n* **The Purifying Spring**\n* **The Gathering Cave**\n* Yaoguai Queen - Violet Spider\nDue to the length, complexity, and number of bosses scattered throughout the Webbed Hollow section of Chapter 4, this particular region walkthrough will be split up into three parts with each section largely covering a major floor level of the hollow. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Cliff of Oblivion', and the detailed content is as follows:\nNow that you've defeated Buddha's Right Hand and created a path with its corpse, the last section of the Webbed Hollow awaits you.\nBefore you drop down the ledge after crossing the corpse of the boss, look for a little ledge leading left, leading to a small cliff area with a small golden pot that contains a **Celestial Taiyi Pill** , increasing your maximum mana.\nThe Webbed Hollow Taiyi Pill\nNow drop down from the body to reach a lower level, where right away you'll be presented with two paths: To the right is a rock bridge lined with a few stone lanterns that leads to the heart of the Lower Hollow, and the main boss. However, there's also a ledge to drop down on the left, which will take you to an optional and lucrative area across a rope bridge, and it helpfully loops back around to drop you back off at this spot.\nWe'll take the rope bridge path first (which may look like its a prime ambush spot, but isn't), leading to a long hall with scaffolding surrounding a large stone disc on the right.\nThere's a few Skeletal Snakes who might creep up on you here, but more important is to check behind the large stone disc through a darkened path to the right, and you'll find a **Treasure Chest** with random materials at the end of a wooden platform.\nUp ahead, you'll find a second rope bridge, and this one is very much a trap. It's surrounded on all sides by hanging cocoons, and sure enough, many of them are Clawed Cocoons in disguise.\nTo make matters worse, there's no invisible walls to stop you from falling to your death when crossing the bridge, which the Clawed Cocoons AND Dragonfly Guai archer at the far end will absolutely use to their advantage to knock you around as you try to cross. While you can use the Thrust Stance to safely poke a few early cocoons, the strategy won't hold very long, and it's almost impossible to target the actual enemies and not the regular cocoons.\nThe easiest way to bamboozle the enemies here and get across without falling is with a bit of subterfuge: Cloud Step. Cast it near the start of the rope bridge, and then sprint all the way to the other end, and don't try to staff spin if any arrows come your way, or you're likely to walk off the side by accident.",
    "promot_tokens_num": 780
}