{
    "chunk_id": 611335424657,
    "source_file": "The_Scorpionlord.md",
    "content_type": "one and two",
    "h1_title": "The Scorpionlord",
    "h2_title": "Where to Find The Scorpionlord",
    "h1_content": "The Scorpionlord is an optional Yaoguai King boss fight that you can encounter in Chapter 4 of Black Myth Wukong. The leader of a gang of insect guai that have taken over Purple Cloud Mountain, he can only be reached by entering a secret area.\n* Rewards: Sky-Piercing Horn, Deathstinger (Material), Stained Jade Gourd, Fine Gold Thread, Mind Core, 3410 Experience, 2595 Will",
    "h2_content": "The Scorpionlord is an optional Yaoguai King, and potentially one of the toughest bosses you'll face in Chapter 4, even though he is not required to complete the Secret Area of Purple Cloud Mountain. However, if you do not defeat him before defeating the actual final boss of this region, he may not be available afterwards.\nTo reach Purple Cloud Mountain, you will have to defeat the Venom Daoist twice - both in the Upper Webbed Hollow, and in a side path outside the Temple of Yellow Flowers main area. This will unlock a mural allowing you to travel to this new area.\nOnce you reach the first main shrine at the Valley of Blooms, keep to the right to find a pathway leading to the Bounds of Deity's Abode Shrine, and stairs up to where the Scorpionlord lounges drinking on top of a building.\nTo goad him into fighting, simply break any of the pots in the area around him.",
    "promot": "This is an excerpt from the file 'The_Scorpionlord.md', located in the main section titled 'The Scorpionlord'. The section summary is: The Scorpionlord is an optional Yaoguai King boss fight that you can encounter in Chapter 4 of Black Myth Wukong. The leader of a gang of insect guai that have taken over Purple Cloud Mountain, he can only be reached by entering a secret area.\n* Rewards: Sky-Piercing Horn, Deathstinger (Material), Stained Jade Gourd, Fine Gold Thread, Mind Core, 3410 Experience, 2595 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find The Scorpionlord', and the detailed content is as follows:\nThe Scorpionlord is an optional Yaoguai King, and potentially one of the toughest bosses you'll face in Chapter 4, even though he is not required to complete the Secret Area of Purple Cloud Mountain. However, if you do not defeat him before defeating the actual final boss of this region, he may not be available afterwards.\nTo reach Purple Cloud Mountain, you will have to defeat the Venom Daoist twice - both in the Upper Webbed Hollow, and in a side path outside the Temple of Yellow Flowers main area. This will unlock a mural allowing you to travel to this new area.\nOnce you reach the first main shrine at the Valley of Blooms, keep to the right to find a pathway leading to the Bounds of Deity's Abode Shrine, and stairs up to where the Scorpionlord lounges drinking on top of a building.\nTo goad him into fighting, simply break any of the pots in the area around him.",
    "promot_tokens_num": 352
}