{
    "chunk_id": 919598941132,
    "source_file": "Buddha's_Eyeball_Locations.md",
    "content_type": "one and two",
    "h1_title": "Buddha's Eyeball Locations",
    "h2_title": "All 6 Black Myth: Wukong Buddha's Eyeball Locations",
    "h1_content": "The Buddha's Eyeballs are one of the first Key Items you will come across during your time in Yellow Wind Ridge in Black Myth: Wukong. These eyeballs are scattered around the land on the heads of Buddha statues. With six to find, chances are you might miss one or two in your travels across the area. Plus, when it comes to using the Buddha's Eyeballs, it can be tricky to find out what to do.\nThis guide covers all Buddha's Eyeball locations in Black Myth: Wukong, where to use them to unlock a secret boss, and more.",
    "h2_content": "There are six Buddha's Eyeballs in Black Myth: Wukong, which are found in the following locations in Yellow Wind Ridge:\n* Fright Cliff - Squall Hideout (just before the Shrine)\n* Along the rafters on the right side of the Fright Cliff - Squall Hideout area, by some Blazebones enemies\n* Along the left path in Fright Cliff - Squall Hideout. Head up the hill and turn left once you reach the statue\n* Along the main, central path heading the Squall Hideout towards the Rockrest Flat shrine\n* Found within the cave on the right in Fright Cliff - Squall Hideout, just before the Rockrest Flat Shrine. Near the Mother of Stones boss, take a right to a cliff edge with the statue head\n* Directly on the left, once you reach the Rockrest Flat Shrine\n### Black Myth: Wukong Buddha's Eyeball 1 Location\nThe first Buddha statue with the Buddha's Eyeball is easy to find in Black Myth: Wukong. You should naturally spot it as you head towards the Squall Hideout shrine in Fright Cliff along the main path.\nBuddha's Eyeball 1\n### Black Myth: Wukong Buddha's Eyeball 2 Location\nThe next Buddha's statue can be found along the right path in Squall Hideout. Along the right side of the area, you will find some rafters with Blazebones enemies. Pass the chest, head up, and kill them. Interact with the Buddha statue at the top.\nBuddha's Eyeball 2\n### Black Myth: Wukong Buddha's Eyeball 3 Location\nHead back to the Squall Hideout Shrine, and take the left path. Head through the gate and then up the hill.\nOnce you reach the statue on your left, take a left and head towards the shaded area. The Buddha's Eyeball can be found here.\nBuddha's Eyeball 3\n### Black Myth: Wukong Buddha's Eyeball 4 Location\nHead back to the Shrine once again and take the path through the centre of Squall Hideout. You will spot the Buddha's Eyeball statue along it.\nBuddha's Eyeball 4\n### Black Myth: Wukong Buddha's Eyeball 5 Location\nA little further on, on the left side of the area, you will see a covered area of the cave with some more Blazebones. This is before the Rockrest Flat Shrine. On your left, there will be a path curving up to another caved area.\nContinue up the hill and you will find the Mother of Stones boss. Either fight her, or leave her for later. Take a right where the light is shining through the cave at the top, and you will find the Buddha statue with the eyeball on the cliff edge.\nBuddha's Eyeball 5\n### Black Myth: Wukong Buddha's Eyeball 6 Location\nThe final Buddha's Eyeball statue can be found directly on your left from the Rockrest Flat shrine in Fright Cliff. It is practically impossible to miss.\nBuddha's Eyeball 6\nFor a more detailed run-through of the entirety of Yellow Wind Ridge, check out our walkthrough.\nBuddha's Eyeball",
    "promot": "This is an excerpt from the file 'Buddha's_Eyeball_Locations.md', located in the main section titled 'Buddha's Eyeball Locations'. The section summary is: The Buddha's Eyeballs are one of the first Key Items you will come across during your time in Yellow Wind Ridge in Black Myth: Wukong. These eyeballs are scattered around the land on the heads of Buddha statues. With six to find, chances are you might miss one or two in your travels across the area. Plus, when it comes to using the Buddha's Eyeballs, it can be tricky to find out what to do.\nThis guide covers all Buddha's Eyeball locations in Black Myth: Wukong, where to use them to unlock a secret boss, and more. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'All 6 Black Myth: Wukong Buddha's Eyeball Locations', and the detailed content is as follows:\nThere are six Buddha's Eyeballs in Black Myth: Wukong, which are found in the following locations in Yellow Wind Ridge:\n* Fright Cliff - Squall Hideout (just before the Shrine)\n* Along the rafters on the right side of the Fright Cliff - Squall Hideout area, by some Blazebones enemies\n* Along the left path in Fright Cliff - Squall Hideout. Head up the hill and turn left once you reach the statue\n* Along the main, central path heading the Squall Hideout towards the Rockrest Flat shrine\n* Found within the cave on the right in Fright Cliff - Squall Hideout, just before the Rockrest Flat Shrine. Near the Mother of Stones boss, take a right to a cliff edge with the statue head\n* Directly on the left, once you reach the Rockrest Flat Shrine\n### Black Myth: Wukong Buddha's Eyeball 1 Location\nThe first Buddha statue with the Buddha's Eyeball is easy to find in Black Myth: Wukong. You should naturally spot it as you head towards the Squall Hideout shrine in Fright Cliff along the main path.\nBuddha's Eyeball 1\n### Black Myth: Wukong Buddha's Eyeball 2 Location\nThe next Buddha's statue can be found along the right path in Squall Hideout. Along the right side of the area, you will find some rafters with Blazebones enemies. Pass the chest, head up, and kill them. Interact with the Buddha statue at the top.\nBuddha's Eyeball 2\n### Black Myth: Wukong Buddha's Eyeball 3 Location\nHead back to the Squall Hideout Shrine, and take the left path. Head through the gate and then up the hill.\nOnce you reach the statue on your left, take a left and head towards the shaded area. The Buddha's Eyeball can be found here.\nBuddha's Eyeball 3\n### Black Myth: Wukong Buddha's Eyeball 4 Location\nHead back to the Shrine once again and take the path through the centre of Squall Hideout. You will spot the Buddha's Eyeball statue along it.\nBuddha's Eyeball 4\n### Black Myth: Wukong Buddha's Eyeball 5 Location\nA little further on, on the left side of the area, you will see a covered area of the cave with some more Blazebones. This is before the Rockrest Flat Shrine. On your left, there will be a path curving up to another caved area.\nContinue up the hill and you will find the Mother of Stones boss. Either fight her, or leave her for later. Take a right where the light is shining through the cave at the top, and you will find the Buddha statue with the eyeball on the cliff edge.\nBuddha's Eyeball 5\n### Black Myth: Wukong Buddha's Eyeball 6 Location\nThe final Buddha's Eyeball statue can be found directly on your left from the Rockrest Flat shrine in Fright Cliff. It is practically impossible to miss.\nBuddha's Eyeball 6\nFor a more detailed run-through of the entirety of Yellow Wind Ridge, check out our walkthrough.\nBuddha's Eyeball",
    "promot_tokens_num": 911
}