{
    "chunk_id": 370372451540,
    "source_file": "Shen_Monkey_Questline.md",
    "content_type": "one and two",
    "h1_title": "Shen Monkey Questline",
    "h2_title": "How to Save the Shen Monkey",
    "h1_content": "The Shen Monkey is a friendly character and merchant you can meet in Chapter 1 of Black Myth Wukong. After being rescued, he will offer a variety of services to improve your healing Gourd, as well as selling new items as you progress through the game.",
    "h2_content": "You’ll first meet the Shen Monkey halfway into Chapter 1 in the Bamboo Grove of the Black Wind Mountain. After defeating the Yaoguai Chief, Guangmou, you’ll reach the **Marsh of the White Mist** Shrine.\nHeading down the path from the shrine, you’ll encounter a Snake Patroller harassing a monkey hanging from a ceiling, and requesting your aid. Defeat the snake, and the **Shen Monkey** will offer his thanks, and usher you into a nearby cave where he resides.\nShen Monkey's Quest",
    "promot": "This is an excerpt from the file 'Shen_Monkey_Questline.md', located in the main section titled 'Shen Monkey Questline'. The section summary is: The Shen Monkey is a friendly character and merchant you can meet in Chapter 1 of Black Myth Wukong. After being rescued, he will offer a variety of services to improve your healing Gourd, as well as selling new items as you progress through the game. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'How to Save the Shen Monkey', and the detailed content is as follows:\nYou’ll first meet the Shen Monkey halfway into Chapter 1 in the Bamboo Grove of the Black Wind Mountain. After defeating the Yaoguai Chief, Guangmou, you’ll reach the **Marsh of the White Mist** Shrine.\nHeading down the path from the shrine, you’ll encounter a Snake Patroller harassing a monkey hanging from a ceiling, and requesting your aid. Defeat the snake, and the **Shen Monkey** will offer his thanks, and usher you into a nearby cave where he resides.\nShen Monkey's Quest",
    "promot_tokens_num": 232
}