{
    "chunk_id": 404078119100,
    "source_file": "Chen_Loong.md",
    "content_type": "one and two",
    "h1_title": "Chen Loong",
    "h2_title": "Where to Find Chen Loong",
    "h1_content": "Chen Loong is a character and possible boss fight first found in Chapter 3 of Black Myth Wukong. Though initially hostile, you can perform a task after defeating him in combat to unlock a Painted Realm where you can quickly access multiple merchants and services.\n* **Rewards:** TBA",
    "h2_content": "Chen Loong is an optional opponent who has their own quest, which you can find shortly after leaving Turtle Rock for the North Shore of the Bitter Lake. From the Shrine, head left while facing it to head along the lakeshore toward a lone shack by the water.\nSearch the shallows near this shack, and you'll find the old dragon wandering the waters, and will become hostile as you approach.\n### Chen Loong Boss Fight and Guide\nLike the other Loongs in The New West, Chen favors using lightning magic, and is a much more caster-oriented opponent compared to the others. You can prepare to mitigate his attacks by making sure you've crafted the Loongscale Armor Set, are stocked up on Shock-Quelling Powder, and apply the Soak to your Gourd that increases shock resistance.\nWhile he's nowhere as strong as the other dragons you've faced, you don't want to get to cocky, or you may find his electric attacks peeling off more of your health than you can restore, even with Zhu Bajie helping out.\nThe old dragon can be pretty agile too, leaping away to float in the air before casting a variety of electric attacks. One of these includes sending out a flurry of small electric orbs at you, though they can be deflected with a quick staff spin.\nHe can also raise his hand up slowly to trigger a row of lightning bolts in the area, which will explode fairly fast.\nSometimes, he'll take to the air instead, and fly at you in a divebomb attack which will require you to dodge both the fly-by, and the resulting row of lightning strikes that follow his attack.\nAnother electric variation will have him performing an underhanded toss of anywhere between one and three small lightning orbs. They'll bounce along the water for a few hops, and then explode in a much wider area to damage you unless you can dodge to the side.\nHe can also shoot lightning directly out of his mouth in a beam of energy. This can happen both when he's on the ground in a quick straight burst right in front of him, or when floating above you in a quick sweep in front of him, and both need quick dodges to stop a quick attack.\nWhile Chen Loong is highly susceptible to being staggered, he has a few tricks to stop you from pressing the attack for too long. His tail can be pretty impressive, and will use it to spin around and attack with it for two rotations, and then leap into the air to perform a delayed third electric slash.\nHe'll often vary this combo up making it hard to read, and either trick you into thinking he's preparing a cast before tail-whipping, or throwing more quick slashes in-between tail attacks -- or even just doing single hits.\nThe dragon won't just stop at wacking you with his tail up close, either. If he proclaims \"To the deepest trench I dive!\" Be ready for him to stick his tail in the ground, only for several giant electrified tails to sprout up in a cluster nearby. You'll need to quickly break off your attack and give them a wide berth, as they'll quickly perform a single huge spin attack all at once!\nOther times, he may only summon one smaller tail, but this one can expel its electrical energy in a projectile blast when the tail swings.\nHis strongest attack by far is when he jumps into the air with his green weapon, charging it with energy before crashing down with it. It will cause a huge electrical explosion when he lands, but then spread outward with several lighting strikes that cover a wide area.\nThe second hit can be extremely tough to dodge, but using the Pillar Stance to get off the ground can soak the blow if you have stamina to spare (though it will probably still stun you).\nRemember that you also have Zhu Bajie as an ally in this fight, and while he won't be able to hold his attention for too long, but he can be useful at giving you some breathing room or interrupting attacks.\nSince Chen Loong doesn't have a whole lot of health or armor, use everything in your arsenal to keep him staggered and unable to hit back whenever possible, and you can rush him down before the fight goes on too long and you start taking double damage too often.\nWhen he's defeated, Chen Loong will throw a bit of a tantrum, and you'll find he's not such a bad guy. He also seems to know Xu Dog, and claims only one of his celestial resurrection pills can ease his pains.\nChen Loong\nWarp back to the Yellow Wind Ridge to find the Xu Dog back in the cellar below the Crouching Tiger Temple.\nSpeak to him here, and he'll pass along a Special-made Bone-Strengthening Pellet for the poor old Loong. You'll also get the formula to make your own Fortifying Medicament for your trouble!\nReturn to Chen Loong (who now stands outside the shack by the water), and deliver the pellet to him. The old dragon will be overjoyed at your gift, and in return will pass along The Ruyi Scroll to you. He'll proclaim that he now has the strength to unseal the Painted Realm, where he and his fellow deities will now reside -- and you're invited!",
    "promot": "This is an excerpt from the file 'Chen_Loong.md', located in the main section titled 'Chen Loong'. The section summary is: Chen Loong is a character and possible boss fight first found in Chapter 3 of Black Myth Wukong. Though initially hostile, you can perform a task after defeating him in combat to unlock a Painted Realm where you can quickly access multiple merchants and services.\n* **Rewards:** TBA This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find Chen Loong', and the detailed content is as follows:\nChen Loong is an optional opponent who has their own quest, which you can find shortly after leaving Turtle Rock for the North Shore of the Bitter Lake. From the Shrine, head left while facing it to head along the lakeshore toward a lone shack by the water.\nSearch the shallows near this shack, and you'll find the old dragon wandering the waters, and will become hostile as you approach.\n### Chen Loong Boss Fight and Guide\nLike the other Loongs in The New West, Chen favors using lightning magic, and is a much more caster-oriented opponent compared to the others. You can prepare to mitigate his attacks by making sure you've crafted the Loongscale Armor Set, are stocked up on Shock-Quelling Powder, and apply the Soak to your Gourd that increases shock resistance.\nWhile he's nowhere as strong as the other dragons you've faced, you don't want to get to cocky, or you may find his electric attacks peeling off more of your health than you can restore, even with Zhu Bajie helping out.\nThe old dragon can be pretty agile too, leaping away to float in the air before casting a variety of electric attacks. One of these includes sending out a flurry of small electric orbs at you, though they can be deflected with a quick staff spin.\nHe can also raise his hand up slowly to trigger a row of lightning bolts in the area, which will explode fairly fast.\nSometimes, he'll take to the air instead, and fly at you in a divebomb attack which will require you to dodge both the fly-by, and the resulting row of lightning strikes that follow his attack.\nAnother electric variation will have him performing an underhanded toss of anywhere between one and three small lightning orbs. They'll bounce along the water for a few hops, and then explode in a much wider area to damage you unless you can dodge to the side.\nHe can also shoot lightning directly out of his mouth in a beam of energy. This can happen both when he's on the ground in a quick straight burst right in front of him, or when floating above you in a quick sweep in front of him, and both need quick dodges to stop a quick attack.\nWhile Chen Loong is highly susceptible to being staggered, he has a few tricks to stop you from pressing the attack for too long. His tail can be pretty impressive, and will use it to spin around and attack with it for two rotations, and then leap into the air to perform a delayed third electric slash.\nHe'll often vary this combo up making it hard to read, and either trick you into thinking he's preparing a cast before tail-whipping, or throwing more quick slashes in-between tail attacks -- or even just doing single hits.\nThe dragon won't just stop at wacking you with his tail up close, either. If he proclaims \"To the deepest trench I dive!\" Be ready for him to stick his tail in the ground, only for several giant electrified tails to sprout up in a cluster nearby. You'll need to quickly break off your attack and give them a wide berth, as they'll quickly perform a single huge spin attack all at once!\nOther times, he may only summon one smaller tail, but this one can expel its electrical energy in a projectile blast when the tail swings.\nHis strongest attack by far is when he jumps into the air with his green weapon, charging it with energy before crashing down with it. It will cause a huge electrical explosion when he lands, but then spread outward with several lighting strikes that cover a wide area.\nThe second hit can be extremely tough to dodge, but using the Pillar Stance to get off the ground can soak the blow if you have stamina to spare (though it will probably still stun you).\nRemember that you also have Zhu Bajie as an ally in this fight, and while he won't be able to hold his attention for too long, but he can be useful at giving you some breathing room or interrupting attacks.\nSince Chen Loong doesn't have a whole lot of health or armor, use everything in your arsenal to keep him staggered and unable to hit back whenever possible, and you can rush him down before the fight goes on too long and you start taking double damage too often.\nWhen he's defeated, Chen Loong will throw a bit of a tantrum, and you'll find he's not such a bad guy. He also seems to know Xu Dog, and claims only one of his celestial resurrection pills can ease his pains.\nChen Loong\nWarp back to the Yellow Wind Ridge to find the Xu Dog back in the cellar below the Crouching Tiger Temple.\nSpeak to him here, and he'll pass along a Special-made Bone-Strengthening Pellet for the poor old Loong. You'll also get the formula to make your own Fortifying Medicament for your trouble!\nReturn to Chen Loong (who now stands outside the shack by the water), and deliver the pellet to him. The old dragon will be overjoyed at your gift, and in return will pass along The Ruyi Scroll to you. He'll proclaim that he now has the strength to unseal the Painted Realm, where he and his fellow deities will now reside -- and you're invited!",
    "promot_tokens_num": 1209
}