{
    "chunk_id": 754263582726,
    "source_file": "Green-Capped_Martialist.md",
    "content_type": "one and two",
    "h1_title": "Green-Capped Martialist",
    "h2_title": "Where to Find the Green-Capped Martialist",
    "h1_content": "The Green-Capped Martialist is an optional and secret Character Boss fight that you can encounter in Chapter 3 of Black Myth Wukong. This boss can only be fought by undertaking a Treasure Hunter's Quest that begins along the Bitter Lake and leads to the Valley of Ecstasy, where you'll have to uncover a secret Melon Field.\n* Rewards: Spell-Binder Spell, Cold Iron Leaves, Random Materials, 1847 Experience, 1190 Will",
    "h2_content": "To unlock this secret boss fight, you'll first need to encounter a simple-looking Treasure Hunter Human in Chapter 3, at the North Shore of the Bitter Lake in The New West.\nOnce you reach the shore, take a left when facing the Shrine and head past the area where Chen Loong is and through a gate to find a human being harassed by small Apramana Bats. Defeat them and talk to him to learn of his quest to find a treasure.\nOnce you reach the Valley of Ecstasy region, head along the main path through the Forest of Felicity and take a left down a slope to enter the Towers of Karma area. Search along the back of this sub-region to find the same Treasure Hunter freezing from the cold sitting in a large gnarled tree, left of the main Shrine in this area.\nPerform the Circle of Fire Spell to warm him up, and he'll thank you, while giving you more clues to the location of a secret Melon Field.\nThis secret spot can be found by going right down the hill from the Forest of Felicity and down to the end of the Brook of Bliss' stream.\nWhen you reach a cliff with some braziers, look down to find a spot to drop into a large open cave with a large Buddha Statue.\nAs you approach, the Treasure Hunter will reveal his true form and attack!",
    "promot": "This is an excerpt from the file 'Green-Capped_Martialist.md', located in the main section titled 'Green-Capped Martialist'. The section summary is: The Green-Capped Martialist is an optional and secret Character Boss fight that you can encounter in Chapter 3 of Black Myth Wukong. This boss can only be fought by undertaking a Treasure Hunter's Quest that begins along the Bitter Lake and leads to the Valley of Ecstasy, where you'll have to uncover a secret Melon Field.\n* Rewards: Spell-Binder Spell, Cold Iron Leaves, Random Materials, 1847 Experience, 1190 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find the Green-Capped Martialist', and the detailed content is as follows:\nTo unlock this secret boss fight, you'll first need to encounter a simple-looking Treasure Hunter Human in Chapter 3, at the North Shore of the Bitter Lake in The New West.\nOnce you reach the shore, take a left when facing the Shrine and head past the area where Chen Loong is and through a gate to find a human being harassed by small Apramana Bats. Defeat them and talk to him to learn of his quest to find a treasure.\nOnce you reach the Valley of Ecstasy region, head along the main path through the Forest of Felicity and take a left down a slope to enter the Towers of Karma area. Search along the back of this sub-region to find the same Treasure Hunter freezing from the cold sitting in a large gnarled tree, left of the main Shrine in this area.\nPerform the Circle of Fire Spell to warm him up, and he'll thank you, while giving you more clues to the location of a secret Melon Field.\nThis secret spot can be found by going right down the hill from the Forest of Felicity and down to the end of the Brook of Bliss' stream.\nWhen you reach a cliff with some braziers, look down to find a spot to drop into a large open cave with a large Buddha Statue.\nAs you approach, the Treasure Hunter will reveal his true form and attack!",
    "promot_tokens_num": 440
}