{
    "chunk_id": 646660811674,
    "source_file": "Violet_Spider.md",
    "content_type": "one and two",
    "h1_title": "Violet Spider",
    "h2_title": "Where to Find the Violet Spider",
    "h1_content": "The Violet Spider is a main Yaoguai \"Queen\" boss fight that you can encounter in Chapter 4 of Black Myth Wukong. The leader of the Spider Guai and master of The Webbed Hollow, the Violet Spider and her six daughters control this region, and their mother has particular plans for the pig known as Zhu Bajie.\n* Rewards: Spider Leg, Refined Iron Sand, 3410 Experience, 2608 Will",
    "h2_content": "The Violet Spider is a required and non-missable boss in Chapter 4. She is the final boss of the Webbed Hollow Section, and must be defeated to progress to the next area. After you have reached the Lower Hollow and defeated Zhu Bajie to free him of his bewitching curse, he'll be abducted again.\nTo reach him (and the Violet Spider), you'll need to ascend the Purfiying Spring outside the Hut of Immortality, and follow the trail upwards to The Gathering Cave where the spider queen awaits you.",
    "promot": "This is an excerpt from the file 'Violet_Spider.md', located in the main section titled 'Violet Spider'. The section summary is: The Violet Spider is a main Yaoguai \"Queen\" boss fight that you can encounter in Chapter 4 of Black Myth Wukong. The leader of the Spider Guai and master of The Webbed Hollow, the Violet Spider and her six daughters control this region, and their mother has particular plans for the pig known as Zhu Bajie.\n* Rewards: Spider Leg, Refined Iron Sand, 3410 Experience, 2608 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find the Violet Spider', and the detailed content is as follows:\nThe Violet Spider is a required and non-missable boss in Chapter 4. She is the final boss of the Webbed Hollow Section, and must be defeated to progress to the next area. After you have reached the Lower Hollow and defeated Zhu Bajie to free him of his bewitching curse, he'll be abducted again.\nTo reach him (and the Violet Spider), you'll need to ascend the Purfiying Spring outside the Hut of Immortality, and follow the trail upwards to The Gathering Cave where the spider queen awaits you.",
    "promot_tokens_num": 267
}