{
    "chunk_id": 964623123479,
    "source_file": "Gold_Spikeplate.md",
    "content_type": "one and two",
    "h1_title": "Gold Spikeplate",
    "h2_title": "Black Myth: Wukong Gold Spikeplate Location",
    "h1_content": "The Gold Spikeplate is one of the many Curios items you can find in Black Myth: Wukong. Like the rest of these items, once found, it can be equipped from the Equipment menu.\nWith the Gold Spikeplate equipped your defense is considerably increased. Additionally, when taking hits, you deal damage to enemies surrounding enemies.\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, the item will stay at its current power throughout the game. If you want a better buff or something else to fit your build, you will need to switch it out.",
    "h2_content": "The Gold Spikeplate can be found in The New West, specifically within the Valley of Ecstasy, Longevity Road Shrine area. Follow the road along until you reach the Dark-faced Overlord in the back of the area. Defeat it to get the Curios item.\nGold Spikeplate\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "promot": "This is an excerpt from the file 'Gold_Spikeplate.md', located in the main section titled 'Gold Spikeplate'. The section summary is: The Gold Spikeplate is one of the many Curios items you can find in Black Myth: Wukong. Like the rest of these items, once found, it can be equipped from the Equipment menu.\nWith the Gold Spikeplate equipped your defense is considerably increased. Additionally, when taking hits, you deal damage to enemies surrounding enemies.\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, the item will stay at its current power throughout the game. If you want a better buff or something else to fit your build, you will need to switch it out. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Gold Spikeplate Location', and the detailed content is as follows:\nThe Gold Spikeplate can be found in The New West, specifically within the Valley of Ecstasy, Longevity Road Shrine area. Follow the road along until you reach the Dark-faced Overlord in the back of the area. Defeat it to get the Curios item.\nGold Spikeplate\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "promot_tokens_num": 307
}