{
    "chunk_id": 749509791993,
    "source_file": "Secrets_in_Black_Myth_Wukong.md",
    "content_type": "one and two",
    "h1_title": "Secrets in Black Myth Wukong",
    "h2_title": "Daoist Mi and the Snake Lady - Purple Cloud Mountain",
    "h1_content": "If you only stick to the main story in Black Myth: Wukong, you're going to miss out on a lot of the content the game has to offer. The world is packed with secrets including NPCs and their side quests that reward unique items, hidden areas, and secret bosses. If you want to fill out every record in your journal and collect all of those trophies, here's a list of all the secrets we've found across the chapters.\n### Guide in Progress\nThis page is currently in progress, so we'll keep adding secrets along the way! Check back later for more information.\n**Click on the links below to jump to:**\nChapter 1 Secrets| Chapter 2 Secrets| Chapter 3 Secrets\n---|---|---\nChapter 4 Secrets| Chapter 5 Secrets| Chapter 6 Secrets\n# Chapter 1 Secrets\nThe secrets start from the very first chapter of the game, and there's not one but two hidden bosses to uncover as you explore. The first is Elder Jinchi and the second is Red Loong. There are also Transformation Spells and missable Spirits that you'll want to bag before you wrap up the chapter.",
    "h2_content": "As you begin to follow the path in Purple Cloud Mountain, you'll encounter a weeping snake curled around a tree. To help her out, you need to find the Daoist Mi, who waits near the Petalfall Hamlet. He'll ask you to find Violet Hail for him, which you can obtain from the yellow-robed enemies in the area. Once you have it, Daoist Mi will become a boss with two phases.\n### Don't Miss This Boss!\nJust like The Scorpionlord, you won't be able to fight Daoist Mi if you head straight for The Duskveil. We'd recommend tackling him second, as you make you way up to Cloudnest Peak.",
    "promot": "This is an excerpt from the file 'Secrets_in_Black_Myth_Wukong.md', located in the main section titled 'Secrets in Black Myth Wukong'. The section summary is: If you only stick to the main story in Black Myth: Wukong, you're going to miss out on a lot of the content the game has to offer. The world is packed with secrets including NPCs and their side quests that reward unique items, hidden areas, and secret bosses. If you want to fill out every record in your journal and collect all of those trophies, here's a list of all the secrets we've found across the chapters.\n### Guide in Progress\nThis page is currently in progress, so we'll keep adding secrets along the way! Check back later for more information.\n**Click on the links below to jump to:**\nChapter 1 Secrets| Chapter 2 Secrets| Chapter 3 Secrets\n---|---|---\nChapter 4 Secrets| Chapter 5 Secrets| Chapter 6 Secrets\n# Chapter 1 Secrets\nThe secrets start from the very first chapter of the game, and there's not one but two hidden bosses to uncover as you explore. The first is Elder Jinchi and the second is Red Loong. There are also Transformation Spells and missable Spirits that you'll want to bag before you wrap up the chapter. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Daoist Mi and the Snake Lady - Purple Cloud Mountain', and the detailed content is as follows:\nAs you begin to follow the path in Purple Cloud Mountain, you'll encounter a weeping snake curled around a tree. To help her out, you need to find the Daoist Mi, who waits near the Petalfall Hamlet. He'll ask you to find Violet Hail for him, which you can obtain from the yellow-robed enemies in the area. Once you have it, Daoist Mi will become a boss with two phases.\n### Don't Miss This Boss!\nJust like The Scorpionlord, you won't be able to fight Daoist Mi if you head straight for The Duskveil. We'd recommend tackling him second, as you make you way up to Cloudnest Peak.",
    "promot_tokens_num": 458
}