{
    "chunk_id": 52071961306,
    "source_file": "Laurel_Buds.md",
    "content_type": "one and two",
    "h1_title": "Laurel Buds",
    "h2_title": "Black Myth: Wukong Laurel Buds Location",
    "h1_content": "Laurel Buds are one of the Soaks you can get for your Gourds in Black Myth: Wukong. Found a little deeper into the game, it has a rather powerful buff, which can save your life in a fight or against a tough enemy.\nWith the Laurel Buds equipped, using the Gourd will moderately increase the damage reduction for a short duration of time. This duration is rather short, but it can be the difference between life and death in a pinch or one of the tougher boss fights in the game.\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd itself, so you are stuck with the length of this damage reduction. It can't be increased, so, if you want to switch to a different Soak, be sure to head back to the Shen Monkey Vendor.",
    "h2_content": "The Laurel Buds can be found past the Lang-Li-Guhh-Baw boss to the left of the Sandgate Village - Village Entrance Shrine in Yellow Wind Ridge. Head towards where you will fight the King of Flowing Sand and Second Rat Prince. Just before that boss arena, you will see a statue.\nBy this statue, you can pick up the Laurel Buds.\nSoaks are far more plentiful than the Drinks for your Gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "promot": "This is an excerpt from the file 'Laurel_Buds.md', located in the main section titled 'Laurel Buds'. The section summary is: Laurel Buds are one of the Soaks you can get for your Gourds in Black Myth: Wukong. Found a little deeper into the game, it has a rather powerful buff, which can save your life in a fight or against a tough enemy.\nWith the Laurel Buds equipped, using the Gourd will moderately increase the damage reduction for a short duration of time. This duration is rather short, but it can be the difference between life and death in a pinch or one of the tougher boss fights in the game.\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd itself, so you are stuck with the length of this damage reduction. It can't be increased, so, if you want to switch to a different Soak, be sure to head back to the Shen Monkey Vendor. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Laurel Buds Location', and the detailed content is as follows:\nThe Laurel Buds can be found past the Lang-Li-Guhh-Baw boss to the left of the Sandgate Village - Village Entrance Shrine in Yellow Wind Ridge. Head towards where you will fight the King of Flowing Sand and Second Rat Prince. Just before that boss arena, you will see a statue.\nBy this statue, you can pick up the Laurel Buds.\nSoaks are far more plentiful than the Drinks for your Gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "promot_tokens_num": 395
}