{
    "chunk_id": 267987950951,
    "source_file": "Shigandang.md",
    "content_type": "one and two",
    "h1_title": "Shigandang",
    "h2_title": "Shigandang Boss Fight and Guide",
    "h1_content": "Shigandang is a secret optional Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Secretly buried not far from another Yaoguai King, you'll need to seek out six Buddha Statue Eyeballs to unlock this boss.\n* **Rewards:** Heart of Stone, Skhanda of Feeling, Mind Core x1, Yaoguai Core x2, 1652 Experience, 1371 Will",
    "h2_content": "Though they appear in the same arena, the Shigandang is a much harder challenge compared to the Stone Vanguard. Because of this, it’s recommended that you save challenging this foe until you’re almost complete with Chapter 2 and have a good set of gear and medicines at your disposal to increase damage negation. He’s worth defeating before you fight the final boss of this chapter, as you’ll be able to craft a new weapon upon his defeat.\n### Secret - Defeat the Stone Vanguard with the Shigandang\nIf you find yourself having trouble with the Stone Vanguard, it is possible to get some assistance from the Shigandang in an unexpected way!\nIf you haven't yet defeated the Stone Vanguard on your own but have found all six Buddha Eyeballs, you can actually summon the Shigandang before engaging the Stone Vanguard. When summoned early, he will arise and immediately fight with the Stone Vanguard. The good news is he's a lot tougher than the Stone Vanguard, and will perform a flashy finisher to tear the other rock Guai to pieces, giving you all the rewards!\nOf course, after defeating the Stone Vanguard, the Shigandang will immediately turn on you, and might be too tough to fight early if you were having problems defeating the Vanguard on your own!\nIn some ways, the Shigandang will have some familiar moves to the Stone Vanguard, most notably the ability for certain stone attacks to glow before exploding and damaging anything nearby, so whenever you see a stone pillar shoot up and glow, that’s your cue to get away.\nThe Shigandang will often start the fight by racing toward you on all fours, slamming the ground with each step that can make it hard to avoid if you don’t have a head start on sprinting back or using Cloud Step to give him the slip.\nWhen the boss leaps into the air, he’ll slam down on all fours again to send out a tremor, but will also cause a stone pillar to shoot up by whichever part of his body you're closest to. The pillar will glow (as will his front arms), and after a moment explode and deal damage, so keep strafing away to attack a different part of his body.\nWhen attacking him from the front, be ready to deal with backhanded sweeps along the ground that you can parry with Rock Solid, or dodge and keep your combo going. However, if he stands up and pulls one arm back, you can expect a surprisingly far-reaching and fast lunging punch, followed by a slam into the ground.\nOther times, he’ll lift off the ground a bit to slam one fist down, and detonate both with a small area of effect blast. This is a perfect attack to try retreating using the Thrust Stance and hitting him from a distance with a charged heavy attack while out of range of the blast.\nHowever, if he performs a larger leap into the air, he can summon several rock pillars in front of him when he slams his fists into the ground, making a direct retreat backward inadvisable! The good news is this move will often require him to pull his arms out of the ground after detonating the pillars, giving you plenty of time to hit him with big attacks.\nBe wary when trying to attack him from behind, as he’ll respond by doing a backward elbow drop into the ground, covering a wide area that will also cause spiky rocks to shoot up near the point of impact in a cone away from his body.\nThe Shigandang has a massive attack you’ll need to be on the lookout for. He’ll start by lifting an arm and a leg, before slamming down on all fours to create a massive shockwave covering a large portion of the arena. All four of his limbs will glow, and soon after will cause a massive detonation. It is possible to avoid this with a well timed pillar stance to gain height on your staff, but you’ll need to do it away from his body or the initial blast can still knock you down or damage you regardless.\nAnother deadly attack he can perform will have the Shigandang stand up on two legs and alternate two delayed punches into the ground in front of him. After this, he’ll slam both hands deep into the earth, and after a pause will rip them out, creating a line of exploding pillars in front of him you’ll want to steer clear of and attack his sides or back.\nIt’s not a bad idea to use the Azure Dust Transformation on him too, as your Rock Guai form can take the damage be dishes out and build up Might, and then perform a Rockfall attack to hit him for massive damage and stagger him.\nWith a lot of health and defense, it will take some time to chip away at this massive stone monster, but if you can avoid or deflect his big attacks and conserve your gourd uses, you’ll be able to win this endurance battle.\nDefeating the Shigandang will earn you a Mind Core, 2 Yaoguai Core, 1371 Will, and a Heart of Stone material, allowing you to craft a new weapon, the Cloud-Patterned Stone Staff! You’ll also gain the Skandha of Feeling, which is the second mysterious Skandha Key Item you can find in the game after the Skandha of Form early in Chapter 1.\nShigandang",
    "promot": "This is an excerpt from the file 'Shigandang.md', located in the main section titled 'Shigandang'. The section summary is: Shigandang is a secret optional Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Secretly buried not far from another Yaoguai King, you'll need to seek out six Buddha Statue Eyeballs to unlock this boss.\n* **Rewards:** Heart of Stone, Skhanda of Feeling, Mind Core x1, Yaoguai Core x2, 1652 Experience, 1371 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Shigandang Boss Fight and Guide', and the detailed content is as follows:\nThough they appear in the same arena, the Shigandang is a much harder challenge compared to the Stone Vanguard. Because of this, it’s recommended that you save challenging this foe until you’re almost complete with Chapter 2 and have a good set of gear and medicines at your disposal to increase damage negation. He’s worth defeating before you fight the final boss of this chapter, as you’ll be able to craft a new weapon upon his defeat.\n### Secret - Defeat the Stone Vanguard with the Shigandang\nIf you find yourself having trouble with the Stone Vanguard, it is possible to get some assistance from the Shigandang in an unexpected way!\nIf you haven't yet defeated the Stone Vanguard on your own but have found all six Buddha Eyeballs, you can actually summon the Shigandang before engaging the Stone Vanguard. When summoned early, he will arise and immediately fight with the Stone Vanguard. The good news is he's a lot tougher than the Stone Vanguard, and will perform a flashy finisher to tear the other rock Guai to pieces, giving you all the rewards!\nOf course, after defeating the Stone Vanguard, the Shigandang will immediately turn on you, and might be too tough to fight early if you were having problems defeating the Vanguard on your own!\nIn some ways, the Shigandang will have some familiar moves to the Stone Vanguard, most notably the ability for certain stone attacks to glow before exploding and damaging anything nearby, so whenever you see a stone pillar shoot up and glow, that’s your cue to get away.\nThe Shigandang will often start the fight by racing toward you on all fours, slamming the ground with each step that can make it hard to avoid if you don’t have a head start on sprinting back or using Cloud Step to give him the slip.\nWhen the boss leaps into the air, he’ll slam down on all fours again to send out a tremor, but will also cause a stone pillar to shoot up by whichever part of his body you're closest to. The pillar will glow (as will his front arms), and after a moment explode and deal damage, so keep strafing away to attack a different part of his body.\nWhen attacking him from the front, be ready to deal with backhanded sweeps along the ground that you can parry with Rock Solid, or dodge and keep your combo going. However, if he stands up and pulls one arm back, you can expect a surprisingly far-reaching and fast lunging punch, followed by a slam into the ground.\nOther times, he’ll lift off the ground a bit to slam one fist down, and detonate both with a small area of effect blast. This is a perfect attack to try retreating using the Thrust Stance and hitting him from a distance with a charged heavy attack while out of range of the blast.\nHowever, if he performs a larger leap into the air, he can summon several rock pillars in front of him when he slams his fists into the ground, making a direct retreat backward inadvisable! The good news is this move will often require him to pull his arms out of the ground after detonating the pillars, giving you plenty of time to hit him with big attacks.\nBe wary when trying to attack him from behind, as he’ll respond by doing a backward elbow drop into the ground, covering a wide area that will also cause spiky rocks to shoot up near the point of impact in a cone away from his body.\nThe Shigandang has a massive attack you’ll need to be on the lookout for. He’ll start by lifting an arm and a leg, before slamming down on all fours to create a massive shockwave covering a large portion of the arena. All four of his limbs will glow, and soon after will cause a massive detonation. It is possible to avoid this with a well timed pillar stance to gain height on your staff, but you’ll need to do it away from his body or the initial blast can still knock you down or damage you regardless.\nAnother deadly attack he can perform will have the Shigandang stand up on two legs and alternate two delayed punches into the ground in front of him. After this, he’ll slam both hands deep into the earth, and after a pause will rip them out, creating a line of exploding pillars in front of him you’ll want to steer clear of and attack his sides or back.\nIt’s not a bad idea to use the Azure Dust Transformation on him too, as your Rock Guai form can take the damage be dishes out and build up Might, and then perform a Rockfall attack to hit him for massive damage and stagger him.\nWith a lot of health and defense, it will take some time to chip away at this massive stone monster, but if you can avoid or deflect his big attacks and conserve your gourd uses, you’ll be able to win this endurance battle.\nDefeating the Shigandang will earn you a Mind Core, 2 Yaoguai Core, 1371 Will, and a Heart of Stone material, allowing you to craft a new weapon, the Cloud-Patterned Stone Staff! You’ll also gain the Skandha of Feeling, which is the second mysterious Skandha Key Item you can find in the game after the Skandha of Form early in Chapter 1.\nShigandang",
    "promot_tokens_num": 1258
}