{
    "chunk_id": 687890748892,
    "source_file": "Rusty-Gold_Cart.md",
    "content_type": "one and two",
    "h1_title": "Rusty-Gold Cart",
    "h2_title": "Rusty-Gold Cart Boss Fight and Guide",
    "h1_content": "Rusty-Gold Cart is a Yaoguai Chief boss fight that you'll go up against toward the end of Chapter 5 in Black Myth: Wukong. This is the final of the Five Element Carts and will allow you to get into the Chapter's Secret Area - Bishui Cave.",
    "h2_content": "Let the cutscene  out as you approach and see the Pale-Axe Stalwart from the mouth of the cart, and then be prepared to use everything you've got against the most aggressive coffin cart of the Chapter.\nIt will combine the movesets from the previous three carts you've encountered and add its own to the mix. While some moves will seem familiar, others you'll need to learn to avoid.\nUse Immobilize when you can to stop it from zooming around and follow up with combo attacks quickly. Landing heavy attacks in this manner will knock the cart down, leaving it vulnerable to further follow-up attacks.\nThe way the cart s with fire will also differ. It will spin around while spewing fire from the front to try and get you. When this happens, stick close to it and spin with it. If you get caught with this move, throw on the Fireproof Mantle to negate some of the fire damage. Another variation you'll see is it spitting fireballs. For this move, it will aim the fireballs and spit them out, and you can dash out of the way to miss them entirely.\nLastly is the difference in punches. The cart will lunge and take swipes at you but also punch the ground like the other carts. To make things trickier, it will also try to grab you.\nWhen it does go to take a swipe at you, try to roll toward it. You'll either end up going underneath it or to the side of it and dodging the attack.\nRusty-Gold Cart",
    "promot": "This is an excerpt from the file 'Rusty-Gold_Cart.md', located in the main section titled 'Rusty-Gold Cart'. The section summary is: Rusty-Gold Cart is a Yaoguai Chief boss fight that you'll go up against toward the end of Chapter 5 in Black Myth: Wukong. This is the final of the Five Element Carts and will allow you to get into the Chapter's Secret Area - Bishui Cave. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Rusty-Gold Cart Boss Fight and Guide', and the detailed content is as follows:\nLet the cutscene  out as you approach and see the Pale-Axe Stalwart from the mouth of the cart, and then be prepared to use everything you've got against the most aggressive coffin cart of the Chapter.\nIt will combine the movesets from the previous three carts you've encountered and add its own to the mix. While some moves will seem familiar, others you'll need to learn to avoid.\nUse Immobilize when you can to stop it from zooming around and follow up with combo attacks quickly. Landing heavy attacks in this manner will knock the cart down, leaving it vulnerable to further follow-up attacks.\nThe way the cart s with fire will also differ. It will spin around while spewing fire from the front to try and get you. When this happens, stick close to it and spin with it. If you get caught with this move, throw on the Fireproof Mantle to negate some of the fire damage. Another variation you'll see is it spitting fireballs. For this move, it will aim the fireballs and spit them out, and you can dash out of the way to miss them entirely.\nLastly is the difference in punches. The cart will lunge and take swipes at you but also punch the ground like the other carts. To make things trickier, it will also try to grab you.\nWhen it does go to take a swipe at you, try to roll toward it. You'll either end up going underneath it or to the side of it and dodging the attack.\nRusty-Gold Cart",
    "promot_tokens_num": 447
}