{
    "chunk_id": 983099635776,
    "source_file": "Xu_Dog_Questline.md",
    "content_type": "one and two",
    "h1_title": "Xu Dog Questline",
    "h2_title": "In the Sandgate Village",
    "h1_content": "The Xu Dog is a friendly character and merchant you can meet in Chapter 2 of Black Myth Wukong. This character will teach you the art of crafting consumable medicine, and eventually allow you to invest in passive buffs.",
    "h2_content": "You can first encounter the **Xu Dog** just outside the Sandgate Village of Chapter 2’s Yellow Wind Ridge. Once you first enter the region, head along the main path across the pond and left along a ridge to reach the **Village Entrance Shrine**.\nLook just beyond the shrine for a small ditch running under a wooden bridge. Follow the ditch through the opposite path under the bridge, and head right to a tunnel. Inside, apart from a green Wisp you can absorb for some Will and a mushroom to harvest, you can spot a grubby yet friendly canine deity.\nThe Xu Dog has a problem he needs help with: A **large frog** has swallowed one of his medicinal formulas, and you’re just the person he’s looking for to get it back. You’ll find the frog miniboss Lang-Li-Guhh-Baw nearby in a large pit, and it can employ electrical attacks to defend itself.\nOnce you defeat this frog boss, he’ll drop the **Evil Repelling Medicament formula**. Return it to the Xu dog back outside the pit. Not only will he reward you with **2 Evil Repelling Medicament** for your trouble, but you’ll also unlock the ability to **create all sorts of consumables yourself** at any Shrine. With all the materials you’ve been harvesting, you can stock up on defensive, offensive, and status reducing consumables.",
    "promot": "This is an excerpt from the file 'Xu_Dog_Questline.md', located in the main section titled 'Xu Dog Questline'. The section summary is: The Xu Dog is a friendly character and merchant you can meet in Chapter 2 of Black Myth Wukong. This character will teach you the art of crafting consumable medicine, and eventually allow you to invest in passive buffs. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'In the Sandgate Village', and the detailed content is as follows:\nYou can first encounter the **Xu Dog** just outside the Sandgate Village of Chapter 2’s Yellow Wind Ridge. Once you first enter the region, head along the main path across the pond and left along a ridge to reach the **Village Entrance Shrine**.\nLook just beyond the shrine for a small ditch running under a wooden bridge. Follow the ditch through the opposite path under the bridge, and head right to a tunnel. Inside, apart from a green Wisp you can absorb for some Will and a mushroom to harvest, you can spot a grubby yet friendly canine deity.\nThe Xu Dog has a problem he needs help with: A **large frog** has swallowed one of his medicinal formulas, and you’re just the person he’s looking for to get it back. You’ll find the frog miniboss Lang-Li-Guhh-Baw nearby in a large pit, and it can employ electrical attacks to defend itself.\nOnce you defeat this frog boss, he’ll drop the **Evil Repelling Medicament formula**. Return it to the Xu dog back outside the pit. Not only will he reward you with **2 Evil Repelling Medicament** for your trouble, but you’ll also unlock the ability to **create all sorts of consumables yourself** at any Shrine. With all the materials you’ve been harvesting, you can stock up on defensive, offensive, and status reducing consumables.",
    "promot_tokens_num": 399
}