{
    "chunk_id": 927064455827,
    "source_file": "Daoist's_Basket_of_Fire_and_Water.md",
    "content_type": "one and two",
    "h1_title": "Daoist's Basket of Fire and Water",
    "h2_title": "Black Myth: Wukong Daoist's Basket of Fire and Water Location",
    "h1_content": "The Daoist's Basket of Fire and Water is one of the many Curios items you can find in Black Myth: Wukong. Like the rest of these items, once found, it can be equipped from the Equipment menu.\nWith the Daoist's Basket of Fire and Water equipped your Burn-inflicting and Chill-inflicting Transformation Spells will have their attack power moderately increased.\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, the item will stay at its current power throughout the game. If you want a better buff or something else to fit your build, you will need to switch it out.",
    "h2_content": "The Daoist's Basket of Fire and Water can be found in the Flaming Mountains upon defeating the Bishui Golden-Eyed Beast.\nDaoist's Basket of Fire and Water\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "promot": "This is an excerpt from the file 'Daoist's_Basket_of_Fire_and_Water.md', located in the main section titled 'Daoist's Basket of Fire and Water'. The section summary is: The Daoist's Basket of Fire and Water is one of the many Curios items you can find in Black Myth: Wukong. Like the rest of these items, once found, it can be equipped from the Equipment menu.\nWith the Daoist's Basket of Fire and Water equipped your Burn-inflicting and Chill-inflicting Transformation Spells will have their attack power moderately increased.\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, the item will stay at its current power throughout the game. If you want a better buff or something else to fit your build, you will need to switch it out. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Daoist's Basket of Fire and Water Location', and the detailed content is as follows:\nThe Daoist's Basket of Fire and Water can be found in the Flaming Mountains upon defeating the Bishui Golden-Eyed Beast.\nDaoist's Basket of Fire and Water\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "promot_tokens_num": 311
}