{
    "chunk_id": 378230888364,
    "source_file": "Man-in-Stone.md",
    "content_type": "one and two",
    "h1_title": "Man-in-Stone",
    "h2_title": "Where to Find the Man-in-Stone",
    "h1_content": "The Man-in-Stone is a optional Character questline culminating in a boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Located in a crevice of the Fright Cliff, you'll have to help the man trapped in stone recover an item, and then beat him up to earn your reward.\n* **Rewards:** Azure Dust Transformation Spell, 758 Experience, 756 Will",
    "h2_content": "As an optional character you can meet, the Man-in-Stone can easily be missed, but shouldn't if you want to unlock an important spell. He's located in a small crevice of the Fright Cliff, found by heading to the right of the Squall Hideout below a large ruin.\nIn order to fight him, you'll first need to complete his questline by defeating the Mother of Stones found in a large cave tunnel to the left, and return the Stone Essence to him. He'll then mock you for being gullible enough to give him the stone, and you'll then be able to fight him for the prize.",
    "promot": "This is an excerpt from the file 'Man-in-Stone.md', located in the main section titled 'Man-in-Stone'. The section summary is: The Man-in-Stone is a optional Character questline culminating in a boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Located in a crevice of the Fright Cliff, you'll have to help the man trapped in stone recover an item, and then beat him up to earn your reward.\n* **Rewards:** Azure Dust Transformation Spell, 758 Experience, 756 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find the Man-in-Stone', and the detailed content is as follows:\nAs an optional character you can meet, the Man-in-Stone can easily be missed, but shouldn't if you want to unlock an important spell. He's located in a small crevice of the Fright Cliff, found by heading to the right of the Squall Hideout below a large ruin.\nIn order to fight him, you'll first need to complete his questline by defeating the Mother of Stones found in a large cave tunnel to the left, and return the Stone Essence to him. He'll then mock you for being gullible enough to give him the stone, and you'll then be able to fight him for the prize.",
    "promot_tokens_num": 281
}