{
    "chunk_id": 44669412879,
    "source_file": "Daoist_Mi.md",
    "content_type": "one and two",
    "h1_title": "Daoist Mi",
    "h2_title": "Where to Find the Daoist Mi",
    "h1_content": "The Daoist Mi is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the secret area of the Purple Cloud Mountain, the Daoist Mi will have a quest for you before you can face him in battle.\n* Rewards: Violet Hail Transformation Spell, Refined Iron Sand, 1562 Experience, 1451 Will",
    "h2_content": "The Daoist Mi is an initially non-hostile NPC that is found while exploring the secret area in Purple Cloud Mountain -- which you can activate by defeating the Venom Daoist twice both in the Webbed Hollow and Temple of Yellow Flowers.\nAfter resting at the Petalfall Hamlet Shrine, head up the path and across a small bridge to enter the small village. It's now overrun by various Daoists, which shouldn't prove too much of a problem if you take them out one at a time.\nHowever, after climbing some stairs, you'll come across a special Sword Daoist ing a flute, and does not appear hostile. He'll actually ask a favor of you, noting that his fellow Daoists have all been partaking of Amourworm eggs, turning them into undying husks. He'll ask you to seek one out and return it to him.\nWhile it may sound like he's asking you to seek out a Worm Practitioner, in reality any of the Daoists you defeat in this hamlet has a chance to drop the item he seeks. We'll clear the village out before returning to him, but you may also need to rest and respawn them if you don't find one.\nHowever, once you return it to him, he'll reveal that he want the egg's power all to himself, and is willing to kill for it.",
    "promot": "This is an excerpt from the file 'Daoist_Mi.md', located in the main section titled 'Daoist Mi'. The section summary is: The Daoist Mi is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the secret area of the Purple Cloud Mountain, the Daoist Mi will have a quest for you before you can face him in battle.\n* Rewards: Violet Hail Transformation Spell, Refined Iron Sand, 1562 Experience, 1451 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find the Daoist Mi', and the detailed content is as follows:\nThe Daoist Mi is an initially non-hostile NPC that is found while exploring the secret area in Purple Cloud Mountain -- which you can activate by defeating the Venom Daoist twice both in the Webbed Hollow and Temple of Yellow Flowers.\nAfter resting at the Petalfall Hamlet Shrine, head up the path and across a small bridge to enter the small village. It's now overrun by various Daoists, which shouldn't prove too much of a problem if you take them out one at a time.\nHowever, after climbing some stairs, you'll come across a special Sword Daoist ing a flute, and does not appear hostile. He'll actually ask a favor of you, noting that his fellow Daoists have all been partaking of Amourworm eggs, turning them into undying husks. He'll ask you to seek one out and return it to him.\nWhile it may sound like he's asking you to seek out a Worm Practitioner, in reality any of the Daoists you defeat in this hamlet has a chance to drop the item he seeks. We'll clear the village out before returning to him, but you may also need to rest and respawn them if you don't find one.\nHowever, once you return it to him, he'll reveal that he want the egg's power all to himself, and is willing to kill for it.",
    "promot_tokens_num": 419
}