{
    "chunk_id": 255627854000,
    "source_file": "Red_Boy.md",
    "content_type": "one and two",
    "h1_title": "Red Boy",
    "h2_title": "Red Boy Boss Fight and Guide",
    "h1_content": "Red Boy is one of the Yaoguai Kings you'll need to fight at the end of Chapter 5 in Black Myth: Wukong. This agile fighter will use flames and duplicates to try and overwhelm you during this heated altercation at the end of the chapter.",
    "h2_content": "The Red Boy is incredibly agile, and he'll move quickly around the clearing, twisting and turning to lunge at you using his spear. However, his combos are thankfully short, so you'll only need to dodge a couple of times to avoid these swiping attacks and be able to follow up with your own.\nThat being said, if you're lucky, you'll experience moments where he actually stands still for a few seconds, preparing to attack. Take advantage of these opportunities when they present themselves, to get in as many hits as possible before he starts a combo of fire assaults.\nWhen he does stand still -- or he's pausing from his own combos -- you won't be able to finish a combo of your own. It's best to just get a few hits in, then immediately jump back. This is because he'll breathe fire in a small arc directly in front of him as soon as you've hit him a few times.\nAs you'd expect from the final boss of The Flaming Mountains, the Red Boy uses a weapon imbued with fire and projectile fire attacks. For this reason, we'd recommend you stock up on Body-Cooling Powder and equip your Fireproof Mantle to help you should you start to take too much elemental damage.\nWhen he winds his staff to create a ring of fire, the attack looks a lot worse than it actually is. He'll throw out the ring toward you and it will start to bounce around the clearing. Keep track of it by looking up and following it to stay away from where it lands. If you keep moving, it's fairly easy to avoid. After bouncing around a few times, the Red Boy will slam down into the ground to recover the spear. There's a brief pause here while he composes himself, so you'll be able to rush in to attack.\nIf he performs the combination of moves where he twirls the spear around him, he'll perform a leap and thrust his spear into the ground, then flip toward you. When he does this, he'll follow it up immediately with a flamethrower from his hand. It's best to dodge all of this moveset, then attack.\nThough it's tempting to create distance, it's better to stay close to the Red Boy during this fight. Not only will this allow you to take advantage of those pauses we mentioned previously, but it also means he's less likely to use projectiles. If you're too far away, he'll shoot fire along the ground to try and reach you.\nWhen his health reaches the halfway point, he'll launch himself up in the air. Shortly after, he'll create duplicates of himself that will appear all around him. These will launch themselves at you with their spears, resulting in an explosion. It'll start with one duplicate launching themselves at you, then two, and finally, a set of three will attack.\nThe best way to approach this is to stay locked on the Red Boy, but move as far back in the area as you can. If you need to, use any rocks nearby that haven't been destroyed. You can then dodge in any direction to evade the attacks and do a quick double tap of dodge when you have multiple duplicates coming at you. If you're finding it difficult to dodge the attacks, Cloudstep can help you direct some of the attention away from yourself.\nOnce the duplicates are gone, he will immediately follow with a strong attack. Most of his attacks can actually be interrupted by your own heavy attack, so try to build focus with cautious half-combos or equip items that will let you gain it quickly. Performing heavy attacks will stagger him and stop him from going into certain moves entirely if timed right.\nWhen he's back down on the floor after sending out the duplicates, his attacks will be way more aggressive and he'll be more agile. You'll find that he repeats the same variations of attack, they'll just have a wider reach. For example, he'll spin his spear for longer, resulting in fire emerging around him, and then will leave areas of the ground covered in flames.\nYou can approach the second part of the fight in much the same way you did the first, and if you haven't used too many spells, now is the time to unleash them and get the rest of his health down as soon as possible.\nRed Boy\nAfter being the Red Boy, the Bull King will reveal the stone that was kept in his belly. At the end of the conversation, the Red Boy's body will begin to disappear. But before The Destined One can collect the stone, the Red Boy emerges, showing that he used a False Death Talisman and is actually alive. He consumes the stone and immediately transforms into the Yaksha King.",
    "promot": "This is an excerpt from the file 'Red_Boy.md', located in the main section titled 'Red Boy'. The section summary is: Red Boy is one of the Yaoguai Kings you'll need to fight at the end of Chapter 5 in Black Myth: Wukong. This agile fighter will use flames and duplicates to try and overwhelm you during this heated altercation at the end of the chapter. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Red Boy Boss Fight and Guide', and the detailed content is as follows:\nThe Red Boy is incredibly agile, and he'll move quickly around the clearing, twisting and turning to lunge at you using his spear. However, his combos are thankfully short, so you'll only need to dodge a couple of times to avoid these swiping attacks and be able to follow up with your own.\nThat being said, if you're lucky, you'll experience moments where he actually stands still for a few seconds, preparing to attack. Take advantage of these opportunities when they present themselves, to get in as many hits as possible before he starts a combo of fire assaults.\nWhen he does stand still -- or he's pausing from his own combos -- you won't be able to finish a combo of your own. It's best to just get a few hits in, then immediately jump back. This is because he'll breathe fire in a small arc directly in front of him as soon as you've hit him a few times.\nAs you'd expect from the final boss of The Flaming Mountains, the Red Boy uses a weapon imbued with fire and projectile fire attacks. For this reason, we'd recommend you stock up on Body-Cooling Powder and equip your Fireproof Mantle to help you should you start to take too much elemental damage.\nWhen he winds his staff to create a ring of fire, the attack looks a lot worse than it actually is. He'll throw out the ring toward you and it will start to bounce around the clearing. Keep track of it by looking up and following it to stay away from where it lands. If you keep moving, it's fairly easy to avoid. After bouncing around a few times, the Red Boy will slam down into the ground to recover the spear. There's a brief pause here while he composes himself, so you'll be able to rush in to attack.\nIf he performs the combination of moves where he twirls the spear around him, he'll perform a leap and thrust his spear into the ground, then flip toward you. When he does this, he'll follow it up immediately with a flamethrower from his hand. It's best to dodge all of this moveset, then attack.\nThough it's tempting to create distance, it's better to stay close to the Red Boy during this fight. Not only will this allow you to take advantage of those pauses we mentioned previously, but it also means he's less likely to use projectiles. If you're too far away, he'll shoot fire along the ground to try and reach you.\nWhen his health reaches the halfway point, he'll launch himself up in the air. Shortly after, he'll create duplicates of himself that will appear all around him. These will launch themselves at you with their spears, resulting in an explosion. It'll start with one duplicate launching themselves at you, then two, and finally, a set of three will attack.\nThe best way to approach this is to stay locked on the Red Boy, but move as far back in the area as you can. If you need to, use any rocks nearby that haven't been destroyed. You can then dodge in any direction to evade the attacks and do a quick double tap of dodge when you have multiple duplicates coming at you. If you're finding it difficult to dodge the attacks, Cloudstep can help you direct some of the attention away from yourself.\nOnce the duplicates are gone, he will immediately follow with a strong attack. Most of his attacks can actually be interrupted by your own heavy attack, so try to build focus with cautious half-combos or equip items that will let you gain it quickly. Performing heavy attacks will stagger him and stop him from going into certain moves entirely if timed right.\nWhen he's back down on the floor after sending out the duplicates, his attacks will be way more aggressive and he'll be more agile. You'll find that he repeats the same variations of attack, they'll just have a wider reach. For example, he'll spin his spear for longer, resulting in fire emerging around him, and then will leave areas of the ground covered in flames.\nYou can approach the second part of the fight in much the same way you did the first, and if you haven't used too many spells, now is the time to unleash them and get the rest of his health down as soon as possible.\nRed Boy\nAfter being the Red Boy, the Bull King will reveal the stone that was kept in his belly. At the end of the conversation, the Red Boy's body will begin to disappear. But before The Destined One can collect the stone, the Red Boy emerges, showing that he used a False Death Talisman and is actually alive. He consumes the stone and immediately transforms into the Yaksha King.",
    "promot_tokens_num": 1072
}