{
    "chunk_id": 152811187960,
    "source_file": "Black_Loong.md",
    "content_type": "one and two",
    "h1_title": "Black Loong",
    "h2_title": "Black Loong Boss Fight and Guide",
    "h1_content": "Black Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Hidden beyond a waterfall of sand in the Fright Cliff, you won't be able to encounter this boss until you obtain a Key Item elswhere in this chapter, Black Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n* **Rewards:** Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1",
    "h2_content": "The Black Loong is a fearsome dragon standing on two legs and wielding a pair of giant maces imbued with his electricity, which he can employ to create different kinds of shockwaves that deal incredible damage. Though you can face him early on in Chapter 2 once you find the Loong Scales, it’s recommended you wait until you’ve completed Chapter 2 or even started Chapter 3 before taking him on.\nIn particular, it’s a good idea to stock up on medicine to increase your shock resistance, and buy the Thunderbolt Horn Soak from the Shen Monkey as well.\nAny time you see the Black Loong’s weapons flare to life and crackle, you can expect them to detonate with massive electrical explosions whenever they slam into the ground. In particular, he can use a large leaping slam to cause a sizable explosion you’ll need to avoid with a well-timed dodge. He’ll often end this slam by dragging his weapons around to his sides, so try to evade backwards or get around to his back before retaliating.\nHe also has a variety of melee swings - sometimes swinging both weapons in slow arcs to slam in the ground one after the other before a third and final electrical slam. Other times he’ll alternate slamming the ground with each weapon while it’s imbued on either side of his body.\nThe Black Loong has a particularly devastating but slow combo where he’ll begin to swing a weapon in the air above his head and then swing it down in a sweeping electrical arc in front of him, before doing the same as his other weapon. Thankfully the movements are very slow and easy to dodge if you aren’t using up all your stamina when attacking. They do however send out currents in front of him, so don’t think that just backpedaling will be enough to stop you from getting hurt.\nSometimes he’ll end the two sweeping electrical swings by finally bringing both weapons together in front of him, and create a shockwave with an expanding electrical ring as they connect that you’ll need to dodge or jump over — or even rise up on your Pillar Stance to retaliate with a heavy attack as it passes under you.\nAnother lengthy combo that can be hard to get away from will be when Black Loong starts to repeatedly pound the ground with alternate weapon slams, expelling electric blasts from each one. This can go on for up to nine slams, with the final attack being the one that causes the biggest explosion. If you try to interrupt him with Immobilize, be sure to follow up with a strong attack that can stagger, or he’ll simply keep the combo going.\nIf you spot the Black Loong raising his weapons high in a slow manner while they crackle to life, it’s a sign he’s going to bang them together slowly three times, causing explosions in the air that gradually increase in range. This is a good time to sprint to safety and use your medicines while you wait for the attack to end.\nHowever, the most dire of his attacks will come when he seems to emit even more electricity coming from his mouth and arcing around his body. Listen carefully to the drumbeat of the music, as he’ll start to pound the very earth in time with the drum beats, causing several rings of electric energy to expel outward.\nGetting hit by even a few of these will quickly deplete your healthbar, and you’ll have to stop everything to focus on evasion. While it is possible to get on top of your staff in the Pillar Stance, each electric ring will take a chunk out of your stamina, and this segment lasts far too long to wait out in this style.\nYou need to also be ready for his final slam, which he’ll do with both weapons, but won’t send out a ring. He’s being sneaky here to lure you into advancing on him, but will detonate his weapons after a pause to send out one final quick electric ring!\nOne method to evade reliably is to listen to the drum beats to anticipate the spacing of the rings, and then dodge parallel to Black Loong, moving from side to side as you evade, instead of toward the next ring or backward into a previous one. It will take a bit of practice, so having electric resistance augmented can help when you slip up.\nAnother cheekier way to evade this attack is to simply find some high ground. There are a few raised rocks in the arena — some that he may destroy over time — but can be used to get off the floor where the electric rings travel. There’s one large rock as you first enter the arena, two more near the back on either side of the stairs, and one more opposite the stairs in the far corner.\nFinally, Black Loong can also employ a sandstorm similar to the Yellow Wind Sage. He’ll start to spin his weapons around as he marches toward you, and a sandstorm vortex will spread out to capture you within. You’ll be essentially pulled into its grip, forcing you extremely close to Black Loong, at which point he’ll stop spinning his weapons and slam them outward from his body, causing a massive detonation that’s hard to dodge with low visibility and movement options.\nLuckily, just like the Yellow Wind Sage, you can negate this attack entirely by using the Wind Tamer Vessel gained from defeating the Fuban boss of the Chapter 2 Secret area. This will not only shatter the sandstorm, but stun him for several seconds as well!\nLearning the electric ring dance is arguably the hardest part of this fight, as is evading his sandstorm if you can’t dissipate it. Immobilize can help you get some breathing room, but it’s harder to stagger him out of attacks, and even Rock Solid deflections aren’t guaranteed to stop his assaults. However, the Azure Dust Transformation can reliably keep him stumbling with many of its attacks, and sometimes even knock him out of his attempts to create rings of electricity altogether! You can also try using the Pluck of Many to disorient him with attacks on all sides, and use that time wisely to charge up your strikes when he’s distracted.\nWhen the Black Loong falls, you’ll earn plenty of rewards, including a Loong Pearl, Mind Core, 2 Refined Iron Sand, 1576 Will, and 2770 Experience. In addition to this, you can find a gold chest nearby that contains a Tridacna Pendant curio, and a Thunderbone weapon material — one of two Loong materials needed to craft the Loongwreathe Staff!\nBlack Loong",
    "promot": "This is an excerpt from the file 'Black_Loong.md', located in the main section titled 'Black Loong'. The section summary is: Black Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Hidden beyond a waterfall of sand in the Fright Cliff, you won't be able to encounter this boss until you obtain a Key Item elswhere in this chapter, Black Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n* **Rewards:** Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1 This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Loong Boss Fight and Guide', and the detailed content is as follows:\nThe Black Loong is a fearsome dragon standing on two legs and wielding a pair of giant maces imbued with his electricity, which he can employ to create different kinds of shockwaves that deal incredible damage. Though you can face him early on in Chapter 2 once you find the Loong Scales, it’s recommended you wait until you’ve completed Chapter 2 or even started Chapter 3 before taking him on.\nIn particular, it’s a good idea to stock up on medicine to increase your shock resistance, and buy the Thunderbolt Horn Soak from the Shen Monkey as well.\nAny time you see the Black Loong’s weapons flare to life and crackle, you can expect them to detonate with massive electrical explosions whenever they slam into the ground. In particular, he can use a large leaping slam to cause a sizable explosion you’ll need to avoid with a well-timed dodge. He’ll often end this slam by dragging his weapons around to his sides, so try to evade backwards or get around to his back before retaliating.\nHe also has a variety of melee swings - sometimes swinging both weapons in slow arcs to slam in the ground one after the other before a third and final electrical slam. Other times he’ll alternate slamming the ground with each weapon while it’s imbued on either side of his body.\nThe Black Loong has a particularly devastating but slow combo where he’ll begin to swing a weapon in the air above his head and then swing it down in a sweeping electrical arc in front of him, before doing the same as his other weapon. Thankfully the movements are very slow and easy to dodge if you aren’t using up all your stamina when attacking. They do however send out currents in front of him, so don’t think that just backpedaling will be enough to stop you from getting hurt.\nSometimes he’ll end the two sweeping electrical swings by finally bringing both weapons together in front of him, and create a shockwave with an expanding electrical ring as they connect that you’ll need to dodge or jump over — or even rise up on your Pillar Stance to retaliate with a heavy attack as it passes under you.\nAnother lengthy combo that can be hard to get away from will be when Black Loong starts to repeatedly pound the ground with alternate weapon slams, expelling electric blasts from each one. This can go on for up to nine slams, with the final attack being the one that causes the biggest explosion. If you try to interrupt him with Immobilize, be sure to follow up with a strong attack that can stagger, or he’ll simply keep the combo going.\nIf you spot the Black Loong raising his weapons high in a slow manner while they crackle to life, it’s a sign he’s going to bang them together slowly three times, causing explosions in the air that gradually increase in range. This is a good time to sprint to safety and use your medicines while you wait for the attack to end.\nHowever, the most dire of his attacks will come when he seems to emit even more electricity coming from his mouth and arcing around his body. Listen carefully to the drumbeat of the music, as he’ll start to pound the very earth in time with the drum beats, causing several rings of electric energy to expel outward.\nGetting hit by even a few of these will quickly deplete your healthbar, and you’ll have to stop everything to focus on evasion. While it is possible to get on top of your staff in the Pillar Stance, each electric ring will take a chunk out of your stamina, and this segment lasts far too long to wait out in this style.\nYou need to also be ready for his final slam, which he’ll do with both weapons, but won’t send out a ring. He’s being sneaky here to lure you into advancing on him, but will detonate his weapons after a pause to send out one final quick electric ring!\nOne method to evade reliably is to listen to the drum beats to anticipate the spacing of the rings, and then dodge parallel to Black Loong, moving from side to side as you evade, instead of toward the next ring or backward into a previous one. It will take a bit of practice, so having electric resistance augmented can help when you slip up.\nAnother cheekier way to evade this attack is to simply find some high ground. There are a few raised rocks in the arena — some that he may destroy over time — but can be used to get off the floor where the electric rings travel. There’s one large rock as you first enter the arena, two more near the back on either side of the stairs, and one more opposite the stairs in the far corner.\nFinally, Black Loong can also employ a sandstorm similar to the Yellow Wind Sage. He’ll start to spin his weapons around as he marches toward you, and a sandstorm vortex will spread out to capture you within. You’ll be essentially pulled into its grip, forcing you extremely close to Black Loong, at which point he’ll stop spinning his weapons and slam them outward from his body, causing a massive detonation that’s hard to dodge with low visibility and movement options.\nLuckily, just like the Yellow Wind Sage, you can negate this attack entirely by using the Wind Tamer Vessel gained from defeating the Fuban boss of the Chapter 2 Secret area. This will not only shatter the sandstorm, but stun him for several seconds as well!\nLearning the electric ring dance is arguably the hardest part of this fight, as is evading his sandstorm if you can’t dissipate it. Immobilize can help you get some breathing room, but it’s harder to stagger him out of attacks, and even Rock Solid deflections aren’t guaranteed to stop his assaults. However, the Azure Dust Transformation can reliably keep him stumbling with many of its attacks, and sometimes even knock him out of his attempts to create rings of electricity altogether! You can also try using the Pluck of Many to disorient him with attacks on all sides, and use that time wisely to charge up your strikes when he’s distracted.\nWhen the Black Loong falls, you’ll earn plenty of rewards, including a Loong Pearl, Mind Core, 2 Refined Iron Sand, 1576 Will, and 2770 Experience. In addition to this, you can find a gold chest nearby that contains a Tridacna Pendant curio, and a Thunderbone weapon material — one of two Loong materials needed to craft the Loongwreathe Staff!\nBlack Loong",
    "promot_tokens_num": 1509
}