{
    "chunk_id": 955695090278,
    "source_file": "Keeper_of_the_Flaming_Mountains_and_Yin-Yang_Fish.md",
    "content_type": "one and two",
    "h1_title": "Keeper of the Flaming Mountains and Yin-Yang Fish",
    "h2_title": "How to Find the Keeper of the Flaming Mountains and Yin-Yang Fish",
    "h1_content": "The Keeper of the Flaming Mountains is a Character boss, while the Yin-Yang Fish is a Yaoguai King you'll fight at the start of The Emerald Hall in Chapter 5 in Black Myth: Wukong. The Keeper of the Flaming Mountains is a master of deception and uses his Yin-Yang ability to produce more than just the Yin-Yang Fish in this showdown.",
    "h2_content": "From The Emerald Hall Keeper's Shrine, go left and up the stairs. A cutscene will start to , where you'll transform into a Cicada and fly toward the center of the hall. This is where you'll find Pingping speaking to her mother, Rakshasi, accompanied by the Keeper of the Flaming Mountains.\nAfter they discuss The Destined One obtaining the relics, the Keeper of the Flaming Mountains offers to care for Rakshashi, which Pingping protests. After he binds Pingping, Rakshashi is revealed to be Zhu Bajie transformed and it's time to take on the Keeper of the Flaming Mountains for yourself.",
    "promot": "This is an excerpt from the file 'Keeper_of_the_Flaming_Mountains_and_Yin-Yang_Fish.md', located in the main section titled 'Keeper of the Flaming Mountains and Yin-Yang Fish'. The section summary is: The Keeper of the Flaming Mountains is a Character boss, while the Yin-Yang Fish is a Yaoguai King you'll fight at the start of The Emerald Hall in Chapter 5 in Black Myth: Wukong. The Keeper of the Flaming Mountains is a master of deception and uses his Yin-Yang ability to produce more than just the Yin-Yang Fish in this showdown. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'How to Find the Keeper of the Flaming Mountains and Yin-Yang Fish', and the detailed content is as follows:\nFrom The Emerald Hall Keeper's Shrine, go left and up the stairs. A cutscene will start to , where you'll transform into a Cicada and fly toward the center of the hall. This is where you'll find Pingping speaking to her mother, Rakshasi, accompanied by the Keeper of the Flaming Mountains.\nAfter they discuss The Destined One obtaining the relics, the Keeper of the Flaming Mountains offers to care for Rakshashi, which Pingping protests. After he binds Pingping, Rakshashi is revealed to be Zhu Bajie transformed and it's time to take on the Keeper of the Flaming Mountains for yourself.",
    "promot_tokens_num": 303
}