{
    "chunk_id": 991018156918,
    "source_file": "Goat_Skull.md",
    "content_type": "one and two",
    "h1_title": "Goat Skull",
    "h2_title": "Black Myth: Wukong Goat Skull Location",
    "h1_content": "Goat Skull is one of the Soaks for your Gourds that can be found throughout Black Myth: Wukong. It can be quite easy to miss if you aren't exploring thoroughly. But, the buff it offers is definitely useful for those looking for a pick-me-up in the middle of a fight.\nWith the Goat Skull equipped, using the Gourd moderately increases maximum health for a short duration. This duration is rather brief, but in the middle of a fight or when at low health, it can give you an extra buffer beyond your regular health to either be more aggressive, or flee and take out an enemy or two on the way.\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd itself, so you are stuck with the length of this health boost. It can't be increased. Therefore, if you want to switch to a different Soak, be sure to visit the Shen Monkey Vendor throughout your game to continue equipping new ones.",
    "h2_content": "The Goat Skull can be found at random by picking up Licorice\") plants. There isn't a set location or spot, you will just need to search for the purple Licorice plants throughout the game's chapters and hope that it drops for you. Chapter 2 - Yellow Wind Ridge has the most, especially in the early Sandgate Village area.\nIt isn't a super rare drop, so chances are you should find the Goat Skull quickly in Chapter 2.\nSoaks are far more plentiful than the Drinks for your Gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "promot": "This is an excerpt from the file 'Goat_Skull.md', located in the main section titled 'Goat Skull'. The section summary is: Goat Skull is one of the Soaks for your Gourds that can be found throughout Black Myth: Wukong. It can be quite easy to miss if you aren't exploring thoroughly. But, the buff it offers is definitely useful for those looking for a pick-me-up in the middle of a fight.\nWith the Goat Skull equipped, using the Gourd moderately increases maximum health for a short duration. This duration is rather brief, but in the middle of a fight or when at low health, it can give you an extra buffer beyond your regular health to either be more aggressive, or flee and take out an enemy or two on the way.\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd itself, so you are stuck with the length of this health boost. It can't be increased. Therefore, if you want to switch to a different Soak, be sure to visit the Shen Monkey Vendor throughout your game to continue equipping new ones. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Goat Skull Location', and the detailed content is as follows:\nThe Goat Skull can be found at random by picking up Licorice\") plants. There isn't a set location or spot, you will just need to search for the purple Licorice plants throughout the game's chapters and hope that it drops for you. Chapter 2 - Yellow Wind Ridge has the most, especially in the early Sandgate Village area.\nIt isn't a super rare drop, so chances are you should find the Goat Skull quickly in Chapter 2.\nSoaks are far more plentiful than the Drinks for your Gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "promot_tokens_num": 440
}