{
    "chunk_id": 360777101316,
    "source_file": "Loong_Balm.md",
    "content_type": "one and two",
    "h1_title": "Loong Balm",
    "h2_title": "Black Myth: Wukong Loong Balm Location",
    "h1_content": "Loong Balm is the final of the Drinks in Black Myth: Wukong that can be found in the world. The last one, the A Thousand Days Inebriation, is purchased from the Shen Monkey Vendor.\nWith the Loong Balm equipped, each sip of your Gourds recovers 30% of Maximum Health. At the same time, each sip considerably increases damage executed by the next attack. This makes the Drink one of the most powerful, especially if you can pair it with a strong Soak and Gourd too.\nAs with all Drinks, the potency of the Loong Balm can be increased by finding the Awoken Wine Worm locations. Our page has all of their locations for you.\nYou can then use these special Crafting Materials to upgrade the Drink at the Shen Monkey Vendor in Bamboo Grove within Black Wind Mountain. Each upgrade will provide a buff to your healing potential and the additional effect. But, as you level the Drink up, more Awoken Wine Worms will be needed.\nThis carries over to New Game Plus too, as you can upgrade your Drinks even more, but once again more Awoken Wine Worms will be needed, so you will have to recollect them all in your New Game Plus run.",
    "h2_content": "Loong Balm is found in The Emerald Hall in Furnace Valley in the Flaming Mountains. In this location, it can be found up the stairs and towards the large hall with the throne, sitting next to it.\nLoong Balm\nThere aren't too many Drinks in the game compared to the Soaks, so be sure to keep your eye out for them. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough.",
    "promot": "This is an excerpt from the file 'Loong_Balm.md', located in the main section titled 'Loong Balm'. The section summary is: Loong Balm is the final of the Drinks in Black Myth: Wukong that can be found in the world. The last one, the A Thousand Days Inebriation, is purchased from the Shen Monkey Vendor.\nWith the Loong Balm equipped, each sip of your Gourds recovers 30% of Maximum Health. At the same time, each sip considerably increases damage executed by the next attack. This makes the Drink one of the most powerful, especially if you can pair it with a strong Soak and Gourd too.\nAs with all Drinks, the potency of the Loong Balm can be increased by finding the Awoken Wine Worm locations. Our page has all of their locations for you.\nYou can then use these special Crafting Materials to upgrade the Drink at the Shen Monkey Vendor in Bamboo Grove within Black Wind Mountain. Each upgrade will provide a buff to your healing potential and the additional effect. But, as you level the Drink up, more Awoken Wine Worms will be needed.\nThis carries over to New Game Plus too, as you can upgrade your Drinks even more, but once again more Awoken Wine Worms will be needed, so you will have to recollect them all in your New Game Plus run. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Loong Balm Location', and the detailed content is as follows:\nLoong Balm is found in The Emerald Hall in Furnace Valley in the Flaming Mountains. In this location, it can be found up the stairs and towards the large hall with the throne, sitting next to it.\nLoong Balm\nThere aren't too many Drinks in the game compared to the Soaks, so be sure to keep your eye out for them. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough.",
    "promot_tokens_num": 419
}