{
    "chunk_id": 400478753138,
    "source_file": "Lingxuzi.md",
    "content_type": "one and two",
    "h1_title": "Lingxuzi",
    "h2_title": "Where to Find Lingxuzi",
    "h1_content": "Lingxuzi is a required Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located at the end of the Forest of Wolves, this towering Wolf Guai will be your first true test for taking on very strong and very large boss enemies.\n* **Rewards:** Grey Wolf Mask, 3x Yarn, 1049 Experience, 702 Will",
    "h2_content": "As a required boss, you can't miss running into Lingxuzi, as he guards the Guanyin Temple at the far edge of the Forest of Wolves. You can find the temple by heading along the path straight from the Outside the Forest Shrine, across a small bridge and past the Wandering Wight to a small tunnel.\nThis tunnel will lead to a wooden path of scaffolding looping around to the temple entrance where this boss waits.",
    "promot": "This is an excerpt from the file 'Lingxuzi.md', located in the main section titled 'Lingxuzi'. The section summary is: Lingxuzi is a required Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located at the end of the Forest of Wolves, this towering Wolf Guai will be your first true test for taking on very strong and very large boss enemies.\n* **Rewards:** Grey Wolf Mask, 3x Yarn, 1049 Experience, 702 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find Lingxuzi', and the detailed content is as follows:\nAs a required boss, you can't miss running into Lingxuzi, as he guards the Guanyin Temple at the far edge of the Forest of Wolves. You can find the temple by heading along the path straight from the Outside the Forest Shrine, across a small bridge and past the Wandering Wight to a small tunnel.\nThis tunnel will lead to a wooden path of scaffolding looping around to the temple entrance where this boss waits.",
    "promot_tokens_num": 241
}