{
    "chunk_id": 978902387738,
    "source_file": "Bee_Mountain_Stone.md",
    "content_type": "one and two",
    "h1_title": "Bee Mountain Stone",
    "h2_title": "Black Myth: Wukong Bee Mountain Stone Location",
    "h1_content": "The Bee Mountain Stone Soak is one of the Rare Soaks for your Gourds in Black Myth: Wukong.\nWith the Bee Mountain Stone Soak equipped, using the gourd grants a considerable chance to take a sip without consuming a gourd use. This works great with the Supreme Gourd or the Qing-Tian Gourd\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor.",
    "h2_content": "The Bee Mountain Stone can be obtained from the Temple of Yellow Flowers at the Mountain Trail Shrine in The Webbed Hollow. From the Shrine, continue forward up a short flight of stairs. Once you reach another short flight of steps, loop around to your left to find the Soak in a container on a bench.\nBee Mountain Stone\nSoaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "promot": "This is an excerpt from the file 'Bee_Mountain_Stone.md', located in the main section titled 'Bee Mountain Stone'. The section summary is: The Bee Mountain Stone Soak is one of the Rare Soaks for your Gourds in Black Myth: Wukong.\nWith the Bee Mountain Stone Soak equipped, using the gourd grants a considerable chance to take a sip without consuming a gourd use. This works great with the Supreme Gourd or the Qing-Tian Gourd\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Bee Mountain Stone Location', and the detailed content is as follows:\nThe Bee Mountain Stone can be obtained from the Temple of Yellow Flowers at the Mountain Trail Shrine in The Webbed Hollow. From the Shrine, continue forward up a short flight of stairs. Once you reach another short flight of steps, loop around to your left to find the Soak in a container on a bench.\nBee Mountain Stone\nSoaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "promot_tokens_num": 341
}