{
    "chunk_id": 956326829804,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Forest of Wolves Walkthrough",
    "h2_title": "Boss Fight - Erlang, the Sacred Divinity",
    "h1_content": "Black Myth: Wukong's Chapter 1 begins with a prologue that takes place during a pivotal scene in the story of the Monkey King, Sun Wukong. Below you'll find a guide to the tutorial, and for the first major area of Black Wind Mountain: The Forest of Wolves, as well as how to defeat its many bosses that include the Bullguard, Gaugnzhi and Yaoguai King Lingxuzi.\n* **Jump to A Section:**\n* **Front Hills**\n* Yaoguai Chief - Bullguard\n* **Outside the Forest**\n* Yaoguai Chief - Guangzhi\n* **Guanyin Temple**\n* Yaoguai King - Lingxuzi\n# Prologue\nUpon beginning your journey, you’ll be thrust into the role of the mythical Sun Wukong as he rebels against the Court of Heaven and its Heavenly Kings. Undaunted by their army, Sun Wukong calls them out, prompting the nephew of the Jade Emperor, Erlang Shen, to meet him in combat.",
    "h2_content": "The good news is that as a tutorial boss, you may notice there’s no health bar indicator on the UI, meaning you’re essentially invulnerable! Take this time to  around with the controls, locking onto your target and trying out both light and heavy attacks against your foe.\nErlang fights in a very standard fashion with sweeps and thrusts of his spear, often slowing down and allowing you to test out your dodging skills. There’s no real block button to speak of in Wukong, so dodging — especially at the last second — is key to surviving combat encounters.\nOnce you’ve removed a fourth of his health bar, Erlang will vanish before trying to ambush from above. When the fight resumes, he’ll get a little faster, and start blocking attacks, which is when you should try throwing more heavy attacks into the mix.\nWhen Erlang falls to less than half health, another small scene will  out before the final bout, and Erlang will start invoking more of his divinity to blast you with projectiles. Since you can’t really take lasting damage, you can simply try dodging around, or hold the L2 button to deflect them.\nWhen Erlang returns to the ground, it's also a good time to try out your spells early if you want, by holding R2 and then pressing one of the three button icons:\n* The top button is **Rock Solid** , which acts like a parry that turns you into stone to deflect an incoming attack.\n* The left button is **Immobilize** , which temporarily freezes your opponent in place allowing you to score free hits\n* The bottom button is A **Pluck of Many** , which creates illusory copies of you to assist in combat.\nOnce nearly all his health is gone, a final scene will ensue, and as Sun Wukong transforms to fly off toward the forests, the Buddha’s magical circlet that Sun Wukong had been tricked into putting on flares, causing him to reel from an excruciating headache. Erlang seizes this moment to cast down Sun Wukong into the mountain, sealing him within a large stone egg and ending the tale of Sun Wukong.\nCenturies later, an elder monkey recounts the tale of the Monkey King, and decrees that a Destined One may yet be able to follow in Sun Wukong’s footsteps by seeking out the Six Relics of the Monkey King’s Spirit - the Six Senses of the Great Sage. As luck would have it, you are that Destined One!Forest of Wolves\n# The Forest of Wolves\nWhile he may not be Sun Wukong, the Destined One is not above a bit of trickery and foolishness — as evidenced by luring some lesser Wolf Guais into trying to take a bite out of him disguised as a peach.\nThese basic enemies, the Wolf Scout and Wolf Swornsword, are perfect for getting a feel for some real combat. They tend to attack fairly slowly and draw out their sword slices giving you ample time to dodge even while using light combo attacks.\nSince the Destined One can dodge mid-attack, you should press your offense while dealing with these foes, and watch their movements to find the right time to leap out of the way. Your light combo attack comes in four sustained attacks, culminating in a strong overhead slam when performed uninterrupted.\nDefeating each of them will earn you a fair bit of Experience - seen by the yellow bar in the top right corner, as well as a bit of “**Will** ”, which serves as a form of currency. Given that you’ll need both to succeed in your adventure, it’s usually best to take on enemies you encounter rather than running past them.\nA voice will call out as you defeat the first two enemies, and we’ll be meeting the owner of this voice soon enough. For now, head straight up the woodland path, and you should spot a red plant to the right. Pluck it to gain some **Aged Ginseng** \\- a crafting material that we won’t be able to make use of until Chapter 2, but there’s no reason you can’t start stocking up on them now!\nWhen you reach the next Wolf Scout, you’ll be prompted to perform a Heavy Attack. Heavy Attacks work a bit differently here than in most other games: The more you land hits, the more your Focus bar in the bottom right corner grows. When it fills, you’ll gain a Focus Point, which allows you to add a Heavy Attack into your Light Attack Combos for massive damage. While you can still perform a Heavy Attack on its own, it will lack added punch without that Focus Point, and can’t be included in a combo attack without it.\nAlternatively, you can simply hold the Heavy Attack button to begin charging up your Focus, and letting go of the button will unleash the attack, which can be devastating on slow or unsuspecting enemies. It’s important to note that Focus won’t decay from performing light attacks, but you can’t keep the Focus from charging up, so knowing when to use which type of heavy attack can prove useful.\nHead up the stone stairway into a narrow path full of boulders, where the path splits in two:\nThe route on the left leads down to a Wolf Scout guarding a small gold chest, which contains 5 **Tiny Piece of Gold** \\- an item that can be sold at shops to earn more Will.\nTaking the path to the right leads to a stronger Wolf Stalwart. armed with a large axe. He’s built a bit tougher than the others, and has some hard-hitting and long reaching swings with his axe, as well as a quick shove attack that’s hard to anticipate and dodge before he follows it with a chop.\nIf you take a few hits, remember that you have a gourd of healing drink that you can use (LB/L1) to replenish a bit of your health, but it can only be used a few times.\nWith both enemies dead, you should start to notice a trail of gold leading you down the main path toward a shrine in a small rocky ravine.\nThese Shrines are your checkpoints, and offering incense at them will allow you to rest up, refill your healing gourd, travel to other shrines, and much more (some enemies — but not all — will respawn as well). You’ll also meet the owner of the voice on the wind - the Keeper of Black Wind Mountain.\nThis friendly guy will be your guide and mentor for this part of the world, and will bid you to set out in search of Guanyin Temple, which burned down long ago but has since been rebuilt - but not by human hands. As the Keeper departs, he’ll bestow you with the Incense Trail Talisman, which can let you warp back to the last Shrine you rested at.",
    "promot": "This is an excerpt from the file 'Forest_of_Wolves_Walkthrough.md', located in the main section titled 'Forest of Wolves Walkthrough'. The section summary is: Black Myth: Wukong's Chapter 1 begins with a prologue that takes place during a pivotal scene in the story of the Monkey King, Sun Wukong. Below you'll find a guide to the tutorial, and for the first major area of Black Wind Mountain: The Forest of Wolves, as well as how to defeat its many bosses that include the Bullguard, Gaugnzhi and Yaoguai King Lingxuzi.\n* **Jump to A Section:**\n* **Front Hills**\n* Yaoguai Chief - Bullguard\n* **Outside the Forest**\n* Yaoguai Chief - Guangzhi\n* **Guanyin Temple**\n* Yaoguai King - Lingxuzi\n# Prologue\nUpon beginning your journey, you’ll be thrust into the role of the mythical Sun Wukong as he rebels against the Court of Heaven and its Heavenly Kings. Undaunted by their army, Sun Wukong calls them out, prompting the nephew of the Jade Emperor, Erlang Shen, to meet him in combat. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Boss Fight - Erlang, the Sacred Divinity', and the detailed content is as follows:\nThe good news is that as a tutorial boss, you may notice there’s no health bar indicator on the UI, meaning you’re essentially invulnerable! Take this time to  around with the controls, locking onto your target and trying out both light and heavy attacks against your foe.\nErlang fights in a very standard fashion with sweeps and thrusts of his spear, often slowing down and allowing you to test out your dodging skills. There’s no real block button to speak of in Wukong, so dodging — especially at the last second — is key to surviving combat encounters.\nOnce you’ve removed a fourth of his health bar, Erlang will vanish before trying to ambush from above. When the fight resumes, he’ll get a little faster, and start blocking attacks, which is when you should try throwing more heavy attacks into the mix.\nWhen Erlang falls to less than half health, another small scene will  out before the final bout, and Erlang will start invoking more of his divinity to blast you with projectiles. Since you can’t really take lasting damage, you can simply try dodging around, or hold the L2 button to deflect them.\nWhen Erlang returns to the ground, it's also a good time to try out your spells early if you want, by holding R2 and then pressing one of the three button icons:\n* The top button is **Rock Solid** , which acts like a parry that turns you into stone to deflect an incoming attack.\n* The left button is **Immobilize** , which temporarily freezes your opponent in place allowing you to score free hits\n* The bottom button is A **Pluck of Many** , which creates illusory copies of you to assist in combat.\nOnce nearly all his health is gone, a final scene will ensue, and as Sun Wukong transforms to fly off toward the forests, the Buddha’s magical circlet that Sun Wukong had been tricked into putting on flares, causing him to reel from an excruciating headache. Erlang seizes this moment to cast down Sun Wukong into the mountain, sealing him within a large stone egg and ending the tale of Sun Wukong.\nCenturies later, an elder monkey recounts the tale of the Monkey King, and decrees that a Destined One may yet be able to follow in Sun Wukong’s footsteps by seeking out the Six Relics of the Monkey King’s Spirit - the Six Senses of the Great Sage. As luck would have it, you are that Destined One!Forest of Wolves\n# The Forest of Wolves\nWhile he may not be Sun Wukong, the Destined One is not above a bit of trickery and foolishness — as evidenced by luring some lesser Wolf Guais into trying to take a bite out of him disguised as a peach.\nThese basic enemies, the Wolf Scout and Wolf Swornsword, are perfect for getting a feel for some real combat. They tend to attack fairly slowly and draw out their sword slices giving you ample time to dodge even while using light combo attacks.\nSince the Destined One can dodge mid-attack, you should press your offense while dealing with these foes, and watch their movements to find the right time to leap out of the way. Your light combo attack comes in four sustained attacks, culminating in a strong overhead slam when performed uninterrupted.\nDefeating each of them will earn you a fair bit of Experience - seen by the yellow bar in the top right corner, as well as a bit of “**Will** ”, which serves as a form of currency. Given that you’ll need both to succeed in your adventure, it’s usually best to take on enemies you encounter rather than running past them.\nA voice will call out as you defeat the first two enemies, and we’ll be meeting the owner of this voice soon enough. For now, head straight up the woodland path, and you should spot a red plant to the right. Pluck it to gain some **Aged Ginseng** \\- a crafting material that we won’t be able to make use of until Chapter 2, but there’s no reason you can’t start stocking up on them now!\nWhen you reach the next Wolf Scout, you’ll be prompted to perform a Heavy Attack. Heavy Attacks work a bit differently here than in most other games: The more you land hits, the more your Focus bar in the bottom right corner grows. When it fills, you’ll gain a Focus Point, which allows you to add a Heavy Attack into your Light Attack Combos for massive damage. While you can still perform a Heavy Attack on its own, it will lack added punch without that Focus Point, and can’t be included in a combo attack without it.\nAlternatively, you can simply hold the Heavy Attack button to begin charging up your Focus, and letting go of the button will unleash the attack, which can be devastating on slow or unsuspecting enemies. It’s important to note that Focus won’t decay from performing light attacks, but you can’t keep the Focus from charging up, so knowing when to use which type of heavy attack can prove useful.\nHead up the stone stairway into a narrow path full of boulders, where the path splits in two:\nThe route on the left leads down to a Wolf Scout guarding a small gold chest, which contains 5 **Tiny Piece of Gold** \\- an item that can be sold at shops to earn more Will.\nTaking the path to the right leads to a stronger Wolf Stalwart. armed with a large axe. He’s built a bit tougher than the others, and has some hard-hitting and long reaching swings with his axe, as well as a quick shove attack that’s hard to anticipate and dodge before he follows it with a chop.\nIf you take a few hits, remember that you have a gourd of healing drink that you can use (LB/L1) to replenish a bit of your health, but it can only be used a few times.\nWith both enemies dead, you should start to notice a trail of gold leading you down the main path toward a shrine in a small rocky ravine.\nThese Shrines are your checkpoints, and offering incense at them will allow you to rest up, refill your healing gourd, travel to other shrines, and much more (some enemies — but not all — will respawn as well). You’ll also meet the owner of the voice on the wind - the Keeper of Black Wind Mountain.\nThis friendly guy will be your guide and mentor for this part of the world, and will bid you to set out in search of Guanyin Temple, which burned down long ago but has since been rebuilt - but not by human hands. As the Keeper departs, he’ll bestow you with the Incense Trail Talisman, which can let you warp back to the last Shrine you rested at.",
    "promot_tokens_num": 1690
}