{
    "chunk_id": 357207281622,
    "source_file": "How_to_Claim_Deluxe_Edition_Items.md",
    "content_type": "one and two",
    "h1_title": "How to Claim Deluxe Edition Items",
    "h2_title": "Claiming Deluxe Edition Items in Black Myth: Wukong",
    "h1_content": "If you already have or are considering upgrading to the Deluxe Edition of Black Myth: Wukong, you might be wondering how to claim the Deluxe Edition Items that come with it. Thankfully, there's an easy way in-game to claim your bonus loot and on this page, we'll talk you through how to do it.",
    "h2_content": "Firstly, it should be noted that if you purchased the Standard Edition of Black Myth: Wukong, you can upgrade to the Deluxe Edition**at any time and still receive the items**.\nIf you're just starting up the game for the first time with the Deluxe Edition or the upgrade from Standard Edition to Deluxe, simply start the game and  through the first section of Chapter 1's Forest of the Wolves.\nAlong the way, you'll be encouraged to pluck a hair to unlock your first Keeper's Shrine and meet the Keeper of the Black Wind Mountain. Interact with the Shrine after the cutscene and go down to **Trailblazer's Gift** to claim your items.\nThere will be 7 items waiting for you there including a **Weapon, Armor set, and a Curio**. If you've purchased the Deluxe Edition after passing this point, just interact with the nearest Shrine to collect your items.",
    "promot": "This is an excerpt from the file 'How_to_Claim_Deluxe_Edition_Items.md', located in the main section titled 'How to Claim Deluxe Edition Items'. The section summary is: If you already have or are considering upgrading to the Deluxe Edition of Black Myth: Wukong, you might be wondering how to claim the Deluxe Edition Items that come with it. Thankfully, there's an easy way in-game to claim your bonus loot and on this page, we'll talk you through how to do it. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Claiming Deluxe Edition Items in Black Myth: Wukong', and the detailed content is as follows:\nFirstly, it should be noted that if you purchased the Standard Edition of Black Myth: Wukong, you can upgrade to the Deluxe Edition**at any time and still receive the items**.\nIf you're just starting up the game for the first time with the Deluxe Edition or the upgrade from Standard Edition to Deluxe, simply start the game and  through the first section of Chapter 1's Forest of the Wolves.\nAlong the way, you'll be encouraged to pluck a hair to unlock your first Keeper's Shrine and meet the Keeper of the Black Wind Mountain. Interact with the Shrine after the cutscene and go down to **Trailblazer's Gift** to claim your items.\nThere will be 7 items waiting for you there including a **Weapon, Armor set, and a Curio**. If you've purchased the Deluxe Edition after passing this point, just interact with the nearest Shrine to collect your items.",
    "promot_tokens_num": 331
}