{
    "chunk_id": 17691962129,
    "source_file": "Flint_Chief.md",
    "content_type": "one and two",
    "h1_title": "Flint Chief",
    "h2_title": "How to Find Flint Chief",
    "h1_content": "Flint Chief is a Yaoguai Chief you'll fight near the start of the Furnace Valley section of Chapter 5 in Black Myth: Wukong. This optional boss is easily missable but can be found tucked away in a lava stream as you head up to Rakshasha Palace.",
    "h2_content": "After entering the cave in Furnace Valley, head to the left. Continue following the path, through the archway, where you'll see another Flamling emerge on the right. Take the Flamling out and look down to the left, below the edge of the cliff where it sat.\nDrop down here, and head right first to collect the Fire Date from the tree. Then go in the opposite direction toward the lava streaming from the ceiling. This is where you can find one of the optional bosses in Chapter 5, the Flint Chief.",
    "promot": "This is an excerpt from the file 'Flint_Chief.md', located in the main section titled 'Flint Chief'. The section summary is: Flint Chief is a Yaoguai Chief you'll fight near the start of the Furnace Valley section of Chapter 5 in Black Myth: Wukong. This optional boss is easily missable but can be found tucked away in a lava stream as you head up to Rakshasha Palace. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'How to Find Flint Chief', and the detailed content is as follows:\nAfter entering the cave in Furnace Valley, head to the left. Continue following the path, through the archway, where you'll see another Flamling emerge on the right. Take the Flamling out and look down to the left, below the edge of the cliff where it sat.\nDrop down here, and head right first to collect the Fire Date from the tree. Then go in the opposite direction toward the lava streaming from the ceiling. This is where you can find one of the optional bosses in Chapter 5, the Flint Chief.",
    "promot_tokens_num": 231
}