{
    "chunk_id": 508098691968,
    "source_file": "Webbed_Hollow-Lower_Hollow_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Webbed Hollow - Lower Hollow Walkthrough",
    "h2_title": "Boss Fight - Zhu Bajie",
    "h1_content": "The Webbed Hollow is the second main area of Black Myth: Wukong's Chapter 4, concluding with the lower portion of the large underground cave system. Below you'll find a guide for the third and final lower area of The Webbed Hollow, including where to find the secret Yellow Loong and frog boss, and rescue Zhu Bajie from the clutches of the Violet Spider.\n* **Jump to a Section**\n* **Relief of the Fallen Loong**\n* **Lower Hollow**\n* Yaoguai Chief - Baw-Li-Guhh-Baw\n* **Hut of Immortality**\n* Boss Fight - Zhu Bajie\n* **The Purifying Spring**\n* **The Gathering Cave**\n* Yaoguai Queen - Violet Spider\nDue to the length, complexity, and number of bosses scattered throughout the Webbed Hollow section of Chapter 4, this particular region walkthrough will be split up into three parts with each section largely covering a major floor level of the hollow.",
    "h2_content": "Your old friend Zhu Bajie is not exactly himself, and now that he's been bewitched, you'll have to beat some sense into him. This is no easy task, as the scrappy little pig once journeyed with Wukong himself. This makes him a wily fighter, if a bit unorthodox.\nZhu Bajie prefers to attack with his special 9-pointed rake, and while it may look silly, it's absolutely dangerous. He can swing it in wide arcs in a few different ways, but he usually has a slow wind-up at first that you can dodge away from.\nWhen his rake glows red, he'll charge up his rake attacks with explosive force. These will usually send you reeling back if you try to deflect them (or at the very least not stagger the boss), and if they hit the swings cleave into the ground, they'll cause waves of force to explode outward from his swings.\nHe can also perform a tricky move to counter where he jumps into the air, and pauses for a moment before slamming down with his rake. He'll immediately slide past you, pivoting to slam down again when you think you've evaded the attack.\nHe can also steal a trick from Guangzhi and use his rake like a pogo stick, slamming down with it before hopping up and spin into another downward slash attack.\nWhen he starts spinning his rake in a low, wide arc, he can continue to spin until turning into a literal tornado. It can be hard to dodge at first, but once you do he'll have a hard time course-correcting, and you can follow his path until he spins himself dizzy.\nQuickly move in to make use of his stunned state, but you should probably try and attack from the sides, as he can sometimes react to the spinning by throwing up all over you... which isn't great.\nThanks to his clumsiness, and that he's prone to stumbling back and falling when staggered by big hits, you'll have a lot of opportunities to unleash your charged up hits and Spirit Attacks on him, but you'll still want to be ready to go on the defensive any time you see him flare up with energy.\nOnce you've dealt enough damage to clear his health bar, Zhu Bajie will flee the Hut of Immortality. The battle isn't exactly over, but you will get some experience and will for surviving the encounter.\nThere actually isn't anything more you can do in the Hut of Immortality, as all the doors are sealed. However, when you return to the Shrine outside, you'll find a new cave path has been carved out that leads outside to a large muddy hole.\nYour battle with Zhu Bajie isn't over. In fact -- it's about to get a whole lot harder.",
    "promot": "This is an excerpt from the file 'Webbed_Hollow-Lower_Hollow_Walkthrough.md', located in the main section titled 'Webbed Hollow - Lower Hollow Walkthrough'. The section summary is: The Webbed Hollow is the second main area of Black Myth: Wukong's Chapter 4, concluding with the lower portion of the large underground cave system. Below you'll find a guide for the third and final lower area of The Webbed Hollow, including where to find the secret Yellow Loong and frog boss, and rescue Zhu Bajie from the clutches of the Violet Spider.\n* **Jump to a Section**\n* **Relief of the Fallen Loong**\n* **Lower Hollow**\n* Yaoguai Chief - Baw-Li-Guhh-Baw\n* **Hut of Immortality**\n* Boss Fight - Zhu Bajie\n* **The Purifying Spring**\n* **The Gathering Cave**\n* Yaoguai Queen - Violet Spider\nDue to the length, complexity, and number of bosses scattered throughout the Webbed Hollow section of Chapter 4, this particular region walkthrough will be split up into three parts with each section largely covering a major floor level of the hollow. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Boss Fight - Zhu Bajie', and the detailed content is as follows:\nYour old friend Zhu Bajie is not exactly himself, and now that he's been bewitched, you'll have to beat some sense into him. This is no easy task, as the scrappy little pig once journeyed with Wukong himself. This makes him a wily fighter, if a bit unorthodox.\nZhu Bajie prefers to attack with his special 9-pointed rake, and while it may look silly, it's absolutely dangerous. He can swing it in wide arcs in a few different ways, but he usually has a slow wind-up at first that you can dodge away from.\nWhen his rake glows red, he'll charge up his rake attacks with explosive force. These will usually send you reeling back if you try to deflect them (or at the very least not stagger the boss), and if they hit the swings cleave into the ground, they'll cause waves of force to explode outward from his swings.\nHe can also perform a tricky move to counter where he jumps into the air, and pauses for a moment before slamming down with his rake. He'll immediately slide past you, pivoting to slam down again when you think you've evaded the attack.\nHe can also steal a trick from Guangzhi and use his rake like a pogo stick, slamming down with it before hopping up and spin into another downward slash attack.\nWhen he starts spinning his rake in a low, wide arc, he can continue to spin until turning into a literal tornado. It can be hard to dodge at first, but once you do he'll have a hard time course-correcting, and you can follow his path until he spins himself dizzy.\nQuickly move in to make use of his stunned state, but you should probably try and attack from the sides, as he can sometimes react to the spinning by throwing up all over you... which isn't great.\nThanks to his clumsiness, and that he's prone to stumbling back and falling when staggered by big hits, you'll have a lot of opportunities to unleash your charged up hits and Spirit Attacks on him, but you'll still want to be ready to go on the defensive any time you see him flare up with energy.\nOnce you've dealt enough damage to clear his health bar, Zhu Bajie will flee the Hut of Immortality. The battle isn't exactly over, but you will get some experience and will for surviving the encounter.\nThere actually isn't anything more you can do in the Hut of Immortality, as all the doors are sealed. However, when you return to the Shrine outside, you'll find a new cave path has been carved out that leads outside to a large muddy hole.\nYour battle with Zhu Bajie isn't over. In fact -- it's about to get a whole lot harder.",
    "promot_tokens_num": 851
}