{
    "chunk_id": 813889596998,
    "source_file": "Valley_of_Ecstasy_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Valley of Ecstasy Walkthrough",
    "h2_title": "Brook of Bliss",
    "h1_content": "The Valley of Ecstasy is the fourth main region of Chapter 3 in The New West in Black Myth: Wukong. Below you'll find a guide for the Valley of Ecstasy Region, including how to reach the valley itself by defeating Non-White, and exploring the different parts of the valley to uncover several Yaoguai Chiefs on the path to the New Thunderclap Temple, and completing the Treasure Hunter's Quest and the Pagoda Realm Prisoner's Quest by defeating the final Captain.\n* **Jump to a Section:**\n* **Mindfulness Cliff**\n* Yaoguai Chief - Non-White\n* Yaoguai Chief - Non-White (Round Two)\n* **Forest of Felicity**\n* Yaoguai Chief - Lang-Li-Guhh-Lang\n* **Brook of Bliss**\n* Yaoguai Chief - Non-Able\n* **Towers of Karma**\n* Yauoguai Chief - Old Ginseng Guai\n* **Longevity Road**\n* Yaoguai Chief - Captain Kalpa-Wave\nAfter you solved the monk's riddle by praying at four Buddha Statues in the Precept Corridor, you'll split up from Zhu Bajie and make your way into the belly button of a large Buddha statue along the cliffs, taking you up a narrow pathway and into the Mindfulness Cliff.",
    "h2_content": "There are two easy paths to take down to the Brook of Bliss: one right next to the Forest Shrine, and one a bit further up along the main path. Both paths are lined with various Frozen Corpses and likely a Cyan Bat or two hiding up in the trees.\nTaking the path by the Shrine, you'll head down the slope and take a right to find the start of the river, which has a green Wisp to absorb and plants to harvest. Leave the other side of the ravine for the moment, and take the closer path on the side of a ravine nearest to where you came down.\nOn this side, you'll find a few fallen trees creating makeshift bridges above the brook below, and one of them has another green Wisp to absorb along the tree, while the other has a green Wisp on top of a giant rock.\nTake this path all the way down until you find an actual stone bridge, where a Thunder Rhino Master guards the way forward. Though he can cast a variety of lightning spells like the Rat Governors of Yellow Wind Ridge, they don't have a lot of health and aren't too much of a threat.\nBe sure to cross the bridge to find the Brook of Bliss Shrine, and you can circle back to the top of the brook to find another Thunder Rhino Master patrolling near a Cyan Bat.\nBefore you check up the hill from the Shrine, head back across the bridge and follow the path down to the brook itself.\nHere you'll find the lower part of the brook, where a Crow Diviner waits in a large pool of water by some falls. Unlike the earlier Crow Diviners, this one is not only empowered with a Spirit, but has even more deadly moves.\nIn addition to their quick dashing sword swings, Crow Diviners in the valley like this one can also blast out an icy chill your way while becoming nearly invisible aside from a purple glowing eye.\nIn this cloud step-like form, you'll only be able to see their purple eye flash before they lunge at you and deal incredible damage -- even causing purple explosions or icy blasts around their slash -- so be ready with a deflect or cloud step of your own.\nDefeating this particular foe will allow you to absorb the Crow Diviner Spirit (and another green Wisp nearby), but he won't be the only one you'll face in this area.\nBe sure to follow the path of the brook to harvest more plants and deal with Frozen Corpses and Golden Lotus Guai along the way.\nOnce you reach an apparent cliff edge, beware of a Frozen Corpse hiding in an overturned bell, and check the inside to find a green Wisp to absorb.\nIn fact, this cliff edge hides a secret, and you can carefully descend to find a secret cave that's devoid of opponents for now, but you can at least activate the Melon Field Shrine for now.\nHead back up along the brook and climb up to the middle part of the river. Here you can head upsteam and harvest a variety of materials as you do, just beware of some Croaky enemies hiding in the waters.\nOnce you've harvested all the plants along the river, return up to the Brook Shrine, and head up the hill taking the road to the left.\nAt the top, you'll find lots of Frozen Corpses to smash apart, as well as a Thunder Rhino Master and two Frozen Corpses guarding a **Treasure Chest** at the foot of a giant stone pillar that overlooks the path you took to get up here.\nJust past the crowd of Frozen Corpses, you'll find the most important thing in this region: A lone man bound and kneeling in front of a large stone pagoda on the hill above.",
    "promot": "This is an excerpt from the file 'Valley_of_Ecstasy_Walkthrough.md', located in the main section titled 'Valley of Ecstasy Walkthrough'. The section summary is: The Valley of Ecstasy is the fourth main region of Chapter 3 in The New West in Black Myth: Wukong. Below you'll find a guide for the Valley of Ecstasy Region, including how to reach the valley itself by defeating Non-White, and exploring the different parts of the valley to uncover several Yaoguai Chiefs on the path to the New Thunderclap Temple, and completing the Treasure Hunter's Quest and the Pagoda Realm Prisoner's Quest by defeating the final Captain.\n* **Jump to a Section:**\n* **Mindfulness Cliff**\n* Yaoguai Chief - Non-White\n* Yaoguai Chief - Non-White (Round Two)\n* **Forest of Felicity**\n* Yaoguai Chief - Lang-Li-Guhh-Lang\n* **Brook of Bliss**\n* Yaoguai Chief - Non-Able\n* **Towers of Karma**\n* Yauoguai Chief - Old Ginseng Guai\n* **Longevity Road**\n* Yaoguai Chief - Captain Kalpa-Wave\nAfter you solved the monk's riddle by praying at four Buddha Statues in the Precept Corridor, you'll split up from Zhu Bajie and make your way into the belly button of a large Buddha statue along the cliffs, taking you up a narrow pathway and into the Mindfulness Cliff. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Brook of Bliss', and the detailed content is as follows:\nThere are two easy paths to take down to the Brook of Bliss: one right next to the Forest Shrine, and one a bit further up along the main path. Both paths are lined with various Frozen Corpses and likely a Cyan Bat or two hiding up in the trees.\nTaking the path by the Shrine, you'll head down the slope and take a right to find the start of the river, which has a green Wisp to absorb and plants to harvest. Leave the other side of the ravine for the moment, and take the closer path on the side of a ravine nearest to where you came down.\nOn this side, you'll find a few fallen trees creating makeshift bridges above the brook below, and one of them has another green Wisp to absorb along the tree, while the other has a green Wisp on top of a giant rock.\nTake this path all the way down until you find an actual stone bridge, where a Thunder Rhino Master guards the way forward. Though he can cast a variety of lightning spells like the Rat Governors of Yellow Wind Ridge, they don't have a lot of health and aren't too much of a threat.\nBe sure to cross the bridge to find the Brook of Bliss Shrine, and you can circle back to the top of the brook to find another Thunder Rhino Master patrolling near a Cyan Bat.\nBefore you check up the hill from the Shrine, head back across the bridge and follow the path down to the brook itself.\nHere you'll find the lower part of the brook, where a Crow Diviner waits in a large pool of water by some falls. Unlike the earlier Crow Diviners, this one is not only empowered with a Spirit, but has even more deadly moves.\nIn addition to their quick dashing sword swings, Crow Diviners in the valley like this one can also blast out an icy chill your way while becoming nearly invisible aside from a purple glowing eye.\nIn this cloud step-like form, you'll only be able to see their purple eye flash before they lunge at you and deal incredible damage -- even causing purple explosions or icy blasts around their slash -- so be ready with a deflect or cloud step of your own.\nDefeating this particular foe will allow you to absorb the Crow Diviner Spirit (and another green Wisp nearby), but he won't be the only one you'll face in this area.\nBe sure to follow the path of the brook to harvest more plants and deal with Frozen Corpses and Golden Lotus Guai along the way.\nOnce you reach an apparent cliff edge, beware of a Frozen Corpse hiding in an overturned bell, and check the inside to find a green Wisp to absorb.\nIn fact, this cliff edge hides a secret, and you can carefully descend to find a secret cave that's devoid of opponents for now, but you can at least activate the Melon Field Shrine for now.\nHead back up along the brook and climb up to the middle part of the river. Here you can head upsteam and harvest a variety of materials as you do, just beware of some Croaky enemies hiding in the waters.\nOnce you've harvested all the plants along the river, return up to the Brook Shrine, and head up the hill taking the road to the left.\nAt the top, you'll find lots of Frozen Corpses to smash apart, as well as a Thunder Rhino Master and two Frozen Corpses guarding a **Treasure Chest** at the foot of a giant stone pillar that overlooks the path you took to get up here.\nJust past the crowd of Frozen Corpses, you'll find the most important thing in this region: A lone man bound and kneeling in front of a large stone pagoda on the hill above.",
    "promot_tokens_num": 1102
}