{
    "chunk_id": 962788860670,
    "source_file": "How_to_Unlock_the_Secret_Ending_(True_Ending).md",
    "content_type": "one and two",
    "h1_title": "How to Unlock the Secret Ending (True Ending)",
    "h2_title": "Unlock and Complete Secret: Ancient Guanyin Temple (Chapter 1)",
    "h1_content": "Each Chapter of Black Myth: Wukong has a secret area to discover. Typically, these are filled with optional bosses, which you'll need to defeat to complete the area. You'll need to finish each of the chapter's secret areas and a side quest you can pick up in Chapter 3 to reach the game's secret - and true - ending. Here's everything you need to do to get there.\n1. Complete Secret: Ancient Guanyin Temple (Chapter 1)\n2. Complete Kingdom of Sahali (Chapter 2)\n3. Complete the Treasure Hunter Side Quest (Chapter 3)\n4. Complete Purple Cloud Mountain (Chapter 4)\n5. Complete Bishui Cave (Chapter 5)\n6. Complete Mount Mei (The Great Pagoda)\n7. Beat the final boss",
    "h2_content": "To unlock the secret area in Chapter 1, you'll need to ring 3 bells. Doing this will automatically transport you to the hidden area, where you can beat the Chapter's secret boss.\n1. Ring the bell in the Forest of Wolves near Guangzhi.\n2. Ring the bell in Bamboo Grove near Guangmou\n3. Ring the bell in Bamboo Grove near Whiteclad Noble\n4. Defeat Elder Jinchi",
    "promot": "This is an excerpt from the file 'How_to_Unlock_the_Secret_Ending_(True_Ending).md', located in the main section titled 'How to Unlock the Secret Ending (True Ending)'. The section summary is: Each Chapter of Black Myth: Wukong has a secret area to discover. Typically, these are filled with optional bosses, which you'll need to defeat to complete the area. You'll need to finish each of the chapter's secret areas and a side quest you can pick up in Chapter 3 to reach the game's secret - and true - ending. Here's everything you need to do to get there.\n1. Complete Secret: Ancient Guanyin Temple (Chapter 1)\n2. Complete Kingdom of Sahali (Chapter 2)\n3. Complete the Treasure Hunter Side Quest (Chapter 3)\n4. Complete Purple Cloud Mountain (Chapter 4)\n5. Complete Bishui Cave (Chapter 5)\n6. Complete Mount Mei (The Great Pagoda)\n7. Beat the final boss This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Unlock and Complete Secret: Ancient Guanyin Temple (Chapter 1)', and the detailed content is as follows:\nTo unlock the secret area in Chapter 1, you'll need to ring 3 bells. Doing this will automatically transport you to the hidden area, where you can beat the Chapter's secret boss.\n1. Ring the bell in the Forest of Wolves near Guangzhi.\n2. Ring the bell in Bamboo Grove near Guangmou\n3. Ring the bell in Bamboo Grove near Whiteclad Noble\n4. Defeat Elder Jinchi",
    "promot_tokens_num": 341
}