{
    "chunk_id": 792299528196,
    "source_file": "Steel_Ginseng.md",
    "content_type": "one and two",
    "h1_title": "Steel Ginseng",
    "h2_title": "Black Myth: Wukong Steel Ginseng Location",
    "h1_content": "The Steel Ginseng is one of the Rare Soaks for your Gourds in Black Myth: Wukong. The Soak's ability is basic when compared to many of the Epic Soaks.\nWith the Steel Ginseng equipped, using the gourd instantly grants you a moderate amount of Focus.\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor.",
    "h2_content": "The Steel Ginseng can be obtained randomly from any Aged Ginseng plant throughout the game.\nSteel Ginseng\nSoaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "promot": "This is an excerpt from the file 'Steel_Ginseng.md', located in the main section titled 'Steel Ginseng'. The section summary is: The Steel Ginseng is one of the Rare Soaks for your Gourds in Black Myth: Wukong. The Soak's ability is basic when compared to many of the Epic Soaks.\nWith the Steel Ginseng equipped, using the gourd instantly grants you a moderate amount of Focus.\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Steel Ginseng Location', and the detailed content is as follows:\nThe Steel Ginseng can be obtained randomly from any Aged Ginseng plant throughout the game.\nSteel Ginseng\nSoaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "promot_tokens_num": 284
}