{
    "chunk_id": 697379715505,
    "source_file": "Temple_of_Yellow_Flowers_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Temple of Yellow Flowers Walkthrough",
    "h2_title": "Court of Illumination",
    "h1_content": "The Temple of Yellow Flowers is the final main area of Black Myth: Wukong's Chapter 4, located high above the Webbed Hollow on. Below you'll find a guide for the final area of The Webbed Hollow, including how to track down the Violet Spider and defeat the Hundred-Eyed Daoist Master, as well as getting a rematch with the Venom Daoist to unlock a Secret Area, and finding the last Purple Talisman Altar.\n* **Jump to a Section**\n* **Mountain Trail**\n* **Forest of Ferocity**\n* Yaoguai Chief - Commander Beetle\n* **Temple Entrance**\n* Yaoguai Chief - Fungiwoman\n* Boss Fight - Venom Daoist\n* **Court of Illumination**\n* Boss Fight - Supreme Inspector\n* Yaoguai King - Hundred-Eyed Daoist Master\nAfter defeating the Violet Spider, you'll have to escape her spider swarm as she retreats, but luckily you'll be plucked to safety by the one Spider Sister that seems to be on your side.\nWhen you untangle yourself from the webbing, you'll find yourself high above the Webbed Hollow, on a mountain path leading to a large temple filled with Daoist martial artists.",
    "h2_content": "After you've completed Purple Cloud Mountain, head back to the Court of Illumination Shrine. If you haven't stopped here to get the Shrine earlier, you'll need to take out two Spear Daoists, but also note a small pond of water with a Tiger Sheriff down inside, along with a green Wisp. Defeating him should also get you a special **Tiger Tendon Belt Curio** (if not, it may randomly drop from other Tiger Sheriffs).\nNow at the Court of Illumination Shrine, you'll find a pathway straight ahead, and another to the right leading to a large field. The doorway to the right leads to the final boss, so first take a quick detour up the stairs.\nUp ahead, you'll find the final purple talisman altar, but before you approach it, look off to the left for a higher pathway guarded by two Sword Daoists. Defeat them and travel through the narrow rocky passageway up to a landing with a **Treasure Chest** that should contain a Knot of Voidness, Loong Aura Amplification Pellet and Life-Saving Pill, or other materials.\nHead back to the altar, and pluck what should be the fourth and final talisman. Before you can celebrate this act, a large winged monster with a hand for a face will appear to aggressively punish you for this deed!",
    "promot": "This is an excerpt from the file 'Temple_of_Yellow_Flowers_Walkthrough.md', located in the main section titled 'Temple of Yellow Flowers Walkthrough'. The section summary is: The Temple of Yellow Flowers is the final main area of Black Myth: Wukong's Chapter 4, located high above the Webbed Hollow on. Below you'll find a guide for the final area of The Webbed Hollow, including how to track down the Violet Spider and defeat the Hundred-Eyed Daoist Master, as well as getting a rematch with the Venom Daoist to unlock a Secret Area, and finding the last Purple Talisman Altar.\n* **Jump to a Section**\n* **Mountain Trail**\n* **Forest of Ferocity**\n* Yaoguai Chief - Commander Beetle\n* **Temple Entrance**\n* Yaoguai Chief - Fungiwoman\n* Boss Fight - Venom Daoist\n* **Court of Illumination**\n* Boss Fight - Supreme Inspector\n* Yaoguai King - Hundred-Eyed Daoist Master\nAfter defeating the Violet Spider, you'll have to escape her spider swarm as she retreats, but luckily you'll be plucked to safety by the one Spider Sister that seems to be on your side.\nWhen you untangle yourself from the webbing, you'll find yourself high above the Webbed Hollow, on a mountain path leading to a large temple filled with Daoist martial artists. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Court of Illumination', and the detailed content is as follows:\nAfter you've completed Purple Cloud Mountain, head back to the Court of Illumination Shrine. If you haven't stopped here to get the Shrine earlier, you'll need to take out two Spear Daoists, but also note a small pond of water with a Tiger Sheriff down inside, along with a green Wisp. Defeating him should also get you a special **Tiger Tendon Belt Curio** (if not, it may randomly drop from other Tiger Sheriffs).\nNow at the Court of Illumination Shrine, you'll find a pathway straight ahead, and another to the right leading to a large field. The doorway to the right leads to the final boss, so first take a quick detour up the stairs.\nUp ahead, you'll find the final purple talisman altar, but before you approach it, look off to the left for a higher pathway guarded by two Sword Daoists. Defeat them and travel through the narrow rocky passageway up to a landing with a **Treasure Chest** that should contain a Knot of Voidness, Loong Aura Amplification Pellet and Life-Saving Pill, or other materials.\nHead back to the altar, and pluck what should be the fourth and final talisman. Before you can celebrate this act, a large winged monster with a hand for a face will appear to aggressively punish you for this deed!",
    "promot_tokens_num": 600
}