{
    "chunk_id": 337129987507,
    "source_file": "Tiger_Relic.md",
    "content_type": "one and two",
    "h1_title": "Tiger Relic",
    "h2_title": "Black Myth: Wukong Tiger Relic Location",
    "h1_content": "The Tiger Relic is one of the Rare Soaks for your Gourds in Black Myth: Wukong. The Soak's ability is rather specialised, useful for specific spell builds or when adopting a particular style.\nWith the Tiger Relic Soak equipped, using the gourd moderately increases your critical hit chance for a brief duration.\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor.",
    "h2_content": "The Tiger Relic is found on a platform beneath the Crouching Tiger Temple in Yellow Wind Ridge. To get it, you will need the Keeness of Tiger and Sterness of Stone from the Tiger Vanguard and Stone Vanguard in the chapter.\nYou can then open the Tally in the arena and head beneath the temple.\nAt the end of the pathway, you will reach a slope leading down. As you step on the slope, jump to reach the platform above, which has the Soak.\nTiger Relic\nSoaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "promot": "This is an excerpt from the file 'Tiger_Relic.md', located in the main section titled 'Tiger Relic'. The section summary is: The Tiger Relic is one of the Rare Soaks for your Gourds in Black Myth: Wukong. The Soak's ability is rather specialised, useful for specific spell builds or when adopting a particular style.\nWith the Tiger Relic Soak equipped, using the gourd moderately increases your critical hit chance for a brief duration.\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Tiger Relic Location', and the detailed content is as follows:\nThe Tiger Relic is found on a platform beneath the Crouching Tiger Temple in Yellow Wind Ridge. To get it, you will need the Keeness of Tiger and Sterness of Stone from the Tiger Vanguard and Stone Vanguard in the chapter.\nYou can then open the Tally in the arena and head beneath the temple.\nAt the end of the pathway, you will reach a slope leading down. As you step on the slope, jump to reach the platform above, which has the Soak.\nTiger Relic\nSoaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "promot_tokens_num": 375
}