{
    "chunk_id": 923236119816,
    "source_file": "Old_Rattle-Drum.md",
    "content_type": "one and two",
    "h1_title": "Old Rattle-Drum",
    "h2_title": "Black Myth: Wukong Old Rattle-Drum Location",
    "h1_content": "The Old Rattle-Drum is one of the more well-hidden Key Items in Black Myth: Wukong. However, it is one of the more important optional ones, as it unlocks a secret area, a hidden boss, and one of the Gourds in the game.\nYou will have to venture off to find it, and figuring out where to use it is even harder. But, below, you can find details on its location and the three spots in the game where you can shake it, to unlock the secret area.",
    "h2_content": "The Old Rattle-Drum is located on the bridge at the end of the Windrest Hamlet in Yellow Wind Formation in Yellow Wind Ridge. It is given to you after defeating the Tiger Acolyte\") on the bridge.\nTo get to the bridge with the Tiger Acolyte, you simply need to head across the rope bridge at the Sandgate Village - Valley of Despair shrine. It is next to the big locked gate. Continue through the initial area until you reach the Windrest Hamlet Shrine. Kill the enemies on the initial bridge into the hamlet and head down towards the next bridge.\nHere is where you will find the Tiger's Acolyte and get the Old Rattle-Drum.\nOld Rattle Drum",
    "promot": "This is an excerpt from the file 'Old_Rattle-Drum.md', located in the main section titled 'Old Rattle-Drum'. The section summary is: The Old Rattle-Drum is one of the more well-hidden Key Items in Black Myth: Wukong. However, it is one of the more important optional ones, as it unlocks a secret area, a hidden boss, and one of the Gourds in the game.\nYou will have to venture off to find it, and figuring out where to use it is even harder. But, below, you can find details on its location and the three spots in the game where you can shake it, to unlock the secret area. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Old Rattle-Drum Location', and the detailed content is as follows:\nThe Old Rattle-Drum is located on the bridge at the end of the Windrest Hamlet in Yellow Wind Formation in Yellow Wind Ridge. It is given to you after defeating the Tiger Acolyte\") on the bridge.\nTo get to the bridge with the Tiger Acolyte, you simply need to head across the rope bridge at the Sandgate Village - Valley of Despair shrine. It is next to the big locked gate. Continue through the initial area until you reach the Windrest Hamlet Shrine. Kill the enemies on the initial bridge into the hamlet and head down towards the next bridge.\nHere is where you will find the Tiger's Acolyte and get the Old Rattle-Drum.\nOld Rattle Drum",
    "promot_tokens_num": 334
}