{
    "chunk_id": 90996924426,
    "source_file": "Stone_Vanguard.md",
    "content_type": "one and two",
    "h1_title": "Stone Vanguard",
    "h2_title": "Where to Find the Stone Vanguard",
    "h1_content": "The Stone Vanguard is a required Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Located near the end of the Fright Cliff area, imposing Rock Guai sports a formidable defense and exploding attacks.\n* **Rewards:** Sterness of Stone, Mind Core x1, Yaoguai Core x2, 1652 Experience, 1366 Will",
    "h2_content": "As a required boss, you won't be able to proceed to the Chapter 2 End Boss without defeating and him and obtaining one half of the Key Items needed to open various doors in Chapter 2's Yellow Wind Ridge.\nYou can find this Vanguard in the Fright Cliff Region by taking a right after heading through the Sandgate Village and defeating the King of Flowing Sand and Second Rat Prince, and then crossing a bridge into this region until you reach Rockrest Flat.\nLook for an archway on the left wall in this area to find this boss arena.",
    "promot": "This is an excerpt from the file 'Stone_Vanguard.md', located in the main section titled 'Stone Vanguard'. The section summary is: The Stone Vanguard is a required Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Located near the end of the Fright Cliff area, imposing Rock Guai sports a formidable defense and exploding attacks.\n* **Rewards:** Sterness of Stone, Mind Core x1, Yaoguai Core x2, 1652 Experience, 1366 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find the Stone Vanguard', and the detailed content is as follows:\nAs a required boss, you won't be able to proceed to the Chapter 2 End Boss without defeating and him and obtaining one half of the Key Items needed to open various doors in Chapter 2's Yellow Wind Ridge.\nYou can find this Vanguard in the Fright Cliff Region by taking a right after heading through the Sandgate Village and defeating the King of Flowing Sand and Second Rat Prince, and then crossing a bridge into this region until you reach Rockrest Flat.\nLook for an archway on the left wall in this area to find this boss arena.",
    "promot_tokens_num": 256
}