{
    "chunk_id": 992574946529,
    "source_file": "Wind_Bear_Staff.md",
    "content_type": "one and two",
    "h1_title": "Wind Bear Staff",
    "h2_title": "Black Myth: Wukong Wind Bear Staff Location",
    "h1_content": "The Wind Bear Staff is a Rare weapon in Black Myth: Wukong. It comes with solid stats, especially for the point in the game where you earn it. It is one of the best Weapons in the early game.\nThis is largely down to its unique effect. With this weapon, the critical hit chance of the Unveiling Strike of Cloud Step is considerably increased. Pair that with the 4% Critical Hit Chance boost and 50 damage, and you have a really great weapon.",
    "h2_content": "The Wind Bear Staff can be found in Chapter 1 - Black Wind Mountain upon defeating Black Bear Guai in Black Wind Mountain. This is a mandatory boss at the end of the chapter, so you can't miss him. When you load into Chapter 2, you will be able to craft it at a Shrine.\nWind Bear Staff\nWeapons can be crafted throughout the game from the Shrines throughout the game's six chapters. Crafting weapons will require Will and various Crafting Materials from the game's locales and enemies. To craft the Wind Bear Staff you will need:\n* 1 Flame Ebongold\n* 4 Yaoguai Core\n* 8 Stone Spirit\n* 8,100 Will\nFor even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Armor and Gear locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.",
    "promot": "This is an excerpt from the file 'Wind_Bear_Staff.md', located in the main section titled 'Wind Bear Staff'. The section summary is: The Wind Bear Staff is a Rare weapon in Black Myth: Wukong. It comes with solid stats, especially for the point in the game where you earn it. It is one of the best Weapons in the early game.\nThis is largely down to its unique effect. With this weapon, the critical hit chance of the Unveiling Strike of Cloud Step is considerably increased. Pair that with the 4% Critical Hit Chance boost and 50 damage, and you have a really great weapon. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Wind Bear Staff Location', and the detailed content is as follows:\nThe Wind Bear Staff can be found in Chapter 1 - Black Wind Mountain upon defeating Black Bear Guai in Black Wind Mountain. This is a mandatory boss at the end of the chapter, so you can't miss him. When you load into Chapter 2, you will be able to craft it at a Shrine.\nWind Bear Staff\nWeapons can be crafted throughout the game from the Shrines throughout the game's six chapters. Crafting weapons will require Will and various Crafting Materials from the game's locales and enemies. To craft the Wind Bear Staff you will need:\n* 1 Flame Ebongold\n* 4 Yaoguai Core\n* 8 Stone Spirit\n* 8,100 Will\nFor even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Armor and Gear locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.",
    "promot_tokens_num": 386
}