{
    "chunk_id": 469822990335,
    "source_file": "Water_Curtain_Cave_and_Birthstone_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Water Curtain Cave and Birthstone Walkthrough",
    "h2_title": "Beginning a New Cycle",
    "h1_content": "Water Curtain Cave is the second area of Chapter 6 of Black Myth: Wukong, while Birthstone is the final section of the game. After conquering a variety of bosses and obtaining Wukong's special armor, The Destined One is ready to complete his journey. Below, you'll find a Walkthrough of the final areas of Mount Huaguo as well as information on the bosses you'll encounter along the way.\n* **Jump to a Section:**\n* Water Curtain Cave**\n* Return Path**\n* Peak of Innocence**\n* Birthstone - Heart of Birthstone**\n* Stone Monkey\n* The Great Sage's Broken Shell",
    "h2_content": "If you've seen both endings, and you choose \"Enter a New Cycle\" on the Main Menu, you'll be rewarded the Sixth of the Great Sage's Relics. This is Free Mind and has the options\n* **Elegance in Simplicity** \\- Moderately increases Light Attack damage.\n* **Unified Minds** \\- When the Destined One performs certain powerful moves, the Duplicates will follow suit.\n* **Unbegotten, Undying** \\- For a short duration after activating the Life-Saving Strand, escapes death and gains significant Damage Bonus.",
    "promot": "This is an excerpt from the file 'Water_Curtain_Cave_and_Birthstone_Walkthrough.md', located in the main section titled 'Water Curtain Cave and Birthstone Walkthrough'. The section summary is: Water Curtain Cave is the second area of Chapter 6 of Black Myth: Wukong, while Birthstone is the final section of the game. After conquering a variety of bosses and obtaining Wukong's special armor, The Destined One is ready to complete his journey. Below, you'll find a Walkthrough of the final areas of Mount Huaguo as well as information on the bosses you'll encounter along the way.\n* **Jump to a Section:**\n* Water Curtain Cave**\n* Return Path**\n* Peak of Innocence**\n* Birthstone - Heart of Birthstone**\n* Stone Monkey\n* The Great Sage's Broken Shell This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Beginning a New Cycle', and the detailed content is as follows:\nIf you've seen both endings, and you choose \"Enter a New Cycle\" on the Main Menu, you'll be rewarded the Sixth of the Great Sage's Relics. This is Free Mind and has the options\n* **Elegance in Simplicity** \\- Moderately increases Light Attack damage.\n* **Unified Minds** \\- When the Destined One performs certain powerful moves, the Duplicates will follow suit.\n* **Unbegotten, Undying** \\- For a short duration after activating the Life-Saving Strand, escapes death and gains significant Damage Bonus.",
    "promot_tokens_num": 325
}