{
    "chunk_id": 155287547840,
    "source_file": "Tiger_Tendon_Belt.md",
    "content_type": "one and two",
    "h1_title": "Tiger Tendon Belt",
    "h2_title": "Black Myth: Wukong Tiger Tendon Belt Location",
    "h1_content": "The Tiger Tendon Belt is one of the many Curios items you can find in Black Myth: Wukong. Like the rest of these items, once found, it can be equipped from the Equipment menu.\nWith the Tiger Tendon Belt equipped you are able to briefly see through the enemy and increase your attack.\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, the item will stay at its current power throughout the game. If you want a better buff or something else to fit your build, you will need to switch it out.",
    "h2_content": "The Tiger Tendon Belt can be found randomly from the Tiger Monks in The Webbed Hollow. The best place to farm this is at the Court of Illumination in the Temple of Yellow Flowers.\nTiger Tendon Belt\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "promot": "This is an excerpt from the file 'Tiger_Tendon_Belt.md', located in the main section titled 'Tiger Tendon Belt'. The section summary is: The Tiger Tendon Belt is one of the many Curios items you can find in Black Myth: Wukong. Like the rest of these items, once found, it can be equipped from the Equipment menu.\nWith the Tiger Tendon Belt equipped you are able to briefly see through the enemy and increase your attack.\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, the item will stay at its current power throughout the game. If you want a better buff or something else to fit your build, you will need to switch it out. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Tiger Tendon Belt Location', and the detailed content is as follows:\nThe Tiger Tendon Belt can be found randomly from the Tiger Monks in The Webbed Hollow. The best place to farm this is at the Court of Illumination in the Temple of Yellow Flowers.\nTiger Tendon Belt\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "promot_tokens_num": 295
}