{
    "chunk_id": 407567400092,
    "source_file": "Wind_Chime.md",
    "content_type": "one and two",
    "h1_title": "Wind Chime",
    "h2_title": "Black Myth: Wukong Wind Chime Location",
    "h1_content": "The Wind Chime is a Curios item that is rather exclusive in Black Myth: Wukong. You can get the Wind Chime Curios from purchasing the Deluxe Edition of the game or the Deluxe Edition upgrade pack.\nThe Wind Chime will slightly increase your movement speed when it is equipped, providing a noticeable but not drastic buff.\nCurios in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, you will want to switch to other Curios items to better fit your build as you . This can be done at any point from the Equipment menu.",
    "h2_content": "The Wind Chime can be obtained from the first Shrine, Front Hills, in the Forest of Wolves in Black Wind Mountain. It is located just after the initial couple of enemies before the bamboo bridge and is hard to miss.\nAt this spot, you can pick up the Trailblazer Deluxe Edition weapon and Deluxe Edition gear and equipment too, alongside this Curios item.\nWind Chime\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "promot": "This is an excerpt from the file 'Wind_Chime.md', located in the main section titled 'Wind Chime'. The section summary is: The Wind Chime is a Curios item that is rather exclusive in Black Myth: Wukong. You can get the Wind Chime Curios from purchasing the Deluxe Edition of the game or the Deluxe Edition upgrade pack.\nThe Wind Chime will slightly increase your movement speed when it is equipped, providing a noticeable but not drastic buff.\nCurios in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, you will want to switch to other Curios items to better fit your build as you . This can be done at any point from the Equipment menu. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Wind Chime Location', and the detailed content is as follows:\nThe Wind Chime can be obtained from the first Shrine, Front Hills, in the Forest of Wolves in Black Wind Mountain. It is located just after the initial couple of enemies before the bamboo bridge and is hard to miss.\nAt this spot, you can pick up the Trailblazer Deluxe Edition weapon and Deluxe Edition gear and equipment too, alongside this Curios item.\nWind Chime\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "promot_tokens_num": 320
}