{
    "chunk_id": 90882699119,
    "source_file": "Endings_Explained.md",
    "content_type": "one and two",
    "h1_title": "Endings Explained",
    "h2_title": "Ending 1 - The (Bad) Default Ending",
    "h1_content": "Black Myth: Wukong has two endings and you can experience both in one through if you complete them in the right order. One is the ending that happens naturally at the end of the game but is considered the bad ending, while the other is a secret ending only achieved by finding and completing several hidden areas and a side quest. On this page, we'll detail what both of the endings mean for The Destined One.",
    "h2_content": "To get this ending, you can complete all aspects of the game, **except for the hidden area of Mount Mei in The Great Pagoda**. With these conditions, you'll automatically unlock the bad ending after the final boss fight in Chapter 6.\nWhen you've beaten The Great Sage's Broken Shell, you'll see Wukong collapse in the water and the six senses leave its body.\nThese will be absorbed by The Destined One, who will kneel down face to face with Wukong. Despite obtaining all the Great Sage's Six Senses, and besting Wukong, a crown falls into the water.\nAs The Old Monkey collects the golden crown from the water, he places it on top of The Destined One's head. Unfortunately, this does nothing but place The Destined One inside the same rock that Wukong laid waiting.",
    "promot": "This is an excerpt from the file 'Endings_Explained.md', located in the main section titled 'Endings Explained'. The section summary is: Black Myth: Wukong has two endings and you can experience both in one through if you complete them in the right order. One is the ending that happens naturally at the end of the game but is considered the bad ending, while the other is a secret ending only achieved by finding and completing several hidden areas and a side quest. On this page, we'll detail what both of the endings mean for The Destined One. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Ending 1 - The (Bad) Default Ending', and the detailed content is as follows:\nTo get this ending, you can complete all aspects of the game, **except for the hidden area of Mount Mei in The Great Pagoda**. With these conditions, you'll automatically unlock the bad ending after the final boss fight in Chapter 6.\nWhen you've beaten The Great Sage's Broken Shell, you'll see Wukong collapse in the water and the six senses leave its body.\nThese will be absorbed by The Destined One, who will kneel down face to face with Wukong. Despite obtaining all the Great Sage's Six Senses, and besting Wukong, a crown falls into the water.\nAs The Old Monkey collects the golden crown from the water, he places it on top of The Destined One's head. Unfortunately, this does nothing but place The Destined One inside the same rock that Wukong laid waiting.",
    "promot_tokens_num": 331
}