{
    "chunk_id": 81297029754,
    "source_file": "Secrets_in_Black_Myth_Wukong.md",
    "content_type": "one and two",
    "h1_title": "Secrets in Black Myth Wukong",
    "h2_title": "King of Flowing Sands and Second Rat Prince - Missable Spirit, Item, and Hidden Boss",
    "h1_content": "If you only stick to the main story in Black Myth: Wukong, you're going to miss out on a lot of the content the game has to offer. The world is packed with secrets including NPCs and their side quests that reward unique items, hidden areas, and secret bosses. If you want to fill out every record in your journal and collect all of those trophies, here's a list of all the secrets we've found across the chapters.\n### Guide in Progress\nThis page is currently in progress, so we'll keep adding secrets along the way! Check back later for more information.\n**Click on the links below to jump to:**\nChapter 1 Secrets| Chapter 2 Secrets| Chapter 3 Secrets\n---|---|---\nChapter 4 Secrets| Chapter 5 Secrets| Chapter 6 Secrets\n# Chapter 1 Secrets\nThe secrets start from the very first chapter of the game, and there's not one but two hidden bosses to uncover as you explore. The first is Elder Jinchi and the second is Red Loong. There are also Transformation Spells and missable Spirits that you'll want to bag before you wrap up the chapter.",
    "h2_content": "The fight against the King of Flowing Sands and Second Rat Prince can either result in a missable spirit or another boss being hidden, depending on the choices you make.\nWhen you start the fight, you'll see two health bars. If you defeat the Second Rant Prince first, you won't be able to obtain the Second Rat Prince's Spirit. Nor will you get the Pungent Flesh Chunk. Instead, the King of Flowing Sands will run into the nearby cave and call upon the First Prince of Flowing Sands.\nIf you want to get the spirit, you need to beat the King of Flowing Sands first. You can then use the Pungent Flesh Chunk to call out the First Prince of Flowing Sands yourself in the nearby cave.\n### Relevant Guide Pages\n* King of Flowing Sands and Second Rat Prince\n* First Prince of Flowing Sands\n* Pungent Flesh Chunk",
    "promot": "This is an excerpt from the file 'Secrets_in_Black_Myth_Wukong.md', located in the main section titled 'Secrets in Black Myth Wukong'. The section summary is: If you only stick to the main story in Black Myth: Wukong, you're going to miss out on a lot of the content the game has to offer. The world is packed with secrets including NPCs and their side quests that reward unique items, hidden areas, and secret bosses. If you want to fill out every record in your journal and collect all of those trophies, here's a list of all the secrets we've found across the chapters.\n### Guide in Progress\nThis page is currently in progress, so we'll keep adding secrets along the way! Check back later for more information.\n**Click on the links below to jump to:**\nChapter 1 Secrets| Chapter 2 Secrets| Chapter 3 Secrets\n---|---|---\nChapter 4 Secrets| Chapter 5 Secrets| Chapter 6 Secrets\n# Chapter 1 Secrets\nThe secrets start from the very first chapter of the game, and there's not one but two hidden bosses to uncover as you explore. The first is Elder Jinchi and the second is Red Loong. There are also Transformation Spells and missable Spirits that you'll want to bag before you wrap up the chapter. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'King of Flowing Sands and Second Rat Prince - Missable Spirit, Item, and Hidden Boss', and the detailed content is as follows:\nThe fight against the King of Flowing Sands and Second Rat Prince can either result in a missable spirit or another boss being hidden, depending on the choices you make.\nWhen you start the fight, you'll see two health bars. If you defeat the Second Rant Prince first, you won't be able to obtain the Second Rat Prince's Spirit. Nor will you get the Pungent Flesh Chunk. Instead, the King of Flowing Sands will run into the nearby cave and call upon the First Prince of Flowing Sands.\nIf you want to get the spirit, you need to beat the King of Flowing Sands first. You can then use the Pungent Flesh Chunk to call out the First Prince of Flowing Sands yourself in the nearby cave.\n### Relevant Guide Pages\n* King of Flowing Sands and Second Rat Prince\n* First Prince of Flowing Sands\n* Pungent Flesh Chunk",
    "promot_tokens_num": 506
}