{
    "chunk_id": 645215463782,
    "source_file": "How_to_Find_the_Five_Skandhas_and_Unlock_a_Secret_Boss.md",
    "content_type": "one and two",
    "h1_title": "How to Find the Five Skandhas and Unlock a Secret Boss",
    "h2_title": "Where to use the Four Skandhas",
    "h1_content": "One of the earliest Key Items you might stumble across in Black Myth: Wukong is the Skandha of Form. However, it's not until the later stages of the game that this item becomes useful. There are 5 Skandhas to collect throughout the chapters, with 4 unlocking a secret boss in Chapter 6. Here's everything you need to know to get your hands on them.\n1. Skandha of Form\n2. Skandha of Feeling\n3. Skandha of Thought\n4. Skandha of Choice\n5. Use the Four Skandhas\n6. Skandha of Consciousness\n7. How to Use the Five Skandhas",
    "h2_content": "* **Location: Chapter 6 (Mount Huaguo, Foothills, Verdant Path)**\nNow that you have the Skandha of Form, Skandha of Feeling, Skandha of Thought, and Skandha of Choice, you'll need to wait until Chapter 6 and once you acquire the ability to travel on the clouds.\nFly using the clouds and go from the edge of the cliff, almost directly north of where you came. This will be where you can find the Son of Stones optional boss, with the Son sitting at the edge of the cliff.\nBeyond that, however, there's a large open area and a path that goes off to the right.\nYou'll need to ascend quite high up, but where the path reaches a dead end, up above there's an opening in the cliff that you can pass through. Follow this until you enter an area that's slightly covered and pass through this tunnel.\nAs you emerge in the wide open space, a Giant Shigandang will appear.\nUnfortunately, you will need to be on foot during the fight, so head for its fists and attack the blue crystals on it.",
    "promot": "This is an excerpt from the file 'How_to_Find_the_Five_Skandhas_and_Unlock_a_Secret_Boss.md', located in the main section titled 'How to Find the Five Skandhas and Unlock a Secret Boss'. The section summary is: One of the earliest Key Items you might stumble across in Black Myth: Wukong is the Skandha of Form. However, it's not until the later stages of the game that this item becomes useful. There are 5 Skandhas to collect throughout the chapters, with 4 unlocking a secret boss in Chapter 6. Here's everything you need to know to get your hands on them.\n1. Skandha of Form\n2. Skandha of Feeling\n3. Skandha of Thought\n4. Skandha of Choice\n5. Use the Four Skandhas\n6. Skandha of Consciousness\n7. How to Use the Five Skandhas This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to use the Four Skandhas', and the detailed content is as follows:\n* **Location: Chapter 6 (Mount Huaguo, Foothills, Verdant Path)**\nNow that you have the Skandha of Form, Skandha of Feeling, Skandha of Thought, and Skandha of Choice, you'll need to wait until Chapter 6 and once you acquire the ability to travel on the clouds.\nFly using the clouds and go from the edge of the cliff, almost directly north of where you came. This will be where you can find the Son of Stones optional boss, with the Son sitting at the edge of the cliff.\nBeyond that, however, there's a large open area and a path that goes off to the right.\nYou'll need to ascend quite high up, but where the path reaches a dead end, up above there's an opening in the cliff that you can pass through. Follow this until you enter an area that's slightly covered and pass through this tunnel.\nAs you emerge in the wide open space, a Giant Shigandang will appear.\nUnfortunately, you will need to be on foot during the fight, so head for its fists and attack the blue crystals on it.",
    "promot_tokens_num": 466
}