{
    "chunk_id": 696980553884,
    "source_file": "Quick_as_Fire,_Fast_as_Wind.md",
    "content_type": "one and two",
    "h1_title": "Quick as Fire, Fast as Wind",
    "h2_title": "How to Find Quick as Fire, Fast as Wind",
    "h1_content": "Quick as Fire, Fast as Wind at Yoaguai Chiefs you'll go up against in Chapter 5 in Black Myth: Wukong. The pair of heads will attack using fire, and are the last bosses you'll fight as part of the Woods of Ember pathway.",
    "h2_content": "You can find this duo immediately after fighting the Gray-Bronze Cart.\nEnter a large open area to find the fox guai suspended from a tree, and her two captors on the way. After she explains that she's been captured, two giant heads will descend upon the arena.\n### Quick as Fire, Fast as Wind Boss Fight and Guide\nQuick as Fire, Fast as Wind are a duo of heads that will use two elements to attack, both causing fire damage. As you may have guessed through this Chapter so far, the Fireproof Mantle is one of the best bits of equipment you can bring along with you. Quick as Fire is the head on the ground that will roll toward you, leaving trails of fire in its wake, while Fast as Wind is the floating head with the tusks.\nStart by focusing on Quick as Fire, using your Fireproof Mantle to protect you from the floor covered in fire. He will just roll around the arena, spewing fire all over the place, so the main focus is to dodge this and chase him with attacks.\nWhen you have the Fireproof Mantle equipped, you can stand in the fire and continuously hit him without worrying about your health bar. If you hit him hard enough, he'll go flying and you'll need to catch up to him to continue landing attacks.\nWhile you're doing this, Fast as Wind will follow you blowing gusts of wind down on you. If this hits you, it will also burn you. Avoid this while you focus on putting an end to Quick as Fire.\nWhen Quick as Fire is down, the intensity of Fast as Wind's attacks will increase. He'll now start to charge at you, sweeping down as close as possible to the ground, to hit you with his tusks. The best counter to this is a dodge, which will see him hit the ground and get his tusks stuck for a few seconds.\nBe ready to follow him and hit him as soon as this happens. Even when he pulls his tusks out from the ground, he'll be temporarily stunned, giving you enough time to attack. He will continue to chase you, blowing wind on you, but will also start to spit gusts of wind out. These will turn into small tornados but they're extremely short-lived, so as long as you can dodge the initial gust, you should be able to quickly get out of the way of the tornado.\nQuick as Fire, Fast as Wind",
    "promot": "This is an excerpt from the file 'Quick_as_Fire,_Fast_as_Wind.md', located in the main section titled 'Quick as Fire, Fast as Wind'. The section summary is: Quick as Fire, Fast as Wind at Yoaguai Chiefs you'll go up against in Chapter 5 in Black Myth: Wukong. The pair of heads will attack using fire, and are the last bosses you'll fight as part of the Woods of Ember pathway. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'How to Find Quick as Fire, Fast as Wind', and the detailed content is as follows:\nYou can find this duo immediately after fighting the Gray-Bronze Cart.\nEnter a large open area to find the fox guai suspended from a tree, and her two captors on the way. After she explains that she's been captured, two giant heads will descend upon the arena.\n### Quick as Fire, Fast as Wind Boss Fight and Guide\nQuick as Fire, Fast as Wind are a duo of heads that will use two elements to attack, both causing fire damage. As you may have guessed through this Chapter so far, the Fireproof Mantle is one of the best bits of equipment you can bring along with you. Quick as Fire is the head on the ground that will roll toward you, leaving trails of fire in its wake, while Fast as Wind is the floating head with the tusks.\nStart by focusing on Quick as Fire, using your Fireproof Mantle to protect you from the floor covered in fire. He will just roll around the arena, spewing fire all over the place, so the main focus is to dodge this and chase him with attacks.\nWhen you have the Fireproof Mantle equipped, you can stand in the fire and continuously hit him without worrying about your health bar. If you hit him hard enough, he'll go flying and you'll need to catch up to him to continue landing attacks.\nWhile you're doing this, Fast as Wind will follow you blowing gusts of wind down on you. If this hits you, it will also burn you. Avoid this while you focus on putting an end to Quick as Fire.\nWhen Quick as Fire is down, the intensity of Fast as Wind's attacks will increase. He'll now start to charge at you, sweeping down as close as possible to the ground, to hit you with his tusks. The best counter to this is a dodge, which will see him hit the ground and get his tusks stuck for a few seconds.\nBe ready to follow him and hit him as soon as this happens. Even when he pulls his tusks out from the ground, he'll be temporarily stunned, giving you enough time to attack. He will continue to chase you, blowing wind on you, but will also start to spit gusts of wind out. These will turn into small tornados but they're extremely short-lived, so as long as you can dodge the initial gust, you should be able to quickly get out of the way of the tornado.\nQuick as Fire, Fast as Wind",
    "promot_tokens_num": 629
}