{
    "chunk_id": 555848966963,
    "source_file": "Centipede_Guai.md",
    "content_type": "one and two",
    "h1_title": "Centipede Guai",
    "h2_title": "Where to Find the Centipede Guai",
    "h1_content": "The Centipede Guai is a required Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the middle section of The Webbed Hollow, this imposing insect guards the Bonevault leading down to the lower parts of the hollow.\n* Rewards: Centipede Guai Spirit, Gold Tree Core, Knot of Voidness, 2274 Experience, 1968 Will",
    "h2_content": "The Centipede Guai is an main boss and non-missable encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down to the Vedure Bridge Shrine, you'll find two paths divering when you head right to find a group of buildings in the underground hollow.\nBoth will take you on a path to the Centipede Guai's lair, either by way of the Middle Hollow Shrine and dropping down a ledge guarded by Skeletal Snakes, or taking the other lower path to the Bonevault Shrine that leads to his domain.",
    "promot": "This is an excerpt from the file 'Centipede_Guai.md', located in the main section titled 'Centipede Guai'. The section summary is: The Centipede Guai is a required Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the middle section of The Webbed Hollow, this imposing insect guards the Bonevault leading down to the lower parts of the hollow.\n* Rewards: Centipede Guai Spirit, Gold Tree Core, Knot of Voidness, 2274 Experience, 1968 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find the Centipede Guai', and the detailed content is as follows:\nThe Centipede Guai is an main boss and non-missable encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down to the Vedure Bridge Shrine, you'll find two paths divering when you head right to find a group of buildings in the underground hollow.\nBoth will take you on a path to the Centipede Guai's lair, either by way of the Middle Hollow Shrine and dropping down a ledge guarded by Skeletal Snakes, or taking the other lower path to the Bonevault Shrine that leads to his domain.",
    "promot_tokens_num": 276
}