{
    "chunk_id": 927002636082,
    "source_file": "Jade_Lotus_Gourd.md",
    "content_type": "one and two",
    "h1_title": "Jade Lotus Gourd",
    "h2_title": "Black Myth: Wukong Jade Lotus Gourd Location",
    "h1_content": "The Jade Lotus Gourd will likely be the first high-level Gourd you find in Black Myth: Wukong. It is of an Epic variety, and it comes with one of the more unique effects when compared with other Gourds.\nWith the Gourd equipped, each sip recovers a considerable amount of health for nearby duplicates if you are using spells like A Pluck of Many. This allows you to both heal yourself based on your Drink choice and your copies. On top of that, the Gourd has 6 uses by default before you have upgraded it at the Shen Monkey Vendor in Bamboo Grove in Black Wind Mountain.",
    "h2_content": "The Jade Lotus Gourd can be purchased from the Shen Monkey Vendor in Bamboo Grove in Black Wind Mountain after completing Chapter 2 - Yellow Wind Ridge. It costs 7,200 Will to buy it.\nBe sure to keep returning to the Shen Monkey Vendor after each chapter, as they will have new items to buy.\nJade Lotus Gourd\nFor even more guides and tips on finding all the Gourd customisation items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, Awaken Wine Worm locations, and Luoija Fragrant Vine locations.",
    "promot": "This is an excerpt from the file 'Jade_Lotus_Gourd.md', located in the main section titled 'Jade Lotus Gourd'. The section summary is: The Jade Lotus Gourd will likely be the first high-level Gourd you find in Black Myth: Wukong. It is of an Epic variety, and it comes with one of the more unique effects when compared with other Gourds.\nWith the Gourd equipped, each sip recovers a considerable amount of health for nearby duplicates if you are using spells like A Pluck of Many. This allows you to both heal yourself based on your Drink choice and your copies. On top of that, the Gourd has 6 uses by default before you have upgraded it at the Shen Monkey Vendor in Bamboo Grove in Black Wind Mountain. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Jade Lotus Gourd Location', and the detailed content is as follows:\nThe Jade Lotus Gourd can be purchased from the Shen Monkey Vendor in Bamboo Grove in Black Wind Mountain after completing Chapter 2 - Yellow Wind Ridge. It costs 7,200 Will to buy it.\nBe sure to keep returning to the Shen Monkey Vendor after each chapter, as they will have new items to buy.\nJade Lotus Gourd\nFor even more guides and tips on finding all the Gourd customisation items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, Awaken Wine Worm locations, and Luoija Fragrant Vine locations.",
    "promot_tokens_num": 323
}