{
    "chunk_id": 337481603399,
    "source_file": "Yellow_Loong.md",
    "content_type": "one and two",
    "h1_title": "Yellow Loong",
    "h2_title": "Yellow Loong Boss Fight and Guide",
    "h1_content": "Yellow Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 4 of Black Myth Wukong. Hiding across several rope bridges outside the middle of the Webbed Hollow, this boss can't be activated until you obtain a Key Item in the previous chapter. Yellow Loong is the final of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n* Rewards: Golden Lining Transformation Spell, Sea-Supporting Tendon, Golden Carp Curio, Kun Steel, Loong Pearl, Mind Core, 6998 Experience, 5049 Will",
    "h2_content": "The Yellow Loong is the last of the four Loong bosses, and rather appropriately, he's an incredibly challenging fight. In fact, you may want to attempt this optional fight later on, especially after you've completed the rest of Chapter 4 and gotten tougher armor sets and weapons before challenging him. While he doesn't have a huge moveset, the attacks he does can some fast, and when imbued with lightning can often kill you before you're able to react.\nIf you do challenge him early, you should really consider arming yourself to the teeth: Upgrade the Loongscale Armor to reduce shock duration, stock up on every medicine you can think of in addition to Shock-Quelling Powder, and ask the Xu Dog for extra pills that may include rare ones that give you boosts of health or damage increases. Such a powerful foe is deserving of your good consumables -- but you may want to practice a bit first before using them in battle.\nYellow Loong has a few distinct attack he can perform, but you'll often find he always starts the fight with the same one: After charging up power, he'll dash forward to thrust with his glaive.\nAfter a brief moment, he'll perform a spinning strike that hits twice as he winds up and then slams down his glaive, dealing electric damage all the while. This is a good time to dodge and then get in a light combo, and then start on a new combo chain.\nUsually as you begin your second combo chain, he'll do one of two things. If he performs a spinning flip, he'll retreat backwards, but the end of your combo can usually chase after him and strike regardless.\nHowever, if you see him raise up his glaive, he'll strike downwards, which you can break off your attack to deflect with Rock Solid, or Immobilize him before the hit lands to finish your second combo.\nWhen using his other basic melee attacks this early, he can raise his weapon and brace it behind his raised right foot, before performing two quick downward slices, then dragging his weapon along the ground for a moment before unleashing a charged upward slice, which is a lot to dodge quickly, but it can be done.\nIf he flips his weapon before catching it, he'll quickly thrust it out in your direction, then jump toward you with a small side slash before doing a bigger sweeping spin with an electric wave of force around him, which you'll need to dodge around his side to keep pace with.\nFinally, he can perform two quick downward slashes with his weapon, and then bring his glaive back across his body in a huge arc that creates an electric wave in front of him.\nYou'll want to dodge toward him and not away and get the hang of evading this attack early, as it won't be long before he'll upgrade the move to detonate a second bigger orange electric arc a moment after the initial slice.\nSpeaking of which, his other quick melee move will begin with a quick stab from the opposite end of his weapon (while turning his back to you) followed by an electric overhead slam. Don't get greedy, because he'll quickly pull his weapon out to swing it around for a big spinning arc that also extends a huge electric wave, which will shortly detonate with a bigger orange blast that you need to be well away from.\nBe **very** wary if you see him whip his weapon around to stab you with the opposite tip without turning his body like the aforementioned attack. If he's able to stab you, it will become an unblockable grab that will almost always give you the Shocked Status, and deplete a huge amount of your health in the process!\nThe first half of this fight will largely come down to learning these moves and how best to avoid them, and chain together counters to keep him staggered. You can offload a lot of damage early before he starts using his bigger moves by chaining initial light combo attacks to build your Focus past three points, Rock Solid deflect to fill the fourth meter and chain that into a heavy attack riposte with either the Thrust or Pillar Stance.\nWhen he staggers back, follow up with a quick but damaging Spirit Attack to keep him staggered (something like the Earth Wolf can deal a lot if you get him cornered against a wall where you'll keep running into him), and then swap into a Transformation Spell to keep him on the defensive.\nTake care when using your Transformation Spells to maximize damage by not being too reckless, and conserve might and health by dodging anything he throws out. The Umbral Abyss is a good pick since you can attack right as you transform, and use the spell at full might to further stun and chill him.\nOnce you take off a good chunk of his health, the second \"phase\" will start, and things get extremely dangerous. It will begin when he stops fighting to charge up and release a blast of electricity around him.\nAfter he does this, he'll immediately fly at you low to the ground with a slash while imbued by electricity that is incredibly quick and hard to dodge -- and it only gets worse from here.\nHe'll spend the next several attacks floating up above you and dive-bombing in his electrified state, and though each dive-bomb looks the same, the timing is slightly different depending on his motions before attacking:\nTwirling his glaive over his head will buy you a second until he finishes the animation before flying at you, but if he holds his glaive pointed behind him, you'll have the smallest of moments to dodge before he charges you. He may also hold his weapon under his other arm, or angle it downward, and each has its own timing.\nWorse still, after dashing at you 2-3 times, he'll start alternating slams where he strikes the ground at your position with a huge lightning blast, rather than charging past you. This can also go on for several hits with different wind-up speeds, and when electrified, a single mistake can spell doom.\nThere is one caveat: The key to surviving this attack string is to stop it before it starts, and there are a few special ways to stop him:\nThe easiest way to do so is to immediately trigger the Wind Tamer Vessel you get from Chapter 2's Secret area the second you see him charge up. The blast will immediately stun him, and he will be unable to complete the charge (the downside is you usually only have enough Qi to use it once, and he's known to employ this move multiple times).\nIf you have 3 focus points already banked, you can also quickly unleash a charged strike with the Thrust Stance to stagger him out of, but your reaction speed will need to be very quick.\nThe other way to stop him is to let him charge up, but then immediately shift into Rock Solid the second he releases the blast and flies at you for his initial swipe. It's this attack and this one only that will completely knock the wind out of him, and stop him from performing the rest of his dive-bombs and slams, which will not stagger him if you try deflecting those.\nEven outside this new attack of his, the last half of the fight will be even deadlier as he follows up many of his basic attacks with more sweeps and spins than before.\nOne of the more annoying new moves he'll employ is his own ability to \"Cloud Step\" to evade some of your moves. One of these he'll often perform at the end of a combo attack, ducking to the side, and then performing a jump where he stabs the ground with his polearm, and flips over to slam his tail down for a two-hit strike.\nThe other move is even more aggravating, as he can Cloud Step without warning even when standing around between moves if you try to attack, and can completely waste a fully charged strike. He'll dash backward while intangible, then quickly race forward to strike -- though you can turn that tables by deflecting his counter-attack.\nBecause of this, its often better to rely on building your focus with light attack combos, and only unleash heavy attacks after deflecting with Rock Solid for an instant hit that he won't have time to dodge. Getting your meter filled to the fourth focus point also ensures you'll be dealing the best possible damage that will knock him down every time.\nExpect this fight to take a lot of attempts as you learn the different ways he can string his combos together, when the best times are to catch him off guard, and - most importantly - practice dodging his lightning dive-bomb attacks that can kill your attempt in an instant. Try to get rid of the Shocked status effect any time you get inflicted, so long as you don't leave yourself open while doing so.\nOnce Yellow Loong is finally revealed, his fate will be sealed, as the Ancient Master whose garment he was hiding in will convince the ancient dragon to relinquish his power, channeling it into his polearm, which you can grab to obtain the Golden Lining Transformation Spell to become a Loong yourself! You'll also finally get the last ingredient types to craft the ultimate Loong Staff Weapon!\nYellow Loong",
    "promot": "This is an excerpt from the file 'Yellow_Loong.md', located in the main section titled 'Yellow Loong'. The section summary is: Yellow Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 4 of Black Myth Wukong. Hiding across several rope bridges outside the middle of the Webbed Hollow, this boss can't be activated until you obtain a Key Item in the previous chapter. Yellow Loong is the final of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n* Rewards: Golden Lining Transformation Spell, Sea-Supporting Tendon, Golden Carp Curio, Kun Steel, Loong Pearl, Mind Core, 6998 Experience, 5049 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Yellow Loong Boss Fight and Guide', and the detailed content is as follows:\nThe Yellow Loong is the last of the four Loong bosses, and rather appropriately, he's an incredibly challenging fight. In fact, you may want to attempt this optional fight later on, especially after you've completed the rest of Chapter 4 and gotten tougher armor sets and weapons before challenging him. While he doesn't have a huge moveset, the attacks he does can some fast, and when imbued with lightning can often kill you before you're able to react.\nIf you do challenge him early, you should really consider arming yourself to the teeth: Upgrade the Loongscale Armor to reduce shock duration, stock up on every medicine you can think of in addition to Shock-Quelling Powder, and ask the Xu Dog for extra pills that may include rare ones that give you boosts of health or damage increases. Such a powerful foe is deserving of your good consumables -- but you may want to practice a bit first before using them in battle.\nYellow Loong has a few distinct attack he can perform, but you'll often find he always starts the fight with the same one: After charging up power, he'll dash forward to thrust with his glaive.\nAfter a brief moment, he'll perform a spinning strike that hits twice as he winds up and then slams down his glaive, dealing electric damage all the while. This is a good time to dodge and then get in a light combo, and then start on a new combo chain.\nUsually as you begin your second combo chain, he'll do one of two things. If he performs a spinning flip, he'll retreat backwards, but the end of your combo can usually chase after him and strike regardless.\nHowever, if you see him raise up his glaive, he'll strike downwards, which you can break off your attack to deflect with Rock Solid, or Immobilize him before the hit lands to finish your second combo.\nWhen using his other basic melee attacks this early, he can raise his weapon and brace it behind his raised right foot, before performing two quick downward slices, then dragging his weapon along the ground for a moment before unleashing a charged upward slice, which is a lot to dodge quickly, but it can be done.\nIf he flips his weapon before catching it, he'll quickly thrust it out in your direction, then jump toward you with a small side slash before doing a bigger sweeping spin with an electric wave of force around him, which you'll need to dodge around his side to keep pace with.\nFinally, he can perform two quick downward slashes with his weapon, and then bring his glaive back across his body in a huge arc that creates an electric wave in front of him.\nYou'll want to dodge toward him and not away and get the hang of evading this attack early, as it won't be long before he'll upgrade the move to detonate a second bigger orange electric arc a moment after the initial slice.\nSpeaking of which, his other quick melee move will begin with a quick stab from the opposite end of his weapon (while turning his back to you) followed by an electric overhead slam. Don't get greedy, because he'll quickly pull his weapon out to swing it around for a big spinning arc that also extends a huge electric wave, which will shortly detonate with a bigger orange blast that you need to be well away from.\nBe **very** wary if you see him whip his weapon around to stab you with the opposite tip without turning his body like the aforementioned attack. If he's able to stab you, it will become an unblockable grab that will almost always give you the Shocked Status, and deplete a huge amount of your health in the process!\nThe first half of this fight will largely come down to learning these moves and how best to avoid them, and chain together counters to keep him staggered. You can offload a lot of damage early before he starts using his bigger moves by chaining initial light combo attacks to build your Focus past three points, Rock Solid deflect to fill the fourth meter and chain that into a heavy attack riposte with either the Thrust or Pillar Stance.\nWhen he staggers back, follow up with a quick but damaging Spirit Attack to keep him staggered (something like the Earth Wolf can deal a lot if you get him cornered against a wall where you'll keep running into him), and then swap into a Transformation Spell to keep him on the defensive.\nTake care when using your Transformation Spells to maximize damage by not being too reckless, and conserve might and health by dodging anything he throws out. The Umbral Abyss is a good pick since you can attack right as you transform, and use the spell at full might to further stun and chill him.\nOnce you take off a good chunk of his health, the second \"phase\" will start, and things get extremely dangerous. It will begin when he stops fighting to charge up and release a blast of electricity around him.\nAfter he does this, he'll immediately fly at you low to the ground with a slash while imbued by electricity that is incredibly quick and hard to dodge -- and it only gets worse from here.\nHe'll spend the next several attacks floating up above you and dive-bombing in his electrified state, and though each dive-bomb looks the same, the timing is slightly different depending on his motions before attacking:\nTwirling his glaive over his head will buy you a second until he finishes the animation before flying at you, but if he holds his glaive pointed behind him, you'll have the smallest of moments to dodge before he charges you. He may also hold his weapon under his other arm, or angle it downward, and each has its own timing.\nWorse still, after dashing at you 2-3 times, he'll start alternating slams where he strikes the ground at your position with a huge lightning blast, rather than charging past you. This can also go on for several hits with different wind-up speeds, and when electrified, a single mistake can spell doom.\nThere is one caveat: The key to surviving this attack string is to stop it before it starts, and there are a few special ways to stop him:\nThe easiest way to do so is to immediately trigger the Wind Tamer Vessel you get from Chapter 2's Secret area the second you see him charge up. The blast will immediately stun him, and he will be unable to complete the charge (the downside is you usually only have enough Qi to use it once, and he's known to employ this move multiple times).\nIf you have 3 focus points already banked, you can also quickly unleash a charged strike with the Thrust Stance to stagger him out of, but your reaction speed will need to be very quick.\nThe other way to stop him is to let him charge up, but then immediately shift into Rock Solid the second he releases the blast and flies at you for his initial swipe. It's this attack and this one only that will completely knock the wind out of him, and stop him from performing the rest of his dive-bombs and slams, which will not stagger him if you try deflecting those.\nEven outside this new attack of his, the last half of the fight will be even deadlier as he follows up many of his basic attacks with more sweeps and spins than before.\nOne of the more annoying new moves he'll employ is his own ability to \"Cloud Step\" to evade some of your moves. One of these he'll often perform at the end of a combo attack, ducking to the side, and then performing a jump where he stabs the ground with his polearm, and flips over to slam his tail down for a two-hit strike.\nThe other move is even more aggravating, as he can Cloud Step without warning even when standing around between moves if you try to attack, and can completely waste a fully charged strike. He'll dash backward while intangible, then quickly race forward to strike -- though you can turn that tables by deflecting his counter-attack.\nBecause of this, its often better to rely on building your focus with light attack combos, and only unleash heavy attacks after deflecting with Rock Solid for an instant hit that he won't have time to dodge. Getting your meter filled to the fourth focus point also ensures you'll be dealing the best possible damage that will knock him down every time.\nExpect this fight to take a lot of attempts as you learn the different ways he can string his combos together, when the best times are to catch him off guard, and - most importantly - practice dodging his lightning dive-bomb attacks that can kill your attempt in an instant. Try to get rid of the Shocked status effect any time you get inflicted, so long as you don't leave yourself open while doing so.\nOnce Yellow Loong is finally revealed, his fate will be sealed, as the Ancient Master whose garment he was hiding in will convince the ancient dragon to relinquish his power, channeling it into his polearm, which you can grab to obtain the Golden Lining Transformation Spell to become a Loong yourself! You'll also finally get the last ingredient types to craft the ultimate Loong Staff Weapon!\nYellow Loong",
    "promot_tokens_num": 2058
}