{
    "chunk_id": 749107795859,
    "source_file": "Graceful_Orchid.md",
    "content_type": "one and two",
    "h1_title": "Graceful Orchid",
    "h2_title": "Black Myth: Wukong Graceful Orchid Location",
    "h1_content": "The Graceful Orchid is one of the Epic Soaks for your Gourds in Black Myth: Wukong. The Soak's ability is basic when compared to some of the Epic Soaks in the game.\nWith the Tender Jade Lotus Soak equipped, using the gourd slowly recovers a small amount of health for a short duration. This is a small added boost to your healing on top of your Drink of choice.\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor.",
    "h2_content": "Graceful Orchid can be found at the end of Chen Loong's questline after giving him all 15 Seeds in the game within the Zodiac Realm in The New West. Our full page on the questline's initial steps will help you out. After you use the Ruyi Scroll\") and enter the Zodiac Realm, you will then need to grab the Special-made Bone-Strengthening Pellet, the Proto-Amourworm, and Rice-Cocoons\") to be able to plant the seeds.\nA full list of the seeds and where they can be found is on our Medicine Ingredients wiki page.\nGraceful Orchid\nSoaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "promot": "This is an excerpt from the file 'Graceful_Orchid.md', located in the main section titled 'Graceful Orchid'. The section summary is: The Graceful Orchid is one of the Epic Soaks for your Gourds in Black Myth: Wukong. The Soak's ability is basic when compared to some of the Epic Soaks in the game.\nWith the Tender Jade Lotus Soak equipped, using the gourd slowly recovers a small amount of health for a short duration. This is a small added boost to your healing on top of your Drink of choice.\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Graceful Orchid Location', and the detailed content is as follows:\nGraceful Orchid can be found at the end of Chen Loong's questline after giving him all 15 Seeds in the game within the Zodiac Realm in The New West. Our full page on the questline's initial steps will help you out. After you use the Ruyi Scroll\") and enter the Zodiac Realm, you will then need to grab the Special-made Bone-Strengthening Pellet, the Proto-Amourworm, and Rice-Cocoons\") to be able to plant the seeds.\nA full list of the seeds and where they can be found is on our Medicine Ingredients wiki page.\nGraceful Orchid\nSoaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "promot_tokens_num": 420
}