{
    "chunk_id": 131963766988,
    "source_file": "First_Prince_of_Flowing_Sands.md",
    "content_type": "one and two",
    "h1_title": "First Prince of Flowing Sands",
    "h2_title": "Where to Find First Prince of Flowing Sands",
    "h1_content": "The First Prince of Flowing Sands is an optional Yaoguai Chief miniboss that you can encounter in Chapter 2 of Black Myth Wukong. As an optional foe, you can seek out this boss just past the Sandgate Village in a large valley cave, and will need to defeat him to unlock more than one secret boss.\n* Rewards: Arhat Hold Piece, Silk x2, Yarn x2, 1102 Experience, 1020 Will",
    "h2_content": "While you can find the First Prince of Flowing Sands in the Valley of Despair beyond the Sandgate Village in Chapter 2's Yellow Wind Ridge. However, depending on how you deal with his father and brother - the King of Flowing Sands and Second Rat Prince - there are a few ways he can appear.\nIf you didn't kill the King during the previous fight and only defeated the Second Rat Prince, the King will have fled -- to this very area in fact. When you approach, he'll summon his son, but meet an untimely demise.\nIf you did kill the King (and made his Second Son very angry), you'll have gained a Pungent Flesh Chunk Key Item from defeating the duo. This item can be used at the very edge of the valley's cliff to summon the First Prince himself.\n### Yaoguai Chief Mini-Boss Fight - First Prince of Flowing Sands\nIf you didn’t kill the King of Flowing Sands when fighting him and his second son, he’ll have snuck over here to summon his even bigger first son to beat you into a pulp (the First Prince however, will promptly deal with the King himself). If you killed both King and Prince, you can instead toss down the Pungent Flesh Chunk to rouse the Prince out of his lair.\nAs a much bigger foe than the Second Prince, expect a lot of large slamming attacks in your direction. He’s a wild and unpredictable opponent, so be sure to use Cloud Step to get out of the way if you’re not sure what’s coming, then crash back into him from the sides.\nThe First Prince will usually start with a lunging two-hand slam attack after he stands on his hind legs that shakes up a lot of dust, but you can dodge to the side and keep attacking as he recovers.\nOther general attacks include alternating hand slams that come in 1 or 2 hit successions. He can also put his hand down to the side first, and then sweep it across the front in a slower swipe that you’ll need to dodge back from instead of moving alongside his hand.\nSome scarier attacks that the First Prince can employ will have him stand up holding his arms to the side, then stumbling forward in a large swing as he topples down on his side, which covers a large area both from the arm swipe and body slam. Be sure to dodge to the side he puts his arms up and you’ll avoid him swinging in the opposite direction.\nHe also has a surprisingly quick lunge that’s very hard to dodge if you don’t look for the subtle cue of him slowly extending one arm backward before lunging forward with a quick sliding swipe attack. If you see it early, you can also Immobilize him to interrupt before he can perform it.\nIf you try dodging around and attacking from the side, be aware that he can either use a quick tail swipe to stagger you, or swing his arm back quickly to draw you away from flanking him, so don’t get too comfortable.\nEven as big as he is with a larger health pool, he’s not as ferocious as the enraged Second Prince. Do note however there is a **secret trick in this fight** : If you lure him into doing one of his larger slam attacks while your back is to the curved wall, his strikes may cause the wall to crack - revealing a secret!\nOnce he’s been defeated, he’ll drop the **Arhat Gold Piece** Key Item. We'll need it for a sidequest elsewhere in this chapter.\nFirst Prince of Flowing Sands\n### The Loong’s Secret Tomb\nIf you got lucky, the First Prince’s attacks may have formed a giant crack in the slightly rounded wall full of little statues on the side of the boss arena, forming a hole you can slide through. If you weren’t able to trigger this, don't worry. You can crack the wall yourself, but it will require a major attack, much bigger than your little monkey frame can deal out. However, specific transformations will get the job done - like the Wandering Wight’s Spirit headbutt attack, or the Azure Dust transformation spell found elsewhere in this chapter.\nOn the other side of the crack, you’ll enter a large tomb with a chest by a mural. It holds the Loong Scale - a very important object that allows you to access several secret bosses!",
    "promot": "This is an excerpt from the file 'First_Prince_of_Flowing_Sands.md', located in the main section titled 'First Prince of Flowing Sands'. The section summary is: The First Prince of Flowing Sands is an optional Yaoguai Chief miniboss that you can encounter in Chapter 2 of Black Myth Wukong. As an optional foe, you can seek out this boss just past the Sandgate Village in a large valley cave, and will need to defeat him to unlock more than one secret boss.\n* Rewards: Arhat Hold Piece, Silk x2, Yarn x2, 1102 Experience, 1020 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find First Prince of Flowing Sands', and the detailed content is as follows:\nWhile you can find the First Prince of Flowing Sands in the Valley of Despair beyond the Sandgate Village in Chapter 2's Yellow Wind Ridge. However, depending on how you deal with his father and brother - the King of Flowing Sands and Second Rat Prince - there are a few ways he can appear.\nIf you didn't kill the King during the previous fight and only defeated the Second Rat Prince, the King will have fled -- to this very area in fact. When you approach, he'll summon his son, but meet an untimely demise.\nIf you did kill the King (and made his Second Son very angry), you'll have gained a Pungent Flesh Chunk Key Item from defeating the duo. This item can be used at the very edge of the valley's cliff to summon the First Prince himself.\n### Yaoguai Chief Mini-Boss Fight - First Prince of Flowing Sands\nIf you didn’t kill the King of Flowing Sands when fighting him and his second son, he’ll have snuck over here to summon his even bigger first son to beat you into a pulp (the First Prince however, will promptly deal with the King himself). If you killed both King and Prince, you can instead toss down the Pungent Flesh Chunk to rouse the Prince out of his lair.\nAs a much bigger foe than the Second Prince, expect a lot of large slamming attacks in your direction. He’s a wild and unpredictable opponent, so be sure to use Cloud Step to get out of the way if you’re not sure what’s coming, then crash back into him from the sides.\nThe First Prince will usually start with a lunging two-hand slam attack after he stands on his hind legs that shakes up a lot of dust, but you can dodge to the side and keep attacking as he recovers.\nOther general attacks include alternating hand slams that come in 1 or 2 hit successions. He can also put his hand down to the side first, and then sweep it across the front in a slower swipe that you’ll need to dodge back from instead of moving alongside his hand.\nSome scarier attacks that the First Prince can employ will have him stand up holding his arms to the side, then stumbling forward in a large swing as he topples down on his side, which covers a large area both from the arm swipe and body slam. Be sure to dodge to the side he puts his arms up and you’ll avoid him swinging in the opposite direction.\nHe also has a surprisingly quick lunge that’s very hard to dodge if you don’t look for the subtle cue of him slowly extending one arm backward before lunging forward with a quick sliding swipe attack. If you see it early, you can also Immobilize him to interrupt before he can perform it.\nIf you try dodging around and attacking from the side, be aware that he can either use a quick tail swipe to stagger you, or swing his arm back quickly to draw you away from flanking him, so don’t get too comfortable.\nEven as big as he is with a larger health pool, he’s not as ferocious as the enraged Second Prince. Do note however there is a **secret trick in this fight** : If you lure him into doing one of his larger slam attacks while your back is to the curved wall, his strikes may cause the wall to crack - revealing a secret!\nOnce he’s been defeated, he’ll drop the **Arhat Gold Piece** Key Item. We'll need it for a sidequest elsewhere in this chapter.\nFirst Prince of Flowing Sands\n### The Loong’s Secret Tomb\nIf you got lucky, the First Prince’s attacks may have formed a giant crack in the slightly rounded wall full of little statues on the side of the boss arena, forming a hole you can slide through. If you weren’t able to trigger this, don't worry. You can crack the wall yourself, but it will require a major attack, much bigger than your little monkey frame can deal out. However, specific transformations will get the job done - like the Wandering Wight’s Spirit headbutt attack, or the Azure Dust transformation spell found elsewhere in this chapter.\nOn the other side of the crack, you’ll enter a large tomb with a chest by a mural. It holds the Loong Scale - a very important object that allows you to access several secret bosses!",
    "promot_tokens_num": 1058
}