{
    "chunk_id": 31979714741,
    "source_file": "New_Thunderclap_Temple_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "New Thunderclap Temple Walkthrough",
    "h2_title": "Yaoguai Chief Miniboss Fight - Macaque Chief (Final Encounter)",
    "h1_content": "The New Thunderclap Temple is the final main region of Chapter 3 in The New West in Black Myth: Wukong. Below you'll find a guide for the New Thunderclap Temple Region, including how to navigate the temple, complete the Snow Fox Questline and defeat all of Yellowbrow's disciples, and finally face Yellowbrow himself.\n* **Jump to a Section:**\n* **Temple Entrance**\n* Yaoguai Chief - Monk from the Sea\n* **Temple Main Plaza**\n* Yaoguai Chief - Non-Void\n* **Temple Inner Courtyard**\n* Yaoguai Chief - Non-Pure\n* **Mahavira Hall**\n* Yaoguai King - Yellowbrow\n* Yaoguai Chief - Macaque Chief\n* Yaoguai King - Yellowbrow (Round Two)\nNow that you've made your way through the Valley of Ecstasy (and hopefully accepted the Snow Fox's request in the Forest of Felicity), the grand New Thunderclap Temple awaits.\nThe temple is a sprawling complex teeming with Yellowbrow's minions, and is comprised of three main plazas leading to the large pagoda tower in the distance, with additional and optional areas on both sides as you make your way up.",
    "h2_content": "For this last bout with the Macaque Chief, your friend Zhu Bajie will be here to help, but will warn you that the sack's magic draws out evil to empower this foe beyond his normal limits.\nEven though you'll have the help of a friend, don't expect this to be an easy fight, as the Macaque Chief hits harder than ever with his evil sword. On the plus side, your health, mana, and gourd will be fully replenished after the Yellowbrow fight, and if you are defeated here, you can re-enter the temple to skip the first fight and pick up where you left off.\nA lot of the Macaque Chief's attacks should look familiar, which is a good thing as you'll be able to accurately react and avoid his most common attacks.\nExpect him to employ his reliable sword stab where the claws out in front of him before grabbing the sword back with his legs to swing at you with, but the range will be greatly increased.\nHe also employs a lot of usual blade swipes, and his multi-hit spinning two-handed swings, which now create large projectiles slashes in front of him.\nLuckily, the Macaque Chief is just as prone to staggering as he was before, even more-so now thanks to the combined efforts of you and your ally, you can repeatedly knock him out of certain moves with well-times heavy hits that sends him toppling to the ground. A single focus point is you need to poke him off his sword when he stands on it!\nUnfortunately, it won't be long before the Macaque Chief makes an effort to rectify this, and takes to the air. He'll then send out two shadow versions of himself to fly down and strike you, but they actually stick around to fight!\nWhile it's tempting to leave the shadows to Zhu Bajie to fight on his own, you're much better off repositioning yourself to take on the clones (and you may even want to summon your own clones if you can find some breathing room.\nThe clones don't have a whole lot of health (but they can replicate most of his moves - including poison spewing!), so go all in and blitz them quickly with a combination of Spirits attacks and Transformation Spells like Ashen Slumber, getting in enough hits to detonate yourself and deal massive damage to everyone if possible.\nThe sooner you remove the clones from the fight, the sooner you'll be able to tag team the Macaque Chief again -- but be prepared for him to pull the similar trick later on if the fight is drawn out long enough.\nInstead of permanent clones, he can also fly up and create kamikaze versions of his shadow clones to fly at you for a single slash, while he prepares a mighty slash of his own as a third and final shadow comes your way.\nEven without clones, he can still fly up to charge his sword, and then charge you with a fast-diving slash attack that you can deflect head on to stop him in his tracks.\nIf you dodge instead, be ready for him to pivot into a jumping slash attack after landing, which will expel a cyclone of blade slashes around him after a short delay.\nAnother new move he can perform when jumping on his blade will be to launch himself into the air instead of slashing with it, which will expel a handful of projectiles feathers from his wings that will fly down at you quickly after hanging in the air for a moment. If you have the time, you can spin your staff, or just simply dodge as they will all reach you at the same moment.\nAfter you've defeated his clones and beaten the Macaque Chief one final time, the Destined One will stand victorious, but the evil energies of the seed sack will warp your mind, transforming you into that which you have sought to defeat!\nMacaque Chief (Mahavira Hall)\n### Floating Sculpture\nYellowbrow will then scoop you out of the sack and place your tiny form into his Floating Sculpture with all his other \"disciples\".\nIn this new transformed state, you'll have little else to do but slash through all of the figures that try to oppose you.\nThe good news in all of this is you'll be pretty unstoppable in this mode. Your light attacks will unleash a flurry of wide sweep attacks, and your heavy strike will perform his spinning slash move.\nKeep defeating any disciple that stands in your path, and move along the platforms and descend to the bottom.\nOne you reach a Clay Vajra, you'll be infused with even more power, and your standard slashes will now cast small projectiles blades out in front of you.\nNot long after you reach the next section, you'll grow wings, and your projectile slashes will tear through anything in your path with ease.\nKeep moving down until you reach the bottom shelf, and you'll find another pathway back up on the opposite side of Yellowbrow's little diorama. Once you clear a path to a large open arena, Yellowbrow himself will shrink down to meet you in combat for a final bout.",
    "promot": "This is an excerpt from the file 'New_Thunderclap_Temple_Walkthrough.md', located in the main section titled 'New Thunderclap Temple Walkthrough'. The section summary is: The New Thunderclap Temple is the final main region of Chapter 3 in The New West in Black Myth: Wukong. Below you'll find a guide for the New Thunderclap Temple Region, including how to navigate the temple, complete the Snow Fox Questline and defeat all of Yellowbrow's disciples, and finally face Yellowbrow himself.\n* **Jump to a Section:**\n* **Temple Entrance**\n* Yaoguai Chief - Monk from the Sea\n* **Temple Main Plaza**\n* Yaoguai Chief - Non-Void\n* **Temple Inner Courtyard**\n* Yaoguai Chief - Non-Pure\n* **Mahavira Hall**\n* Yaoguai King - Yellowbrow\n* Yaoguai Chief - Macaque Chief\n* Yaoguai King - Yellowbrow (Round Two)\nNow that you've made your way through the Valley of Ecstasy (and hopefully accepted the Snow Fox's request in the Forest of Felicity), the grand New Thunderclap Temple awaits.\nThe temple is a sprawling complex teeming with Yellowbrow's minions, and is comprised of three main plazas leading to the large pagoda tower in the distance, with additional and optional areas on both sides as you make your way up. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Yaoguai Chief Miniboss Fight - Macaque Chief (Final Encounter)', and the detailed content is as follows:\nFor this last bout with the Macaque Chief, your friend Zhu Bajie will be here to help, but will warn you that the sack's magic draws out evil to empower this foe beyond his normal limits.\nEven though you'll have the help of a friend, don't expect this to be an easy fight, as the Macaque Chief hits harder than ever with his evil sword. On the plus side, your health, mana, and gourd will be fully replenished after the Yellowbrow fight, and if you are defeated here, you can re-enter the temple to skip the first fight and pick up where you left off.\nA lot of the Macaque Chief's attacks should look familiar, which is a good thing as you'll be able to accurately react and avoid his most common attacks.\nExpect him to employ his reliable sword stab where the claws out in front of him before grabbing the sword back with his legs to swing at you with, but the range will be greatly increased.\nHe also employs a lot of usual blade swipes, and his multi-hit spinning two-handed swings, which now create large projectiles slashes in front of him.\nLuckily, the Macaque Chief is just as prone to staggering as he was before, even more-so now thanks to the combined efforts of you and your ally, you can repeatedly knock him out of certain moves with well-times heavy hits that sends him toppling to the ground. A single focus point is you need to poke him off his sword when he stands on it!\nUnfortunately, it won't be long before the Macaque Chief makes an effort to rectify this, and takes to the air. He'll then send out two shadow versions of himself to fly down and strike you, but they actually stick around to fight!\nWhile it's tempting to leave the shadows to Zhu Bajie to fight on his own, you're much better off repositioning yourself to take on the clones (and you may even want to summon your own clones if you can find some breathing room.\nThe clones don't have a whole lot of health (but they can replicate most of his moves - including poison spewing!), so go all in and blitz them quickly with a combination of Spirits attacks and Transformation Spells like Ashen Slumber, getting in enough hits to detonate yourself and deal massive damage to everyone if possible.\nThe sooner you remove the clones from the fight, the sooner you'll be able to tag team the Macaque Chief again -- but be prepared for him to pull the similar trick later on if the fight is drawn out long enough.\nInstead of permanent clones, he can also fly up and create kamikaze versions of his shadow clones to fly at you for a single slash, while he prepares a mighty slash of his own as a third and final shadow comes your way.\nEven without clones, he can still fly up to charge his sword, and then charge you with a fast-diving slash attack that you can deflect head on to stop him in his tracks.\nIf you dodge instead, be ready for him to pivot into a jumping slash attack after landing, which will expel a cyclone of blade slashes around him after a short delay.\nAnother new move he can perform when jumping on his blade will be to launch himself into the air instead of slashing with it, which will expel a handful of projectiles feathers from his wings that will fly down at you quickly after hanging in the air for a moment. If you have the time, you can spin your staff, or just simply dodge as they will all reach you at the same moment.\nAfter you've defeated his clones and beaten the Macaque Chief one final time, the Destined One will stand victorious, but the evil energies of the seed sack will warp your mind, transforming you into that which you have sought to defeat!\nMacaque Chief (Mahavira Hall)\n### Floating Sculpture\nYellowbrow will then scoop you out of the sack and place your tiny form into his Floating Sculpture with all his other \"disciples\".\nIn this new transformed state, you'll have little else to do but slash through all of the figures that try to oppose you.\nThe good news in all of this is you'll be pretty unstoppable in this mode. Your light attacks will unleash a flurry of wide sweep attacks, and your heavy strike will perform his spinning slash move.\nKeep defeating any disciple that stands in your path, and move along the platforms and descend to the bottom.\nOne you reach a Clay Vajra, you'll be infused with even more power, and your standard slashes will now cast small projectiles blades out in front of you.\nNot long after you reach the next section, you'll grow wings, and your projectile slashes will tear through anything in your path with ease.\nKeep moving down until you reach the bottom shelf, and you'll find another pathway back up on the opposite side of Yellowbrow's little diorama. Once you clear a path to a large open arena, Yellowbrow himself will shrink down to meet you in combat for a final bout.",
    "promot_tokens_num": 1365
}