{
    "chunk_id": 348809695656,
    "source_file": "Cat_Eye_Beads.md",
    "content_type": "one and two",
    "h1_title": "Cat Eye Beads",
    "h2_title": "Black Myth: Wukong Cat Eye Beads Location",
    "h1_content": "The Cat Eye Beads iare one of the Curios items you can find in Black Myth: Wukong. Given its location in the game, it will likely be one of the first ones you find.\nWith the Cat Eye Beads equipped, you will get a slightly increased critical hit chance, which can provide a decent attack boost when you need it.\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their strength. Therefore, if you want to increase their power or find a better item for your build, you will need to search them out and switch your Curios item from the Equipment menu.",
    "h2_content": "The Cat Eye Beads can be found by killing the Wandering Wight in the Forest of Wolves \\- Outside the Forest Shrine area in Black Wind Mountain. The Wight is located along the main path towards Guanyin Temple.\nYou need to defeat the Wandering Wight before ringing all three bells in Black Wind Mountain and killing Elder Jinchi. This secret boss in the Ancient Guanyin Temple will despawn the Wandering Wight, making the Beads unobtainable. You can also grab the Wandering Wight Spirit here too upon defeating him.\nThe Wandering Wight acts as a skill check boss early in the game, so don't be afraid to come back after you have levelled up, just don't kill Elder Jinchi.\nOur guide on how to ring all three bells in Black Wind Mountain will take you through how to find the secret area if you haven't already.\nCat Eye Beads\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "promot": "This is an excerpt from the file 'Cat_Eye_Beads.md', located in the main section titled 'Cat Eye Beads'. The section summary is: The Cat Eye Beads iare one of the Curios items you can find in Black Myth: Wukong. Given its location in the game, it will likely be one of the first ones you find.\nWith the Cat Eye Beads equipped, you will get a slightly increased critical hit chance, which can provide a decent attack boost when you need it.\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their strength. Therefore, if you want to increase their power or find a better item for your build, you will need to search them out and switch your Curios item from the Equipment menu. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Cat Eye Beads Location', and the detailed content is as follows:\nThe Cat Eye Beads can be found by killing the Wandering Wight in the Forest of Wolves \\- Outside the Forest Shrine area in Black Wind Mountain. The Wight is located along the main path towards Guanyin Temple.\nYou need to defeat the Wandering Wight before ringing all three bells in Black Wind Mountain and killing Elder Jinchi. This secret boss in the Ancient Guanyin Temple will despawn the Wandering Wight, making the Beads unobtainable. You can also grab the Wandering Wight Spirit here too upon defeating him.\nThe Wandering Wight acts as a skill check boss early in the game, so don't be afraid to come back after you have levelled up, just don't kill Elder Jinchi.\nOur guide on how to ring all three bells in Black Wind Mountain will take you through how to find the secret area if you haven't already.\nCat Eye Beads\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "promot_tokens_num": 443
}