{
    "chunk_id": 849680960917,
    "source_file": "Secrets_in_Black_Myth_Wukong.md",
    "content_type": "one and two",
    "h1_title": "Secrets in Black Myth Wukong",
    "h2_title": "Red Loong",
    "h1_content": "If you only stick to the main story in Black Myth: Wukong, you're going to miss out on a lot of the content the game has to offer. The world is packed with secrets including NPCs and their side quests that reward unique items, hidden areas, and secret bosses. If you want to fill out every record in your journal and collect all of those trophies, here's a list of all the secrets we've found across the chapters.\n### Guide in Progress\nThis page is currently in progress, so we'll keep adding secrets along the way! Check back later for more information.\n**Click on the links below to jump to:**\nChapter 1 Secrets| Chapter 2 Secrets| Chapter 3 Secrets\n---|---|---\nChapter 4 Secrets| Chapter 5 Secrets| Chapter 6 Secrets\n# Chapter 1 Secrets\nThe secrets start from the very first chapter of the game, and there's not one but two hidden bosses to uncover as you explore. The first is Elder Jinchi and the second is Red Loong. There are also Transformation Spells and missable Spirits that you'll want to bag before you wrap up the chapter.",
    "h2_content": "Though Red Loong can be found in Chapter 1, you'll actually **need to wait until Chapter 2 before you can access the secret boss.** Once you've collected the Loong Scales from Chapter 2, return to the Keeper's Shrine called Outside the Forest and head to the nearby waterfall. With the Scales in your possession, you can now enter the waterfall and fight Red Loong.\n### Relevant Guide Pages\n* How to Find the Loong Scales and Red Loong\n* Red Loong Boss Guide\n# Chapter 2 Secrets\nChapter 2 has a lot more secrets to uncover, including another hidden area that opens up after finishing a side quest and some Key Items that will help you reach missable bosses.",
    "promot": "This is an excerpt from the file 'Secrets_in_Black_Myth_Wukong.md', located in the main section titled 'Secrets in Black Myth Wukong'. The section summary is: If you only stick to the main story in Black Myth: Wukong, you're going to miss out on a lot of the content the game has to offer. The world is packed with secrets including NPCs and their side quests that reward unique items, hidden areas, and secret bosses. If you want to fill out every record in your journal and collect all of those trophies, here's a list of all the secrets we've found across the chapters.\n### Guide in Progress\nThis page is currently in progress, so we'll keep adding secrets along the way! Check back later for more information.\n**Click on the links below to jump to:**\nChapter 1 Secrets| Chapter 2 Secrets| Chapter 3 Secrets\n---|---|---\nChapter 4 Secrets| Chapter 5 Secrets| Chapter 6 Secrets\n# Chapter 1 Secrets\nThe secrets start from the very first chapter of the game, and there's not one but two hidden bosses to uncover as you explore. The first is Elder Jinchi and the second is Red Loong. There are also Transformation Spells and missable Spirits that you'll want to bag before you wrap up the chapter. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Red Loong', and the detailed content is as follows:\nThough Red Loong can be found in Chapter 1, you'll actually **need to wait until Chapter 2 before you can access the secret boss.** Once you've collected the Loong Scales from Chapter 2, return to the Keeper's Shrine called Outside the Forest and head to the nearby waterfall. With the Scales in your possession, you can now enter the waterfall and fight Red Loong.\n### Relevant Guide Pages\n* How to Find the Loong Scales and Red Loong\n* Red Loong Boss Guide\n# Chapter 2 Secrets\nChapter 2 has a lot more secrets to uncover, including another hidden area that opens up after finishing a side quest and some Key Items that will help you reach missable bosses.",
    "promot_tokens_num": 458
}