{
    "chunk_id": 833207401890,
    "source_file": "Azure_Dust.md",
    "content_type": "one and two",
    "h1_title": "Azure Dust",
    "h2_title": "Black Myth: Wukong Azure Dust Location",
    "h1_content": "Azure Dust is one of the more hidden Transformation Spells in Black Myth: Wukong. Unlike some of the other Transformations, Azure Dust doesn't have much flexibility in how you use it. But, it has some powerful attacks even the Transformation is hard to control.\nThe Transformation allows you to transform into a rock guai, immune to all Four Banes. Azure Dust also builds up Might when hit. Azure Dust's moveset is as follows:\n* **Light Attack: Earth Shatter - Strike the enemy three times with your heavy head**. This is a powerful slam on the ground with your head that can be repeated.\n* **Heavy Attack: Mountain Splitter - Dash forward with full force. Fully charge to dash further**. This is a slow, but heavy charged dash which can pin enemies and also get you out of danger if needed. It lacks a lot of control, however.\n* **De-transformation Attack: Body Slam - Slam your body into the ground.** This is the final attack Azure Dust will perform when it runs out of stamina. It turns around and slams its whole body into the ground.",
    "h2_content": "The Azure Dust Transformation can be found in Fright Cliff - Squall Hideout in Yellow Wind Ridge. After defeating both the Mother of Stones boss and the Man-In-Stone\") boss with the Stone Essence in your inventory, you will unlock the Transformation. Our walkthrough and boss guides of the Fright Cliff area will help you complete this side quest.\nAzure Dust",
    "promot": "This is an excerpt from the file 'Azure_Dust.md', located in the main section titled 'Azure Dust'. The section summary is: Azure Dust is one of the more hidden Transformation Spells in Black Myth: Wukong. Unlike some of the other Transformations, Azure Dust doesn't have much flexibility in how you use it. But, it has some powerful attacks even the Transformation is hard to control.\nThe Transformation allows you to transform into a rock guai, immune to all Four Banes. Azure Dust also builds up Might when hit. Azure Dust's moveset is as follows:\n* **Light Attack: Earth Shatter - Strike the enemy three times with your heavy head**. This is a powerful slam on the ground with your head that can be repeated.\n* **Heavy Attack: Mountain Splitter - Dash forward with full force. Fully charge to dash further**. This is a slow, but heavy charged dash which can pin enemies and also get you out of danger if needed. It lacks a lot of control, however.\n* **De-transformation Attack: Body Slam - Slam your body into the ground.** This is the final attack Azure Dust will perform when it runs out of stamina. It turns around and slams its whole body into the ground. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Azure Dust Location', and the detailed content is as follows:\nThe Azure Dust Transformation can be found in Fright Cliff - Squall Hideout in Yellow Wind Ridge. After defeating both the Mother of Stones boss and the Man-In-Stone\") boss with the Stone Essence in your inventory, you will unlock the Transformation. Our walkthrough and boss guides of the Fright Cliff area will help you complete this side quest.\nAzure Dust",
    "promot_tokens_num": 365
}