{
    "chunk_id": 540821780785,
    "source_file": "Monk_from_the_Sea.md",
    "content_type": "one and two",
    "h1_title": "Monk from the Sea",
    "h2_title": "Where to Find The Monk from the Sea",
    "h1_content": "The Monk from the Sea is an optional miniboss fight that you can encounter in Chapter 3 of Black Myth Wukong. A much tougher variant of the other Sea Monks you can encounter in The New West, this boss hides within the New Thunderclap Temple.\n* **Rewards:** Hoarfrost Transformation Spell, Random Materials, 1847 Experience, 1195 Will",
    "h2_content": "The Monk from the Sea is an optional boss, and hides within the New Thunderclap Temple at the far end of the Valley of Ecstasy in The New West. To find him, you'll need to explore an optional path once inside the temple grounds.\nFrom the Temple Entrance Shrine, take the far right path and head up a narrow sloping path filled with Supporter Monks to find a side area, and continue through the large gate past where Censor Holders are praying, and the monk will jump out of an altar as you enter the next large open part of the temple grounds.\n### Monk from the Sea Miniboss Fight and Guide\nThe Monk from the Sea is essentially a supercharged version of the already tough Sea Monks you've been encountering since escaping the Pagoda Realm's prison. While you may recognize a good number of his moves, you'll soon find that he's also been infused with a lot of frost power, and can quickly chill and render you immobile before dealing a killing blow. As such, having chill-resistant items and curios will be of great help here.\nBy now you're well aware of this Monk's ability to use their tentacles to strike at you form a distance, both in a three-hit combos to stab outward, or in spinning horizontal sweeps. By recognizing the timing, you can make good use of deflecting these attacks or immobilizing him mid swing.\nIn addition to his large snowy boulder throw for massive damage, he can also toss two smaller rocks when at a far distance, but they deal less damage and are easier to step away from.\nWhat really makes this Yaoguai a Chief is his ability to invoke frost damage. Whenever you spot him rise up in the air on his two appendages and create a gust around him, he's actually coating the area in frost, which will quickly raise your frost meter while in the area.\nConsidering how snowy the area already is, this can be quite dangerous as it's hard to tell where the affected area is. Look carefully for a low mist, or try to reposition yourself in a non snow-covered area to see when its been painted over in white.\nIt'll take a lot of repositioning to survive this fight, and you'll also need to be aware of one other new attack that seems harmless but can deal a good amount of damage, as the Monk from the Sea can either leap toward or away from you with a deceptive blast.\nIf he uses it to jump at you, he'll use his appendages to stab down as he lands, and after a pause, will slam down to the ground that creates another damaging blast.\nDefeating this Yaoguai Chief will boast an unexpected reward: Hoarfrost. With this, you'll be able to utilize a new Transformation Spell to become a Monk from the Sea, and inflict your own frost damage on enemies to chill them!\nMonk from the Sea",
    "promot": "This is an excerpt from the file 'Monk_from_the_Sea.md', located in the main section titled 'Monk from the Sea'. The section summary is: The Monk from the Sea is an optional miniboss fight that you can encounter in Chapter 3 of Black Myth Wukong. A much tougher variant of the other Sea Monks you can encounter in The New West, this boss hides within the New Thunderclap Temple.\n* **Rewards:** Hoarfrost Transformation Spell, Random Materials, 1847 Experience, 1195 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find The Monk from the Sea', and the detailed content is as follows:\nThe Monk from the Sea is an optional boss, and hides within the New Thunderclap Temple at the far end of the Valley of Ecstasy in The New West. To find him, you'll need to explore an optional path once inside the temple grounds.\nFrom the Temple Entrance Shrine, take the far right path and head up a narrow sloping path filled with Supporter Monks to find a side area, and continue through the large gate past where Censor Holders are praying, and the monk will jump out of an altar as you enter the next large open part of the temple grounds.\n### Monk from the Sea Miniboss Fight and Guide\nThe Monk from the Sea is essentially a supercharged version of the already tough Sea Monks you've been encountering since escaping the Pagoda Realm's prison. While you may recognize a good number of his moves, you'll soon find that he's also been infused with a lot of frost power, and can quickly chill and render you immobile before dealing a killing blow. As such, having chill-resistant items and curios will be of great help here.\nBy now you're well aware of this Monk's ability to use their tentacles to strike at you form a distance, both in a three-hit combos to stab outward, or in spinning horizontal sweeps. By recognizing the timing, you can make good use of deflecting these attacks or immobilizing him mid swing.\nIn addition to his large snowy boulder throw for massive damage, he can also toss two smaller rocks when at a far distance, but they deal less damage and are easier to step away from.\nWhat really makes this Yaoguai a Chief is his ability to invoke frost damage. Whenever you spot him rise up in the air on his two appendages and create a gust around him, he's actually coating the area in frost, which will quickly raise your frost meter while in the area.\nConsidering how snowy the area already is, this can be quite dangerous as it's hard to tell where the affected area is. Look carefully for a low mist, or try to reposition yourself in a non snow-covered area to see when its been painted over in white.\nIt'll take a lot of repositioning to survive this fight, and you'll also need to be aware of one other new attack that seems harmless but can deal a good amount of damage, as the Monk from the Sea can either leap toward or away from you with a deceptive blast.\nIf he uses it to jump at you, he'll use his appendages to stab down as he lands, and after a pause, will slam down to the ground that creates another damaging blast.\nDefeating this Yaoguai Chief will boast an unexpected reward: Hoarfrost. With this, you'll be able to utilize a new Transformation Spell to become a Monk from the Sea, and inflict your own frost damage on enemies to chill them!\nMonk from the Sea",
    "promot_tokens_num": 737
}