{
    "chunk_id": 147984728301,
    "source_file": "Celestial_Birthstone_Fragment.md",
    "content_type": "one and two",
    "h1_title": "Celestial Birthstone Fragment",
    "h2_title": "Black Myth: Wukong Celestial Birthstone Fragment Location",
    "h1_content": "The Celestial Birthstone Fragment is one of the many Curios items you can find in Black Myth: Wukong. Like the rest of these items, once found, it can be equipped from the Equipment menu.\nWith the Celestial Birthstone Fragment equipped your enemies' four elemental Bane resistances will be completely ignored, allowing you to deal maximum damage.\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, the item will stay at its current power throughout the game. If you want a better buff or something else to fit your build, you will need to switch it out.",
    "h2_content": "The Celestial Birthstone Fragment can be found in Mount Huaguo upon defeating Lan-Baw-Baw\").\nCelestial Birthstone Fragment\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "promot": "This is an excerpt from the file 'Celestial_Birthstone_Fragment.md', located in the main section titled 'Celestial Birthstone Fragment'. The section summary is: The Celestial Birthstone Fragment is one of the many Curios items you can find in Black Myth: Wukong. Like the rest of these items, once found, it can be equipped from the Equipment menu.\nWith the Celestial Birthstone Fragment equipped your enemies' four elemental Bane resistances will be completely ignored, allowing you to deal maximum damage.\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, the item will stay at its current power throughout the game. If you want a better buff or something else to fit your build, you will need to switch it out. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Celestial Birthstone Fragment Location', and the detailed content is as follows:\nThe Celestial Birthstone Fragment can be found in Mount Huaguo upon defeating Lan-Baw-Baw\").\nCelestial Birthstone Fragment\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "promot_tokens_num": 288
}