{
    "chunk_id": 413621125121,
    "source_file": "Tiger's_Acolyte.md",
    "content_type": "one and two",
    "h1_title": "Tiger's Acolyte",
    "h2_title": "Where to Find the Tiger's Acolyte",
    "h1_content": "The Tiger's Acolyte is an optional Yaoguai Chief miniboss that you can encounter in Chapter 2 of Black Myth Wukong. As an optional foe, you can seek out this boss in the Yellow Wind Formation high above on the Windrest Hamlet's bridge at the back of the region. He is required to defeat to unlock a secret boss using an item he drops.\n* Rewards: Tiger's Acolyte Spirit, Old-Rattle Drum, Silk x2, Yarn x2, 758 Experience, 779 Will",
    "h2_content": "As an optional boss, the Tiger's Acolyte is easily missed as he resides in an entirely optional area in the Yellow Wind Formation, far at the back of the Yellow Wind Ridge in Chapter 2. To reach him, you'll need to head past the Crouching Tiger Temple, and up toward the Windrest Bridge.\nTravel through the Windrest Hamlet area across a second bridge past the Windrest Bridge Shrine, and you can locate this boss in the middle of the final bridge leading back toward the Fright Cliff.\n### Tiger’s Acolyte Mini-Boss Fight and Guide\nA follower of the Tiger Guai, the strange man will call out for his missing son before violently attacking you. And just like his master, he’s incredibly ferocious, and it can be hard to anticipate his attacks, let alone whether he’ll attack with his very long sword or very long claws.\nThe battle will often begin with him lowering his sword, only to leap forward at blinding speed to attack with both sword and claw at once, rolling past you as he does, and then performing a follow up slash as he finishes his roll. This means you’ll want to dodge past him as he approaches, so you can safely distance yourself from the following slash and then attack him back.\nHowever, if he suddenly pivots after his slash to face away, be ready for him to perform a large overhand swing as he twists to face you. Though it's a vertical strike, it has a great deal of reach, sending a tremor along the ground from its force.\nUnfortunately, this isn’t even his only unpredictable leaping attack, as he can also just vault at you at top speed from a fair distance without a hint of preparation and cleave you with his sword for massive damage.\nOne leaping attack with a bit more warning will come when he jumps high into the air first, moving right above you before slamming down with his sword. The impact will be fierce, and even trying to use Rock Solid will simply send both of you stumbling back, so dodging is the better call here. It’s also a good idea to use Immobilize here, as there’s a good chance he’ll pull his sword out of the ground while performing a horizontal slash with incredible reach in a wide arc.\nWhile he has a varied assortment of combo attacks, some use only the sword and some only his claw. His most used claw attack will come when he holds it behind him and it begins to shine with a gold gleam. He’ll rush forward with a swipe, and then follow it shortly with a leg stomp, and then roll forward to end with a quick forward slash attack.\nIf you see him rush forward with his claw raised back, prepare for a rapid combo of four quick slashes, followed by a stab with his claws.\nIf possible, you can try to go Rock Solid when he jabs, otherwise he’ll quickly pull backwards and retreat before you can try to retaliate — which often leads to one if his leaping attacks.\nWhen he favors his sword, things won’t get any easier. Watch for him to hold his sword sideways across his body and a quick gleam. He’ll pull into a rapid stab attack with the sword that moves very fast — but it is possible to evade it using the Pillar Stance by raising yourself above the stab and then retaliating with a charged hit.\nWhen he holds his sword back behind him, he’ll launch into two fast upward slashes, which usually ends with him taking the aforementioned stance before his thrust attack.\nIf he holds his sword back without moving, he’ll charge up for a combo attack consisting of two quick horizontal slashes, and then a short jump into the air to land with a downward slash attack. Retaliate cautiously if he doesn’t move away, and be ready for him to assume his next stance.\nHe can also charge at you with his sword behind his back in a sheathed stance, and then quickly slash forward with a follow up jab for a two-hit strike. The jabs are straight ahead, which you can dodge around to the side and punish.\nOn rare occasions, he may even go for a varied combo of his own using all the weapons at his disposal. Starting with a forward kick, he’ll launch into three spinning slash attacks with a reverse grip, followed by a quick claw swipe and upward sword swing all in quick succession. When he stops to raise his sword up, that’s your moment to stagger him with a heavy hit of your own to stop him in his tracks.\nIf your health is dropping fast, remember you can use a Transformation Spell to rely on a secondary health bar to stay alive. Either the Red Tides or Azure Dust can work well in this fight, depending on if you want to match his agility in your wolf form, or tank his hits and then smash into him when he stops attacking. It’s also not a bad idea to try the Pluck of Many, as his smaller size makes him vulnerable to getting overwhelmed and staggered on all sides.\nWhen the Tiger’s Acolyte falls, he’ll drop a curious Key Item, the **Old-Rattle Drum** , as well as leaving behind the Tiger’s Acolyte Spirit to absorb. The child’s toy actually serves an important purpose to unlock another boss. You’ll need it to commune with a child’s spirit in various spots around the Yellow Wind Ridge.\nTiger's Acolyte",
    "promot": "This is an excerpt from the file 'Tiger's_Acolyte.md', located in the main section titled 'Tiger's Acolyte'. The section summary is: The Tiger's Acolyte is an optional Yaoguai Chief miniboss that you can encounter in Chapter 2 of Black Myth Wukong. As an optional foe, you can seek out this boss in the Yellow Wind Formation high above on the Windrest Hamlet's bridge at the back of the region. He is required to defeat to unlock a secret boss using an item he drops.\n* Rewards: Tiger's Acolyte Spirit, Old-Rattle Drum, Silk x2, Yarn x2, 758 Experience, 779 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find the Tiger's Acolyte', and the detailed content is as follows:\nAs an optional boss, the Tiger's Acolyte is easily missed as he resides in an entirely optional area in the Yellow Wind Formation, far at the back of the Yellow Wind Ridge in Chapter 2. To reach him, you'll need to head past the Crouching Tiger Temple, and up toward the Windrest Bridge.\nTravel through the Windrest Hamlet area across a second bridge past the Windrest Bridge Shrine, and you can locate this boss in the middle of the final bridge leading back toward the Fright Cliff.\n### Tiger’s Acolyte Mini-Boss Fight and Guide\nA follower of the Tiger Guai, the strange man will call out for his missing son before violently attacking you. And just like his master, he’s incredibly ferocious, and it can be hard to anticipate his attacks, let alone whether he’ll attack with his very long sword or very long claws.\nThe battle will often begin with him lowering his sword, only to leap forward at blinding speed to attack with both sword and claw at once, rolling past you as he does, and then performing a follow up slash as he finishes his roll. This means you’ll want to dodge past him as he approaches, so you can safely distance yourself from the following slash and then attack him back.\nHowever, if he suddenly pivots after his slash to face away, be ready for him to perform a large overhand swing as he twists to face you. Though it's a vertical strike, it has a great deal of reach, sending a tremor along the ground from its force.\nUnfortunately, this isn’t even his only unpredictable leaping attack, as he can also just vault at you at top speed from a fair distance without a hint of preparation and cleave you with his sword for massive damage.\nOne leaping attack with a bit more warning will come when he jumps high into the air first, moving right above you before slamming down with his sword. The impact will be fierce, and even trying to use Rock Solid will simply send both of you stumbling back, so dodging is the better call here. It’s also a good idea to use Immobilize here, as there’s a good chance he’ll pull his sword out of the ground while performing a horizontal slash with incredible reach in a wide arc.\nWhile he has a varied assortment of combo attacks, some use only the sword and some only his claw. His most used claw attack will come when he holds it behind him and it begins to shine with a gold gleam. He’ll rush forward with a swipe, and then follow it shortly with a leg stomp, and then roll forward to end with a quick forward slash attack.\nIf you see him rush forward with his claw raised back, prepare for a rapid combo of four quick slashes, followed by a stab with his claws.\nIf possible, you can try to go Rock Solid when he jabs, otherwise he’ll quickly pull backwards and retreat before you can try to retaliate — which often leads to one if his leaping attacks.\nWhen he favors his sword, things won’t get any easier. Watch for him to hold his sword sideways across his body and a quick gleam. He’ll pull into a rapid stab attack with the sword that moves very fast — but it is possible to evade it using the Pillar Stance by raising yourself above the stab and then retaliating with a charged hit.\nWhen he holds his sword back behind him, he’ll launch into two fast upward slashes, which usually ends with him taking the aforementioned stance before his thrust attack.\nIf he holds his sword back without moving, he’ll charge up for a combo attack consisting of two quick horizontal slashes, and then a short jump into the air to land with a downward slash attack. Retaliate cautiously if he doesn’t move away, and be ready for him to assume his next stance.\nHe can also charge at you with his sword behind his back in a sheathed stance, and then quickly slash forward with a follow up jab for a two-hit strike. The jabs are straight ahead, which you can dodge around to the side and punish.\nOn rare occasions, he may even go for a varied combo of his own using all the weapons at his disposal. Starting with a forward kick, he’ll launch into three spinning slash attacks with a reverse grip, followed by a quick claw swipe and upward sword swing all in quick succession. When he stops to raise his sword up, that’s your moment to stagger him with a heavy hit of your own to stop him in his tracks.\nIf your health is dropping fast, remember you can use a Transformation Spell to rely on a secondary health bar to stay alive. Either the Red Tides or Azure Dust can work well in this fight, depending on if you want to match his agility in your wolf form, or tank his hits and then smash into him when he stops attacking. It’s also not a bad idea to try the Pluck of Many, as his smaller size makes him vulnerable to getting overwhelmed and staggered on all sides.\nWhen the Tiger’s Acolyte falls, he’ll drop a curious Key Item, the **Old-Rattle Drum** , as well as leaving behind the Tiger’s Acolyte Spirit to absorb. The child’s toy actually serves an important purpose to unlock another boss. You’ll need it to commune with a child’s spirit in various spots around the Yellow Wind Ridge.\nTiger's Acolyte",
    "promot_tokens_num": 1282
}