{
    "chunk_id": 66751175567,
    "source_file": "The_Second_Sister.md",
    "content_type": "one and two",
    "h1_title": "The Second Sister",
    "h2_title": "Where to Find The Second Sister",
    "h1_content": "The Second Sister is a main Yaoguai Chief boss fight that you can encounter at the start of Chapter 4 of Black Myth Wukong. Located in the Village of Lanxi, the Second Sister is a large spider that guards the entrance to the Webbed Hollow.\n* Rewards: Venomous Hair, Gold Tree Core, 2274 Experience, 1933 Will",
    "h2_content": "The Second Sister is a required boss that you'll encounter very early in the start of Chapter 4. Once you arrive at the Village of Lanxi, you'll need to proceed through the town and across a narrow bridge to find a Shrine for the Zhu Estate.\nNearby, there's a door you can interact with, and your friend Zhu Bajie will disguise the two of you to gain access, and then encounter the Second Sister.",
    "promot": "This is an excerpt from the file 'The_Second_Sister.md', located in the main section titled 'The Second Sister'. The section summary is: The Second Sister is a main Yaoguai Chief boss fight that you can encounter at the start of Chapter 4 of Black Myth Wukong. Located in the Village of Lanxi, the Second Sister is a large spider that guards the entrance to the Webbed Hollow.\n* Rewards: Venomous Hair, Gold Tree Core, 2274 Experience, 1933 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Find The Second Sister', and the detailed content is as follows:\nThe Second Sister is a required boss that you'll encounter very early in the start of Chapter 4. Once you arrive at the Village of Lanxi, you'll need to proceed through the town and across a narrow bridge to find a Shrine for the Zhu Estate.\nNearby, there's a door you can interact with, and your friend Zhu Bajie will disguise the two of you to gain access, and then encounter the Second Sister.",
    "promot_tokens_num": 229
}