{
    "chunk_id": 958352938434,
    "source_file": "Black_Bear_Guai.md",
    "content_type": "one and two",
    "h1_title": "Black Bear Guai",
    "h2_title": "Black Bear Guai Boss Fight and Guide",
    "h1_content": "The Black Bear Guai is a required Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located at the very end of Chapter 1 at the top of Black Wind Mountain, this is the second of two forms you'll fight the self-imposed King. Now in the form of a giant bear, he'll harness the power of fire to try and burn you alive.\n* **Rewards:** Craving Eyes Relic, Flame Ebongold, Yarn x5, Silk x2, Spirit Stone x1, Yaoguai Core x1, Mind Core x1, 1641 Experience, 990 Will",
    "h2_content": "Instead of a spear, the Black Wind King is now going for overwhelming size and power, and similar to the main boss of the Forest of Wolves, you’ll be up against a very large opponent with huge attack swings. To make matters worse, several parts of the arena are on fire and will absolutely start burning you if you roll into them for too long.\nTo make matters worse, Black Bear Guai can and will utilize his black wind magic to teleport around the arena, and pop out of thin air in the middle of a two-hit charge attack you’ll need to evade with little warning.\nEven without the wind form, it can be hard to tell which moves the black bear is using when you’re right underneath him, so be sure not to get too far into your attacks that you can’t tell when he’s preparing a new attack.\nThere’s more than a few attack combos he can launch at close range, including two-hit swipes, which are sometimes followed by a raised foot slam afterward. Later in the fight, he can extend this combo with more slashes before finally slamming his foot down.\nHe can also simply belly flop down, requiring you to dodge to the side rather than backwards.This move can come from the front, as well as from the sides if he collapses on his side, meaning even if you aren’t attacking from the front you won’t automatically be safe.\nOne of the more easy attacks to punish will have him gallop around to your side before leaping into the air for a big diving attack. It will take him a few moments to get up off the ground and back into his neutral stance, which is a great time to use the Wight’s Spirit Attack to headbutt him for massive damage.\nFor most of this fight, your key strategy should involve picking your moments to attack wisely, waiting for his bigger slams that take him a while to get back up and unleash your combo attacks.\nHowever, once he’s at a bit less than half of his health, he’ll retreat away and let loose a roar as he slams the ground, engulfing himself in flames as several eruptions take over the arena. Dodge away from them, and if you find yourself burning, either roll repeatedly or use a cooling powder.\nThis is also a key moment to use the Fireproof Mantle from defeating the secret boss. It will not only negate a lot of fire damage, but slowly build your focus up over time to unleash more heavy attacks in your combos.\nOnce engulfed in flames, the Black Bear Guai will revert to his old tricks of turning into the black wind wisp and charging at you after a small explosion — only this time it will also deal fire damage. Be ready for him to zip back and forth quickly to catch you off guard.\nHe can also pull his familiar trick of turning into mist and then reappearing with a diving bodyslam (now on fire). If you see his black wind fly up, be ready for the attack and either dodge past him or Cloud Step away and retaliate as he struggles to rise.\nWhen he comes at you in his bear form, all of his attacks will now deal fire damage, and all of his slams will cause explosions in front of him when his attacks hit the ground. Dodging is now more important than ever, especially to the side of his attacks to escape their explosion range.\nRemember that you can also quickly evade his explosive slams by using the Cloud Step to teleport a short distance away, then race back into him for a Revealing Strike to deal a good amount of damage. Combo these with well-timed Immobilize to disrupt his combo attacks, and you can often knock him off balance with sustained heavy hits.\nEven with his fire damage buff, he’s not exactly immune to taking fire damage himself. If you’re in danger of being engulfed in flames and don’t have any more cooling powder, you can also use the Red Waves spell to transform, resetting your fire meter and building might to hit him with pogo jumps after dodging his attacks.\nThis fight will last awhile, so be sure to be mindful of your stamina and back off when you need to recover, or reposition yourself if you find yourself too close to any fire pits he’s created. It’s much better to wait and find a better avenue of attack than getting too reckless and being burned as a result.\nWhen he’s finally defeated, the Black Bear Guai will try and flee with the sense of the Great Sage, only for it to reject his escape attempt. As he realizes your true purpose, he’ll plead for mercy, blaming the Celestial Palace. It matters little, as the true object of your quest in the Black Wind Mountain is now yours - The Craving Eyes Relic.\nBlack Bear Guai",
    "promot": "This is an excerpt from the file 'Black_Bear_Guai.md', located in the main section titled 'Black Bear Guai'. The section summary is: The Black Bear Guai is a required Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located at the very end of Chapter 1 at the top of Black Wind Mountain, this is the second of two forms you'll fight the self-imposed King. Now in the form of a giant bear, he'll harness the power of fire to try and burn you alive.\n* **Rewards:** Craving Eyes Relic, Flame Ebongold, Yarn x5, Silk x2, Spirit Stone x1, Yaoguai Core x1, Mind Core x1, 1641 Experience, 990 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Bear Guai Boss Fight and Guide', and the detailed content is as follows:\nInstead of a spear, the Black Wind King is now going for overwhelming size and power, and similar to the main boss of the Forest of Wolves, you’ll be up against a very large opponent with huge attack swings. To make matters worse, several parts of the arena are on fire and will absolutely start burning you if you roll into them for too long.\nTo make matters worse, Black Bear Guai can and will utilize his black wind magic to teleport around the arena, and pop out of thin air in the middle of a two-hit charge attack you’ll need to evade with little warning.\nEven without the wind form, it can be hard to tell which moves the black bear is using when you’re right underneath him, so be sure not to get too far into your attacks that you can’t tell when he’s preparing a new attack.\nThere’s more than a few attack combos he can launch at close range, including two-hit swipes, which are sometimes followed by a raised foot slam afterward. Later in the fight, he can extend this combo with more slashes before finally slamming his foot down.\nHe can also simply belly flop down, requiring you to dodge to the side rather than backwards.This move can come from the front, as well as from the sides if he collapses on his side, meaning even if you aren’t attacking from the front you won’t automatically be safe.\nOne of the more easy attacks to punish will have him gallop around to your side before leaping into the air for a big diving attack. It will take him a few moments to get up off the ground and back into his neutral stance, which is a great time to use the Wight’s Spirit Attack to headbutt him for massive damage.\nFor most of this fight, your key strategy should involve picking your moments to attack wisely, waiting for his bigger slams that take him a while to get back up and unleash your combo attacks.\nHowever, once he’s at a bit less than half of his health, he’ll retreat away and let loose a roar as he slams the ground, engulfing himself in flames as several eruptions take over the arena. Dodge away from them, and if you find yourself burning, either roll repeatedly or use a cooling powder.\nThis is also a key moment to use the Fireproof Mantle from defeating the secret boss. It will not only negate a lot of fire damage, but slowly build your focus up over time to unleash more heavy attacks in your combos.\nOnce engulfed in flames, the Black Bear Guai will revert to his old tricks of turning into the black wind wisp and charging at you after a small explosion — only this time it will also deal fire damage. Be ready for him to zip back and forth quickly to catch you off guard.\nHe can also pull his familiar trick of turning into mist and then reappearing with a diving bodyslam (now on fire). If you see his black wind fly up, be ready for the attack and either dodge past him or Cloud Step away and retaliate as he struggles to rise.\nWhen he comes at you in his bear form, all of his attacks will now deal fire damage, and all of his slams will cause explosions in front of him when his attacks hit the ground. Dodging is now more important than ever, especially to the side of his attacks to escape their explosion range.\nRemember that you can also quickly evade his explosive slams by using the Cloud Step to teleport a short distance away, then race back into him for a Revealing Strike to deal a good amount of damage. Combo these with well-timed Immobilize to disrupt his combo attacks, and you can often knock him off balance with sustained heavy hits.\nEven with his fire damage buff, he’s not exactly immune to taking fire damage himself. If you’re in danger of being engulfed in flames and don’t have any more cooling powder, you can also use the Red Waves spell to transform, resetting your fire meter and building might to hit him with pogo jumps after dodging his attacks.\nThis fight will last awhile, so be sure to be mindful of your stamina and back off when you need to recover, or reposition yourself if you find yourself too close to any fire pits he’s created. It’s much better to wait and find a better avenue of attack than getting too reckless and being burned as a result.\nWhen he’s finally defeated, the Black Bear Guai will try and flee with the sense of the Great Sage, only for it to reject his escape attempt. As he realizes your true purpose, he’ll plead for mercy, blaming the Celestial Palace. It matters little, as the true object of your quest in the Black Wind Mountain is now yours - The Craving Eyes Relic.\nBlack Bear Guai",
    "promot_tokens_num": 1169
}