{
    "chunk_id": 82076841646,
    "source_file": "Preservation_Orb.md",
    "content_type": "one and two",
    "h1_title": "Preservation Orb",
    "h2_title": "Black Myth: Wukong Preservation Orb Location",
    "h1_content": "The Preservation Orb is one of the many Curios items you can find in Black Myth: Wukong. Like the rest of these items, once found, it can be equipped from the Equipment menu.\nWith the Preservation Orb equipped upon resurrection in a battle, your maximum health mana, and stamina will be increased for a long duration.\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, the item will stay at its current power throughout the game. If you want a better buff or something else to fit your build, you will need to switch it out.",
    "h2_content": "The Preservation Orb can be found in The Webbed Hollow, in a box at the start of the Purple Cloud Mountain Secret area. This is only accessible after completing Chapter 4, providing you haven't finished the area.\nA full guide on how to access Purple Cloud Mountain can be found in the video below:\nPreservation Orb\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "promot": "This is an excerpt from the file 'Preservation_Orb.md', located in the main section titled 'Preservation Orb'. The section summary is: The Preservation Orb is one of the many Curios items you can find in Black Myth: Wukong. Like the rest of these items, once found, it can be equipped from the Equipment menu.\nWith the Preservation Orb equipped upon resurrection in a battle, your maximum health mana, and stamina will be increased for a long duration.\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, the item will stay at its current power throughout the game. If you want a better buff or something else to fit your build, you will need to switch it out. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Preservation Orb Location', and the detailed content is as follows:\nThe Preservation Orb can be found in The Webbed Hollow, in a box at the start of the Purple Cloud Mountain Secret area. This is only accessible after completing Chapter 4, providing you haven't finished the area.\nA full guide on how to access Purple Cloud Mountain can be found in the video below:\nPreservation Orb\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "promot_tokens_num": 313
}