{
    "chunk_id": 581040315190,
    "source_file": "Celestial_Lotus_Seeds.md",
    "content_type": "one and two",
    "h1_title": "Celestial Lotus Seeds",
    "h2_title": "Black Myth: Wukong Celestial Lotus Seeds Location",
    "h1_content": "The Celestial Lotus Seeds are one of the many Soaks you will find for your Gourds in Black Myth: Wukong. They provide an extra healing boost on top of your Gourd if you have them equipped, allowing you to heal beyond what your Drink and Gourd allows.\nWith the Celestial Lotus Seeds equipped, for a brief moment after using the gourd, slowly recovers a small amount of health. While this amount isn't anything great, it can be a nice addition to your basic healing.\nUnlike the Drinks in the game and the Gourd itself, Soaks can't be upgraded at the Shen Monkey Vendor, so you are stuck with the potency of this buff. It can't be increased. So, if you want to switch to a more powerful buff, be sure to head back to the Shen Monkey Vendor.",
    "h2_content": "The Celestial Lotus Seeds Soak in Black Myth: Wukong can be found in Bamboo Grove \\- Marsh of White Mist Shrine in Black Wind Mountain after talking to the Shen Monkey Vendor upon freeing him from the enemy attacking him.\nThis is along the main path when you are making your way through the area, so you can't miss him. Once you free him, enter his shop screen and you will be able to choose the Celestial Lotus Seeds.\nThere are a large variety of Soaks to be found throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "promot": "This is an excerpt from the file 'Celestial_Lotus_Seeds.md', located in the main section titled 'Celestial Lotus Seeds'. The section summary is: The Celestial Lotus Seeds are one of the many Soaks you will find for your Gourds in Black Myth: Wukong. They provide an extra healing boost on top of your Gourd if you have them equipped, allowing you to heal beyond what your Drink and Gourd allows.\nWith the Celestial Lotus Seeds equipped, for a brief moment after using the gourd, slowly recovers a small amount of health. While this amount isn't anything great, it can be a nice addition to your basic healing.\nUnlike the Drinks in the game and the Gourd itself, Soaks can't be upgraded at the Shen Monkey Vendor, so you are stuck with the potency of this buff. It can't be increased. So, if you want to switch to a more powerful buff, be sure to head back to the Shen Monkey Vendor. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Celestial Lotus Seeds Location', and the detailed content is as follows:\nThe Celestial Lotus Seeds Soak in Black Myth: Wukong can be found in Bamboo Grove \\- Marsh of White Mist Shrine in Black Wind Mountain after talking to the Shen Monkey Vendor upon freeing him from the enemy attacking him.\nThis is along the main path when you are making your way through the area, so you can't miss him. Once you free him, enter his shop screen and you will be able to choose the Celestial Lotus Seeds.\nThere are a large variety of Soaks to be found throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "promot_tokens_num": 406
}