{
    "chunk_id": 288036352828,
    "source_file": "The_Four_Heavenly_Kings_and_Erlang_Shen.md",
    "content_type": "one and two",
    "h1_title": "The Four Heavenly Kings and Erlang Shen",
    "h2_title": "The Four Heavenly Kings Boss Fight and Guide",
    "h1_content": "The Four Heavenly Kings and Erlang Shen are optional secret bosses you can find by entering Chapter 3's Secret Area of Mount Mei in Black Myth: Wukong. You'll need to complete all chapters' secret areas and an elusive side quest to access the area, then take on the incredibly strong Erlang, The Sacred Divinity. Completing this Kaiju fight will allow you to unlock the game's secret ending.",
    "h2_content": "Thankfully after a huge battle against Erlang, The Sacred Divinity, the fight against the Four Heavenly Kings is much more straightforward. They share one health bar between them, and in your Stone Monkey transformation, you can use Primal Punch as your light attack, Earthshatter Slam as your heavy attack (this attack also heals), and Rock Solid to deflect their hits.\nUse Rock Solid when it's available and when one of the four giants will launch themselves at you. Other than that, you'll just want to keep using Primal Punch to build up Focus. When you've built your points, use Earthshatter Slam.\nAbout halfway through the fight, you'll also be able to start using Ice Bath. When you use the Ice Bath Spell, the Stone Monkey's arms will be covered in frost, and when you punch, you'll inflict frost damage.\nThe Four Heavenly Kings\nWhen the Four Heavenly Kings have been taken down, there's just one more giant to deal with, which is Erlang Shen.",
    "promot": "This is an excerpt from the file 'The_Four_Heavenly_Kings_and_Erlang_Shen.md', located in the main section titled 'The Four Heavenly Kings and Erlang Shen'. The section summary is: The Four Heavenly Kings and Erlang Shen are optional secret bosses you can find by entering Chapter 3's Secret Area of Mount Mei in Black Myth: Wukong. You'll need to complete all chapters' secret areas and an elusive side quest to access the area, then take on the incredibly strong Erlang, The Sacred Divinity. Completing this Kaiju fight will allow you to unlock the game's secret ending. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'The Four Heavenly Kings Boss Fight and Guide', and the detailed content is as follows:\nThankfully after a huge battle against Erlang, The Sacred Divinity, the fight against the Four Heavenly Kings is much more straightforward. They share one health bar between them, and in your Stone Monkey transformation, you can use Primal Punch as your light attack, Earthshatter Slam as your heavy attack (this attack also heals), and Rock Solid to deflect their hits.\nUse Rock Solid when it's available and when one of the four giants will launch themselves at you. Other than that, you'll just want to keep using Primal Punch to build up Focus. When you've built your points, use Earthshatter Slam.\nAbout halfway through the fight, you'll also be able to start using Ice Bath. When you use the Ice Bath Spell, the Stone Monkey's arms will be covered in frost, and when you punch, you'll inflict frost damage.\nThe Four Heavenly Kings\nWhen the Four Heavenly Kings have been taken down, there's just one more giant to deal with, which is Erlang Shen.",
    "promot_tokens_num": 372
}