{
    "chunk_id": 679777543628,
    "source_file": "Drunken_Boar_Questline.md",
    "content_type": "one and two",
    "h1_title": "Drunken Boar Questline",
    "h2_title": "Where to Get the Sobering Stone",
    "h1_content": "The Drunken Boar (aka Drunken Pig or his official name, the Yellow-Robed Squire) is a character you can meet and also fight in Chapter 2 of Black Myth Wukong. This character will ask you to complete a side quest for him that will unlock Chapter 2’s Secret Area: The Kingdom of Sahali.",
    "h2_content": "There are two ways to get the item required, one of which will cost you, and the other through exploring. If you complete the **Man-in-Stone’s questline**, you’ll find that the **Man-in-Stone** sells a **Sobering Stone** if you don’t want to explore. Since it costs a hefty 6,480 Will, you’re better off finding one yourself.\nTo locate the stone itself, you’ll need to head through the Yellow Wind Formation to the **Windrest Hamlet** , which is across the **Windrest Bridge** up the road past the Crouching Tiger Temple. Once you enter the hamlet, take a left to find a large building guarded by a Rat Soldier and Rat Imperial Guard.\nOn the left side when looking at the large building, defeat a Blazebone monster, and then look to the right for a **small alcove** , where you can spot a **glowing pot**. Break the pot, and you’ll find the **Sobering Stone**.",
    "promot": "This is an excerpt from the file 'Drunken_Boar_Questline.md', located in the main section titled 'Drunken Boar Questline'. The section summary is: The Drunken Boar (aka Drunken Pig or his official name, the Yellow-Robed Squire) is a character you can meet and also fight in Chapter 2 of Black Myth Wukong. This character will ask you to complete a side quest for him that will unlock Chapter 2’s Secret Area: The Kingdom of Sahali. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to Get the Sobering Stone', and the detailed content is as follows:\nThere are two ways to get the item required, one of which will cost you, and the other through exploring. If you complete the **Man-in-Stone’s questline**, you’ll find that the **Man-in-Stone** sells a **Sobering Stone** if you don’t want to explore. Since it costs a hefty 6,480 Will, you’re better off finding one yourself.\nTo locate the stone itself, you’ll need to head through the Yellow Wind Formation to the **Windrest Hamlet** , which is across the **Windrest Bridge** up the road past the Crouching Tiger Temple. Once you enter the hamlet, take a left to find a large building guarded by a Rat Soldier and Rat Imperial Guard.\nOn the left side when looking at the large building, defeat a Blazebone monster, and then look to the right for a **small alcove** , where you can spot a **glowing pot**. Break the pot, and you’ll find the **Sobering Stone**.",
    "promot_tokens_num": 358
}