{
    "chunk_id": 302521321701,
    "source_file": "Sunset_of_the_Nine_Skies.md",
    "content_type": "one and two",
    "h1_title": "Sunset of the Nine Skies",
    "h2_title": "Black Myth: Wukong Sunset of the Nine Skies Location",
    "h1_content": "Sunset of the Nine Skies is one of the Drinks in Black Myth: Wukong. It is one of the trickier ones to find, located towards the end of The Webbed Hollow.\nWith the Sunset of the Nine Skies Drink equipped to your Gourds, each sip recovers 35% of maximum health. Additionally, each sip grants a considerable amount of Qi - which is a nice bonus on top of the basic healing.\nAs with all Drinks, the potency of it can be increased by finding the Awoken Wine Worm locations around the game's areas. Our page has each location for you.\nYou can then use these Crafting Materials to upgrade the Drink at the Shen Monkey Vendor in Bamboo Grove within Black Wind Mountain. Each upgrade will provide a sizeable buff to your healing potential. As you level the Drink up, more Awoken Wine Worms will be needed to further upgrade it.\nThis carries over to New Game Plus too, as you can upgrade your Drinks even more, but once again more Awoken Wine Worms will be needed, so you will have to recollect them all in your New Game Plus run.",
    "h2_content": "The Sunset of the Nine Skies drink can be found in the Temple of the Yellow Flowers, Court of Illumination area in The Webbed Hollow. From the Shrine, pass the two Doaist enemies at the entrance and follow the path through the cliffside. Once you reach a tree trunk ahead at the top of a hill, take a left up some more stairs and follow the path to the end, to find a hut with the Drink.\nSunset of the Nine Skies\nThere aren't too many Drinks in the game compared to the Soaks, so be sure to keep your eye out for them. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough.",
    "promot": "This is an excerpt from the file 'Sunset_of_the_Nine_Skies.md', located in the main section titled 'Sunset of the Nine Skies'. The section summary is: Sunset of the Nine Skies is one of the Drinks in Black Myth: Wukong. It is one of the trickier ones to find, located towards the end of The Webbed Hollow.\nWith the Sunset of the Nine Skies Drink equipped to your Gourds, each sip recovers 35% of maximum health. Additionally, each sip grants a considerable amount of Qi - which is a nice bonus on top of the basic healing.\nAs with all Drinks, the potency of it can be increased by finding the Awoken Wine Worm locations around the game's areas. Our page has each location for you.\nYou can then use these Crafting Materials to upgrade the Drink at the Shen Monkey Vendor in Bamboo Grove within Black Wind Mountain. Each upgrade will provide a sizeable buff to your healing potential. As you level the Drink up, more Awoken Wine Worms will be needed to further upgrade it.\nThis carries over to New Game Plus too, as you can upgrade your Drinks even more, but once again more Awoken Wine Worms will be needed, so you will have to recollect them all in your New Game Plus run. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Sunset of the Nine Skies Location', and the detailed content is as follows:\nThe Sunset of the Nine Skies drink can be found in the Temple of the Yellow Flowers, Court of Illumination area in The Webbed Hollow. From the Shrine, pass the two Doaist enemies at the entrance and follow the path through the cliffside. Once you reach a tree trunk ahead at the top of a hill, take a left up some more stairs and follow the path to the end, to find a hut with the Drink.\nSunset of the Nine Skies\nThere aren't too many Drinks in the game compared to the Soaks, so be sure to keep your eye out for them. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough.",
    "promot_tokens_num": 453
}