{
    "chunk_id": 813032052223,
    "source_file": "Guangmou.md",
    "content_type": "one and two",
    "h1_title": "Guangmou",
    "h2_title": "Black Wind Mountain’s Secret - Ringing the Second Bell",
    "h1_content": "Guangmou is a required Yaoguai Chief miniboss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located along the main path through the Bamboo Grove, this boss is a ranged fighter who moves quickly to evade you while filling you with poison strikes.\n* **Rewards:** Guangmou Spirit, Materials, 700 Experience, 520 Will",
    "h2_content": "As the boss falls, the Keeper will comment on the two fallen Yaoguai Guangmou and Guangzhi. Both monks apparently aided an Elder named Jinchi to burn down the temple and the monk within alive — but that’s not all they share: Just up the sloping stairway path to the left of the way forward, you can find a second large bell that you can ring. Something ominous seems to be responding to the sound of these bells.",
    "promot": "This is an excerpt from the file 'Guangmou.md', located in the main section titled 'Guangmou'. The section summary is: Guangmou is a required Yaoguai Chief miniboss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located along the main path through the Bamboo Grove, this boss is a ranged fighter who moves quickly to evade you while filling you with poison strikes.\n* **Rewards:** Guangmou Spirit, Materials, 700 Experience, 520 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Wind Mountain’s Secret - Ringing the Second Bell', and the detailed content is as follows:\nAs the boss falls, the Keeper will comment on the two fallen Yaoguai Guangmou and Guangzhi. Both monks apparently aided an Elder named Jinchi to burn down the temple and the monk within alive — but that’s not all they share: Just up the sloping stairway path to the left of the way forward, you can find a second large bell that you can ring. Something ominous seems to be responding to the sound of these bells.",
    "promot_tokens_num": 239
}