{
    "chunk_id": 930283018633,
    "source_file": "Erlang,_The_Sacred_Divinity.md",
    "content_type": "one and two",
    "h1_title": "Erlang, The Sacred Divinity",
    "h2_title": "How to Unlock Mount Mei",
    "h1_content": "Erlang, The Sacred Divinity is an optional secret boss you can find by entering Chapter 3's Secret Area of Mount Mei in Black Myth: Wukong. You'll need to complete all chapters' secret areas and an elusive side quest before you can find this tough boss.",
    "h2_content": "There are several steps you need to take to unlock Mount Mei. You can find a detailed breakdown on our dedicated page: How to Unlock the Secret Ending (True Ending) \"How to Unlock the Secret Ending \\(True Ending\\)\"). But here's a quick rundown of everything you'll need to do by Chapter 6 to reach it.\n1. Complete the Chapter 1 secret area of the Ancient Guanyin Temple\n2. Complete the Chapter 2 secret area of the Kingdom of Sahali\n3. Complete the Green-Capped Martialist/Treasure Hunter quest in Chapter 3\n4. Complete the Chapter 4 secret area of the Purple Cloud Mountain\n5. Complete the Chapter 5 secret area of Bishui Cave\n6. Return to **The Great Pagoda in Chapter 3**. You can find it on the Snow-Veiled Trail in the Pagoda Realm.",
    "promot": "This is an excerpt from the file 'Erlang,_The_Sacred_Divinity.md', located in the main section titled 'Erlang, The Sacred Divinity'. The section summary is: Erlang, The Sacred Divinity is an optional secret boss you can find by entering Chapter 3's Secret Area of Mount Mei in Black Myth: Wukong. You'll need to complete all chapters' secret areas and an elusive side quest before you can find this tough boss. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'How to Unlock Mount Mei', and the detailed content is as follows:\nThere are several steps you need to take to unlock Mount Mei. You can find a detailed breakdown on our dedicated page: How to Unlock the Secret Ending (True Ending) \"How to Unlock the Secret Ending \\(True Ending\\)\"). But here's a quick rundown of everything you'll need to do by Chapter 6 to reach it.\n1. Complete the Chapter 1 secret area of the Ancient Guanyin Temple\n2. Complete the Chapter 2 secret area of the Kingdom of Sahali\n3. Complete the Green-Capped Martialist/Treasure Hunter quest in Chapter 3\n4. Complete the Chapter 4 secret area of the Purple Cloud Mountain\n5. Complete the Chapter 5 secret area of Bishui Cave\n6. Return to **The Great Pagoda in Chapter 3**. You can find it on the Snow-Veiled Trail in the Pagoda Realm.",
    "promot_tokens_num": 313
}