{
    "chunk_id": 713116424120,
    "source_file": "Man-in-Stone.md",
    "content_type": "one and two",
    "h1_title": "Man-in-Stone",
    "h2_title": "Man-in-Stone Boss Fight and Guide",
    "h1_content": "The Man-in-Stone is a optional Character questline culminating in a boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Located in a crevice of the Fright Cliff, you'll have to help the man trapped in stone recover an item, and then beat him up to earn your reward.\n* **Rewards:** Azure Dust Transformation Spell, 758 Experience, 756 Will",
    "h2_content": "While he technically has a boss health bar and everything, he’s kind of a pushover, barely having much more health than a regular Pinstone, and only doing their regular attacks anyway. Simply Immobilize him, rack up some Focus Points, and deliver a charged strike to send him packing.\nRealizing the error of his ways, the Man-in-Stone will promptly burrow right back in the ground and plead for mercy. You’ll then be able to re-harvest the Stone Essence from him, which will turn into the **Azure Dust Transformation Spell**! Finally, the slow yet sturdy power of the Rock Guai is yours to command in battle!\nMan-in-Stone",
    "promot": "This is an excerpt from the file 'Man-in-Stone.md', located in the main section titled 'Man-in-Stone'. The section summary is: The Man-in-Stone is a optional Character questline culminating in a boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Located in a crevice of the Fright Cliff, you'll have to help the man trapped in stone recover an item, and then beat him up to earn your reward.\n* **Rewards:** Azure Dust Transformation Spell, 758 Experience, 756 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Man-in-Stone Boss Fight and Guide', and the detailed content is as follows:\nWhile he technically has a boss health bar and everything, he’s kind of a pushover, barely having much more health than a regular Pinstone, and only doing their regular attacks anyway. Simply Immobilize him, rack up some Focus Points, and deliver a charged strike to send him packing.\nRealizing the error of his ways, the Man-in-Stone will promptly burrow right back in the ground and plead for mercy. You’ll then be able to re-harvest the Stone Essence from him, which will turn into the **Azure Dust Transformation Spell**! Finally, the slow yet sturdy power of the Rock Guai is yours to command in battle!\nMan-in-Stone",
    "promot_tokens_num": 290
}