{
    "chunk_id": 259860780962,
    "source_file": "Wandering_Wight.md",
    "content_type": "one and two",
    "h1_title": "Wandering Wight",
    "h2_title": "How to Absorb Spirit With Guidance",
    "h1_content": "The Wandering Wight is an optional and very challenging Yaoguai Chief boss fight that you can encounter early in Chapter 1 of Black Myth Wukong. The Wight is much tougher than any other bosses you can fight this early in the game, and while it is still possible to defeat them early, it is highly recommended that you level up further before taking them on.\n* Rewards: Wandering Wight Spirit, Cat’s Eye Beads, Stone Spirit, 691 Will, 1,049 Experience",
    "h2_content": "He will also leave behind the Wandering Wight Spirit — a purple glowing wisp — for you to absorb. if you tried to defeat this boss early, interacting with it will prompt the note: \"Cannot Absorb Spirit Without Guidance\".\nLuckily, you don't have too far to go gain this upgrade. This can only be done once you’ve met the Ancient Master in the Bamboo Grove who will upgrade your Gourd. If you haven’t done this yet, don’t worry — the Spirit will appear in your Shrine menu when attempting to Cultivate Spirits after the gourd has been upgraded.\nWandering Wight",
    "promot": "This is an excerpt from the file 'Wandering_Wight.md', located in the main section titled 'Wandering Wight'. The section summary is: The Wandering Wight is an optional and very challenging Yaoguai Chief boss fight that you can encounter early in Chapter 1 of Black Myth Wukong. The Wight is much tougher than any other bosses you can fight this early in the game, and while it is still possible to defeat them early, it is highly recommended that you level up further before taking them on.\n* Rewards: Wandering Wight Spirit, Cat’s Eye Beads, Stone Spirit, 691 Will, 1,049 Experience This excerpt merges content from both the main and sub-sections. The sub-section is titled 'How to Absorb Spirit With Guidance', and the detailed content is as follows:\nHe will also leave behind the Wandering Wight Spirit — a purple glowing wisp — for you to absorb. if you tried to defeat this boss early, interacting with it will prompt the note: \"Cannot Absorb Spirit Without Guidance\".\nLuckily, you don't have too far to go gain this upgrade. This can only be done once you’ve met the Ancient Master in the Bamboo Grove who will upgrade your Gourd. If you haven’t done this yet, don’t worry — the Spirit will appear in your Shrine menu when attempting to Cultivate Spirits after the gourd has been upgraded.\nWandering Wight",
    "promot_tokens_num": 293
}