{
    "chunk_id": 484932474410,
    "source_file": "Boshan_Censer.md",
    "content_type": "one and two",
    "h1_title": "Boshan Censer",
    "h2_title": "Black Myth: Wukong Boshan Censer Location",
    "h1_content": "The Boshan Censer is a rare Curios item you can find in Black Myth: Wukong. While it has a specific use, the Boshan Censer's buff is rather strong, making it quite useful for those who like to  aggressive when they are out of healing.\nWith the Boshan Censer equipped, it grants considerable damage reduction when Gourd use is depleted. So, if you are someone who hasn't upgraded their Gourd or is running a Gourd with a low amount of uses, this can be incredibly powerful, granting you enhanced survivability for an extended period. Dodge masters and those using Cloud Step and Rock Solid can really benefit from this Curios item.\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or boost the effect of them. Therefore, you will want to switch to other Curios items to better fit your build as you  if needed. This can be done easily from the game's Equipment menu.",
    "h2_content": "The Boshan Censer can be found upon defeating Red Loong in the Forest of Wolves \\- Outside the Forest area in Black Wind Mountain. Red Loong is located behind the waterfall in Black Wind Mountain, and you will need to obtain the Loong Scales in Yellow Wind Ridge first to enter this secret area.\nThe Loong Scales are a rather well hidden item in Yellow Wind Ridge, requiring you to have the First Prince of Flowing Sands boss destroy a wall with its attack. You can also destroy it with the powerful Transformation Spells. Our guide below on how to get behind the waterfall will take you through the steps, alongside the links above to the individual places.\nOnce you have defeated Red Loong, you can open the chest to finish everything in the area, obtaining the Boshan Censer in the process.\nBoshan Censer\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "promot": "This is an excerpt from the file 'Boshan_Censer.md', located in the main section titled 'Boshan Censer'. The section summary is: The Boshan Censer is a rare Curios item you can find in Black Myth: Wukong. While it has a specific use, the Boshan Censer's buff is rather strong, making it quite useful for those who like to  aggressive when they are out of healing.\nWith the Boshan Censer equipped, it grants considerable damage reduction when Gourd use is depleted. So, if you are someone who hasn't upgraded their Gourd or is running a Gourd with a low amount of uses, this can be incredibly powerful, granting you enhanced survivability for an extended period. Dodge masters and those using Cloud Step and Rock Solid can really benefit from this Curios item.\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or boost the effect of them. Therefore, you will want to switch to other Curios items to better fit your build as you  if needed. This can be done easily from the game's Equipment menu. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Boshan Censer Location', and the detailed content is as follows:\nThe Boshan Censer can be found upon defeating Red Loong in the Forest of Wolves \\- Outside the Forest area in Black Wind Mountain. Red Loong is located behind the waterfall in Black Wind Mountain, and you will need to obtain the Loong Scales in Yellow Wind Ridge first to enter this secret area.\nThe Loong Scales are a rather well hidden item in Yellow Wind Ridge, requiring you to have the First Prince of Flowing Sands boss destroy a wall with its attack. You can also destroy it with the powerful Transformation Spells. Our guide below on how to get behind the waterfall will take you through the steps, alongside the links above to the individual places.\nOnce you have defeated Red Loong, you can open the chest to finish everything in the area, obtaining the Boshan Censer in the process.\nBoshan Censer\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "promot_tokens_num": 504
}