{
    "chunk_id": 14325556586,
    "source_file": "How_to_Find_All_Purple_Talisman_Altars_in_Chapter_4.md",
    "content_type": "one and two",
    "h1_title": "How to Find All Purple Talisman Altars in Chapter 4",
    "h2_title": "What Happens When You Collect All 4 Talismans?",
    "h1_content": "Chapter 4 of Black Myth: Wukong has plenty of secrets to discover and one of these involves collecting the purple talismans you can find hanging from altars in the Webbed Hollow and Temple of the Yellow Flowers. Collecting them all will prompt cutscenes and a meeting with a hidden boss, so here's everything you need to do to uncover this extra content.",
    "h2_content": "When you collect the final Talisman, the Altar will disappear and a boss called the Supreme Inspector will emerge. Fight for as long as you can and a cutscene will begin. The Supreme Inspector will be taken away by the Crane Immortal who emerges, and the fight will end here.\nWhen it's over, you can collect a Celestial Nonary Pill from the box behind the fight area and will achieve the trophy Misfit with Merit.",
    "promot": "This is an excerpt from the file 'How_to_Find_All_Purple_Talisman_Altars_in_Chapter_4.md', located in the main section titled 'How to Find All Purple Talisman Altars in Chapter 4'. The section summary is: Chapter 4 of Black Myth: Wukong has plenty of secrets to discover and one of these involves collecting the purple talismans you can find hanging from altars in the Webbed Hollow and Temple of the Yellow Flowers. Collecting them all will prompt cutscenes and a meeting with a hidden boss, so here's everything you need to do to uncover this extra content. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'What Happens When You Collect All 4 Talismans?', and the detailed content is as follows:\nWhen you collect the final Talisman, the Altar will disappear and a boss called the Supreme Inspector will emerge. Fight for as long as you can and a cutscene will begin. The Supreme Inspector will be taken away by the Crane Immortal who emerges, and the fight will end here.\nWhen it's over, you can collect a Celestial Nonary Pill from the box behind the fight area and will achieve the trophy Misfit with Merit.",
    "promot_tokens_num": 260
}