{
    "chunk_id": 272998671172,
    "source_file": "How_to_Find_the_Five_Skandhas_and_Unlock_a_Secret_Boss.md",
    "content_type": "one and two",
    "h1_title": "How to Find the Five Skandhas and Unlock a Secret Boss",
    "h2_title": "How to Find the Skandha of Choice",
    "h1_content": "One of the earliest Key Items you might stumble across in Black Myth: Wukong is the Skandha of Form. However, it's not until the later stages of the game that this item becomes useful. There are 5 Skandhas to collect throughout the chapters, with 4 unlocking a secret boss in Chapter 6. Here's everything you need to know to get your hands on them.\n1. Skandha of Form\n2. Skandha of Feeling\n3. Skandha of Thought\n4. Skandha of Choice\n5. Use the Four Skandhas\n6. Skandha of Consciousness\n7. How to Use the Five Skandhas",
    "h2_content": "* **Location: Chapter 4: (The Webbed Hollow, Webbed Hollow, The Purifying Spring).**\nThe Skandha of Choice can be found in Chapter 4. Go right from The Purifying Spring Keeper's Choice and up the stairs and through the gap in the wall.\nHug the wall on the right as you follow the path up to the next set of stairs and a wooden bridge. Cross the wooden bridge, and follow the path as it curves around to the left.\nWhen you get to the end, you'll see a pathway leading up to the right and white sacs to the left of it. Behind these sacs is a bridge that will take you down to where you want to go.\nFollow this to the end to be met with a Buddha's head and the monkey sitting on top of it. Approach, and the monkey will run off but you'll be able to collect the Skandha of Choice from the Buddha's head.",
    "promot": "This is an excerpt from the file 'How_to_Find_the_Five_Skandhas_and_Unlock_a_Secret_Boss.md', located in the main section titled 'How to Find the Five Skandhas and Unlock a Secret Boss'. The section summary is: One of the earliest Key Items you might stumble across in Black Myth: Wukong is the Skandha of Form. However, it's not until the later stages of the game that this item becomes useful. There are 5 Skandhas to collect throughout the chapters, with 4 unlocking a secret boss in Chapter 6. Here's everything you need to know to get your hands on them.\n1. Skandha of Form\n2. Skandha of Feeling\n3. Skandha of Thought\n4. Skandha of Choice\n5. Use the Four Skandhas\n6. Skandha of Consciousness\n7. How to Use the Five Skandhas This excerpt merges content from both the main and sub-sections. The sub-section is titled 'How to Find the Skandha of Choice', and the detailed content is as follows:\n* **Location: Chapter 4: (The Webbed Hollow, Webbed Hollow, The Purifying Spring).**\nThe Skandha of Choice can be found in Chapter 4. Go right from The Purifying Spring Keeper's Choice and up the stairs and through the gap in the wall.\nHug the wall on the right as you follow the path up to the next set of stairs and a wooden bridge. Cross the wooden bridge, and follow the path as it curves around to the left.\nWhen you get to the end, you'll see a pathway leading up to the right and white sacs to the left of it. Behind these sacs is a bridge that will take you down to where you want to go.\nFollow this to the end to be met with a Buddha's head and the monkey sitting on top of it. Approach, and the monkey will run off but you'll be able to collect the Skandha of Choice from the Buddha's head.",
    "promot_tokens_num": 429
}