{
    "chunk_id": 799152467490,
    "source_file": "How_to_Unlock_the_Zodiac_Village_and_Upgrade_Armor.md",
    "content_type": "one and two",
    "h1_title": "How to Unlock the Zodiac Village and Upgrade Armor",
    "h2_title": "How to Unlock Zodiac Village in The Painted Realm",
    "h1_content": "If you're tired of hopping from shrine to shrine to see NPCs, or you're wondering how to upgrade armor in Black Myth: Wukong, then Zodiac Village is the place for you. This central hub for NPCs can be unlocked in Chapter 3 and will introduce a new smithing character to cater to all your armor and weapon needs, along with additional perks from those you've already met.\n* How to Unlock Zodiac Village\n* How to Upgrade Armor\n* Challenge Yin Tiger\n* Request Medicines from Xu Dog\n* How to Use Seeds and Harvest Ingredients",
    "h2_content": "In Chapter 3, you'll arrive at a snowy beach near the Bitter Lake accompanied by an NPC called Admiral Bajie. If you turn back on yourself from the North Shore of the Bitter Lake shrine and go right to the end, you'll see a hut in the distance.\nGo toward it, and as you get closer, you can see a dragon ing with lightning in the water to the left. As you approach the area, Admiral Bajie will tell you he sees a familiar face.\nHead into the water to meet Chen Loong, and a fight will automatically begin with Admiral Bajie helping you out. When it's done, he won't be very happy and he'll exclaim that only one of Xu Dog's pills can save him.\nTo progress Loong's questline, you'll need to go back to Xu Dog. If you've been following our Walkthrough, by the time you reach Chapter 3, Xu Dog will have moved to the Cellar underneath the Crouching Tiger Temple in Yellow Wind Ridge.\nThe option to talk to Xu Dog will appear when you approach him after the battle with Chen Loong, and he'll hand over a formula for **Fortifying Medicament and a Special-made-Bone-Strengthening Pellet**. Return to the beach where you fought Chen Loong, and you'll find him waiting by the hut.\nHand over the potion, and in exchange, he'll give you the Ruyi Scroll, which will take you to the Zodiac Village in the Painted Realm.\nNow you have the scroll, a number of NPCs you've already encountered in your journey will be reunited in the village. This will now act as a central hub where you can find Xu Dog, Shen Monkey, Chen Loong, and a new character - Yin Tiger.",
    "promot": "This is an excerpt from the file 'How_to_Unlock_the_Zodiac_Village_and_Upgrade_Armor.md', located in the main section titled 'How to Unlock the Zodiac Village and Upgrade Armor'. The section summary is: If you're tired of hopping from shrine to shrine to see NPCs, or you're wondering how to upgrade armor in Black Myth: Wukong, then Zodiac Village is the place for you. This central hub for NPCs can be unlocked in Chapter 3 and will introduce a new smithing character to cater to all your armor and weapon needs, along with additional perks from those you've already met.\n* How to Unlock Zodiac Village\n* How to Upgrade Armor\n* Challenge Yin Tiger\n* Request Medicines from Xu Dog\n* How to Use Seeds and Harvest Ingredients This excerpt merges content from both the main and sub-sections. The sub-section is titled 'How to Unlock Zodiac Village in The Painted Realm', and the detailed content is as follows:\nIn Chapter 3, you'll arrive at a snowy beach near the Bitter Lake accompanied by an NPC called Admiral Bajie. If you turn back on yourself from the North Shore of the Bitter Lake shrine and go right to the end, you'll see a hut in the distance.\nGo toward it, and as you get closer, you can see a dragon ing with lightning in the water to the left. As you approach the area, Admiral Bajie will tell you he sees a familiar face.\nHead into the water to meet Chen Loong, and a fight will automatically begin with Admiral Bajie helping you out. When it's done, he won't be very happy and he'll exclaim that only one of Xu Dog's pills can save him.\nTo progress Loong's questline, you'll need to go back to Xu Dog. If you've been following our Walkthrough, by the time you reach Chapter 3, Xu Dog will have moved to the Cellar underneath the Crouching Tiger Temple in Yellow Wind Ridge.\nThe option to talk to Xu Dog will appear when you approach him after the battle with Chen Loong, and he'll hand over a formula for **Fortifying Medicament and a Special-made-Bone-Strengthening Pellet**. Return to the beach where you fought Chen Loong, and you'll find him waiting by the hut.\nHand over the potion, and in exchange, he'll give you the Ruyi Scroll, which will take you to the Zodiac Village in the Painted Realm.\nNow you have the scroll, a number of NPCs you've already encountered in your journey will be reunited in the village. This will now act as a central hub where you can find Xu Dog, Shen Monkey, Chen Loong, and a new character - Yin Tiger.",
    "promot_tokens_num": 568
}