{
    "chunk_id": 974603283044,
    "source_file": "Bishui_Beast_Staff.md",
    "content_type": "one and two",
    "h1_title": "Bishui Beast Staff",
    "h2_title": "Black Myth: Wukong Bishui Beast Staff Location",
    "h1_content": "The Bishui Beast Staff is a weapon in Black Myth: Wukong. It comes with solid stats and high critical hit chance, like the other Weapons in the game.\nThe weapon comes with 805 damage, an impressive 10% Critical Hit Chance. Unlike many of the other weapons, it doesn't have a Unique Effect.",
    "h2_content": "The Bishui Beast Staff can be found in Chapter 5 - Flaming Mountains, upon defeating the Bishui Golden-Eyed Beast in the Bishui Cave.\nBishui Beast Staff\nWeapons can be crafted throughout the game from the Shrines throughout the game's six chapters. Crafting weapons will require Will and various Crafting Materials from the game's locales and enemies. To craft the Bishui Beast Staff you will need:\n* 1 Bishui Beast Bit\")\n* 2 Refined Iron Sand\n* 8 Yaoguai Core\n* 1,500 Will\nFor even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Armor and Gear locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.",
    "promot": "This is an excerpt from the file 'Bishui_Beast_Staff.md', located in the main section titled 'Bishui Beast Staff'. The section summary is: The Bishui Beast Staff is a weapon in Black Myth: Wukong. It comes with solid stats and high critical hit chance, like the other Weapons in the game.\nThe weapon comes with 805 damage, an impressive 10% Critical Hit Chance. Unlike many of the other weapons, it doesn't have a Unique Effect. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Bishui Beast Staff Location', and the detailed content is as follows:\nThe Bishui Beast Staff can be found in Chapter 5 - Flaming Mountains, upon defeating the Bishui Golden-Eyed Beast in the Bishui Cave.\nBishui Beast Staff\nWeapons can be crafted throughout the game from the Shrines throughout the game's six chapters. Crafting weapons will require Will and various Crafting Materials from the game's locales and enemies. To craft the Bishui Beast Staff you will need:\n* 1 Bishui Beast Bit\")\n* 2 Refined Iron Sand\n* 8 Yaoguai Core\n* 1,500 Will\nFor even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Armor and Gear locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.",
    "promot_tokens_num": 339
}