{
    "chunk_id": 307856894188,
    "source_file": "Secrets_in_Black_Myth_Wukong.md",
    "content_type": "one and two",
    "h1_title": "Secrets in Black Myth Wukong",
    "h2_title": "The Scorpionlord Boss - Purple Cloud Mountain",
    "h1_content": "If you only stick to the main story in Black Myth: Wukong, you're going to miss out on a lot of the content the game has to offer. The world is packed with secrets including NPCs and their side quests that reward unique items, hidden areas, and secret bosses. If you want to fill out every record in your journal and collect all of those trophies, here's a list of all the secrets we've found across the chapters.\n### Guide in Progress\nThis page is currently in progress, so we'll keep adding secrets along the way! Check back later for more information.\n**Click on the links below to jump to:**\nChapter 1 Secrets| Chapter 2 Secrets| Chapter 3 Secrets\n---|---|---\nChapter 4 Secrets| Chapter 5 Secrets| Chapter 6 Secrets\n# Chapter 1 Secrets\nThe secrets start from the very first chapter of the game, and there's not one but two hidden bosses to uncover as you explore. The first is Elder Jinchi and the second is Red Loong. There are also Transformation Spells and missable Spirits that you'll want to bag before you wrap up the chapter.",
    "h2_content": "Just after the Bounds of Deity's Abode Keeper's Shrine, you can find the Scorpionlord. Go near the building that he protects and smash the pots, and he'll jump down for a fight. As you might expect, anything that will help you against poison resistance will help you against him.\n### Don't Miss This Boss!\nWe've listed the secret bosses in Purple Cloud Mountain in a particular order because ers have reported that this is a missable encounter. For that reason, we'd recommend tackling the Scorpionlord first when you're in Purple Cloud Mountain.",
    "promot": "This is an excerpt from the file 'Secrets_in_Black_Myth_Wukong.md', located in the main section titled 'Secrets in Black Myth Wukong'. The section summary is: If you only stick to the main story in Black Myth: Wukong, you're going to miss out on a lot of the content the game has to offer. The world is packed with secrets including NPCs and their side quests that reward unique items, hidden areas, and secret bosses. If you want to fill out every record in your journal and collect all of those trophies, here's a list of all the secrets we've found across the chapters.\n### Guide in Progress\nThis page is currently in progress, so we'll keep adding secrets along the way! Check back later for more information.\n**Click on the links below to jump to:**\nChapter 1 Secrets| Chapter 2 Secrets| Chapter 3 Secrets\n---|---|---\nChapter 4 Secrets| Chapter 5 Secrets| Chapter 6 Secrets\n# Chapter 1 Secrets\nThe secrets start from the very first chapter of the game, and there's not one but two hidden bosses to uncover as you explore. The first is Elder Jinchi and the second is Red Loong. There are also Transformation Spells and missable Spirits that you'll want to bag before you wrap up the chapter. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'The Scorpionlord Boss - Purple Cloud Mountain', and the detailed content is as follows:\nJust after the Bounds of Deity's Abode Keeper's Shrine, you can find the Scorpionlord. Go near the building that he protects and smash the pots, and he'll jump down for a fight. As you might expect, anything that will help you against poison resistance will help you against him.\n### Don't Miss This Boss!\nWe've listed the secret bosses in Purple Cloud Mountain in a particular order because ers have reported that this is a missable encounter. For that reason, we'd recommend tackling the Scorpionlord first when you're in Purple Cloud Mountain.",
    "promot_tokens_num": 429
}