{
    "chunk_id": 315166359932,
    "source_file": "Webbed_Hollow-Lower_Hollow_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Webbed Hollow - Lower Hollow Walkthrough",
    "h2_title": "Relief of the Fallen Loong",
    "h1_content": "The Webbed Hollow is the second main area of Black Myth: Wukong's Chapter 4, concluding with the lower portion of the large underground cave system. Below you'll find a guide for the third and final lower area of The Webbed Hollow, including where to find the secret Yellow Loong and frog boss, and rescue Zhu Bajie from the clutches of the Violet Spider.\n* **Jump to a Section**\n* **Relief of the Fallen Loong**\n* **Lower Hollow**\n* Yaoguai Chief - Baw-Li-Guhh-Baw\n* **Hut of Immortality**\n* Boss Fight - Zhu Bajie\n* **The Purifying Spring**\n* **The Gathering Cave**\n* Yaoguai Queen - Violet Spider\nDue to the length, complexity, and number of bosses scattered throughout the Webbed Hollow section of Chapter 4, this particular region walkthrough will be split up into three parts with each section largely covering a major floor level of the hollow.",
    "h2_content": "After sneaking across the bridge (be sure to go back and grab the green Wisp only after you've taken out the archer), you'll find another exit from the Hollow leading to a lush cliffside path.\nThe area is chock-full of various plants to harvest, but you'll also find a bunch of Beetle Captains who appear to be doing the same. Since many of them have their backs turned as they scavenge, be sure to sneak up and charge up your focus points to deliver a big heavy attack.\nOff on the right side, there's a larger tree where you can find a **Luojia Fragrant Vine** above a pool of water, and then find a path leading up to the left.\nRelief of the Fallen Loong Luojia Fragrant Vine\nClimbing up the path, there's more Beetle Captains on the side of the road, before it curves to the left.\nAt this point, if you've collected the Loong Scales back in Chapter 2, a familiar voice will begin to speak, indicating that a secret Loong boss is not far away. Follow the voice past a large area littered with the remains of wooden treasure chests to find the local Shrine, and up ahead at the top of the cliffside path you can find what appears to be the Ancient Master standing under a pavilion.\nThis man is actually the Yellow Loong, who claims he's been hiding upon the Ancient Master's garb as a pattern. As the last of the secret Loong bosses, he is an incredibly tough battle, especially at this point in the game, so you may want to back off and challenge him when you've got some stronger gear! If you're able to meet the challenge, you'll claim more materials needed to craft the ultimate Loong Staff, as well as a **Golden Carp Curio** , and the **Golden Lining Spell** to transform into the Yellow Loong himself!\n* See the **Yellow Loong Boss Guide** for details on how to defeat him.\nBack at the Shrine, head up the trail of old treasure chests to find another entrance back into the Webbed Hollow where a Scorpion Prince is guarding the cave opening.\nBeyond him, you'll find yourself on one of the large platforms along the Middle Hollow we couldn't reach earlier, so be sure to check the far left path to find the other side of a broken bridge with a green Wisp to absorb.\nTake the far right path past a few pools of water, and you'll be able to head along the right wall past a Grasshopper Guai to find three Puppet Ticks, who will try to slow you down with webbing and summon Stone Spiders. Defeat them all, you you'll gain the Puppet Tick Spirit from the enemy in the middle of the group.\nReturn back the way you came and look for a high ledge at the top of this platform. To the right, you'll find a **Treasure Chest** guarded by a lone archer, which holds rare items like a Septenary Heartfire Pill, Knot of Voidness, or Blood of the Iron Bull!\nHead back to the left along the edge of the platform, and you'll find the third **Purple Talisman Altar** , which you can pluck the talisman from (the last altar we won't find until we reach the next major area).\nRather helpfully, there's a brazier by a ledge nearby, and looking down you can find a spot to drop back down to the two bridges we noted at the start of the Lower Hollow, putting you quickly back on track to the main pathway.",
    "promot": "This is an excerpt from the file 'Webbed_Hollow-Lower_Hollow_Walkthrough.md', located in the main section titled 'Webbed Hollow - Lower Hollow Walkthrough'. The section summary is: The Webbed Hollow is the second main area of Black Myth: Wukong's Chapter 4, concluding with the lower portion of the large underground cave system. Below you'll find a guide for the third and final lower area of The Webbed Hollow, including where to find the secret Yellow Loong and frog boss, and rescue Zhu Bajie from the clutches of the Violet Spider.\n* **Jump to a Section**\n* **Relief of the Fallen Loong**\n* **Lower Hollow**\n* Yaoguai Chief - Baw-Li-Guhh-Baw\n* **Hut of Immortality**\n* Boss Fight - Zhu Bajie\n* **The Purifying Spring**\n* **The Gathering Cave**\n* Yaoguai Queen - Violet Spider\nDue to the length, complexity, and number of bosses scattered throughout the Webbed Hollow section of Chapter 4, this particular region walkthrough will be split up into three parts with each section largely covering a major floor level of the hollow. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Relief of the Fallen Loong', and the detailed content is as follows:\nAfter sneaking across the bridge (be sure to go back and grab the green Wisp only after you've taken out the archer), you'll find another exit from the Hollow leading to a lush cliffside path.\nThe area is chock-full of various plants to harvest, but you'll also find a bunch of Beetle Captains who appear to be doing the same. Since many of them have their backs turned as they scavenge, be sure to sneak up and charge up your focus points to deliver a big heavy attack.\nOff on the right side, there's a larger tree where you can find a **Luojia Fragrant Vine** above a pool of water, and then find a path leading up to the left.\nRelief of the Fallen Loong Luojia Fragrant Vine\nClimbing up the path, there's more Beetle Captains on the side of the road, before it curves to the left.\nAt this point, if you've collected the Loong Scales back in Chapter 2, a familiar voice will begin to speak, indicating that a secret Loong boss is not far away. Follow the voice past a large area littered with the remains of wooden treasure chests to find the local Shrine, and up ahead at the top of the cliffside path you can find what appears to be the Ancient Master standing under a pavilion.\nThis man is actually the Yellow Loong, who claims he's been hiding upon the Ancient Master's garb as a pattern. As the last of the secret Loong bosses, he is an incredibly tough battle, especially at this point in the game, so you may want to back off and challenge him when you've got some stronger gear! If you're able to meet the challenge, you'll claim more materials needed to craft the ultimate Loong Staff, as well as a **Golden Carp Curio** , and the **Golden Lining Spell** to transform into the Yellow Loong himself!\n* See the **Yellow Loong Boss Guide** for details on how to defeat him.\nBack at the Shrine, head up the trail of old treasure chests to find another entrance back into the Webbed Hollow where a Scorpion Prince is guarding the cave opening.\nBeyond him, you'll find yourself on one of the large platforms along the Middle Hollow we couldn't reach earlier, so be sure to check the far left path to find the other side of a broken bridge with a green Wisp to absorb.\nTake the far right path past a few pools of water, and you'll be able to head along the right wall past a Grasshopper Guai to find three Puppet Ticks, who will try to slow you down with webbing and summon Stone Spiders. Defeat them all, you you'll gain the Puppet Tick Spirit from the enemy in the middle of the group.\nReturn back the way you came and look for a high ledge at the top of this platform. To the right, you'll find a **Treasure Chest** guarded by a lone archer, which holds rare items like a Septenary Heartfire Pill, Knot of Voidness, or Blood of the Iron Bull!\nHead back to the left along the edge of the platform, and you'll find the third **Purple Talisman Altar** , which you can pluck the talisman from (the last altar we won't find until we reach the next major area).\nRather helpfully, there's a brazier by a ledge nearby, and looking down you can find a spot to drop back down to the two bridges we noted at the start of the Lower Hollow, putting you quickly back on track to the main pathway.",
    "promot_tokens_num": 1020
}