{
    "chunk_id": 679741370849,
    "source_file": "Spider_Celestial_Staff.md",
    "content_type": "one and two",
    "h1_title": "Spider Celestial Staff",
    "h2_title": "Black Myth: Wukong Spider Celestial Staff Location",
    "h1_content": "The Spider Celestial Staff is a weapon in Black Myth: Wukong. It comes with solid stats, damage, and a unique effect like many of the other Weapons in the game.\nThe weapon comes with 85 damage, an impressive 12% Critical Hit Chance, and the following unique effect:\n* Upon a successful hit with charged heavy attacks, each Focus Point cost slightly recovers Health\nIn Poisoned state, hits inflict the enemy with Poison Bane",
    "h2_content": "The Spider Celestial Staff can be found in Chapter 4 - The Webbed Hollow upon defeating the Violet Spider in Gathering Cave.\nSpider Celestial Staff\nWeapons can be crafted throughout the game from the Shrines throughout the game's six chapters. Crafting weapons will require Will and various Crafting Materials from the game's locales and enemies. To craft the Spider Celestial Staff you will need:\n* 1 Spider Leg\")\n* 2 Refined Iron Sand\n* 1,500 Will\nFor even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Armor and Gear locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.",
    "promot": "This is an excerpt from the file 'Spider_Celestial_Staff.md', located in the main section titled 'Spider Celestial Staff'. The section summary is: The Spider Celestial Staff is a weapon in Black Myth: Wukong. It comes with solid stats, damage, and a unique effect like many of the other Weapons in the game.\nThe weapon comes with 85 damage, an impressive 12% Critical Hit Chance, and the following unique effect:\n* Upon a successful hit with charged heavy attacks, each Focus Point cost slightly recovers Health\nIn Poisoned state, hits inflict the enemy with Poison Bane This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Myth: Wukong Spider Celestial Staff Location', and the detailed content is as follows:\nThe Spider Celestial Staff can be found in Chapter 4 - The Webbed Hollow upon defeating the Violet Spider in Gathering Cave.\nSpider Celestial Staff\nWeapons can be crafted throughout the game from the Shrines throughout the game's six chapters. Crafting weapons will require Will and various Crafting Materials from the game's locales and enemies. To craft the Spider Celestial Staff you will need:\n* 1 Spider Leg\")\n* 2 Refined Iron Sand\n* 1,500 Will\nFor even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Armor and Gear locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.",
    "promot_tokens_num": 338
}