{
    "chunk_id": 854608607266,
    "source_file": "Webbed_Hollow-Upper_Hollow_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Webbed Hollow - Upper Hollow Walkthrough",
    "h2_title": "Webbed Hollow",
    "h1_content": "The Webbed Hollow is the second main area of Black Myth: Wukong's Chapter 4, starting with the upper portion of the large underground cave system. Below you'll find a guide for the first upper area of The Webbed Hollow, including where to find your first encounter with the Venom Daoist, and the different ways to reach The Verdure Bridge.\n* **Jump to a Section**\n* **Upper Hollow**\n* **Pool of Shattered Jade**\n* Boss Fight - Venom Daoist\nDue to the length, complexity, and number of bosses scattered throughout the Webbed Hollow section of Chapter 4, this particular region walkthrough will be split up into three parts with each section largely covering a major floor level of the hollow.",
    "h2_content": "After facing certain doom trapped in the web of the spider guais of this realm, the Destined One will suddenly awake safe in a bed, somewhere deep underground below the Lanxi Village.\nOnce you are up again, you'll find a helpful gold box has been placed by the bed, and you can open the small **Treasure Chest** to claim 3 Antimiasma Powder and 1 Longevity Decoction. If you can't take the hint, it means you're likely to run into a lot of poison-inducing enemies in this area.\nBefore following the golden trail of a nearby Shrine, look to the left of the bed and small chest to find a path leading to another larger **Treasure Chest** you can open to claim a **Cuo Jin-Yin Belt Hook Curio** , another item that can help resist all the poison you'll be encountering.",
    "promot": "This is an excerpt from the file 'Webbed_Hollow-Upper_Hollow_Walkthrough.md', located in the main section titled 'Webbed Hollow - Upper Hollow Walkthrough'. The section summary is: The Webbed Hollow is the second main area of Black Myth: Wukong's Chapter 4, starting with the upper portion of the large underground cave system. Below you'll find a guide for the first upper area of The Webbed Hollow, including where to find your first encounter with the Venom Daoist, and the different ways to reach The Verdure Bridge.\n* **Jump to a Section**\n* **Upper Hollow**\n* **Pool of Shattered Jade**\n* Boss Fight - Venom Daoist\nDue to the length, complexity, and number of bosses scattered throughout the Webbed Hollow section of Chapter 4, this particular region walkthrough will be split up into three parts with each section largely covering a major floor level of the hollow. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Webbed Hollow', and the detailed content is as follows:\nAfter facing certain doom trapped in the web of the spider guais of this realm, the Destined One will suddenly awake safe in a bed, somewhere deep underground below the Lanxi Village.\nOnce you are up again, you'll find a helpful gold box has been placed by the bed, and you can open the small **Treasure Chest** to claim 3 Antimiasma Powder and 1 Longevity Decoction. If you can't take the hint, it means you're likely to run into a lot of poison-inducing enemies in this area.\nBefore following the golden trail of a nearby Shrine, look to the left of the bed and small chest to find a path leading to another larger **Treasure Chest** you can open to claim a **Cuo Jin-Yin Belt Hook Curio** , another item that can help resist all the poison you'll be encountering.",
    "promot_tokens_num": 401
}