{
    "chunk_id": 435937066997,
    "source_file": "How_to_Find_the_Five_Skandhas_and_Unlock_a_Secret_Boss.md",
    "content_type": "one and two",
    "h1_title": "How to Find the Five Skandhas and Unlock a Secret Boss",
    "h2_title": "How to Find the Skandha of Thought",
    "h1_content": "One of the earliest Key Items you might stumble across in Black Myth: Wukong is the Skandha of Form. However, it's not until the later stages of the game that this item becomes useful. There are 5 Skandhas to collect throughout the chapters, with 4 unlocking a secret boss in Chapter 6. Here's everything you need to know to get your hands on them.\n1. Skandha of Form\n2. Skandha of Feeling\n3. Skandha of Thought\n4. Skandha of Choice\n5. Use the Four Skandhas\n6. Skandha of Consciousness\n7. How to Use the Five Skandhas",
    "h2_content": "* **Location: Chapter 3 (The New West, Valley of Ectascy, Mindfulnes Cliff)**\nYou can collect the Skandha of Thought in Chapter 3 when you reach the Mindfulness Cliff Keeper's Shrine. To the right of the shrine, there's a large canyon, and there's actually a path below that you can drop down onto.\nJump down there and follow the cave system, until you're back outside, then continue up the stairs and along the path. Turn right and head through the corridor to emerge on another cliff that's covered in snow.\nContinue along the cliff's edge, where you'll see a statue above another cave entrance. Go inside here and up the stairs on the opposite side, where you'll see the monkey you saw near the first Skandha.\nOnce it's run away again, go up the stairs and get the Skandha of Thought from the head it was stood near.",
    "promot": "This is an excerpt from the file 'How_to_Find_the_Five_Skandhas_and_Unlock_a_Secret_Boss.md', located in the main section titled 'How to Find the Five Skandhas and Unlock a Secret Boss'. The section summary is: One of the earliest Key Items you might stumble across in Black Myth: Wukong is the Skandha of Form. However, it's not until the later stages of the game that this item becomes useful. There are 5 Skandhas to collect throughout the chapters, with 4 unlocking a secret boss in Chapter 6. Here's everything you need to know to get your hands on them.\n1. Skandha of Form\n2. Skandha of Feeling\n3. Skandha of Thought\n4. Skandha of Choice\n5. Use the Four Skandhas\n6. Skandha of Consciousness\n7. How to Use the Five Skandhas This excerpt merges content from both the main and sub-sections. The sub-section is titled 'How to Find the Skandha of Thought', and the detailed content is as follows:\n* **Location: Chapter 3 (The New West, Valley of Ectascy, Mindfulnes Cliff)**\nYou can collect the Skandha of Thought in Chapter 3 when you reach the Mindfulness Cliff Keeper's Shrine. To the right of the shrine, there's a large canyon, and there's actually a path below that you can drop down onto.\nJump down there and follow the cave system, until you're back outside, then continue up the stairs and along the path. Turn right and head through the corridor to emerge on another cliff that's covered in snow.\nContinue along the cliff's edge, where you'll see a statue above another cave entrance. Go inside here and up the stairs on the opposite side, where you'll see the monkey you saw near the first Skandha.\nOnce it's run away again, go up the stairs and get the Skandha of Thought from the head it was stood near.",
    "promot_tokens_num": 424
}