{
    "chunk_id": 375858887132,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Fright Cliff Walkthrough",
    "h2_title": "Rockrest Flat",
    "h1_content": "Fright Cliff is one of two possible second main regions of Chapter 2 in the Yellow Wind Ridge of Black Myth: Wukong. Below you'll find a guide for the Fright Cliff Region and its side quests for the Man-in-Stone and Yellow-Robed Squire, as well as how to defeat its many bosses that include the Mother of Stones and Stone Vanguard to get the Sterness of Stone.\n* **Jump to A Section:**\n* **Squall Hideout**\n* Yaoguai Chief - Mother of Stones\n* **Rockrest Flat**\n* Yaoguai King - Stone Vanguard\n* **Rock Crash Platform**\nFright Cliff is one of the two sub-regions you’ll need to explore in Chapter 2 of Black Myth Wukong in order to unlock the large sealed doors that lead to the end of the chapter. You can first reach this area by heading through the Sandgate Village and defeating the King of Flowing Sands and Second Rat Prince, and then crossing the bridge to the right of the sealed door.\nAs you cross the bridge, you can harvest some Licorice on the other side, and look to the left to spot a large archway in the distance, with a whirling black tornado even further left in a canyon separating the Fright Cliffs from the Crouching Tiger Temple.\nHeading toward the archway in the distance, you can find a green Wisp to absorb on the left side of the broken rock pathway, and on the right is a new type of enemy that will try to ambush you. This Pitstone is a mass of rock and skulls on legs, and will try to use its weight to jump down on you, and perform somersaults to use its momentum to slam into you. If they prove to be a problem to evade, consider using the Thrust Stance to charge up attacks from a distance and shatter them.\nAt the foot of the large archway stands another new enemy, the Spearbone. These warriors with horse skull heads adorned with brambles are very durable enemies, and will roar before stabbing and slashing with their hefty spears. Since they are slow to hit, engage in light attack combos and watch their moments to know when to dodge or try a strike through.\nAs you enter the Fright Cliff proper, another Pitstone enemy waits up the path, with a Blazebone enemy on a ledge to the right to try and pepper you with projectiles.\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.",
    "h2_content": "The area of Rockrest flat is wide with three major branches from the open area around the Shrine, and all directions are worth noting.\nTo the right when facing the shrine, you can spot stairs leading up past a wooden platform where a Blazebone will attack from its vantage point.\nUp the stairs, a Spearbone with shield guards a spot with a large waterfall of sand. The Spearbone is tougher than average, because defeating him will allow you to claim the Spearbone Spirit to add to your arsenal of transformation attacks! Just beware of his roar that preludes a frenzied combo of spear swings and slams, and use your Immobilize or Cloud Step to skirt around his defenses and attack him instead of his shield.\nTaking a closer look at the sandfall behind this enemy, you’ll find that its actually a magic barrier that can be dispelled, but only if you were able to crack the wall near the First Prince of Flowing Sand and find the Loong Scales. Once you have them, you’ll be able to interact with the sandfall and remove it, opening a door to a very tough secret boss fight - the Black Loong. Due to its difficulty, and some ways to make the fight easier you’ll unlock later, we recommend saving him for later.\nHead back down the stairs from the waterfall of sand and keep to the right to take down more Spearbones and assorted Rock Guai until you reach an opening in the cliff walls with a small wooden fencing you can break open.\nIn this large open field, you’ll find a friendly boar-like Guai resting on a rock. He’s apparently extremely inebriated, and needs you to help him find something to sober him up. He’ll mention “Windrest” if you talk to him again, providing a clue to where you can find such an ingredient. However, you’ll also find that the Man-in-Stone sells a Sobering Stone if you don’t want to explore. Since it costs a hefty 6,480 Will, you’re better off waiting to continue his questline when we explore the Yellow Wind Formation later on.\nBe sure to look around the vast field for items to gather like Fire Bellflower and Fragrant Jade Flowers. If you travel to the edge of the cliff past the field, you can find a **Meditation Point** by a large curved tree, giving you a free Skill Point!\nDeadwood Forest, Rockrest Flat Meditation Spot\nThe only other part of this field has a large gate that can’t currently be opened, so instead it’s time to return to the Shrine.\n### The Sixth Buddha’s Eyeball\nFrom the Shrine at Rockrest Flat, look off to the left for a path leading to a large opening in the rocks. Just before the path opens up, you can find the final statue head, and claiming its eyes will cause a mantra to be chanted, “Om Mani Padme Hum”, confirming you’ve found the final eye!\nJust past this final Buddha statue head, look through the archway opening in the rocky wall. Ahead you’ll spot a group of stone floating in the air, signaling your next boss fight is at hand. There's also a strange large rock to the left - make a note of it and we'll inspect it later.",
    "promot": "This is an excerpt from the file 'Fright_Cliff_Walkthrough.md', located in the main section titled 'Fright Cliff Walkthrough'. The section summary is: Fright Cliff is one of two possible second main regions of Chapter 2 in the Yellow Wind Ridge of Black Myth: Wukong. Below you'll find a guide for the Fright Cliff Region and its side quests for the Man-in-Stone and Yellow-Robed Squire, as well as how to defeat its many bosses that include the Mother of Stones and Stone Vanguard to get the Sterness of Stone.\n* **Jump to A Section:**\n* **Squall Hideout**\n* Yaoguai Chief - Mother of Stones\n* **Rockrest Flat**\n* Yaoguai King - Stone Vanguard\n* **Rock Crash Platform**\nFright Cliff is one of the two sub-regions you’ll need to explore in Chapter 2 of Black Myth Wukong in order to unlock the large sealed doors that lead to the end of the chapter. You can first reach this area by heading through the Sandgate Village and defeating the King of Flowing Sands and Second Rat Prince, and then crossing the bridge to the right of the sealed door.\nAs you cross the bridge, you can harvest some Licorice on the other side, and look to the left to spot a large archway in the distance, with a whirling black tornado even further left in a canyon separating the Fright Cliffs from the Crouching Tiger Temple.\nHeading toward the archway in the distance, you can find a green Wisp to absorb on the left side of the broken rock pathway, and on the right is a new type of enemy that will try to ambush you. This Pitstone is a mass of rock and skulls on legs, and will try to use its weight to jump down on you, and perform somersaults to use its momentum to slam into you. If they prove to be a problem to evade, consider using the Thrust Stance to charge up attacks from a distance and shatter them.\nAt the foot of the large archway stands another new enemy, the Spearbone. These warriors with horse skull heads adorned with brambles are very durable enemies, and will roar before stabbing and slashing with their hefty spears. Since they are slow to hit, engage in light attack combos and watch their moments to know when to dodge or try a strike through.\nAs you enter the Fright Cliff proper, another Pitstone enemy waits up the path, with a Blazebone enemy on a ledge to the right to try and pepper you with projectiles.\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Rockrest Flat', and the detailed content is as follows:\nThe area of Rockrest flat is wide with three major branches from the open area around the Shrine, and all directions are worth noting.\nTo the right when facing the shrine, you can spot stairs leading up past a wooden platform where a Blazebone will attack from its vantage point.\nUp the stairs, a Spearbone with shield guards a spot with a large waterfall of sand. The Spearbone is tougher than average, because defeating him will allow you to claim the Spearbone Spirit to add to your arsenal of transformation attacks! Just beware of his roar that preludes a frenzied combo of spear swings and slams, and use your Immobilize or Cloud Step to skirt around his defenses and attack him instead of his shield.\nTaking a closer look at the sandfall behind this enemy, you’ll find that its actually a magic barrier that can be dispelled, but only if you were able to crack the wall near the First Prince of Flowing Sand and find the Loong Scales. Once you have them, you’ll be able to interact with the sandfall and remove it, opening a door to a very tough secret boss fight - the Black Loong. Due to its difficulty, and some ways to make the fight easier you’ll unlock later, we recommend saving him for later.\nHead back down the stairs from the waterfall of sand and keep to the right to take down more Spearbones and assorted Rock Guai until you reach an opening in the cliff walls with a small wooden fencing you can break open.\nIn this large open field, you’ll find a friendly boar-like Guai resting on a rock. He’s apparently extremely inebriated, and needs you to help him find something to sober him up. He’ll mention “Windrest” if you talk to him again, providing a clue to where you can find such an ingredient. However, you’ll also find that the Man-in-Stone sells a Sobering Stone if you don’t want to explore. Since it costs a hefty 6,480 Will, you’re better off waiting to continue his questline when we explore the Yellow Wind Formation later on.\nBe sure to look around the vast field for items to gather like Fire Bellflower and Fragrant Jade Flowers. If you travel to the edge of the cliff past the field, you can find a **Meditation Point** by a large curved tree, giving you a free Skill Point!\nDeadwood Forest, Rockrest Flat Meditation Spot\nThe only other part of this field has a large gate that can’t currently be opened, so instead it’s time to return to the Shrine.\n### The Sixth Buddha’s Eyeball\nFrom the Shrine at Rockrest Flat, look off to the left for a path leading to a large opening in the rocks. Just before the path opens up, you can find the final statue head, and claiming its eyes will cause a mantra to be chanted, “Om Mani Padme Hum”, confirming you’ve found the final eye!\nJust past this final Buddha statue head, look through the archway opening in the rocky wall. Ahead you’ll spot a group of stone floating in the air, signaling your next boss fight is at hand. There's also a strange large rock to the left - make a note of it and we'll inspect it later.",
    "promot_tokens_num": 1273
}