{
    "chunk_id": 544992671804,
    "source_file": "How_to_Unlock_the_Secret_Loong_Dragon_Bosses.md",
    "content_type": "one and two",
    "h1_title": "How to Unlock the Secret Loong Dragon Bosses",
    "h2_title": "How to Find Black Loong - Chapter 2 Secret Boss",
    "h1_content": "Chapter 1 of Black Myth: Wukong has more than one secret boss for you to find, and one of these is a Dragon that's tucked away behind a waterfall. Getting to the boss, however, requires finding a key item that you can't get until Chapter 2. This isn't the only Loong boss you can find in the game, so if you want to access the secret area, and know the whereabouts of the Loong Dragon Bosses, here's everything you need to know.\n* How to Get the Loong Scales\n* How to Find the Chapter 1 Secret Dragon Boss\n* How to Find the Chapter 2 Secret Boss\n* How to Find Chapter 3 Dragon Boss\n* How to Find the Chapter 4 Secret Boss",
    "h2_content": "For Chapter 2, you'll want to wait until you've got to the Rockrest Flat Keeper's Shrine in Yellow Wind Ridge. If you're facing the Keeper's Shrine, turn to the right and head all the way up the stairs. If you haven't already collected it, you'll be able to fight a Spearbone here for a Spirit.\nBeyond this enemy, you'll see a sandfall. Head toward it and you can interact with it to remove the sand and enter a secret area Hidden Loong Cavern, where you'll fight Black Loong.\nBlack Loong",
    "promot": "This is an excerpt from the file 'How_to_Unlock_the_Secret_Loong_Dragon_Bosses.md', located in the main section titled 'How to Unlock the Secret Loong Dragon Bosses'. The section summary is: Chapter 1 of Black Myth: Wukong has more than one secret boss for you to find, and one of these is a Dragon that's tucked away behind a waterfall. Getting to the boss, however, requires finding a key item that you can't get until Chapter 2. This isn't the only Loong boss you can find in the game, so if you want to access the secret area, and know the whereabouts of the Loong Dragon Bosses, here's everything you need to know.\n* How to Get the Loong Scales\n* How to Find the Chapter 1 Secret Dragon Boss\n* How to Find the Chapter 2 Secret Boss\n* How to Find Chapter 3 Dragon Boss\n* How to Find the Chapter 4 Secret Boss This excerpt merges content from both the main and sub-sections. The sub-section is titled 'How to Find Black Loong - Chapter 2 Secret Boss', and the detailed content is as follows:\nFor Chapter 2, you'll want to wait until you've got to the Rockrest Flat Keeper's Shrine in Yellow Wind Ridge. If you're facing the Keeper's Shrine, turn to the right and head all the way up the stairs. If you haven't already collected it, you'll be able to fight a Spearbone here for a Spirit.\nBeyond this enemy, you'll see a sandfall. Head toward it and you can interact with it to remove the sand and enter a secret area Hidden Loong Cavern, where you'll fight Black Loong.\nBlack Loong",
    "promot_tokens_num": 361
}