{
    "chunk_id": 144816646993,
    "source_file": "Sterness_of_Stone.md",
    "content_type": "one and two",
    "h1_title": "Sterness of Stone",
    "h2_title": "Where To Use The Sterness of Stone in Black Myth: Wukong",
    "h1_content": "Sterness of Stone is one of the main Key Items in Black Myth: Wukong's Yellow Wind Ridge area. It is a mandatory Key Item you will come across throughout the chapter, as you need it to progress towards the final boss: the Yellow Wind Sage.\nThe Sterness of Stone can be found at the Fright Cliff - Rockrest Flat Shrine. Just to the left, of the Shrine you can find a small arena. Once you enter it, you will fight the Stone Vanguard. Defeating it will drop the Sterness of Stone.\nSterness of Stone\nFor a full guide through the Fright Cliff - Rockrest Flat area, be sure to read through our Fright Cliff Walkthrough in Chapter 2 - Yellow Sand, Desolate Dusk.\nBefore that, however, you can find out where the Sterness of Stone can be used below.",
    "h2_content": "The Sterness of Stone can be used on the Tallies located in Chapter 2 - Yellow Wind Ridge. They allow you to access the path under the Crouching Tiger Temple, and open the locked doors at Sandgate Village - Valley of Despair and Yellow Sand Formation - Windrest Gate Shrines. You will need to use this with the Keeness of Tiger Key Item, which can be found at the Crouching Tiger Temple upon defeating the Tiger Vanguard.\nThe first Tally is at the Crouching Tiger Temple, within the arena where you fought the Tiger Vanguard.\nThe first gate can be found right next to the Sandgate Village - Valley of Despair Shrine, on the right.\nThe second gate and final Tally is at the base of the sand slope onwards from the Fright Cliff - Rock Clash Platform Shrine, which is just after the Stone Vanguard fight.\nFor an even more detailed walkthrough of these areas beyond the Tallies, be sure to check out our full walkthrough.",
    "promot": "This is an excerpt from the file 'Sterness_of_Stone.md', located in the main section titled 'Sterness of Stone'. The section summary is: Sterness of Stone is one of the main Key Items in Black Myth: Wukong's Yellow Wind Ridge area. It is a mandatory Key Item you will come across throughout the chapter, as you need it to progress towards the final boss: the Yellow Wind Sage.\nThe Sterness of Stone can be found at the Fright Cliff - Rockrest Flat Shrine. Just to the left, of the Shrine you can find a small arena. Once you enter it, you will fight the Stone Vanguard. Defeating it will drop the Sterness of Stone.\nSterness of Stone\nFor a full guide through the Fright Cliff - Rockrest Flat area, be sure to read through our Fright Cliff Walkthrough in Chapter 2 - Yellow Sand, Desolate Dusk.\nBefore that, however, you can find out where the Sterness of Stone can be used below. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where To Use The Sterness of Stone in Black Myth: Wukong', and the detailed content is as follows:\nThe Sterness of Stone can be used on the Tallies located in Chapter 2 - Yellow Wind Ridge. They allow you to access the path under the Crouching Tiger Temple, and open the locked doors at Sandgate Village - Valley of Despair and Yellow Sand Formation - Windrest Gate Shrines. You will need to use this with the Keeness of Tiger Key Item, which can be found at the Crouching Tiger Temple upon defeating the Tiger Vanguard.\nThe first Tally is at the Crouching Tiger Temple, within the arena where you fought the Tiger Vanguard.\nThe first gate can be found right next to the Sandgate Village - Valley of Despair Shrine, on the right.\nThe second gate and final Tally is at the base of the sand slope onwards from the Fright Cliff - Rock Clash Platform Shrine, which is just after the Stone Vanguard fight.\nFor an even more detailed walkthrough of these areas beyond the Tallies, be sure to check out our full walkthrough.",
    "promot_tokens_num": 450
}