{
    "chunk_id": 202315625952,
    "source_file": "How_to_Unlock_the_Secret_Ending_(True_Ending).md",
    "content_type": "one and two",
    "h1_title": "How to Unlock the Secret Ending (True Ending)",
    "h2_title": "Unlock and Complete Purple Cloud Mountain (Chapter 4)",
    "h1_content": "Each Chapter of Black Myth: Wukong has a secret area to discover. Typically, these are filled with optional bosses, which you'll need to defeat to complete the area. You'll need to finish each of the chapter's secret areas and a side quest you can pick up in Chapter 3 to reach the game's secret - and true - ending. Here's everything you need to do to get there.\n1. Complete Secret: Ancient Guanyin Temple (Chapter 1)\n2. Complete Kingdom of Sahali (Chapter 2)\n3. Complete the Treasure Hunter Side Quest (Chapter 3)\n4. Complete Purple Cloud Mountain (Chapter 4)\n5. Complete Bishui Cave (Chapter 5)\n6. Complete Mount Mei (The Great Pagoda)\n7. Beat the final boss",
    "h2_content": "In Chapter 4, fighting the Venom Daoist twice will grant you access to Purple Cloud Mountain. Here, you'll find 3 bosses to take on to complete the section.\n1. Defeat the Venom Daoist in the Upper Hollow\n2. Defeat the Venom Daoist again at the Temple of Yellow Flowers to unlock Purple Cloud Mountain\n3. Defeat the Scorpionlord\n4. Defeat Daoist Mi\n5. Defeat Duskveil",
    "promot": "This is an excerpt from the file 'How_to_Unlock_the_Secret_Ending_(True_Ending).md', located in the main section titled 'How to Unlock the Secret Ending (True Ending)'. The section summary is: Each Chapter of Black Myth: Wukong has a secret area to discover. Typically, these are filled with optional bosses, which you'll need to defeat to complete the area. You'll need to finish each of the chapter's secret areas and a side quest you can pick up in Chapter 3 to reach the game's secret - and true - ending. Here's everything you need to do to get there.\n1. Complete Secret: Ancient Guanyin Temple (Chapter 1)\n2. Complete Kingdom of Sahali (Chapter 2)\n3. Complete the Treasure Hunter Side Quest (Chapter 3)\n4. Complete Purple Cloud Mountain (Chapter 4)\n5. Complete Bishui Cave (Chapter 5)\n6. Complete Mount Mei (The Great Pagoda)\n7. Beat the final boss This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Unlock and Complete Purple Cloud Mountain (Chapter 4)', and the detailed content is as follows:\nIn Chapter 4, fighting the Venom Daoist twice will grant you access to Purple Cloud Mountain. Here, you'll find 3 bosses to take on to complete the section.\n1. Defeat the Venom Daoist in the Upper Hollow\n2. Defeat the Venom Daoist again at the Temple of Yellow Flowers to unlock Purple Cloud Mountain\n3. Defeat the Scorpionlord\n4. Defeat Daoist Mi\n5. Defeat Duskveil",
    "promot_tokens_num": 343
}