{
    "chunk_id": 1718176122,
    "source_file": "New_Thunderclap_Temple_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "New Thunderclap Temple Walkthrough",
    "h2_title": "Temple Entrance",
    "h1_content": "The New Thunderclap Temple is the final main region of Chapter 3 in The New West in Black Myth: Wukong. Below you'll find a guide for the New Thunderclap Temple Region, including how to navigate the temple, complete the Snow Fox Questline and defeat all of Yellowbrow's disciples, and finally face Yellowbrow himself.\n* **Jump to a Section:**\n* **Temple Entrance**\n* Yaoguai Chief - Monk from the Sea\n* **Temple Main Plaza**\n* Yaoguai Chief - Non-Void\n* **Temple Inner Courtyard**\n* Yaoguai Chief - Non-Pure\n* **Mahavira Hall**\n* Yaoguai King - Yellowbrow\n* Yaoguai Chief - Macaque Chief\n* Yaoguai King - Yellowbrow (Round Two)\nNow that you've made your way through the Valley of Ecstasy (and hopefully accepted the Snow Fox's request in the Forest of Felicity), the grand New Thunderclap Temple awaits.\nThe temple is a sprawling complex teeming with Yellowbrow's minions, and is comprised of three main plazas leading to the large pagoda tower in the distance, with additional and optional areas on both sides as you make your way up.",
    "h2_content": "With Captain Kalpa-Wave defeated, you can head through the temple entrance to find the Temple Entrance Shrine to the left. There's a large entry courtyard area here, with another gate straight ahead, and some optional spots to explore on both sides.\nBe sure to turn around from the Shrine and look back toward the main gate, and you should spot a **Treasure Chest** to the right in front of an altar.\nFrom the chest, be sure to keep exploring this side a bit farther to find a frozen lake and falls where a number of Censor Holders are wandering around while a lesser Sea Monk watches over them. Remember to watch out for their snow boulder tossing and rapidly extending appendages to find a moment to dodge around strike at them.\nOnce defeated, you can check the statues by the frozen falls to find a green Wisp to absorb.\nThe central path from the Shrine leads down a main road with more Censor Holders on both sides (they won't bother you if you don't bother them) leading to a large building guarded by a Dual-Blade Monk.\nBefore checking the interior, be sure to look around the left side of the building to find a Thunder Rhino Master on top of a small wooden platform, and climb the snowdrift on the side to reach him before he can cast lightning on you.\nBehind the mage, you can spot a new enemy standing by a sealed doorway. These Overseeing Monks are an interesting enemy - they really are blind, and will often shift about when they sense you approach. However, once you attack, they'll immediately begin to counter with powerful martial arts, which can sometimes extend for several powerful attacks in a row.\nThe good news is that they largely remain stationary, meaning you can easily stop a few feet away and charge a full heavy thrust attack to knock them flat, and then follow up with a quick light combo as they stagger to their feet.\nOnce this monk has been defeated, check the corner of this snowdrift for a green Wisp to absorb.\nInside the building itself, you'll find another Overseeing Monk in the main room (plus another on the far right side of the building exterior), and on the other side is the beginning of the main plaza, but the stairs beyond are lined with several Thunder Rhino Masters, so let's backtrack and find an optional side path.\nBack at the Temple Entrance Shrine, move to the right to find two other paths:\nTake the first left to find a quicker path to the Main Plaza that's a little less guarded, as there's only a Supporter Monk patrolling the path to where a lone Overseeing Monk guarding a smaller gate.\nIf you take the far right path, you can find another green Wisp in the farthest corner close to the entrance gate, and another path leading to a side area.\nTake out a lone Censor Holder as you follow the stone path to a long sloping corridor with a green Wisp to absorb at the bottom.\nThe sloping path itself is lined with several Supporter Monks, but are thankfully slow to attack and allow you to charge up your focus points with light combos and unleash big hits before they can react.\nAt the top of the slope, two Censor Holders and a Supporter Monk are praying to statues of Turtle and Snake General, and you can ignore them or unleash a surprise attack if you wish.\nBy now you may have noticed the New Thunderclap Temple is brimming with lots of enemies you don't necessarily need to kill. Between the praying Censor Holders and blind Overseeing Monks, you can ignore a lot of enemies if you wish, but it's also not a bad idea to kill them for extra Will and Experience, and is also a good way to build up Focus to expend on more deadly foes.\nHead into the next area, and look left at the top of the stairs to find another Turtle General statue with a **Treasure Chest** with a Knot of Voidness and other materials, surrounded on all sides by praying Censor Holders.\nBe wary of two Supporter Monks lying in wait in opposite alcoves near the statue, as well as the patrolling monk on the nearby road.\nThere's more Censor Holders praying in front of an altar that stands before a gate opening, but you can also continue to explore the far corner to find a Wolf Guardian by a tree, and a green Wisp to absorb at the top of a snow drift nearby.\nFinally, look to the right when approaching the gate to find a small side room with an alcove to the right where a **Treasure Chest** with materials has been stashed.\nInside the side room, there's another large tree that a Supporter Monk is facing, but a Wolf Guardian will try to ambush you as you approach him. You can also find a Ginsengling around the tree roots by trying to harvest some Aged Ginseng.\nCarefully head through the open doorway into the side plaza, and look for a small alcove on the left for a green Wisp to absorb. However, once you begin to explore this area, a Yaoguai Chief will emerge from a nearby altar.",
    "promot": "This is an excerpt from the file 'New_Thunderclap_Temple_Walkthrough.md', located in the main section titled 'New Thunderclap Temple Walkthrough'. The section summary is: The New Thunderclap Temple is the final main region of Chapter 3 in The New West in Black Myth: Wukong. Below you'll find a guide for the New Thunderclap Temple Region, including how to navigate the temple, complete the Snow Fox Questline and defeat all of Yellowbrow's disciples, and finally face Yellowbrow himself.\n* **Jump to a Section:**\n* **Temple Entrance**\n* Yaoguai Chief - Monk from the Sea\n* **Temple Main Plaza**\n* Yaoguai Chief - Non-Void\n* **Temple Inner Courtyard**\n* Yaoguai Chief - Non-Pure\n* **Mahavira Hall**\n* Yaoguai King - Yellowbrow\n* Yaoguai Chief - Macaque Chief\n* Yaoguai King - Yellowbrow (Round Two)\nNow that you've made your way through the Valley of Ecstasy (and hopefully accepted the Snow Fox's request in the Forest of Felicity), the grand New Thunderclap Temple awaits.\nThe temple is a sprawling complex teeming with Yellowbrow's minions, and is comprised of three main plazas leading to the large pagoda tower in the distance, with additional and optional areas on both sides as you make your way up. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Temple Entrance', and the detailed content is as follows:\nWith Captain Kalpa-Wave defeated, you can head through the temple entrance to find the Temple Entrance Shrine to the left. There's a large entry courtyard area here, with another gate straight ahead, and some optional spots to explore on both sides.\nBe sure to turn around from the Shrine and look back toward the main gate, and you should spot a **Treasure Chest** to the right in front of an altar.\nFrom the chest, be sure to keep exploring this side a bit farther to find a frozen lake and falls where a number of Censor Holders are wandering around while a lesser Sea Monk watches over them. Remember to watch out for their snow boulder tossing and rapidly extending appendages to find a moment to dodge around strike at them.\nOnce defeated, you can check the statues by the frozen falls to find a green Wisp to absorb.\nThe central path from the Shrine leads down a main road with more Censor Holders on both sides (they won't bother you if you don't bother them) leading to a large building guarded by a Dual-Blade Monk.\nBefore checking the interior, be sure to look around the left side of the building to find a Thunder Rhino Master on top of a small wooden platform, and climb the snowdrift on the side to reach him before he can cast lightning on you.\nBehind the mage, you can spot a new enemy standing by a sealed doorway. These Overseeing Monks are an interesting enemy - they really are blind, and will often shift about when they sense you approach. However, once you attack, they'll immediately begin to counter with powerful martial arts, which can sometimes extend for several powerful attacks in a row.\nThe good news is that they largely remain stationary, meaning you can easily stop a few feet away and charge a full heavy thrust attack to knock them flat, and then follow up with a quick light combo as they stagger to their feet.\nOnce this monk has been defeated, check the corner of this snowdrift for a green Wisp to absorb.\nInside the building itself, you'll find another Overseeing Monk in the main room (plus another on the far right side of the building exterior), and on the other side is the beginning of the main plaza, but the stairs beyond are lined with several Thunder Rhino Masters, so let's backtrack and find an optional side path.\nBack at the Temple Entrance Shrine, move to the right to find two other paths:\nTake the first left to find a quicker path to the Main Plaza that's a little less guarded, as there's only a Supporter Monk patrolling the path to where a lone Overseeing Monk guarding a smaller gate.\nIf you take the far right path, you can find another green Wisp in the farthest corner close to the entrance gate, and another path leading to a side area.\nTake out a lone Censor Holder as you follow the stone path to a long sloping corridor with a green Wisp to absorb at the bottom.\nThe sloping path itself is lined with several Supporter Monks, but are thankfully slow to attack and allow you to charge up your focus points with light combos and unleash big hits before they can react.\nAt the top of the slope, two Censor Holders and a Supporter Monk are praying to statues of Turtle and Snake General, and you can ignore them or unleash a surprise attack if you wish.\nBy now you may have noticed the New Thunderclap Temple is brimming with lots of enemies you don't necessarily need to kill. Between the praying Censor Holders and blind Overseeing Monks, you can ignore a lot of enemies if you wish, but it's also not a bad idea to kill them for extra Will and Experience, and is also a good way to build up Focus to expend on more deadly foes.\nHead into the next area, and look left at the top of the stairs to find another Turtle General statue with a **Treasure Chest** with a Knot of Voidness and other materials, surrounded on all sides by praying Censor Holders.\nBe wary of two Supporter Monks lying in wait in opposite alcoves near the statue, as well as the patrolling monk on the nearby road.\nThere's more Censor Holders praying in front of an altar that stands before a gate opening, but you can also continue to explore the far corner to find a Wolf Guardian by a tree, and a green Wisp to absorb at the top of a snow drift nearby.\nFinally, look to the right when approaching the gate to find a small side room with an alcove to the right where a **Treasure Chest** with materials has been stashed.\nInside the side room, there's another large tree that a Supporter Monk is facing, but a Wolf Guardian will try to ambush you as you approach him. You can also find a Ginsengling around the tree roots by trying to harvest some Aged Ginseng.\nCarefully head through the open doorway into the side plaza, and look for a small alcove on the left for a green Wisp to absorb. However, once you begin to explore this area, a Yaoguai Chief will emerge from a nearby altar.",
    "promot_tokens_num": 1380
}