{
    "chunk_id": 549601417931,
    "source_file": "Village_of_Lanxi_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Village of Lanxi Walkthrough",
    "h2_title": "The Webbed Hollow",
    "h1_content": "Black Myth: Wukong's Chapter 4 begins in the darkened outskirts of the Village of Lanxi where the mysterious Webbed Hollow is rumored to be. Below you'll find a guide for the first major area of The Webbed Hollow: the Village of Lanxi, as well as how to navigate the town and defeat the Second Sister.\n* **Jump to a Section**\n* **Estate of the Zhu**\n* Yaoguai Chief - The Second Sister",
    "h2_content": "You'll awaken in this new realm hiding inside an offering chest for a mysterious \"Lady\", being carried to The Webbed Hollow by two Yaoguai. Eventually, your fiend Zhu Bajie will grow tired of hiding, but before you can bust out, a mysterious woman will eliminate the two Wushan Lesser Guai.\nOnce you're able to take stock of your new surroundings, you'll find yourself on the outskirts of a village under cover of night. Before heading onward, you may want to backtrack up the hill you were carried down, as you'll find a free green Wisp to absorb in the shack at the top, plus a Monkey-Head Mushroom to harvest.\nMaking your way past the scattered homes, the place is eerily quiet, but you can find a few other plants to harvest. Head through the wooded area to find another green Wisp, and you may notice a body hiding up in the trees.\nDown will drop a Puppet Spider, a Yaoguai that likes to ambush and stab at you with its many legs. Luckily, you'll have Zhu Bajie on your side once more, and overwhelming lone opponents will be an easy task. They can spew poison from a distance, so watch yourself that you don't have to waste any Antimiasma potions this early.\nAs you approach the entrance to the village, you can spot two paths - a main one directly ahead, and a side path leading to the left down some stairs. You can also check out a small stream to the right with more plants to harvest in and around the water, and a green Wisp to absorb (it's guarded by another Puppet Spider).\nIn fact, this town is teeming with green Wisps of all sizes, which means you'll have a lot of these little spirits to absorb to gain both will and some of your Gourd charges back in a pinch.\nTake the main path first to find a few enemies up ahead, and an open shack on the right where the dim glow of another green Wisp can be seen. Be wary, as there's another Puppet Spider hiding in the shadows waiting for you to try and absorb the spirit!\nApproach the enemy holding the lanterns cautiously, as the other side of the shack you investigated hides an archer who will try to ambush you once you engage the other foe.\nThis Dragonfly Guai will fire off poison arrows at a measured pace, which are an unfortunate pairing with the fiery hostile wisps the Lantern Holder can create, alongside his equally poisonous sickle.\nOnce they've been defeated, look for some stairs left of the lantern decorations, and head to the lower level. There's many more green Wisps to absorb, so long as you take out the other Lantern Holder creating more dangerous wisps of his own.\nAt the end of this lower path with the five green Wisps scattered about, there's a innocuous looking chest sitting in front of a small shack, but when you try to claim it, you'll be ambushed by a swarm of small Stone Spiders.\nThese little enemies are surprisingly durable, and can often come in waves. You'll really need to keep a close eye on them -- if you spot them begin to vibrate rapidly, they'll all explode at once, and getting hit by several exploding spiders can deal a ton of damage if you aren't paying attention.\nOnce all the waves of Stone Spiders are dealt with, loot the **Treasure Chest** for a Blood of the Iron Bull and some random materials.\nHead back up to the main path, and be sure to check behind the small shack where the Dragonfly Guai was positioned to find a Lingzhiling hiding in the earth disguised as a mushroom to harvest.\nJust past the lantern decorations, you'll encounter a new enemy: the Beetle Captain. These foes are tougher than the others in this area, and move deftly with twin swords for dual slashes or pincer-like stab attacks. They can also rapidly reorient themselves by flying backward after an attack, but you can Immobilize them to keep the foe pinned down.\nOnce the captain falls (and watch for another Puppet Spider nearby, you can check around the back of the house to the left to find another green Wisp guarded by a Puppet Spider hanging from the tree above.\nFrom here, look around to find two paths to take: A narrow walkway over a stream below, and another open path past a building to the right.\nTake the path on the right first, but first look for a small building next to the narrow path where you'll find another **Treasure Chest** inside, guarded by more Stone Spiders that will burrow up to ambush you.\nHead down the sloping street and grab a green Wisp along the way, and you'll find yourself crossing a small bridge to a clearing with a shack covered in webs. Standing our front are two Grasshopper Guai that can strike extremely quickly, but aren't as durable as the Beetle Captain.\nClear them out with Zhu Bajie's help, and you'll find they were guarding a large **Treasure Chest** holding several consumables, which may include a Loong Aura Amplification Pellet, as well as a Knot of Voidness and Blood of the Iron Bull.",
    "promot": "This is an excerpt from the file 'Village_of_Lanxi_Walkthrough.md', located in the main section titled 'Village of Lanxi Walkthrough'. The section summary is: Black Myth: Wukong's Chapter 4 begins in the darkened outskirts of the Village of Lanxi where the mysterious Webbed Hollow is rumored to be. Below you'll find a guide for the first major area of The Webbed Hollow: the Village of Lanxi, as well as how to navigate the town and defeat the Second Sister.\n* **Jump to a Section**\n* **Estate of the Zhu**\n* Yaoguai Chief - The Second Sister This excerpt merges content from both the main and sub-sections. The sub-section is titled 'The Webbed Hollow', and the detailed content is as follows:\nYou'll awaken in this new realm hiding inside an offering chest for a mysterious \"Lady\", being carried to The Webbed Hollow by two Yaoguai. Eventually, your fiend Zhu Bajie will grow tired of hiding, but before you can bust out, a mysterious woman will eliminate the two Wushan Lesser Guai.\nOnce you're able to take stock of your new surroundings, you'll find yourself on the outskirts of a village under cover of night. Before heading onward, you may want to backtrack up the hill you were carried down, as you'll find a free green Wisp to absorb in the shack at the top, plus a Monkey-Head Mushroom to harvest.\nMaking your way past the scattered homes, the place is eerily quiet, but you can find a few other plants to harvest. Head through the wooded area to find another green Wisp, and you may notice a body hiding up in the trees.\nDown will drop a Puppet Spider, a Yaoguai that likes to ambush and stab at you with its many legs. Luckily, you'll have Zhu Bajie on your side once more, and overwhelming lone opponents will be an easy task. They can spew poison from a distance, so watch yourself that you don't have to waste any Antimiasma potions this early.\nAs you approach the entrance to the village, you can spot two paths - a main one directly ahead, and a side path leading to the left down some stairs. You can also check out a small stream to the right with more plants to harvest in and around the water, and a green Wisp to absorb (it's guarded by another Puppet Spider).\nIn fact, this town is teeming with green Wisps of all sizes, which means you'll have a lot of these little spirits to absorb to gain both will and some of your Gourd charges back in a pinch.\nTake the main path first to find a few enemies up ahead, and an open shack on the right where the dim glow of another green Wisp can be seen. Be wary, as there's another Puppet Spider hiding in the shadows waiting for you to try and absorb the spirit!\nApproach the enemy holding the lanterns cautiously, as the other side of the shack you investigated hides an archer who will try to ambush you once you engage the other foe.\nThis Dragonfly Guai will fire off poison arrows at a measured pace, which are an unfortunate pairing with the fiery hostile wisps the Lantern Holder can create, alongside his equally poisonous sickle.\nOnce they've been defeated, look for some stairs left of the lantern decorations, and head to the lower level. There's many more green Wisps to absorb, so long as you take out the other Lantern Holder creating more dangerous wisps of his own.\nAt the end of this lower path with the five green Wisps scattered about, there's a innocuous looking chest sitting in front of a small shack, but when you try to claim it, you'll be ambushed by a swarm of small Stone Spiders.\nThese little enemies are surprisingly durable, and can often come in waves. You'll really need to keep a close eye on them -- if you spot them begin to vibrate rapidly, they'll all explode at once, and getting hit by several exploding spiders can deal a ton of damage if you aren't paying attention.\nOnce all the waves of Stone Spiders are dealt with, loot the **Treasure Chest** for a Blood of the Iron Bull and some random materials.\nHead back up to the main path, and be sure to check behind the small shack where the Dragonfly Guai was positioned to find a Lingzhiling hiding in the earth disguised as a mushroom to harvest.\nJust past the lantern decorations, you'll encounter a new enemy: the Beetle Captain. These foes are tougher than the others in this area, and move deftly with twin swords for dual slashes or pincer-like stab attacks. They can also rapidly reorient themselves by flying backward after an attack, but you can Immobilize them to keep the foe pinned down.\nOnce the captain falls (and watch for another Puppet Spider nearby, you can check around the back of the house to the left to find another green Wisp guarded by a Puppet Spider hanging from the tree above.\nFrom here, look around to find two paths to take: A narrow walkway over a stream below, and another open path past a building to the right.\nTake the path on the right first, but first look for a small building next to the narrow path where you'll find another **Treasure Chest** inside, guarded by more Stone Spiders that will burrow up to ambush you.\nHead down the sloping street and grab a green Wisp along the way, and you'll find yourself crossing a small bridge to a clearing with a shack covered in webs. Standing our front are two Grasshopper Guai that can strike extremely quickly, but aren't as durable as the Beetle Captain.\nClear them out with Zhu Bajie's help, and you'll find they were guarding a large **Treasure Chest** holding several consumables, which may include a Loong Aura Amplification Pellet, as well as a Knot of Voidness and Blood of the Iron Bull.",
    "promot_tokens_num": 1231
}