{
    "chunk_id": 899143431063,
    "source_file": "Daoist_Mi.md",
    "content_type": "one and two",
    "h1_title": "Daoist Mi",
    "h2_title": "Daoist Mi Boss Fight and Guide",
    "h1_content": "The Daoist Mi is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the secret area of the Purple Cloud Mountain, the Daoist Mi will have a quest for you before you can face him in battle.\n* Rewards: Violet Hail Transformation Spell, Refined Iron Sand, 1562 Experience, 1451 Will",
    "h2_content": "The Daoist Mi is a stronger version of the Sword Daoists you've encountered all over the Temple of Yellow Flowers. Despite being stronger, he's still kind of a pushover, as he doesn't boast much more than your average enemy, even with two distinct phases.\nIn his first phase, the Daoist Mi will come at you with flowing sword attacks, some of which can emit projectiles waves of force at range when they perform an upward slash in a reverse grip stance.\nWhile most of their basic attacks are simple two-hit strikes, they can also start a combo with an upward slice creating a projectile wave, dash forward into a lunging strike, before spinning to perform a horizontal sweep with one last projectile wave.\nThe good news all of their attacks can be deflected with Rock Solid, and pretty much any spell you have will be effective or stagger them greatly. Just treat them as you would any other Sword Daoist, keeping in mind that their greatly expanded health pool should dissuade you from pressing your attack too long so that you can back off to evade their next moves and regain your stamina.\nSomewhat surprisingly, Daoist Mi can also employ the move used by the Red-Haired Yaksha of Chapter 3, performing two quick fist strikes, and then turning around to perform a reverse bicycle kick that can hit especially hard -- but its still nothing as dangerous as the Scorpionlord.\nOnce you deplete their health bar, the Daoist Mi will invoke the power of the worm's egg, transforming into a Worm Practitioner for the second phase of this fight. Like before, much of their attack patterns will follow the basic enemy, so there won't be too much of a surprise in store.\nMuch of the worm's moves rely on stumbling and staggering slashes with their long poisonous appendage, either thrusting forward or dragging it along the ground toward you. While they can be a little unpredictable, they still move very slowly.\nThe one big new move that Daoist Mi can use in this form is spewing a lot more poison across the arena. In particular, if they arch backwards for a long moment before getting up, they'll run towards you while spewing poison in every possible direction. Knowing this in advance, simply keep your distance or prepare a charged thrust attack to repel them.\nWith Antimiasma powder on hand, the Daoist Mi won't last long against your superior skills. When you finally defeat him, the snake woman will appear and take the egg back from the fallen Daoist, before giving it to you, in the hopes you can make true use of its power. You'll gain the **Violet Hail Transformation Spell** , allowing you to temporarily turn into a Worm Practitioner yourself and become immune to poison!\nDaoist Mi",
    "promot": "This is an excerpt from the file 'Daoist_Mi.md', located in the main section titled 'Daoist Mi'. The section summary is: The Daoist Mi is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the secret area of the Purple Cloud Mountain, the Daoist Mi will have a quest for you before you can face him in battle.\n* Rewards: Violet Hail Transformation Spell, Refined Iron Sand, 1562 Experience, 1451 Will This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Daoist Mi Boss Fight and Guide', and the detailed content is as follows:\nThe Daoist Mi is a stronger version of the Sword Daoists you've encountered all over the Temple of Yellow Flowers. Despite being stronger, he's still kind of a pushover, as he doesn't boast much more than your average enemy, even with two distinct phases.\nIn his first phase, the Daoist Mi will come at you with flowing sword attacks, some of which can emit projectiles waves of force at range when they perform an upward slash in a reverse grip stance.\nWhile most of their basic attacks are simple two-hit strikes, they can also start a combo with an upward slice creating a projectile wave, dash forward into a lunging strike, before spinning to perform a horizontal sweep with one last projectile wave.\nThe good news all of their attacks can be deflected with Rock Solid, and pretty much any spell you have will be effective or stagger them greatly. Just treat them as you would any other Sword Daoist, keeping in mind that their greatly expanded health pool should dissuade you from pressing your attack too long so that you can back off to evade their next moves and regain your stamina.\nSomewhat surprisingly, Daoist Mi can also employ the move used by the Red-Haired Yaksha of Chapter 3, performing two quick fist strikes, and then turning around to perform a reverse bicycle kick that can hit especially hard -- but its still nothing as dangerous as the Scorpionlord.\nOnce you deplete their health bar, the Daoist Mi will invoke the power of the worm's egg, transforming into a Worm Practitioner for the second phase of this fight. Like before, much of their attack patterns will follow the basic enemy, so there won't be too much of a surprise in store.\nMuch of the worm's moves rely on stumbling and staggering slashes with their long poisonous appendage, either thrusting forward or dragging it along the ground toward you. While they can be a little unpredictable, they still move very slowly.\nThe one big new move that Daoist Mi can use in this form is spewing a lot more poison across the arena. In particular, if they arch backwards for a long moment before getting up, they'll run towards you while spewing poison in every possible direction. Knowing this in advance, simply keep your distance or prepare a charged thrust attack to repel them.\nWith Antimiasma powder on hand, the Daoist Mi won't last long against your superior skills. When you finally defeat him, the snake woman will appear and take the egg back from the fallen Daoist, before giving it to you, in the hopes you can make true use of its power. You'll gain the **Violet Hail Transformation Spell** , allowing you to temporarily turn into a Worm Practitioner yourself and become immune to poison!\nDaoist Mi",
    "promot_tokens_num": 704
}