{
    "chunk_id": 995346539522,
    "source_file": "Water_Curtain_Cave_and_Birthstone_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Water Curtain Cave and Birthstone Walkthrough",
    "h2_title": "Birthstone - Heart of Birthstone",
    "h1_content": "Water Curtain Cave is the second area of Chapter 6 of Black Myth: Wukong, while Birthstone is the final section of the game. After conquering a variety of bosses and obtaining Wukong's special armor, The Destined One is ready to complete his journey. Below, you'll find a Walkthrough of the final areas of Mount Huaguo as well as information on the bosses you'll encounter along the way.\n* **Jump to a Section:**\n* Water Curtain Cave**\n* Return Path**\n* Peak of Innocence**\n* Birthstone - Heart of Birthstone**\n* Stone Monkey\n* The Great Sage's Broken Shell",
    "h2_content": "When the boat ride is over, you'll be at the Birthstone portion of the Water Curtain Cave. In the distance, you'll see a monkey sitting cross-legged in the water.\nAs the cutscene sees you move toward the Stone Monkey, you'll be automatically thrown into a fight against it.\nNote! You won't be able to activate the Heart of Birthstone Keeper's Shrine here unless you die, but if you do, you won't need to go back to a previous shrine – you'll automatically be transported back here.\n### Stone Monkey\nThis fight has two phases, so be prepared for a tough battle and think about how you manage your Gourd and Spell usage throughout. You'll want to take in medicines that include Body-Warming and Body-Cooling Powder, as well as those that strengthen your attacks such as Enhanced Tiger Subduing Pellets and Loong Aura Amplification Pellets. You might prefer other medicines depending on the build you're ing with, such as the Mirage or Life-Saving Pill.\nThe first thing to note is that the Stone Monkey, like other Stone enemies, is resistant to elemental attacks, so the best thing you can do here is have a build that focuses on high attack strength and increasing the chances of critical attacks. His resistance to these attacks should also influence the Transformation you take into the fight with you – we'd recommend Ebon Flow or Azure Dust, which can both deliver heavy blows.\n### The Stone Monkey Phase One\nDuring the first phase of the fight, the Stone Monkey will generally try to attack with a combo of punches. These can be avoided but it's best to use dodges to build up your focus quickly. Speed is key for this first phase, to keep as many of your medicines and Gourd uses available for the second phase.\nHe will also leap up and pound his fists down onto the ground, causing a shockwave of rocks immediately around him. As long as you dive out of the way when he goes to land or step back from him slightly, you can avoid this attack.\nWhen his health is down to around 70%, he will start to disappear occasionally and quickly reappear to catch you off guard. You can watch the ripples in the water to see where he'll approach from and quickly evade.\nThis will also be the time when he starts to glow slightly, indicating that his attacks will begin to differ. You'll now see that when he punches down on the ground, shockwaves will be sent out. You can jump or roll over these to dodge them.\nAlong with this move, you'll see that he will sometimes end the combo by keeping his hand in the water after punching down. The ground will start to pulse and he'll pull his first up, causing a shockwave of rocks to go upward.\nTwo other attacks happen less frequently, but go on for longer and can be more dangerous. The first one is that now and then, he'll flash gold and your attacks will repel.\nHe'll freeze at this moment, and it can seem like a time to strike, but he's actually preparing to grab you. If he's able to, a small cutscene s where you're thrown and slammed on the ground either side of him. The second attack is when he goes berserk and starts slamming his fists down on the ground around him more violently and quicker than his usual attack.\nYour aim during this portion of the fight should be to dodge attacks while building focus, and max out the four Focus Points as soon as possible. With Wukong's armor and staff, these won't deplete, so you can land impressive heavy attacks with the staff.\n### Stone Monkey Phase Two\nWhen you've depleted his health bar, a cutscene will . The Stone Monkey's arms will start to glow, and suddenly, they'll be ablaze. This is when the second phase of the fight starts, which is far more difficult, and his health bar will be fully replenished.\nThe important thing to remember for this second phase is that the attacks he performs don't really change from the first phase. He just replaces the rocks with fire and ice. But the trickiest part of the fight is how quickly and often he switches between the use of frost of fire.\nThere are multiple things to consider if you're struggling with this portion of the fight, such as taking in the Fire Vessel to help protect against burn damage, and the Body-Cooling and Body-Warming Powders we mentioned earlier.\nThe Plantain Fan is also a good option, to remove the elements from him and knock him back while you follow up with your own attacks. It at least buys you some time to take down a chunk of his health without retaliation.\nIt's still worth focusing on heavy attacks and increasing your Critical Hit chances to finish the fight quickly in this second phase. If you stick with using Wukong's armor and staff, your Critical Hit chance will increase with Spells, so it's worth unleashing them in this second phase – particularly as they'll also receive a reduced cooldown buff.\nAround the halfway mark of this second phase, things get even more complicated. The Stone Monkey will reach for a hair and perform his own version of the Pluck of Many spell. He'll split in two, with two health bars appearing on screen. When this happens, you'll now experience both fire and ice at the same time, with each monkey alternating between the two elements.\nThankfully, the attacks won't vary hugely here so you should be familiar with them at this stage. But you will need to keep shifting your attention between the two enemies as each one takes the lead.\nSome more projectiles are brought into  here, however. Occasionally, one of the monkeys will pull up a large rock from the ground and throw it at you, or you'll see one prepare to throw an orb of ice followed by an orb of fire at you.\nThe final part of this move is typically an even larger orb of fire will be thrown your way. This will mean that you can't spend all your time as close to them as possible, and will need to dip back at times to easily avoid these attacks.\nAt this stage, it's worth throwing out your spells like Pluck of Many to overwhelm the two enemies and using Immobilize to keep one in place, while you target the other.\nWhen the Stone Monkey's health bar has been depleted, he'll face off still against The Destined One. A cutscene will see the Destined One hold his own against the giant monkey, sending our duplicates to put an end to the creature.\nAs it staggers back and breaks down into stone, electricity will form around it and the Great Sage's Broken Shell will appear. Despite going straight into this fight from the Stone Monkey, all your Spells, Gourd uses, and health will be replenished.\nThe Stone Monkey\n### The Great Sage's Broken Shell\nNow comes your final challenge, and just like before, if you die, you'll be sent back to the Heart of Birthstone Keeper's Shrine. You won't need to fight the Stone Monkey again, however.\nFor this fight, you can expect two phases as well. You'll essentially be going up against a better version of yourself, with access to fully unlocked skills and stances that are also available to you.\nHe'll use variations of **Vengeful Mirage, which leaves an exploding illusion behind, Rock Solid, Ring of Fire, and Pluck of Many**. On top of this, he'll use Smash, Pillar, and Thrust Stance attacks.\nWe'd recommend having Ring of Fire equipped, so you can match him, and upgrade it as much as possible. Strangely enough, if you step into his Ring of Fire, you can also use it to build your Focus.\nHowever, you may prefer to use Spell Binder (if you've unlocked it) and increase your Attack and Critical Hit Chance. We'd also suggest using Plantain Fan again in this phase. You should also use Medicines like the Loong Aura Amplification Pellets, Ginseng Pellets, and Enhanced Tiger Subduing Pellets to buff your Focus gain and attack.\n### The Great Sage's Broken Shell Phase One\nThe Great Sage's Broken Shell will start this phase by dodging your attacks each time you try to complete combos. As these are perfect dodges, you'll see multiple illusions left behind in its wake, which will explode after a few seconds. To counter this, you'll want to land a few hits, and then jump back to avoid the explosions, but continue to follow up and complete the combos for a heavy attack.\nWe'd suggest throwing out the Plantain Fan as soon as the fight starts, to knock him back, and allow you to whittle his health down quickly before he even gets a chance to start. In terms of Transformations and Spirits, we found that Ebon Flow was useful for deflecting his attacks and quickly building might to perform a powerful finisher, and the Wandering Wight Spirit was able to take down a chunk of his health in one go.\nYou'll see the Great Sage's Broken Shell's version of a heavy attack, as the staff glows gold and he jumps up with his staff to smash it down on you. These moves can also be evaded, to help build up your own focus for a counterattack. Again, you'll want to take advantage of Wukong's arm and staff in this fight, by using the fourth focus point for heavy attacks, and making use of the increased Critical Hit Chance.\nWhen the Great Sage uses his variation of Pluck of Many, you'll see a duplicate appear as close as possible to you and will swing its staff. This will disappear after attacking, so you won't have to face multiple duplicates all at once.\nAs mentioned, the Great Sage will use multiple stances, and you'll occasionally see him climb his staff to perform Pillar Stance. This is not to evade your attacks but is just a way to slam down on you from above. As you see the staff start to bend toward you, get ready to dash away.\nFinally, be mindful of where you stand in this fight. If you're too far from him, he'll throw out his staff as a spinning projectile, or swap to Thrust Stance to attack you. It's best to stick close to him but jump back when he performs perfect dodges or throws out Pluck of Many.\nJust like the Stone Monkey, once you've got his health bar down all the way, phase two will begin.\n### The Great Sage's Broken Shell Phase Two\nAt the start of this phase, the Great Sage will remove your relics from you, so you'll lose the buffs you selected when unlocking them. This is when you'll want to rely more on your Medicines, Curios, and Spells, especially Ring of Fire to build up your focus quickly. It can be much harder to hit him during this phase, so you'll need to  it somewhat safe to build up your focus.\nYou also need to be careful when using your Gourd at this stage. When you do, it's best to dodge to be safe but try to limit your use of it. This is because the Great Sage can Immobilize you and steal your Gourd for himself.\nIn this phase, you'll generally see the same attacks as the first phase, but there will of course be additional variations or they will be heightened. One of these changes includes the Great Sage's Broken Shell climbing to the top of his staff just like before, but this time, unleashing a flurry of projectiles. Tap dodge and roll to the side quickly to avoid this and build up focus while doing so. Then be prepared for him to slide down toward you, skim the water, and quickly dash back at you to try for another hit.\nHis combos will also become more aggressive and dangerous, and you'll see him jump up in the air and spin his staff multiple times. It will glow red as he smashes it down, and you'll need to dash out of the way to avoid it doing huge amounts of damage.\nLastly, you'll see him use the Somersault Cloud spell to zoom around the area, hit you, and dash off. He will try to grab you when using this, so it's important to learn the timings and roll away as often as possible.\nJust like the first phase, the key to this fight is attacking when you have your Focus Points built up and not trying to finish light combos. He'll typically interrupt them or use his perfect dodge to hurt you in the process, so it's best to wait until you can land those heavy attacks. It's also important to note him during his Rock Solid phase! Otherwise, you'll see the Destined One kicked around by the Great Sage's duplicates.\nUsing Gingseng Pellets and Ring of Fire will get your Focus up in no time, and Smash Stance is generally favorable here, to land those heavy slamming attacks. Don't forget to throw out the Plantain Fan as soon as it's ready each time, as well, as this is one of the best ways to attack him undisturbed.\nOnce the fight is over, The Great Sage's Broken Shell will be vanquished, and a cutscene will begin. The Great Sage will stumble in the water and the relics will leave his body as golden orbs.\nEach one will land inside the Destined One as the Great Sage crumbles, and his crown lands in the water. As the Old Monkey appears again, he'll place the crown upon the Destined One's head and finish the tale of Sun Wukong.\nThe Great Sage's Broken Shell\nCongratulations on completing Black Myth: Wukong! Now that you've finished the game, we'd recommend experiencing the secret ending by accessing Mount Mei in The Great Pagoda (Chapter 3). To see both endings, make sure you choose \"Continue Journey\" rather than \"Enter a New Cycle\" and then return to The Great Pagoda to access a secret area.\nFor more guidance on unlocking the secret ending and what it means for The Destined One, see our pages How to Unlock the Secret Ending (True Ending) \"How to Unlock the Secret Ending \\(True Ending\\)\") and Endings Explained.\nWater Curtain Cave Complete",
    "promot": "This is an excerpt from the file 'Water_Curtain_Cave_and_Birthstone_Walkthrough.md', located in the main section titled 'Water Curtain Cave and Birthstone Walkthrough'. The section summary is: Water Curtain Cave is the second area of Chapter 6 of Black Myth: Wukong, while Birthstone is the final section of the game. After conquering a variety of bosses and obtaining Wukong's special armor, The Destined One is ready to complete his journey. Below, you'll find a Walkthrough of the final areas of Mount Huaguo as well as information on the bosses you'll encounter along the way.\n* **Jump to a Section:**\n* Water Curtain Cave**\n* Return Path**\n* Peak of Innocence**\n* Birthstone - Heart of Birthstone**\n* Stone Monkey\n* The Great Sage's Broken Shell This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Birthstone - Heart of Birthstone', and the detailed content is as follows:\nWhen the boat ride is over, you'll be at the Birthstone portion of the Water Curtain Cave. In the distance, you'll see a monkey sitting cross-legged in the water.\nAs the cutscene sees you move toward the Stone Monkey, you'll be automatically thrown into a fight against it.\nNote! You won't be able to activate the Heart of Birthstone Keeper's Shrine here unless you die, but if you do, you won't need to go back to a previous shrine – you'll automatically be transported back here.\n### Stone Monkey\nThis fight has two phases, so be prepared for a tough battle and think about how you manage your Gourd and Spell usage throughout. You'll want to take in medicines that include Body-Warming and Body-Cooling Powder, as well as those that strengthen your attacks such as Enhanced Tiger Subduing Pellets and Loong Aura Amplification Pellets. You might prefer other medicines depending on the build you're ing with, such as the Mirage or Life-Saving Pill.\nThe first thing to note is that the Stone Monkey, like other Stone enemies, is resistant to elemental attacks, so the best thing you can do here is have a build that focuses on high attack strength and increasing the chances of critical attacks. His resistance to these attacks should also influence the Transformation you take into the fight with you – we'd recommend Ebon Flow or Azure Dust, which can both deliver heavy blows.\n### The Stone Monkey Phase One\nDuring the first phase of the fight, the Stone Monkey will generally try to attack with a combo of punches. These can be avoided but it's best to use dodges to build up your focus quickly. Speed is key for this first phase, to keep as many of your medicines and Gourd uses available for the second phase.\nHe will also leap up and pound his fists down onto the ground, causing a shockwave of rocks immediately around him. As long as you dive out of the way when he goes to land or step back from him slightly, you can avoid this attack.\nWhen his health is down to around 70%, he will start to disappear occasionally and quickly reappear to catch you off guard. You can watch the ripples in the water to see where he'll approach from and quickly evade.\nThis will also be the time when he starts to glow slightly, indicating that his attacks will begin to differ. You'll now see that when he punches down on the ground, shockwaves will be sent out. You can jump or roll over these to dodge them.\nAlong with this move, you'll see that he will sometimes end the combo by keeping his hand in the water after punching down. The ground will start to pulse and he'll pull his first up, causing a shockwave of rocks to go upward.\nTwo other attacks happen less frequently, but go on for longer and can be more dangerous. The first one is that now and then, he'll flash gold and your attacks will repel.\nHe'll freeze at this moment, and it can seem like a time to strike, but he's actually preparing to grab you. If he's able to, a small cutscene s where you're thrown and slammed on the ground either side of him. The second attack is when he goes berserk and starts slamming his fists down on the ground around him more violently and quicker than his usual attack.\nYour aim during this portion of the fight should be to dodge attacks while building focus, and max out the four Focus Points as soon as possible. With Wukong's armor and staff, these won't deplete, so you can land impressive heavy attacks with the staff.\n### Stone Monkey Phase Two\nWhen you've depleted his health bar, a cutscene will . The Stone Monkey's arms will start to glow, and suddenly, they'll be ablaze. This is when the second phase of the fight starts, which is far more difficult, and his health bar will be fully replenished.\nThe important thing to remember for this second phase is that the attacks he performs don't really change from the first phase. He just replaces the rocks with fire and ice. But the trickiest part of the fight is how quickly and often he switches between the use of frost of fire.\nThere are multiple things to consider if you're struggling with this portion of the fight, such as taking in the Fire Vessel to help protect against burn damage, and the Body-Cooling and Body-Warming Powders we mentioned earlier.\nThe Plantain Fan is also a good option, to remove the elements from him and knock him back while you follow up with your own attacks. It at least buys you some time to take down a chunk of his health without retaliation.\nIt's still worth focusing on heavy attacks and increasing your Critical Hit chances to finish the fight quickly in this second phase. If you stick with using Wukong's armor and staff, your Critical Hit chance will increase with Spells, so it's worth unleashing them in this second phase – particularly as they'll also receive a reduced cooldown buff.\nAround the halfway mark of this second phase, things get even more complicated. The Stone Monkey will reach for a hair and perform his own version of the Pluck of Many spell. He'll split in two, with two health bars appearing on screen. When this happens, you'll now experience both fire and ice at the same time, with each monkey alternating between the two elements.\nThankfully, the attacks won't vary hugely here so you should be familiar with them at this stage. But you will need to keep shifting your attention between the two enemies as each one takes the lead.\nSome more projectiles are brought into  here, however. Occasionally, one of the monkeys will pull up a large rock from the ground and throw it at you, or you'll see one prepare to throw an orb of ice followed by an orb of fire at you.\nThe final part of this move is typically an even larger orb of fire will be thrown your way. This will mean that you can't spend all your time as close to them as possible, and will need to dip back at times to easily avoid these attacks.\nAt this stage, it's worth throwing out your spells like Pluck of Many to overwhelm the two enemies and using Immobilize to keep one in place, while you target the other.\nWhen the Stone Monkey's health bar has been depleted, he'll face off still against The Destined One. A cutscene will see the Destined One hold his own against the giant monkey, sending our duplicates to put an end to the creature.\nAs it staggers back and breaks down into stone, electricity will form around it and the Great Sage's Broken Shell will appear. Despite going straight into this fight from the Stone Monkey, all your Spells, Gourd uses, and health will be replenished.\nThe Stone Monkey\n### The Great Sage's Broken Shell\nNow comes your final challenge, and just like before, if you die, you'll be sent back to the Heart of Birthstone Keeper's Shrine. You won't need to fight the Stone Monkey again, however.\nFor this fight, you can expect two phases as well. You'll essentially be going up against a better version of yourself, with access to fully unlocked skills and stances that are also available to you.\nHe'll use variations of **Vengeful Mirage, which leaves an exploding illusion behind, Rock Solid, Ring of Fire, and Pluck of Many**. On top of this, he'll use Smash, Pillar, and Thrust Stance attacks.\nWe'd recommend having Ring of Fire equipped, so you can match him, and upgrade it as much as possible. Strangely enough, if you step into his Ring of Fire, you can also use it to build your Focus.\nHowever, you may prefer to use Spell Binder (if you've unlocked it) and increase your Attack and Critical Hit Chance. We'd also suggest using Plantain Fan again in this phase. You should also use Medicines like the Loong Aura Amplification Pellets, Ginseng Pellets, and Enhanced Tiger Subduing Pellets to buff your Focus gain and attack.\n### The Great Sage's Broken Shell Phase One\nThe Great Sage's Broken Shell will start this phase by dodging your attacks each time you try to complete combos. As these are perfect dodges, you'll see multiple illusions left behind in its wake, which will explode after a few seconds. To counter this, you'll want to land a few hits, and then jump back to avoid the explosions, but continue to follow up and complete the combos for a heavy attack.\nWe'd suggest throwing out the Plantain Fan as soon as the fight starts, to knock him back, and allow you to whittle his health down quickly before he even gets a chance to start. In terms of Transformations and Spirits, we found that Ebon Flow was useful for deflecting his attacks and quickly building might to perform a powerful finisher, and the Wandering Wight Spirit was able to take down a chunk of his health in one go.\nYou'll see the Great Sage's Broken Shell's version of a heavy attack, as the staff glows gold and he jumps up with his staff to smash it down on you. These moves can also be evaded, to help build up your own focus for a counterattack. Again, you'll want to take advantage of Wukong's arm and staff in this fight, by using the fourth focus point for heavy attacks, and making use of the increased Critical Hit Chance.\nWhen the Great Sage uses his variation of Pluck of Many, you'll see a duplicate appear as close as possible to you and will swing its staff. This will disappear after attacking, so you won't have to face multiple duplicates all at once.\nAs mentioned, the Great Sage will use multiple stances, and you'll occasionally see him climb his staff to perform Pillar Stance. This is not to evade your attacks but is just a way to slam down on you from above. As you see the staff start to bend toward you, get ready to dash away.\nFinally, be mindful of where you stand in this fight. If you're too far from him, he'll throw out his staff as a spinning projectile, or swap to Thrust Stance to attack you. It's best to stick close to him but jump back when he performs perfect dodges or throws out Pluck of Many.\nJust like the Stone Monkey, once you've got his health bar down all the way, phase two will begin.\n### The Great Sage's Broken Shell Phase Two\nAt the start of this phase, the Great Sage will remove your relics from you, so you'll lose the buffs you selected when unlocking them. This is when you'll want to rely more on your Medicines, Curios, and Spells, especially Ring of Fire to build up your focus quickly. It can be much harder to hit him during this phase, so you'll need to  it somewhat safe to build up your focus.\nYou also need to be careful when using your Gourd at this stage. When you do, it's best to dodge to be safe but try to limit your use of it. This is because the Great Sage can Immobilize you and steal your Gourd for himself.\nIn this phase, you'll generally see the same attacks as the first phase, but there will of course be additional variations or they will be heightened. One of these changes includes the Great Sage's Broken Shell climbing to the top of his staff just like before, but this time, unleashing a flurry of projectiles. Tap dodge and roll to the side quickly to avoid this and build up focus while doing so. Then be prepared for him to slide down toward you, skim the water, and quickly dash back at you to try for another hit.\nHis combos will also become more aggressive and dangerous, and you'll see him jump up in the air and spin his staff multiple times. It will glow red as he smashes it down, and you'll need to dash out of the way to avoid it doing huge amounts of damage.\nLastly, you'll see him use the Somersault Cloud spell to zoom around the area, hit you, and dash off. He will try to grab you when using this, so it's important to learn the timings and roll away as often as possible.\nJust like the first phase, the key to this fight is attacking when you have your Focus Points built up and not trying to finish light combos. He'll typically interrupt them or use his perfect dodge to hurt you in the process, so it's best to wait until you can land those heavy attacks. It's also important to note him during his Rock Solid phase! Otherwise, you'll see the Destined One kicked around by the Great Sage's duplicates.\nUsing Gingseng Pellets and Ring of Fire will get your Focus up in no time, and Smash Stance is generally favorable here, to land those heavy slamming attacks. Don't forget to throw out the Plantain Fan as soon as it's ready each time, as well, as this is one of the best ways to attack him undisturbed.\nOnce the fight is over, The Great Sage's Broken Shell will be vanquished, and a cutscene will begin. The Great Sage will stumble in the water and the relics will leave his body as golden orbs.\nEach one will land inside the Destined One as the Great Sage crumbles, and his crown lands in the water. As the Old Monkey appears again, he'll place the crown upon the Destined One's head and finish the tale of Sun Wukong.\nThe Great Sage's Broken Shell\nCongratulations on completing Black Myth: Wukong! Now that you've finished the game, we'd recommend experiencing the secret ending by accessing Mount Mei in The Great Pagoda (Chapter 3). To see both endings, make sure you choose \"Continue Journey\" rather than \"Enter a New Cycle\" and then return to The Great Pagoda to access a secret area.\nFor more guidance on unlocking the secret ending and what it means for The Destined One, see our pages How to Unlock the Secret Ending (True Ending) \"How to Unlock the Secret Ending \\(True Ending\\)\") and Endings Explained.\nWater Curtain Cave Complete",
    "promot_tokens_num": 3117
}