{
    "chunk_id": 565756669280,
    "source_file": "Baw-Lang_Lang.md",
    "content_type": "one and two",
    "h1_title": "Baw-Lang_Lang",
    "h2_title": "How to Find Baw-Lang-Lang",
    "h1_content": "Baw-Lang-Lang is one of the six frog bosses you can find in Black Myth: Wukong. The fifth of the frogs, Baw-Lang-Lang can only be discovered once you've taken down the Five Element Carts and gained access to Bishui Cave.",
    "h2_content": "When you've beaten the Rusty-Gold Cart approach the frozen-over entrance and break through to head inside.\nThis doorway will take you to the chapter's secret area called the Bishui Cave. We'd recommend completing this before you finish up the chapter. But there's one last miniboss to fight before you teleport to the secret area.\nAs you head inside the cave, go down the slope. You'll see a large structure in the center of the room that's being hit by the light. This is what will teleport you to Bishui Cave, but first, you'll want to look to the left. Here you can find the fifth of the frog bosses in the game, called Baw-Lang-Lang.",
    "promot": "This is an excerpt from the file 'Baw-Lang_Lang.md', located in the main section titled 'Baw-Lang_Lang'. The section summary is: Baw-Lang-Lang is one of the six frog bosses you can find in Black Myth: Wukong. The fifth of the frogs, Baw-Lang-Lang can only be discovered once you've taken down the Five Element Carts and gained access to Bishui Cave. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'How to Find Baw-Lang-Lang', and the detailed content is as follows:\nWhen you've beaten the Rusty-Gold Cart approach the frozen-over entrance and break through to head inside.\nThis doorway will take you to the chapter's secret area called the Bishui Cave. We'd recommend completing this before you finish up the chapter. But there's one last miniboss to fight before you teleport to the secret area.\nAs you head inside the cave, go down the slope. You'll see a large structure in the center of the room that's being hit by the light. This is what will teleport you to Bishui Cave, but first, you'll want to look to the left. Here you can find the fifth of the frog bosses in the game, called Baw-Lang-Lang.",
    "promot_tokens_num": 278
}