{
    "chunk_id": 382015136200,
    "source_file": "Stone_Essence.md",
    "content_type": "one and two",
    "h1_title": "Stone Essence",
    "h2_title": "Where To Use The Stone Essence in Black Myth: Wukong",
    "h1_content": "The Stone Essence is one of the more hidden Key Items in Black Myth: Wukong. It is dropped by a secret boss found in Fright Cliff and you will need it to help the Man-In-Stone within the same area.\nThe Stone Essence can be found at Fright Cliff - Rockrest Flat. Just before the Shrine, you will see a small pathway leading into a cave. At the end of this cave, you can find the Mother of Stones. Defeating her will cause her to drop the Stone Essence.\nHowever, if you have it, you are probably wondering where you can use it.\nStone Essence",
    "h2_content": "With the Stone Essence in hand, you can give it to the Man-In-Stone, who is located along the central path between the two raised paths from the Fright Cliff - Squall Hideout Shrine.\nGiving it to him will cause him to stand up and he will tell you to go away. However, you can now target him and kill him, which is what you should do to get the Azure Dust Transformation Spells. For a full guide on the boss, be sure to check our Mother of Stones boss guide and our walkthrough of Fright Cliff.",
    "promot": "This is an excerpt from the file 'Stone_Essence.md', located in the main section titled 'Stone Essence'. The section summary is: The Stone Essence is one of the more hidden Key Items in Black Myth: Wukong. It is dropped by a secret boss found in Fright Cliff and you will need it to help the Man-In-Stone within the same area.\nThe Stone Essence can be found at Fright Cliff - Rockrest Flat. Just before the Shrine, you will see a small pathway leading into a cave. At the end of this cave, you can find the Mother of Stones. Defeating her will cause her to drop the Stone Essence.\nHowever, if you have it, you are probably wondering where you can use it.\nStone Essence This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where To Use The Stone Essence in Black Myth: Wukong', and the detailed content is as follows:\nWith the Stone Essence in hand, you can give it to the Man-In-Stone, who is located along the central path between the two raised paths from the Fright Cliff - Squall Hideout Shrine.\nGiving it to him will cause him to stand up and he will tell you to go away. However, you can now target him and kill him, which is what you should do to get the Azure Dust Transformation Spells. For a full guide on the boss, be sure to check our Mother of Stones boss guide and our walkthrough of Fright Cliff.",
    "promot_tokens_num": 307
}