{
    "chunk_id": 180375421406,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Forest of Wolves Walkthrough",
    "h2_title": "Black Wind Mountain’s Secret - Ringing the First Bell",
    "h1_content": "Black Myth: Wukong's Chapter 1 begins with a prologue that takes place during a pivotal scene in the story of the Monkey King, Sun Wukong. Below you'll find a guide to the tutorial, and for the first major area of Black Wind Mountain: The Forest of Wolves, as well as how to defeat its many bosses that include the Bullguard, Gaugnzhi and Yaoguai King Lingxuzi.\n* **Jump to A Section:**\n* **Front Hills**\n* Yaoguai Chief - Bullguard\n* **Outside the Forest**\n* Yaoguai Chief - Guangzhi\n* **Guanyin Temple**\n* Yaoguai King - Lingxuzi\n# Prologue\nUpon beginning your journey, you’ll be thrust into the role of the mythical Sun Wukong as he rebels against the Court of Heaven and its Heavenly Kings. Undaunted by their army, Sun Wukong calls them out, prompting the nephew of the Jade Emperor, Erlang Shen, to meet him in combat.",
    "h2_content": "With Guangzhi defeated, you can look where he was meditating to find a large bell. Interact with the pole to ring the bell. The Keeper will fret over this, but in reality this is the first of three bells you should seek out in Chapter 1 to uncover a major secret!\nBe sure to check around the boss arena for pots to break, some **Aged Ginseng** , and another green wisp that flies away while only granting you a small amount of Will.\nWith the Red Tides spell, you can try your luck against the Wandering Wight mini-boss next, or slip past him to find a tunnel beyond and return to him later once we can actually make use of the reward for defeating him.\nOn the other side of the tunnel, head across the long wooden scaffolding to find a path up to the famed Guanyin Temple. A few Wolf Guai are guarding the entrance, including an archer so be ready with the staff twirl to deflect the arrows, then charge them first.\n### Guanyin Temple\nAs you open the gate to the temple, the Keeper will warn you of a fearsome Yaoguai who lurks here, but that won’t be stopping you. Rest up at the Shrine, and be sure to look around for some loot before proceeding into the plaza:\n* Check the Shrine to find a new option: Armor Crafting. You can now use the materials you’ve been collecting like Yarn along with the Will you’ve accumulated to craft the ‘’’Pilgrim’s Set’’’. As an armor set, the more pieces you equip, the more benefits you’ll earn, and certain armor pieces like the Headband have their own unique effects regardless of how many pieces you equip!\n* Near the shrine is a small enclosed area with a green wisp in front of a wolf statue you can attempt to grab for a bit of Will, as well as the **Purple Lingzhi**.\n* On the other side of the large building opposite the wolf shrine, look past a small arch to find a chest you can open to gain 2 **Tiny Piece of Gold** and 2 **Stone Spirit**.\n* The far side of the entrance area has another building with a **Gentian** plant on the side, and plenty of pots to break for extra Will.\nBe sure you’ve allocated all your extra Spark Skill Points, equipped the best possible armor, and then head inside to face the boss of the Forest of Wolves.",
    "promot": "This is an excerpt from the file 'Forest_of_Wolves_Walkthrough.md', located in the main section titled 'Forest of Wolves Walkthrough'. The section summary is: Black Myth: Wukong's Chapter 1 begins with a prologue that takes place during a pivotal scene in the story of the Monkey King, Sun Wukong. Below you'll find a guide to the tutorial, and for the first major area of Black Wind Mountain: The Forest of Wolves, as well as how to defeat its many bosses that include the Bullguard, Gaugnzhi and Yaoguai King Lingxuzi.\n* **Jump to A Section:**\n* **Front Hills**\n* Yaoguai Chief - Bullguard\n* **Outside the Forest**\n* Yaoguai Chief - Guangzhi\n* **Guanyin Temple**\n* Yaoguai King - Lingxuzi\n# Prologue\nUpon beginning your journey, you’ll be thrust into the role of the mythical Sun Wukong as he rebels against the Court of Heaven and its Heavenly Kings. Undaunted by their army, Sun Wukong calls them out, prompting the nephew of the Jade Emperor, Erlang Shen, to meet him in combat. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Black Wind Mountain’s Secret - Ringing the First Bell', and the detailed content is as follows:\nWith Guangzhi defeated, you can look where he was meditating to find a large bell. Interact with the pole to ring the bell. The Keeper will fret over this, but in reality this is the first of three bells you should seek out in Chapter 1 to uncover a major secret!\nBe sure to check around the boss arena for pots to break, some **Aged Ginseng** , and another green wisp that flies away while only granting you a small amount of Will.\nWith the Red Tides spell, you can try your luck against the Wandering Wight mini-boss next, or slip past him to find a tunnel beyond and return to him later once we can actually make use of the reward for defeating him.\nOn the other side of the tunnel, head across the long wooden scaffolding to find a path up to the famed Guanyin Temple. A few Wolf Guai are guarding the entrance, including an archer so be ready with the staff twirl to deflect the arrows, then charge them first.\n### Guanyin Temple\nAs you open the gate to the temple, the Keeper will warn you of a fearsome Yaoguai who lurks here, but that won’t be stopping you. Rest up at the Shrine, and be sure to look around for some loot before proceeding into the plaza:\n* Check the Shrine to find a new option: Armor Crafting. You can now use the materials you’ve been collecting like Yarn along with the Will you’ve accumulated to craft the ‘’’Pilgrim’s Set’’’. As an armor set, the more pieces you equip, the more benefits you’ll earn, and certain armor pieces like the Headband have their own unique effects regardless of how many pieces you equip!\n* Near the shrine is a small enclosed area with a green wisp in front of a wolf statue you can attempt to grab for a bit of Will, as well as the **Purple Lingzhi**.\n* On the other side of the large building opposite the wolf shrine, look past a small arch to find a chest you can open to gain 2 **Tiny Piece of Gold** and 2 **Stone Spirit**.\n* The far side of the entrance area has another building with a **Gentian** plant on the side, and plenty of pots to break for extra Will.\nBe sure you’ve allocated all your extra Spark Skill Points, equipped the best possible armor, and then head inside to face the boss of the Forest of Wolves.",
    "promot_tokens_num": 797
}