{
    "chunk_id": 757248340792,
    "source_file": "Giant_Shigandang.md",
    "content_type": "one and two",
    "h1_title": "Giant Shigandang",
    "h2_title": "Giant Shigandang Boss Fight and Guide",
    "h1_content": "Giant Shigandangis one of the optional Yaoguai Kings you can fight in Chapter 6 of Black Myth: Wukong\"). It's the only Yaoguai King that will be recorded in your Journal in Chapter 6. Unlocking it will require collecting Skandhas across the 5 previous chapters.",
    "h2_content": "Unfortunately, despite its size, you will need to be on foot during the fight. The key to defeating this enormous rocky monster is to head for its fits and attack the blue crystals you can on them.\nIts main attack is to punch down with its giant fists, which unsurprisingly, will one-shot you if you're hit by them. The easiest way to avoid them is to just back up as far away from them as possible. Then, once the Giant Shigandang pauses punching, run up to the fists and keep hitting the blue crystals.\nThe other attack that the Shigandang does is to punch both fists down and send out ripples. Again, you want to hang back as much as you can. The rings will come toward you, and you can jump over them to avoid them. There are times when he'll raise both hands in the air, and seem like he's about to perform this attack, but instead, he's actually going to slam his fists down and just lay there for a bit. This is the perfect time to get in close and attack him.\nAfter defeating the boss, climb the arm that touches the ground and you'll meet the monkey again. Let the cutscene  and you'll get the Skandha of Consciousness.\nGiant Shigandang",
    "promot": "This is an excerpt from the file 'Giant_Shigandang.md', located in the main section titled 'Giant Shigandang'. The section summary is: Giant Shigandangis one of the optional Yaoguai Kings you can fight in Chapter 6 of Black Myth: Wukong\"). It's the only Yaoguai King that will be recorded in your Journal in Chapter 6. Unlocking it will require collecting Skandhas across the 5 previous chapters. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Giant Shigandang Boss Fight and Guide', and the detailed content is as follows:\nUnfortunately, despite its size, you will need to be on foot during the fight. The key to defeating this enormous rocky monster is to head for its fits and attack the blue crystals you can on them.\nIts main attack is to punch down with its giant fists, which unsurprisingly, will one-shot you if you're hit by them. The easiest way to avoid them is to just back up as far away from them as possible. Then, once the Giant Shigandang pauses punching, run up to the fists and keep hitting the blue crystals.\nThe other attack that the Shigandang does is to punch both fists down and send out ripples. Again, you want to hang back as much as you can. The rings will come toward you, and you can jump over them to avoid them. There are times when he'll raise both hands in the air, and seem like he's about to perform this attack, but instead, he's actually going to slam his fists down and just lay there for a bit. This is the perfect time to get in close and attack him.\nAfter defeating the boss, climb the arm that touches the ground and you'll meet the monkey again. Let the cutscene  and you'll get the Skandha of Consciousness.\nGiant Shigandang",
    "promot_tokens_num": 401
}