{
    "chunk_id": 236510135957,
    "source_file": "Pagoda_Realm_Walkthrough.md",
    "content_type": "one and two",
    "h1_title": "Pagoda Realm Walkthrough",
    "h2_title": "Yaoguai King Boss Fight - Captain Wise-Voice",
    "h1_content": "The Pagoda Realm is the second main region of Chapter 3 in The New West in Black Myth: Wukong. Below you'll find a guide for the Pagoda Realm Region, including how to escape the jail, unlock the purple seals, and defeat the Captains.\n* **Jump to A Section:**\n* **Lower Pagoda (Level 1)**\n* **Lower Pagoda (Level 2)**\n* Yaoguai Chief - Captain Lotus-Vision\n* **Upper Pagoda (Level 3)**\n* **Upper Pagoda (Level 4**\n* **Mani Wheel**\n* Yaoguai King - Captain Wise-Voice\n* **Outside the Wheel**\n* **Snow-Veiled Trail**\n* **Warding Temple**\n* Yaoguai Chief - Macaque Chief\nAfter winning the battle against Kang-Jin Loong, you'll be swept up and thrown into a jail of sorts, in a new region known as The Pagoda Realm. Thankfully you'll be able to open your cell door without much trouble, but it will be long climb to get out of here.\nStepping out into this eerie dungeon, you'll find that this part of the Pagoda Realm is a prison made up of several circular tiers that comprise both an inner walkway ring, and an outer ring for cells, hallways, and stairs -- all circling a large pagoda (and that's not even the titular one) made to look like a mani wheel (or prayer wheel), as its slowly revolving and featuring large statues on every side.\nAs you begin to step out onto the inner walkway, a voice will call out from the next cell, which has a mysterious purple seal you can't break. You can still speak to the person inside, sitting against a wall next to a dead Rat Captain.\nThey'll warn you against trying to make your own way, but you can't exactly do nothing. Still, it pays to heed their warning -- this place is not going to be easy to traverse, especially with minds \"ebbing away with the tides of chants\".\nBe extra wary when exploring this area, as there are many Cyan Bats hiding up on ceilings. They'll divebomb you with little warning, and explode with ice to harass you as you deal with other threats.\nPast the first Cyan Bat, be sure to check the first open cell on the left to find a Wisp to absorb, and a Snake-Head Mushroom to harvest.\n# The Beguiling Chant of the Pagoda Realm\nIt's around this point that you'll likely get your first taste of the \"beguiling chants\" the prisoner mentioned, and there's a lot going on you'll have to make sense of. A large terrifying sound will echo throughout the realm, the pagoda itself will spin even faster, everyone will start glowing, strange new creatures will appear -- and your health will start lowering!\nLet's break it down: The Pagoda Realm's chanting curse is on a global timer, meaning even if you die or go to different Shines in the realm, or even sit around resting at a shrine, the curse can still trigger and persist. **Every three minutes, the chanting will begin, and last for exactly one minute and thirty seconds before resetting.**\nDuring this time, your maximum health will be halved! However, there is a silver lining: The curse will actually slowly refill your entire health bar before starting to lower your maximum health bar (but will still account for damage you've taken if you're currently in a fight and not regenerate past that point). As an added caveat, both the Destined One and all other enemies in the Pagoda Realm will start to glow red. This not only makes enemies easier to spot, but also grants everyone a considerable damage boost -- which can be blessing or a curse depending on who you are facing.\nFinally, during this period, strange new enemies will appear along several of the inner ring walkways. These sentries have tall lantern-shaped heads, and will try to grab you and throw you into the pit if they spot you, which is an instant death!The only way to stop this beguiling chant from continuing to manifest is to defeat the boss at the top of the Pagoda, and it will take some work to get there!\nBe wary of Frozen Corpses along this walkway that can come to life and jump at you with their sword, but also of the Lantern Wardens that appear when the beguiling chant's curse begins. There are two in this area, and will slowly patrol back forth while swiveling their heads around casting spotlights on the ground. Should you step in one, you'll be stunned for a moment as they approach to attack. Dodge before they perform their sweeping head attack or you'll be knocked into the realm's pit.\nInstead, use your Immobilize spell to lock them down and try attacking from behind, and watch out for their head slamming attacks.\nIf you see them perform a hand gesture, expect them to disappear, only to reappear from a different angle to try and kick you without warning.",
    "h2_content": "Much like Captain Lotus-Vision, the second Captain of the Pagoda Realm is a creepy one, with a strange construct-like shape with four legs, housing an golden sphere adorned with dragons that serves as its central core. The rest of the construct is highly resistant to damage, meaning you'll need to stun it so that you can take a shot at its most vulnerable part.\nOnly one of its legs is susceptible to attack, where you can see an orange glow emanating from its front right leg, so try to focus your attacks there whenever possible to try and stagger it.\nCaptain Wise-Voice has a lot of unorthodox attacks, made by violently spinning its golden sphere of a head around to emit thin beams of light. If you start to see beams erupt in different directions, start strafing to get distance, and prepare to dodge or sprint away when all the beams finally flash down in your direction at the same time.\nAfter a short delay, he'll perform another blast as the laser cuts upward, requiring a second dodge.\nOther times, it will create a sustained laser much faster, roving around you to slash upwards, and then create a trail of lightning strikes in a vertical line you'll need to quickly strafe to outpace.\nIt can also generate electrical power in its front leg, and stomp down to create a ring that extends outward, requiring you to dodge over it or use the Pillar Stance to evade it entirely.\nOther times, it will perform a series of slow stomps, causing multiple electric spots to appear around you. You'll need to sprint away from these spots before a delayed lightning blast can strike the ground where you are.\nCaptain Wise-Voice also has a number of up close melee stomps, smashes, and kicks you'll need to be wary of when attacking the hoof, which can be hard to anticipate with the camera angle. Whenever you see it start to move erratically, that's your cue to back up and be ready to evade.\nCertain times, it can even perform a charging attack by moving its head down, but you can lure it into charging the wall and dazing itself, letting you score a bunch of free hits.\nAfter taking a bit of damage, the boss will charge up to emit its \"beguiling chant\", blurring your vision somewhat, and performing an effect similar to when you were ascending the prison. Thankfully this will only lower your maximum health by around a fourth, and still give you a damage boost in return. The effect doesn't last forever -- only for around a full minute -- so make the most of it!\nOnce enough damage has been sustained to its leg, you'll see its leg start to explode with light, meaning your attacks have successfully staggered the boss. He'll fall to the ground in a heap, with its sphere-like core right in front of you.\nThis is your best chance to get in some real damage, but it's worth noting that a big charged heavy strike can sometimes knock it completely out of its dazed state. Instead, build up some more focus with one or two light combos, and then expend all your focus points on a bit charged hit to end its daze, taking off a huge amount of health in the process.\nRepeat the process of damaging its leg, or look for any opportunities to strike at its head -- particularly when it triggers the beguiling chant again to take off a chunk of your maximum HP.\nHowever, you'll also need to be ready to deal with its one major attack, which usually comes after you've assaulted its sphere at least once.\nAt a certain point, the construct will step into a corner of the room while the sphere lifts up and float high up toward the center, spinning wildly. It will send out beams of electricity in all direction as it twirls around, and the music swells.\nKeep strafing, and wait for lasers to start hitting the ground near you to trigger incoming lightning strikes on your position. This is a great time to use Cloud Step to give it the slip, allowing you to conserve stamina for the final act.\nEventually, you'll see the entire floor light up with criss-crossing lines over almost every inch of the surface. Keep dodging the lightning strikes, and as soon as the floor glows red, hop onto your Pillar Stance to extend off the ground (the more stamina you have built up, the better).\nWith a massive blast, the ground will explode in color, dealing a ton of damage if you aren't grounded at the top of your staff, and then the sphere will return to the construct body.\nTo defeat him, stay patient by building up focus points with sustained damage on his leg, using your Spirit Attacks too to rack up damage so that it can stagger the boss, then unleash more combos before your biggest charged up strike to maximize damage to his weak point before he rises. Use Cloud Step to get away from some of his more pesky lighting strikes and beams, and use Immobilize to stop Lotus-Vision's wild melee stomps and attacks (it generally doesn't work to help extend his stunned state).\nWhen Captain Wise-Voice finally falls to your assault, the Pagoda Realm will at last be free of his beguiling chant. This means you can head down to re-explore if you missed any areas without worrying about the debuff (but it also means any Sentry Lanterns not killed are gone forever).\nCaptain Wise-Voice\nLike Captain Lotus-Vision, you'll also get The Spirit of Captain Wise-Voice that can't be cultivated. You can now step out through the opposite opening to exit this pagoda, and you can check the rim of the cliff to the left to find a **Treasure Chest** with materials inside.",
    "promot": "This is an excerpt from the file 'Pagoda_Realm_Walkthrough.md', located in the main section titled 'Pagoda Realm Walkthrough'. The section summary is: The Pagoda Realm is the second main region of Chapter 3 in The New West in Black Myth: Wukong. Below you'll find a guide for the Pagoda Realm Region, including how to escape the jail, unlock the purple seals, and defeat the Captains.\n* **Jump to A Section:**\n* **Lower Pagoda (Level 1)**\n* **Lower Pagoda (Level 2)**\n* Yaoguai Chief - Captain Lotus-Vision\n* **Upper Pagoda (Level 3)**\n* **Upper Pagoda (Level 4**\n* **Mani Wheel**\n* Yaoguai King - Captain Wise-Voice\n* **Outside the Wheel**\n* **Snow-Veiled Trail**\n* **Warding Temple**\n* Yaoguai Chief - Macaque Chief\nAfter winning the battle against Kang-Jin Loong, you'll be swept up and thrown into a jail of sorts, in a new region known as The Pagoda Realm. Thankfully you'll be able to open your cell door without much trouble, but it will be long climb to get out of here.\nStepping out into this eerie dungeon, you'll find that this part of the Pagoda Realm is a prison made up of several circular tiers that comprise both an inner walkway ring, and an outer ring for cells, hallways, and stairs -- all circling a large pagoda (and that's not even the titular one) made to look like a mani wheel (or prayer wheel), as its slowly revolving and featuring large statues on every side.\nAs you begin to step out onto the inner walkway, a voice will call out from the next cell, which has a mysterious purple seal you can't break. You can still speak to the person inside, sitting against a wall next to a dead Rat Captain.\nThey'll warn you against trying to make your own way, but you can't exactly do nothing. Still, it pays to heed their warning -- this place is not going to be easy to traverse, especially with minds \"ebbing away with the tides of chants\".\nBe extra wary when exploring this area, as there are many Cyan Bats hiding up on ceilings. They'll divebomb you with little warning, and explode with ice to harass you as you deal with other threats.\nPast the first Cyan Bat, be sure to check the first open cell on the left to find a Wisp to absorb, and a Snake-Head Mushroom to harvest.\n# The Beguiling Chant of the Pagoda Realm\nIt's around this point that you'll likely get your first taste of the \"beguiling chants\" the prisoner mentioned, and there's a lot going on you'll have to make sense of. A large terrifying sound will echo throughout the realm, the pagoda itself will spin even faster, everyone will start glowing, strange new creatures will appear -- and your health will start lowering!\nLet's break it down: The Pagoda Realm's chanting curse is on a global timer, meaning even if you die or go to different Shines in the realm, or even sit around resting at a shrine, the curse can still trigger and persist. **Every three minutes, the chanting will begin, and last for exactly one minute and thirty seconds before resetting.**\nDuring this time, your maximum health will be halved! However, there is a silver lining: The curse will actually slowly refill your entire health bar before starting to lower your maximum health bar (but will still account for damage you've taken if you're currently in a fight and not regenerate past that point). As an added caveat, both the Destined One and all other enemies in the Pagoda Realm will start to glow red. This not only makes enemies easier to spot, but also grants everyone a considerable damage boost -- which can be blessing or a curse depending on who you are facing.\nFinally, during this period, strange new enemies will appear along several of the inner ring walkways. These sentries have tall lantern-shaped heads, and will try to grab you and throw you into the pit if they spot you, which is an instant death!The only way to stop this beguiling chant from continuing to manifest is to defeat the boss at the top of the Pagoda, and it will take some work to get there!\nBe wary of Frozen Corpses along this walkway that can come to life and jump at you with their sword, but also of the Lantern Wardens that appear when the beguiling chant's curse begins. There are two in this area, and will slowly patrol back forth while swiveling their heads around casting spotlights on the ground. Should you step in one, you'll be stunned for a moment as they approach to attack. Dodge before they perform their sweeping head attack or you'll be knocked into the realm's pit.\nInstead, use your Immobilize spell to lock them down and try attacking from behind, and watch out for their head slamming attacks.\nIf you see them perform a hand gesture, expect them to disappear, only to reappear from a different angle to try and kick you without warning. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Yaoguai King Boss Fight - Captain Wise-Voice', and the detailed content is as follows:\nMuch like Captain Lotus-Vision, the second Captain of the Pagoda Realm is a creepy one, with a strange construct-like shape with four legs, housing an golden sphere adorned with dragons that serves as its central core. The rest of the construct is highly resistant to damage, meaning you'll need to stun it so that you can take a shot at its most vulnerable part.\nOnly one of its legs is susceptible to attack, where you can see an orange glow emanating from its front right leg, so try to focus your attacks there whenever possible to try and stagger it.\nCaptain Wise-Voice has a lot of unorthodox attacks, made by violently spinning its golden sphere of a head around to emit thin beams of light. If you start to see beams erupt in different directions, start strafing to get distance, and prepare to dodge or sprint away when all the beams finally flash down in your direction at the same time.\nAfter a short delay, he'll perform another blast as the laser cuts upward, requiring a second dodge.\nOther times, it will create a sustained laser much faster, roving around you to slash upwards, and then create a trail of lightning strikes in a vertical line you'll need to quickly strafe to outpace.\nIt can also generate electrical power in its front leg, and stomp down to create a ring that extends outward, requiring you to dodge over it or use the Pillar Stance to evade it entirely.\nOther times, it will perform a series of slow stomps, causing multiple electric spots to appear around you. You'll need to sprint away from these spots before a delayed lightning blast can strike the ground where you are.\nCaptain Wise-Voice also has a number of up close melee stomps, smashes, and kicks you'll need to be wary of when attacking the hoof, which can be hard to anticipate with the camera angle. Whenever you see it start to move erratically, that's your cue to back up and be ready to evade.\nCertain times, it can even perform a charging attack by moving its head down, but you can lure it into charging the wall and dazing itself, letting you score a bunch of free hits.\nAfter taking a bit of damage, the boss will charge up to emit its \"beguiling chant\", blurring your vision somewhat, and performing an effect similar to when you were ascending the prison. Thankfully this will only lower your maximum health by around a fourth, and still give you a damage boost in return. The effect doesn't last forever -- only for around a full minute -- so make the most of it!\nOnce enough damage has been sustained to its leg, you'll see its leg start to explode with light, meaning your attacks have successfully staggered the boss. He'll fall to the ground in a heap, with its sphere-like core right in front of you.\nThis is your best chance to get in some real damage, but it's worth noting that a big charged heavy strike can sometimes knock it completely out of its dazed state. Instead, build up some more focus with one or two light combos, and then expend all your focus points on a bit charged hit to end its daze, taking off a huge amount of health in the process.\nRepeat the process of damaging its leg, or look for any opportunities to strike at its head -- particularly when it triggers the beguiling chant again to take off a chunk of your maximum HP.\nHowever, you'll also need to be ready to deal with its one major attack, which usually comes after you've assaulted its sphere at least once.\nAt a certain point, the construct will step into a corner of the room while the sphere lifts up and float high up toward the center, spinning wildly. It will send out beams of electricity in all direction as it twirls around, and the music swells.\nKeep strafing, and wait for lasers to start hitting the ground near you to trigger incoming lightning strikes on your position. This is a great time to use Cloud Step to give it the slip, allowing you to conserve stamina for the final act.\nEventually, you'll see the entire floor light up with criss-crossing lines over almost every inch of the surface. Keep dodging the lightning strikes, and as soon as the floor glows red, hop onto your Pillar Stance to extend off the ground (the more stamina you have built up, the better).\nWith a massive blast, the ground will explode in color, dealing a ton of damage if you aren't grounded at the top of your staff, and then the sphere will return to the construct body.\nTo defeat him, stay patient by building up focus points with sustained damage on his leg, using your Spirit Attacks too to rack up damage so that it can stagger the boss, then unleash more combos before your biggest charged up strike to maximize damage to his weak point before he rises. Use Cloud Step to get away from some of his more pesky lighting strikes and beams, and use Immobilize to stop Lotus-Vision's wild melee stomps and attacks (it generally doesn't work to help extend his stunned state).\nWhen Captain Wise-Voice finally falls to your assault, the Pagoda Realm will at last be free of his beguiling chant. This means you can head down to re-explore if you missed any areas without worrying about the debuff (but it also means any Sentry Lanterns not killed are gone forever).\nCaptain Wise-Voice\nLike Captain Lotus-Vision, you'll also get The Spirit of Captain Wise-Voice that can't be cultivated. You can now step out through the opposite opening to exit this pagoda, and you can check the rim of the cliff to the left to find a **Treasure Chest** with materials inside.",
    "promot_tokens_num": 2279
}