{
    "chunk_id": 751928720931,
    "source_file": "Baw-Lang_Lang.md",
    "content_type": "one and two",
    "h1_title": "Baw-Lang_Lang",
    "h2_title": "Baw-Lang-Lang Boss Fight and Guide",
    "h1_content": "Baw-Lang-Lang is one of the six frog bosses you can find in Black Myth: Wukong. The fifth of the frogs, Baw-Lang-Lang can only be discovered once you've taken down the Five Element Carts and gained access to Bishui Cave.",
    "h2_content": "Much like other bosses in this Chapter, Baw-Lang-Lang favors fire attacks. And much like the other frog bosses, you'll see the same set of moves from Baw-Lang-Lang that include the tongue whip and leaping.\nWhen Baw-Lang-Lang whips its tongue, it will be coated in fire. The frog will whip it left to right, or shoot it straight out at you. You can jump over its tongue or dodge the attacks.\nYou'll then find it uses a leaping attack, where it swipes at you twice and then leaps up and over to you, to try and catch you. When it lands, a little burst of fire will emerge from underneath it.\nChanges in its attack pattern will begin around the halfway mark, and it will lean up toward the top of the cave and spit fireballs all around it. Hang back as far as you can when this happens to avoid them.\nIt will then start to breathe fire from its mouth as a jet, in which case, you'll want to get behind it and attack. Lastly, you'll see a change in its leap attacks. Wherever it jumps, it will send out small waves of fire in a circle around it. As you see it leaping, dodge and create distance between the two of you to avoid the circle of flames.\nBaw-Lang-Lang",
    "promot": "This is an excerpt from the file 'Baw-Lang_Lang.md', located in the main section titled 'Baw-Lang_Lang'. The section summary is: Baw-Lang-Lang is one of the six frog bosses you can find in Black Myth: Wukong. The fifth of the frogs, Baw-Lang-Lang can only be discovered once you've taken down the Five Element Carts and gained access to Bishui Cave. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Baw-Lang-Lang Boss Fight and Guide', and the detailed content is as follows:\nMuch like other bosses in this Chapter, Baw-Lang-Lang favors fire attacks. And much like the other frog bosses, you'll see the same set of moves from Baw-Lang-Lang that include the tongue whip and leaping.\nWhen Baw-Lang-Lang whips its tongue, it will be coated in fire. The frog will whip it left to right, or shoot it straight out at you. You can jump over its tongue or dodge the attacks.\nYou'll then find it uses a leaping attack, where it swipes at you twice and then leaps up and over to you, to try and catch you. When it lands, a little burst of fire will emerge from underneath it.\nChanges in its attack pattern will begin around the halfway mark, and it will lean up toward the top of the cave and spit fireballs all around it. Hang back as far as you can when this happens to avoid them.\nIt will then start to breathe fire from its mouth as a jet, in which case, you'll want to get behind it and attack. Lastly, you'll see a change in its leap attacks. Wherever it jumps, it will send out small waves of fire in a circle around it. As you see it leaping, dodge and create distance between the two of you to avoid the circle of flames.\nBaw-Lang-Lang",
    "promot_tokens_num": 410
}