{
    "chunk_id": 297349504096,
    "source_file": "Old_Rattle-Drum.md",
    "content_type": "one and two",
    "h1_title": "Old Rattle-Drum",
    "h2_title": "Where To Use The Old Rattle-Drum in Black Myth: Wukong",
    "h1_content": "The Old Rattle-Drum is one of the more well-hidden Key Items in Black Myth: Wukong. However, it is one of the more important optional ones, as it unlocks a secret area, a hidden boss, and one of the Gourds in the game.\nYou will have to venture off to find it, and figuring out where to use it is even harder. But, below, you can find details on its location and the three spots in the game where you can shake it, to unlock the secret area.",
    "h2_content": "The Old-Rattle Drum can be used in the following spots:\n* The area just before the Windrest Hamlet Shrine\n* In a small yard by some huts, through the gates at the Valley of Despair Shrine\n* At the far back of Sandgate Village, where you fought the Earth Wolf and saw the horse man tied to the post\n### Windrest Hamlet Old Rattle-Drum Location\nFrom the Windrest Hamlet Shrine, turn around and go back towards the Windrest Bridge Shrine. As you head through the gate at the bottom of the hill, take a left to find a small square area within the walls where you can use the drum.\nYou will know if you are in the right place, as the screen will go black and white and a young boy will start talking to you.\n### Valley of Despair Old Rattle-Drum Location\nFrom that spot, head back to the Valley of Despair Shrine. Go through the large gate, you will need the Keeness of Tiger and Sterness of Stone Key Items, which are along the main story path of this chapter and are unmissable.\nOn your right, you will see a small hut, which you can go under to enter a yard. In the yard, the boy will talk again, and you can use the drum.\n### Sandgate Village Old Rattle-Drum Location\nThe last location is in Sandgate Village. From the Village Entrance Shrine, head through the gate you opened when you fought Earth Wolf in the large courtyard. You will have also seen the horse man here tied to a post. To the left of that post, where he was tied, is a small path leading to a well.\nHere you can use the drum and summon the boy who will lead you down into the well.\nOnce down in the well, you will be able to fight the Mad Tiger. It is one of the tougher fights in the Yellow Wind Ridge and our guide has a ton of tips on how to defeat them. You can also read our full walkthrough for the chapter.",
    "promot": "This is an excerpt from the file 'Old_Rattle-Drum.md', located in the main section titled 'Old Rattle-Drum'. The section summary is: The Old Rattle-Drum is one of the more well-hidden Key Items in Black Myth: Wukong. However, it is one of the more important optional ones, as it unlocks a secret area, a hidden boss, and one of the Gourds in the game.\nYou will have to venture off to find it, and figuring out where to use it is even harder. But, below, you can find details on its location and the three spots in the game where you can shake it, to unlock the secret area. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where To Use The Old Rattle-Drum in Black Myth: Wukong', and the detailed content is as follows:\nThe Old-Rattle Drum can be used in the following spots:\n* The area just before the Windrest Hamlet Shrine\n* In a small yard by some huts, through the gates at the Valley of Despair Shrine\n* At the far back of Sandgate Village, where you fought the Earth Wolf and saw the horse man tied to the post\n### Windrest Hamlet Old Rattle-Drum Location\nFrom the Windrest Hamlet Shrine, turn around and go back towards the Windrest Bridge Shrine. As you head through the gate at the bottom of the hill, take a left to find a small square area within the walls where you can use the drum.\nYou will know if you are in the right place, as the screen will go black and white and a young boy will start talking to you.\n### Valley of Despair Old Rattle-Drum Location\nFrom that spot, head back to the Valley of Despair Shrine. Go through the large gate, you will need the Keeness of Tiger and Sterness of Stone Key Items, which are along the main story path of this chapter and are unmissable.\nOn your right, you will see a small hut, which you can go under to enter a yard. In the yard, the boy will talk again, and you can use the drum.\n### Sandgate Village Old Rattle-Drum Location\nThe last location is in Sandgate Village. From the Village Entrance Shrine, head through the gate you opened when you fought Earth Wolf in the large courtyard. You will have also seen the horse man here tied to a post. To the left of that post, where he was tied, is a small path leading to a well.\nHere you can use the drum and summon the boy who will lead you down into the well.\nOnce down in the well, you will be able to fight the Mad Tiger. It is one of the tougher fights in the Yellow Wind Ridge and our guide has a ton of tips on how to defeat them. You can also read our full walkthrough for the chapter.",
    "promot_tokens_num": 608
}