{
    "chunk_id": 931883718130,
    "source_file": "Special-made_Bone-Strengthening_Pellet.md",
    "content_type": "one and two",
    "h1_title": "Special-made Bone-Strengthening Pellet",
    "h2_title": "Where to use the Special-made Bone-Strengthening Pellet in Black Myth: Wukong",
    "h1_content": "The Special-made Bone-Strengthening Pellet is one of the Key Items you can find within Black Myth: Wukong. This Key Item is a part of a long quest within The New West, revolving around Chen Loong, one of the bosses and NPCs.\n_\"Cast to wilds, joy I've found--thanks abound!\"_\nThe Special-made Bone Strengthening Pellet can be found during Chen Loong's quest in The New West. Chen Loong is to the left of of the Shrine after stepping off Turtle Island in Bitter Lake. You will initially need to fight him, but after he has been defeated, he will ask you to get some medicine from Xu Dog.\nReturn to him in Yellow Wind Ridge in the Crouching Tiger Temple - Cellar location and he will give you the Special-made Bone-Strengthening Pellet.\nSpecial-made Bone-Strengthening Pellet",
    "h2_content": "With the Pellet in your inventory, you can head back to Chen Loong and give it to him. He will then let you access the Zodiac Realm in The New West, by giving you the Ruyi Scroll\").\nThat's it! This is one of the easier Key Items to follow the quest chain for, as it only consists of a few steps. Chen Loong's quest doesn't end there though, so be sure to continue helping him out and talking with him and the other NPCs in the Zodiac Realm.",
    "promot": "This is an excerpt from the file 'Special-made_Bone-Strengthening_Pellet.md', located in the main section titled 'Special-made Bone-Strengthening Pellet'. The section summary is: The Special-made Bone-Strengthening Pellet is one of the Key Items you can find within Black Myth: Wukong. This Key Item is a part of a long quest within The New West, revolving around Chen Loong, one of the bosses and NPCs.\n_\"Cast to wilds, joy I've found--thanks abound!\"_\nThe Special-made Bone Strengthening Pellet can be found during Chen Loong's quest in The New West. Chen Loong is to the left of of the Shrine after stepping off Turtle Island in Bitter Lake. You will initially need to fight him, but after he has been defeated, he will ask you to get some medicine from Xu Dog.\nReturn to him in Yellow Wind Ridge in the Crouching Tiger Temple - Cellar location and he will give you the Special-made Bone-Strengthening Pellet.\nSpecial-made Bone-Strengthening Pellet This excerpt merges content from both the main and sub-sections. The sub-section is titled 'Where to use the Special-made Bone-Strengthening Pellet in Black Myth: Wukong', and the detailed content is as follows:\nWith the Pellet in your inventory, you can head back to Chen Loong and give it to him. He will then let you access the Zodiac Realm in The New West, by giving you the Ruyi Scroll\").\nThat's it! This is one of the easier Key Items to follow the quest chain for, as it only consists of a few steps. Chen Loong's quest doesn't end there though, so be sure to continue helping him out and talking with him and the other NPCs in the Zodiac Realm.",
    "promot_tokens_num": 380
}