{
    "chunk_id": 389849507300,
    "source_file": "Secret_Bosses_in_Black_Myth_Wukong.md",
    "content_type": "one and two",
    "h1_title": "Secret Bosses in Black Myth Wukong",
    "h2_title": "The Mad Tiger in the Well",
    "h1_content": "Black Myth: Wukong has a wealth of secrets to discover, from Transformation Spells to hidden Key Items and, of course, bosses. While some secret bosses can be found through exploration, others are well-hidden and require completing NPC questlines, collecting multiple items, or even fighting mini-bosses to make them emerge. Here's a breakdown of all the secret bosses in the game, organised by chapter.\nSecret Bosses in Chapter 1| Secret Bosses in Chapter 2| Secret Bosses in Chapter 3\n---|---|---\nSecret Bosses in Chapter 4| Secret Bosses in Chapter 5| Secret Bosses in Chapter 6\n# Secret Bosses in Chapter 1\nChapter 1 has two secret bosses for you to take on. The first can be found in the chapter's secret area Secret: Ancient Guanyin Temple; the second, you'll find behind a waterfall, but only after collecting the Loong Scales from Chapter 2.",
    "h2_content": "It's not just the Tiger Vanguard you can take down in Chapter 2, you can also find a Mad Tiger. First, find the Tiger's Acolyte in Windgate Village. He'll drop an Old Rattle-Drum which you can use in three spots across the chapter to uncover its secret. Once you've found all three and used the drum, a well will be revealed near Sandgate Village. Drop down into it and go head-to-head with the Mad Tiger.\nMad Tiger\n# Secret Bosses in Chapter 3\nChapter 3 will have you finding secret areas, bringing together NPCs and continuing to take down the Loongs. Here are all the secret bosses you can encounter.",
    "promot": "This is an excerpt from the file 'Secret_Bosses_in_Black_Myth_Wukong.md', located in the main section titled 'Secret Bosses in Black Myth Wukong'. The section summary is: Black Myth: Wukong has a wealth of secrets to discover, from Transformation Spells to hidden Key Items and, of course, bosses. While some secret bosses can be found through exploration, others are well-hidden and require completing NPC questlines, collecting multiple items, or even fighting mini-bosses to make them emerge. Here's a breakdown of all the secret bosses in the game, organised by chapter.\nSecret Bosses in Chapter 1| Secret Bosses in Chapter 2| Secret Bosses in Chapter 3\n---|---|---\nSecret Bosses in Chapter 4| Secret Bosses in Chapter 5| Secret Bosses in Chapter 6\n# Secret Bosses in Chapter 1\nChapter 1 has two secret bosses for you to take on. The first can be found in the chapter's secret area Secret: Ancient Guanyin Temple; the second, you'll find behind a waterfall, but only after collecting the Loong Scales from Chapter 2. This excerpt merges content from both the main and sub-sections. The sub-section is titled 'The Mad Tiger in the Well', and the detailed content is as follows:\nIt's not just the Tiger Vanguard you can take down in Chapter 2, you can also find a Mad Tiger. First, find the Tiger's Acolyte in Windgate Village. He'll drop an Old Rattle-Drum which you can use in three spots across the chapter to uncover its secret. Once you've found all three and used the drum, a well will be revealed near Sandgate Village. Drop down into it and go head-to-head with the Mad Tiger.\nMad Tiger\n# Secret Bosses in Chapter 3\nChapter 3 will have you finding secret areas, bringing together NPCs and continuing to take down the Loongs. Here are all the secret bosses you can encounter.",
    "promot_tokens_num": 420
}