{
    "chunk_id": 107129485777,
    "source_file": "Amber_Prayer_Beads.md",
    "h1_title": "Amber Prayer Beads",
    "h2_title": "Black Myth: Wukong Amber Prayer Beads Location",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/de/Woods_Ember_Walkthrough_%2891%29.png",
    "alt_text": "Woods Ember Walkthrough \\(91\\).png",
    "position_desc": 2,
    "img_above_text": "# Amber Prayer Beads\n\nThe Amber Prayer Beads is one of the many Curios items you can find in Black Myth: Wukong. Like the rest of these items, once found, it can be equipped from the Equipment menu.\n\nWith the Amber Prayer Beads equipped your focus gain speed is moderately increased.\n\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, the item will stay at its current power throughout the game. If you want a better buff or something else to fit your build, you will need to switch it out.\n\n## Black Myth: Wukong Amber Prayer Beads Location\n\nContinue down this path until you end up outside and find the beads on the ground.",
    "img_below_text": "For even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Amber Prayer Beads\n            - Section Title: Black Myth: Wukong Amber Prayer Beads Location\n\n            Context:\n            - Preceding Text: \"# Amber Prayer Beads\n\nThe Amber Prayer Beads is one of the many Curios items you can find in Black Myth: Wukong. Like the rest of these items, once found, it can be equipped from the Equipment menu.\n\nWith the Amber Prayer Beads equipped your focus gain speed is moderately increased.\n\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, the item will stay at its current power throughout the game. If you want a better buff or something else to fit your build, you will need to switch it out.\n\n## Black Myth: Wukong Amber Prayer Beads Location\n\nContinue down this path until you end up outside and find the beads on the ground.\"\n            - Following Text: \"For even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe Amber Prayer Beads are a Curios item in *Black Myth: Wukong* that increases focus gain speed when equipped. These items cannot be upgraded, so their power remains constant throughout the game. Players may need to swap them out for other items to better suit their build. The location of the Amber Prayer Beads is described as being found on the ground after following a specific path.\n\nImage Summary:  \nThe image depicts a scene from *Black Myth: Wukong*, showing a character standing in a rocky, cave-like environment with intricate carvings on the walls. The character is looking toward an open area with a glowing red marker highlighting the location of an item, likely the Amber Prayer Beads. The image serves to visually guide players to the exact spot where the item can be found.\n\nFollowing Text Summary:  \nThe following text encourages players to explore additional guides for *Black Myth: Wukong*, which include tips on finding other items such as Drinks, Soaks, Weapons, Armor, and Gear sets."
}