{
    "chunk_id": 628502389826,
    "source_file": "Crouching_Tiger_Temple_Walkthrough.md",
    "h1_title": "Crouching Tiger Temple Walkthrough",
    "h2_title": "Yaoguai King Boss Fight - Tiger Vanguard",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c7/Wukong_Tiger_13.jpg",
    "alt_text": "Wukong Tiger 13.jpg",
    "position_desc": 19,
    "img_above_text": "# Crouching Tiger Temple Walkthrough\n\nOnce you reach the top, you’ll come face to bloody face with the Tiger Vanguard, who looks like he just found his next meal.\n\n## Yaoguai King Boss Fight - Tiger Vanguard\n\nThis will be a tough fight no matter what you do, so the best thing you can do is to learn his moves, and which ones you can afford to hit back with a big charge attack. Certain times you may even be able to stagger him before he can perform a combo, or Immobilize him to shut him down from going on a sword-swinging spree — but if you don’t crash him out of it, he may just pick up where he left off.",
    "img_below_text": "Try using your Thrust stance to ensure your heavy hits give you some breathing room at range, especially if you’re not confident he’s done attacking when you try to get big hits off. Similarly, you may want to rely on quick-hitting Spirits. Since you don’t get a different health bar like the Transformation Spells, there’s a good chance you may be stuck attacking right into a sword slash unless you time your Spirit attack well. In fact, a well-timed Earth Wolf Spirit can knock him right out of an attack and stagger him against a wall!",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Crouching Tiger Temple Walkthrough\n            - Section Title: Yaoguai King Boss Fight - Tiger Vanguard\n\n            Context:\n            - Preceding Text: \"# Crouching Tiger Temple Walkthrough\n\nOnce you reach the top, you’ll come face to bloody face with the Tiger Vanguard, who looks like he just found his next meal.\n\n## Yaoguai King Boss Fight - Tiger Vanguard\n\nThis will be a tough fight no matter what you do, so the best thing you can do is to learn his moves, and which ones you can afford to hit back with a big charge attack. Certain times you may even be able to stagger him before he can perform a combo, or Immobilize him to shut him down from going on a sword-swinging spree — but if you don’t crash him out of it, he may just pick up where he left off.\"\n            - Following Text: \"Try using your Thrust stance to ensure your heavy hits give you some breathing room at range, especially if you’re not confident he’s done attacking when you try to get big hits off. Similarly, you may want to rely on quick-hitting Spirits. Since you don’t get a different health bar like the Transformation Spells, there’s a good chance you may be stuck attacking right into a sword slash unless you time your Spirit attack well. In fact, a well-timed Earth Wolf Spirit can knock him right out of an attack and stagger him against a wall!\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Tiger Vanguard, a formidable enemy encountered at the top of the Crouching Tiger Temple. It emphasizes the difficulty of the fight and suggests strategies such as learning the boss's moves, staggering him, or immobilizing him to interrupt his combos and sword attacks.\n\nImage Summary:\nThe image depicts the Tiger Vanguard boss fight in the game, showcasing the intense combat against the tiger-like creature in a visually striking environment. The player character is engaged in battle, with the Tiger Vanguard mid-attack. The interface elements, including health bars and abilities, suggest active gameplay mechanics and a focus on strategic combat.\n\nFollowing Text Summary:\nThe following text provides specific gameplay tips for the fight, recommending the use of the Thrust stance for heavy attacks at range and quick-hitting Spirit abilities for interrupting the Tiger Vanguard's attacks. It highlights the effectiveness of timing Spirit attacks, such as the Earth Wolf Spirit, to stagger the boss and gain an advantage."
}