{
    "chunk_id": 31275632638,
    "source_file": "Crouching_Tiger_Temple_Walkthrough.md",
    "h1_title": "Crouching Tiger Temple Walkthrough",
    "h2_title": "Temple Cellar",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ec/Wukong_Tiger_31.jpg",
    "alt_text": "Wukong Tiger 31.jpg",
    "position_desc": 32,
    "img_above_text": "# Crouching Tiger Temple Walkthrough\n\nOnce you reach the top, you’ll come face to bloody face with the Tiger Vanguard, who looks like he just found his next meal.\n\n\nUsing the Keeness of Tiger and Sterness of Stone, head up the steps to the large headless statue in the middle of the temple’s blood-soaked plaza. By activating this two-headed tally, you’ll drain the bloody pool, and reveal a large lion mouth that serves as a pit into the cellar below.\n\n## Temple Cellar\n\nSlide down the rest of the way, and you’ll come up to a Shrine for the Crouching Tiger Temple’s Cellar. In the far corner of the cellar, you’ll find a familiar friendly face - the Xu Dog you helped get medicine recipes for!\n\nTalk to him while he’s in front of his large furnace, and the Xu Dog will thank you for your help thus far with a Mind Core. He'll also teach you the art of crafting your own Celestial Medicines in addition to the Mortal Medicine consumables you’ve been creating.",
    "img_below_text": "Celestial Medicines are sort of like passive buffs you can apply by trading in Mind Cores, which can be found in a variety of places - both by defeating bosses and sometimes regular enemies, or in chests. The buffs range from the familiar ones like health/stamina/mana increases much like the Celestial Pills, but also other stats like Crit Chance or resistance to certain afflictions.\n\nThe best part of these new passive buffs is that you have the option to reset them like your Skill Tree, which will give you back all the Mind Cores you’ve used thus far, allowing you to come back and reallocate points to suit your needs.\n\nBefore heading out, be sure to also buy the **Longevity Decoction** formula for 2,700 Will. It will allow you to craft a consumable that temporarily raises max health, allowing you to survive a bit longer in deadly boss fights.\n\nDown past the Shrine, you’ll finally find the way down to the final boss of Chapter 2. However, there’s a lot more to the Yellow Wind Formation sub-region than just the boss, including the path beyond the Crouching Tiger Temple, and the other doors yet to be unlocked. Our next stop will be to explore a large optional part of the **Yellow Wind Formation** above at the Windrest Bridge.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Crouching Tiger Temple Walkthrough\n            - Section Title: Temple Cellar\n\n            Context:\n            - Preceding Text: \"# Crouching Tiger Temple Walkthrough\n\nOnce you reach the top, you’ll come face to bloody face with the Tiger Vanguard, who looks like he just found his next meal.\n\n\nUsing the Keeness of Tiger and Sterness of Stone, head up the steps to the large headless statue in the middle of the temple’s blood-soaked plaza. By activating this two-headed tally, you’ll drain the bloody pool, and reveal a large lion mouth that serves as a pit into the cellar below.\n\n## Temple Cellar\n\nSlide down the rest of the way, and you’ll come up to a Shrine for the Crouching Tiger Temple’s Cellar. In the far corner of the cellar, you’ll find a familiar friendly face - the Xu Dog you helped get medicine recipes for!\n\nTalk to him while he’s in front of his large furnace, and the Xu Dog will thank you for your help thus far with a Mind Core. He'll also teach you the art of crafting your own Celestial Medicines in addition to the Mortal Medicine consumables you’ve been creating.\"\n            - Following Text: \"Celestial Medicines are sort of like passive buffs you can apply by trading in Mind Cores, which can be found in a variety of places - both by defeating bosses and sometimes regular enemies, or in chests. The buffs range from the familiar ones like health/stamina/mana increases much like the Celestial Pills, but also other stats like Crit Chance or resistance to certain afflictions.\n\nThe best part of these new passive buffs is that you have the option to reset them like your Skill Tree, which will give you back all the Mind Cores you’ve used thus far, allowing you to come back and reallocate points to suit your needs.\n\nBefore heading out, be sure to also buy the **Longevity Decoction** formula for 2,700 Will. It will allow you to craft a consumable that temporarily raises max health, allowing you to survive a bit longer in deadly boss fights.\n\nDown past the Shrine, you’ll finally find the way down to the final boss of Chapter 2. However, there’s a lot more to the Yellow Wind Formation sub-region than just the boss, including the path beyond the Crouching Tiger Temple, and the other doors yet to be unlocked. Our next stop will be to explore a large optional part of the **Yellow Wind Formation** above at the Windrest Bridge.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the player's progression through the Crouching Tiger Temple, where they drain a bloody pool to access the Temple Cellar. In the cellar, the player encounters Xu Dog, a friendly NPC who provides a Mind Core and teaches the crafting of Celestial Medicines, a new type of consumable with passive buffs.\n\nImage Summary:\nThe image showcases the crafting interface for Celestial Medicines, specifically the \"Jade Lotus Pill,\" which permanently increases maximum health. The interface displays the required resources, including \"Will\" and \"Mind Cores,\" alongside the player's current stats such as health, stamina, mana, and resistances. The background features a character in detailed armor, suggesting the crafting occurs in an immersive in-game environment.\n\nFollowing Text Summary:\nThe following text elaborates on Celestial Medicines, explaining their function as passive buffs that can enhance various stats, including health, stamina, mana, and resistances. Players can reset these buffs to reallocate Mind Cores as needed. Additionally, it advises purchasing the \"Longevity Decoction\" formula for temporary health boosts before progressing to the next area, which includes a boss fight and exploration of the Yellow Wind Formation sub-region."
}