{
    "chunk_id": 503054680110,
    "source_file": "Copper_Pill.md",
    "h1_title": "Copper Pill",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/30/Copper_Pill_2.jpg",
    "alt_text": "Copper Pill 2.jpg",
    "position_desc": 1,
    "img_above_text": "# Copper Pill\n\nCopper Pill is one of the Epic Soaks for your Gourds in Black Myth: Wukong. The Soak's ability is rather specialised, useful for specific spell builds or when adopting a particular playstyle, over some of the other Soaks, which have a more general use.\n\nWith the Copper Pill Soak equipped, after using the gourd, the next Rock Solid cast costs no mana for a short duration. If you are using the Rock Solid spell, then this can be an incredibly useful addition to your build, giving you free uses of the spell, without needing to refill your mana as much. However, if you are not using the spell, then other Soaks will be more worthwhile.",
    "img_below_text": "Soaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get to Rock Solid will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor\n\n## Black Myth: Wukong Copper Pill Location\n\nThe Copper Pill Soak can be found by a statue on the hill after the Tiger Vanguard fight at Crouching Tiger Temple \\- Temple Entrance in Yellow Wind Ridge. Simply follow the hill and inside a small box on the Shrine, you can find the Soak.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Copper Pill\n\n            Context:\n            - Preceding Text: \"# Copper Pill\n\nCopper Pill is one of the Epic Soaks for your Gourds in Black Myth: Wukong. The Soak's ability is rather specialised, useful for specific spell builds or when adopting a particular playstyle, over some of the other Soaks, which have a more general use.\n\nWith the Copper Pill Soak equipped, after using the gourd, the next Rock Solid cast costs no mana for a short duration. If you are using the Rock Solid spell, then this can be an incredibly useful addition to your build, giving you free uses of the spell, without needing to refill your mana as much. However, if you are not using the spell, then other Soaks will be more worthwhile.\"\n            - Following Text: \"Soaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get to Rock Solid will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor\n\n## Black Myth: Wukong Copper Pill Location\n\nThe Copper Pill Soak can be found by a statue on the hill after the Tiger Vanguard fight at Crouching Tiger Temple \\- Temple Entrance in Yellow Wind Ridge. Simply follow the hill and inside a small box on the Shrine, you can find the Soak.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Copper Pill Soak as an Epic item in *Black Myth: Wukong*. It explains its specialized ability, which allows the next *Rock Solid* spell to be cast without consuming mana for a short duration after using the gourd. This Soak is particularly useful for builds that rely on the *Rock Solid* spell but less effective for players who do not use this spell.\n\nImage Summary:\nThe image displays the Copper Pill Soak within the inventory menu of *Black Myth: Wukong*. It is categorized under \"Drinks and Soaks\" and marked as an Epic item. The description highlights its ability: after using the gourd, the next *Rock Solid* spell costs no mana for a limited time. The visual design includes a bowl containing dark pellets, and the text below provides a flavor narrative: \"Famished, he dined on iron pellets; parched, he supped on molten copper. For five centuries, not a morsel of tea nor rice.\"\n\nFollowing Text Summary:\nThe following text clarifies that Soaks, including the Copper Pill, cannot be upgraded in the game, unlike other items such as Drinks or the Gourd. The buff provided to the *Rock Solid* spell remains fixed. Players can switch to a different Soak by visiting the Shen Monkey vendor. Additionally, the Copper Pill's location is described as being inside a small box on a shrine near a statue on a hill after the Tiger Vanguard fight at the Crouching Tiger Temple in Yellow Wind Ridge."
}