{
    "chunk_id": 22021551418,
    "source_file": "Chapter_1_Secret_-_Ancient_Guanyin_Temple_Walkthrough.md",
    "h1_title": "Chapter 1 Secret - Ancient Guanyin Temple Walkthrough",
    "h2_title": "Ancient Guanyin Temple",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/52/Wukong_Guanyin_2.jpg",
    "alt_text": "Wukong Guanyin 2.jpg",
    "position_desc": 4,
    "img_above_text": "# Chapter 1 Secret - Ancient Guanyin Temple Walkthrough\n\nThe Ancient Guanyin Temple is a Secret Area found in Chapter 1's Black Wind Mountain of Black Myth Wukong. Below you'll find a guide to accessing the temple with all three bell locations, and how to defeat the secret Yaoguai King boss, Elder Jinchi.\n\nThis Chapter 1 Secret can only be accessed by ringing three large bells found around Black Wind Mountain, and will transport you to a different location to fight the secret boss that possess a magical item that is instrumental in defeating the Black Wind King.\n\n\n* **Bamboo Grove** \\- Traveling through the very short region of the Marsh of the White Mists, you’ll have to defeat a character boss, the Whiteclad Noble. Once he retreats, look for a path off to the left instead of heading straight into Black Wind Cave, and you’ll find a large plaza past the marsh where several Wolf Guai sit before a wolf that has been hung from a tree. Just beyond them is the final bell.\n\n## Ancient Guanyin Temple",
    "img_below_text": "Ringing all three bells will transport you back in time to an earlier version of the Guanyin Temple, presumably shortly after it was set on fire long ago. Despite looking similar to the area you explored previously to fight the Yaoguai King, Lingxuzi, you’ll find new items at the entrance.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chapter 1 Secret - Ancient Guanyin Temple Walkthrough\n            - Section Title: Ancient Guanyin Temple\n\n            Context:\n            - Preceding Text: \"# Chapter 1 Secret - Ancient Guanyin Temple Walkthrough\n\nThe Ancient Guanyin Temple is a Secret Area found in Chapter 1's Black Wind Mountain of Black Myth Wukong. Below you'll find a guide to accessing the temple with all three bell locations, and how to defeat the secret Yaoguai King boss, Elder Jinchi.\n\nThis Chapter 1 Secret can only be accessed by ringing three large bells found around Black Wind Mountain, and will transport you to a different location to fight the secret boss that possess a magical item that is instrumental in defeating the Black Wind King.\n\n\n* **Bamboo Grove** \\- Traveling through the very short region of the Marsh of the White Mists, you’ll have to defeat a character boss, the Whiteclad Noble. Once he retreats, look for a path off to the left instead of heading straight into Black Wind Cave, and you’ll find a large plaza past the marsh where several Wolf Guai sit before a wolf that has been hung from a tree. Just beyond them is the final bell.\n\n## Ancient Guanyin Temple\"\n            - Following Text: \"Ringing all three bells will transport you back in time to an earlier version of the Guanyin Temple, presumably shortly after it was set on fire long ago. Despite looking similar to the area you explored previously to fight the Yaoguai King, Lingxuzi, you’ll find new items at the entrance.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe Ancient Guanyin Temple is a secret area in Chapter 1 of *Black Myth Wukong*, accessible by ringing three bells scattered across Black Wind Mountain. This area serves as the location for a secret boss fight against Elder Jinchi, who holds a magical item crucial to progressing in the game.\n\nImage Summary:\nThe image depicts the Ancient Guanyin Temple, a dark and eerie structure surrounded by barren trees and a foreboding atmosphere. The temple's dilapidated state, combined with the dim lighting and overgrown surroundings, suggests a mysterious and ancient location, aligning with its role as a secret area in the game.\n\nFollowing Text Summary:\nRinging the three bells transports the player to an earlier version of the Ancient Guanyin Temple, set in the past shortly after it was burned. This version of the temple contains new items near its entrance, distinguishing it from the previously explored area."
}