{
    "chunk_id": 794154166041,
    "source_file": "Bitter_Lake_Walkthrough.md",
    "h1_title": "Bitter Lake Walkthrough",
    "h2_title": "Yaoguai Chief Miniboss Fight - Apramana Bat",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/79/Wukong_Bitter_46.jpg",
    "alt_text": "Wukong Bitter 46.jpg",
    "position_desc": 79,
    "img_above_text": "# Bitter Lake Walkthrough\n\nAs you draw close, you'll hear a voice coming from the cymbals, who is arguing with a woman refusing to let the trapped person out. With a loud gong, the trapped \"Admiral\" will use the cymbal to awaken a giant turtle whose mountainous shell you're actually standing on.\n\nAs the turtle begins to swim through the Bitter Seal, the woman will become aware of your presence, starting this new region off with a bang of a boss fight.\n\n\nAs long as your patient to wait for the right moments to get in close and attack, and make sure you're using shock-quelling medicine, you'll be able to come out on top. Even as Kang-Jin Star tries to flee in her dragon form, the Destined One will see to it that she crashes into the large cymbals, freeing the prisoner inside!\n\nThis imprisoned Pig Guai is none other than Zhu Bajie, who traveled with Sun Wukong during his adventures in Journey to the West!\n\n\nAs you start exploring the path over to the right, an echoing voice will lead you to a large open platform where dragon humanoid figure appears to be frozen in place with its fishing rod. If you interact with it while holding the Loong Scales, it will crackle to life, and begin a new secret boss fight.\n\n\nWhen he falls, you'll earn some Fine Gold Thread and another Loong Pearl, and can loot a nearby chest that appears for the Mountain-Shaking Claw material and Breath of Fire Soak for your Gourd. This new material will unlock the upgrade path for your Loongwreathe Staff into the Golden Loong Staff, but you'll need to find and defeat the last of the four Loongs to craft it.\n\nOnce you've had your fill of exploring the \"Turtle Island\", you can head to the front where the small Pig Guai stands waiting, and interact with him for the turtle to finally make its landing at the next part of the Bitter Lake.\n\n\nStart by heading along the shore and defeating various Frozen Corpses, and look for a small building in the distance by the water's edge. As you near it, you can also spot a dragon man standing alone in the shallows. Zhu Bajie seems to know him, but as you approach, you'll be pulled into another boss fight.\n\n\nAs you head close to inspect the skull of the great snake, a Yaoguai Chief will fly down to intercept you: a much bigger version of the bats you've faced recently!\n\n## Yaoguai Chief Miniboss Fight - Apramana Bat\n\nHead up the path toward a series of stone stairs, but be ready to deal with a new wolf enemy, the Wolf Guardian. Much like Wolf Assassins, they are highly mobile and can dart in and out of combat with their large sickles, but between you and your companion, he won't last long.",
    "img_below_text": "As you head up the stone stairs, look for a small pathway on the left where Zhu Bajie will point out a small enclosure. Be ready to deal with both a Falcon Fan-Maker and Cyan Bat. Shut down the Falcon with Immobilize so you can quickly remove the bat, and then focus your attention on defeating the stronger falcon enemy.\n\nWith both of them down, you'll find that they were guarding a **Luojia Fragrant Vine** , which you can now bring back to the Zodiac Village instead of going all the way back to Chapter 1!",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bitter Lake Walkthrough\n            - Section Title: Yaoguai Chief Miniboss Fight - Apramana Bat\n\n            Context:\n            - Preceding Text: \"# Bitter Lake Walkthrough\n\nAs you draw close, you'll hear a voice coming from the cymbals, who is arguing with a woman refusing to let the trapped person out. With a loud gong, the trapped \"Admiral\" will use the cymbal to awaken a giant turtle whose mountainous shell you're actually standing on.\n\nAs the turtle begins to swim through the Bitter Seal, the woman will become aware of your presence, starting this new region off with a bang of a boss fight.\n\n\nAs long as your patient to wait for the right moments to get in close and attack, and make sure you're using shock-quelling medicine, you'll be able to come out on top. Even as Kang-Jin Star tries to flee in her dragon form, the Destined One will see to it that she crashes into the large cymbals, freeing the prisoner inside!\n\nThis imprisoned Pig Guai is none other than Zhu Bajie, who traveled with Sun Wukong during his adventures in Journey to the West!\n\n\nAs you start exploring the path over to the right, an echoing voice will lead you to a large open platform where dragon humanoid figure appears to be frozen in place with its fishing rod. If you interact with it while holding the Loong Scales, it will crackle to life, and begin a new secret boss fight.\n\n\nWhen he falls, you'll earn some Fine Gold Thread and another Loong Pearl, and can loot a nearby chest that appears for the Mountain-Shaking Claw material and Breath of Fire Soak for your Gourd. This new material will unlock the upgrade path for your Loongwreathe Staff into the Golden Loong Staff, but you'll need to find and defeat the last of the four Loongs to craft it.\n\nOnce you've had your fill of exploring the \"Turtle Island\", you can head to the front where the small Pig Guai stands waiting, and interact with him for the turtle to finally make its landing at the next part of the Bitter Lake.\n\n\nStart by heading along the shore and defeating various Frozen Corpses, and look for a small building in the distance by the water's edge. As you near it, you can also spot a dragon man standing alone in the shallows. Zhu Bajie seems to know him, but as you approach, you'll be pulled into another boss fight.\n\n\nAs you head close to inspect the skull of the great snake, a Yaoguai Chief will fly down to intercept you: a much bigger version of the bats you've faced recently!\n\n## Yaoguai Chief Miniboss Fight - Apramana Bat\n\nHead up the path toward a series of stone stairs, but be ready to deal with a new wolf enemy, the Wolf Guardian. Much like Wolf Assassins, they are highly mobile and can dart in and out of combat with their large sickles, but between you and your companion, he won't last long.\"\n            - Following Text: \"As you head up the stone stairs, look for a small pathway on the left where Zhu Bajie will point out a small enclosure. Be ready to deal with both a Falcon Fan-Maker and Cyan Bat. Shut down the Falcon with Immobilize so you can quickly remove the bat, and then focus your attention on defeating the stronger falcon enemy.\n\nWith both of them down, you'll find that they were guarding a **Luojia Fragrant Vine** , which you can now bring back to the Zodiac Village instead of going all the way back to Chapter 1!\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text describes the player's journey through the Bitter Lake region, where they encounter various enemies and events, including a boss fight with a Yaoguai Chief, the Apramana Bat. The player is advised to proceed carefully up a path with stone stairs, facing new enemies like the Wolf Guardian, who is agile and challenging but manageable with the help of a companion.\n\nImage Summary:  \nThe image depicts an in-game battle scene in a snowy environment. The player character, wielding a staff weapon, is engaged in combat with a flying red bat-like enemy, likely the Apramana Bat or a similar foe. Another enemy, possibly a Wolf Guardian, is visible in the background, highlighted with a red circle. The interface shows combat abilities and health indicators, emphasizing the active and strategic nature of the fight.\n\nFollowing Text Summary:  \nThe following text advises players to explore a side path near the stone stairs, where Zhu Bajie points out an enclosure guarded by two enemies: a Falcon Fan-Maker and a Cyan Bat. Players are instructed to use specific strategies, such as immobilizing the Falcon, to defeat the enemies and obtain the Luojia Fragrant Vine, a valuable item for progressing in the game."
}