{
    "chunk_id": 666411620514,
    "source_file": "Black_Bear_Guai.md",
    "h1_title": "Black Bear Guai",
    "h2_title": "Black Bear Guai Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/33/Wukong_BlackWind_42.jpg",
    "alt_text": "Wukong BlackWind 42.jpg",
    "position_desc": 11,
    "img_above_text": "# Black Bear Guai\n\nThe Black Bear Guai is a required Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located at the very end of Chapter 1 at the top of Black Wind Mountain, this is the second of two forms you'll fight the self-imposed King. Now in the form of a giant bear, he'll harness the power of fire to try and burn you alive.\n\n* **Rewards:** Craving Eyes Relic, Flame Ebongold, Yarn x5, Silk x2, Spirit Stone x1, Yaoguai Core x1, Mind Core x1, 1641 Experience, 990 Will\n\n\nAs a required boss, you won't be able to miss running into the Black Wind King. You can find him at the very end of the chapter by progressing through Black Wind Cave and up the mountain, past all of the wolf defenses until you reach Bodhi Peak.\n\n## Black Bear Guai Boss Fight and Guide\n\nThis fight will last awhile, so be sure to be mindful of your stamina and back off when you need to recover, or reposition yourself if you find yourself too close to any fire pits he’s created. It’s much better to wait and find a better avenue of attack than getting too reckless and being burned as a result.",
    "img_below_text": "When he’s finally defeated, the Black Bear Guai will try and flee with the sense of the Great Sage, only for it to reject his escape attempt. As he realizes your true purpose, he’ll plead for mercy, blaming the Celestial Palace. It matters little, as the true object of your quest in the Black Wind Mountain is now yours - The Craving Eyes Relic.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Black Bear Guai\n            - Section Title: Black Bear Guai Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Black Bear Guai\n\nThe Black Bear Guai is a required Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located at the very end of Chapter 1 at the top of Black Wind Mountain, this is the second of two forms you'll fight the self-imposed King. Now in the form of a giant bear, he'll harness the power of fire to try and burn you alive.\n\n* **Rewards:** Craving Eyes Relic, Flame Ebongold, Yarn x5, Silk x2, Spirit Stone x1, Yaoguai Core x1, Mind Core x1, 1641 Experience, 990 Will\n\n\nAs a required boss, you won't be able to miss running into the Black Wind King. You can find him at the very end of the chapter by progressing through Black Wind Cave and up the mountain, past all of the wolf defenses until you reach Bodhi Peak.\n\n## Black Bear Guai Boss Fight and Guide\n\nThis fight will last awhile, so be sure to be mindful of your stamina and back off when you need to recover, or reposition yourself if you find yourself too close to any fire pits he’s created. It’s much better to wait and find a better avenue of attack than getting too reckless and being burned as a result.\"\n            - Following Text: \"When he’s finally defeated, the Black Bear Guai will try and flee with the sense of the Great Sage, only for it to reject his escape attempt. As he realizes your true purpose, he’ll plead for mercy, blaming the Celestial Palace. It matters little, as the true object of your quest in the Black Wind Mountain is now yours - The Craving Eyes Relic.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Black Bear Guai, a required boss fight in Chapter 1 of *Black Myth: Wukong*. The boss, located at the top of Black Wind Mountain, takes the form of a giant bear wielding fire-based attacks. Players are advised to manage stamina and avoid recklessness during the prolonged fight. Rewards for defeating the boss include valuable items, experience points, and progression in the game.\n\nImage Summary:  \nThe image depicts a character in *Black Myth: Wukong*, likely the protagonist, holding a weapon and adorned with detailed armor or accessories. The setting appears to be a fiery or dimly lit environment, consistent with the narrative's focus on the Black Bear Guai boss fight and its fire-themed attacks.\n\nFollowing Text Summary:  \nThe following text describes the aftermath of defeating the Black Bear Guai. The boss attempts to escape but fails, leading to a moment of realization and a plea for mercy. The protagonist acquires the Craving Eyes Relic, the true objective of the quest in Black Wind Mountain."
}