{
    "chunk_id": 967663612852,
    "source_file": "Cloud-Patterned_Stone_Staff.md",
    "h1_title": "Cloud-Patterned Stone Staff",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/65/Cloud-Patterned_Stone_Staff_2.jpg",
    "alt_text": "Cloud-Patterned Stone Staff 2.jpg",
    "position_desc": 1,
    "img_above_text": "# Cloud-Patterned Stone Staff\n\nThe Cloud-Patterned Stone Staff is a Rare weapon in Black Myth: Wukong. It comes with solid stats, damage, and a decent, albeit easily outbeaten unique effect compared to the other Weapons in the game.\n\nThe weapon comes with a respectable 60 damage, and the unique effect of making the fourth move of moderately increasing the damage executed by charged smash heavy attacks. It also has a bonus 30 Defense.",
    "img_below_text": "## Black Myth: Wukong Cloud-Patterned Stone Staff Location\n\nThe Cloud-Patterned Stone Staff can be found in Chapter 2 - Yellow Wind Ridge upon defeating Shigandang in Fright Cliff - Rock Clash Platform. You will need obtain all the Buddha Eyeballs items from the Fright Cliff area to activate the fight.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Cloud-Patterned Stone Staff\n\n            Context:\n            - Preceding Text: \"# Cloud-Patterned Stone Staff\n\nThe Cloud-Patterned Stone Staff is a Rare weapon in Black Myth: Wukong. It comes with solid stats, damage, and a decent, albeit easily outbeaten unique effect compared to the other Weapons in the game.\n\nThe weapon comes with a respectable 60 damage, and the unique effect of making the fourth move of moderately increasing the damage executed by charged smash heavy attacks. It also has a bonus 30 Defense.\"\n            - Following Text: \"## Black Myth: Wukong Cloud-Patterned Stone Staff Location\n\nThe Cloud-Patterned Stone Staff can be found in Chapter 2 - Yellow Wind Ridge upon defeating Shigandang in Fright Cliff - Rock Clash Platform. You will need obtain all the Buddha Eyeballs items from the Fright Cliff area to activate the fight.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe Cloud-Patterned Stone Staff is a Rare weapon in *Black Myth: Wukong*. It has solid stats, including 60 damage and 30 defense, and a unique effect that moderately increases the damage of charged smash heavy attacks. While effective, its unique effect is considered less impactful compared to other weapons in the game.\n\nImage Summary:  \nThe image displays the in-game equipment menu for the Cloud-Patterned Stone Staff in *Black Myth: Wukong*. The weapon is categorized as Rare and has stats of 60 Attack and 30 Defense. Its unique effect is highlighted, which boosts the damage of charged smash heavy attacks. The visual design of the staff is shown, along with the character holding it, and additional gameplay stats are visible on the right side of the screen.\n\nFollowing Text Summary:  \nThe Cloud-Patterned Stone Staff can be acquired in Chapter 2 of *Black Myth: Wukong*, specifically at Yellow Wind Ridge. Players must defeat Shigandang at Fright Cliff - Rock Clash Platform after collecting all Buddha Eyeballs from the Fright Cliff area to activate the encounter."
}