{
    "chunk_id": 351553951368,
    "source_file": "Elder_Jinchi.md",
    "h1_title": "Elder Jinchi",
    "h2_title": "Elder Jinchi Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/19/Wukong_Guanyin_4.jpg",
    "alt_text": "Wukong Guanyin 4.jpg",
    "position_desc": 4,
    "img_above_text": "# Elder Jinchi\n\nElder Jinchi is an optional secret Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located in a secret realm locked away in the past, you'll need to activate three bells in order to locate and defeat him.\n\n* **Rewards:** Fireproof Mantle, 2,000 Will\n\n\n* **Bamboo Grove** \\- Traveling through the very short region of the Marsh of the White Mists, you’ll have to defeat a character boss, the Whiteclad Noble. Once he retreats, look for a path off to the left instead of heading straight into Black Wind Cave, and you’ll find a large plaza past the marsh where several Wolf Guai sit before a wolf that has been hung from a tree. Just beyond them is the final bell.\n\nNote - Before facing this boss, be sure to defeat the optional **Wandering Wight** that is found in the Forest of Wolves region of Black Wind Mountain if you haven’t faced him already. Not only does he share many attacks with this secret boss, but defeating this one will cause the Wandering Wight to disappear, and you will not be able to gain the Curio and Spirit that the Wight drops.\n\n## Elder Jinchi Fight and Guide\n\nIf you fought the Wandering Wight then the good news is you’ll have a good idea of what to expect in this fight, as he shares many of the same moves. That said, he does hit harder and can empower certain moves, so don’t assume this will be a cakewalk. You’ll want to have upgraded your staff after defeating the Whiteclad Noble to dish out more damage, and using the Wandering Wight’s Spirit on this guy can help tremendously.",
    "img_below_text": "The big twist on this fight that you’ll notice immediately is all the wandering bronze-colored corpses milling about the arena. The good news is they actually aren’t a threat — at least at first. This means you can focus on attacking the boss without worrying about one of them randomly clawing at you, but there’s more to it than that.\n\nThough you can’t directly target them, you can kill them with a single swipe of your staff. Doing so will actually cause their spirit to be directly absorbed, and heal you for a small amount. It’s not enough that you should be turning your back to the boss to seek them out exactly, but there are situations where you’ll need to distance yourself from Jinchi’s tremor and earthquake attacks that provide a pause in combat where you might as well hit one nearby to get a bit of your health restored. That’s not all these corpses do, but we’ll get to the rest in a bit.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Elder Jinchi\n            - Section Title: Elder Jinchi Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Elder Jinchi\n\nElder Jinchi is an optional secret Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located in a secret realm locked away in the past, you'll need to activate three bells in order to locate and defeat him.\n\n* **Rewards:** Fireproof Mantle, 2,000 Will\n\n\n* **Bamboo Grove** \\- Traveling through the very short region of the Marsh of the White Mists, you’ll have to defeat a character boss, the Whiteclad Noble. Once he retreats, look for a path off to the left instead of heading straight into Black Wind Cave, and you’ll find a large plaza past the marsh where several Wolf Guai sit before a wolf that has been hung from a tree. Just beyond them is the final bell.\n\nNote - Before facing this boss, be sure to defeat the optional **Wandering Wight** that is found in the Forest of Wolves region of Black Wind Mountain if you haven’t faced him already. Not only does he share many attacks with this secret boss, but defeating this one will cause the Wandering Wight to disappear, and you will not be able to gain the Curio and Spirit that the Wight drops.\n\n## Elder Jinchi Fight and Guide\n\nIf you fought the Wandering Wight then the good news is you’ll have a good idea of what to expect in this fight, as he shares many of the same moves. That said, he does hit harder and can empower certain moves, so don’t assume this will be a cakewalk. You’ll want to have upgraded your staff after defeating the Whiteclad Noble to dish out more damage, and using the Wandering Wight’s Spirit on this guy can help tremendously.\"\n            - Following Text: \"The big twist on this fight that you’ll notice immediately is all the wandering bronze-colored corpses milling about the arena. The good news is they actually aren’t a threat — at least at first. This means you can focus on attacking the boss without worrying about one of them randomly clawing at you, but there’s more to it than that.\n\nThough you can’t directly target them, you can kill them with a single swipe of your staff. Doing so will actually cause their spirit to be directly absorbed, and heal you for a small amount. It’s not enough that you should be turning your back to the boss to seek them out exactly, but there are situations where you’ll need to distance yourself from Jinchi’s tremor and earthquake attacks that provide a pause in combat where you might as well hit one nearby to get a bit of your health restored. That’s not all these corpses do, but we’ll get to the rest in a bit.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Elder Jinchi as a secret boss in *Black Myth: Wukong*, encountered in Chapter 1 after activating three bells. It provides preparation advice, including defeating the Wandering Wight to gain familiarity with similar attack patterns and to obtain helpful rewards. Players are encouraged to upgrade their staff and use the Wandering Wight’s Spirit for an advantage in the fight.\n\nImage Summary:\nThe image depicts the arena for the Elder Jinchi boss fight, showcasing a large, imposing bronze-colored figure resembling Elder Jinchi, surrounded by wandering humanoid corpses. The player character is positioned in the foreground, wielding a staff and preparing for combat. The environment is dark and decrepit, with stone flooring and a temple-like structure in the background, emphasizing the ominous atmosphere of the encounter.\n\nFollowing Text Summary:\nThe following text elaborates on the mechanics of the fight, highlighting the presence of bronze-colored wandering corpses in the arena. These corpses are initially non-threatening but can be killed to absorb their spirit for minor health restoration. Players are advised to strategically use these corpses during pauses in combat caused by Jinchi’s tremor and earthquake attacks. Additional details about their role in the fight are hinted at but not fully explained."
}