{
    "chunk_id": 405076983029,
    "source_file": "Fuban.md",
    "h1_title": "Fuban",
    "h2_title": "Where to Find Fuban",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8c/Wukong_Fright_59.jpg",
    "alt_text": "Wukong Fright 59.jpg",
    "position_desc": 2,
    "img_above_text": "# Fuban\n\nFuban is a secret optional Yaoguai King boss fight that you can encounter in Chapter 2's secret area in Black Myth Wukong. Located in the Kingdom of Sahali locked away in the past, you'll need to help fulfill a drunken Boar's quest to access this area.\n\n* **Rewards:** Wind Tamer, Sky-Piercing Horn\n\n## Where to Find Fuban\n\nIn order to unlock this secret area, you need to find the Drunk Boar (the Yellow-Robed Squire) who can be found in the Rockrest Flat part of the Fright Cliff region in Chapter 2. Head straight to the back of the area from the shrine to find a small breakable wooden fence protected by a Spearbone enemy.",
    "img_below_text": "In this large open field, you’ll find a friendly boar-like Guai resting on a rock. He’s apparently extremely inebriated, and needs you to help him find something to sober him up. He’ll mention “Windrest” if you talk to him again, providing a clue to where you can find such an ingredient.\n\nThere are two ways to get the item required:",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fuban\n            - Section Title: Where to Find Fuban\n\n            Context:\n            - Preceding Text: \"# Fuban\n\nFuban is a secret optional Yaoguai King boss fight that you can encounter in Chapter 2's secret area in Black Myth Wukong. Located in the Kingdom of Sahali locked away in the past, you'll need to help fulfill a drunken Boar's quest to access this area.\n\n* **Rewards:** Wind Tamer, Sky-Piercing Horn\n\n## Where to Find Fuban\n\nIn order to unlock this secret area, you need to find the Drunk Boar (the Yellow-Robed Squire) who can be found in the Rockrest Flat part of the Fright Cliff region in Chapter 2. Head straight to the back of the area from the shrine to find a small breakable wooden fence protected by a Spearbone enemy.\"\n            - Following Text: \"In this large open field, you’ll find a friendly boar-like Guai resting on a rock. He’s apparently extremely inebriated, and needs you to help him find something to sober him up. He’ll mention “Windrest” if you talk to him again, providing a clue to where you can find such an ingredient.\n\nThere are two ways to get the item required:\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Fuban, a secret optional boss in *Black Myth: Wukong*, accessible in Chapter 2 through a hidden area in the Kingdom of Sahali. To unlock this area, players must assist a drunken boar-like character, the Yellow-Robed Squire, found in the Rockrest Flat region of Fright Cliff. The quest begins by breaking a wooden fence guarded by an enemy.\n\nImage Summary:  \nThe image depicts a large, boar-like character resting on a rock in a desolate, rugged landscape. This character, identified as the drunken Yellow-Robed Squire, appears to be part of the quest to unlock the secret area leading to Fuban. The text overlay suggests the player needs to find an item to sober the boar up, advancing the quest.\n\nFollowing Text Summary:  \nThe following text elaborates that the boar-like character provides a clue about an ingredient called \"Windrest\" to help sober him up. Players are given two options to obtain the required item, continuing the quest progression."
}