{
    "chunk_id": 877490905476,
    "source_file": "Bamboo_Grove_Walkthrough.md",
    "h1_title": "Bamboo Grove Walkthrough",
    "h2_title": "Black Wind Mountain’s Secret - Ringing the Final Bell",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c6/Wukong_Guanyin_1.jpg",
    "alt_text": "Wukong Guanyin 1.jpg",
    "position_desc": 50,
    "img_above_text": "# Bamboo Grove Walkthrough\n\nThe Bamboo Grove is the second main region of Chapter 1's Black Wind Mountain in Black Myth: Wukong. Below you'll find a guide to the progressing through the grove and learning how to cultivate Spirits, accessing a secret realm, as well as how to defeat the many bosses of this area that include Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble.\n\n* **Jump to A Section:**\n* **Back Hills**\n* **Snake Trail**\n- Yaoguai Chief - Baw-Li-Guhh-Lang\n- Yaoguai Chief - Guangmo\n* **Marsh of the White Mist**\n- Boss FIght - Whiteclad Noble\n\n\nTo advance, keep heading up the stairway to cross the high bridge over the falls, where you’ll soon see the golden trail of a nearby shrine beckoning you left. Before making that turn, be sure to look to the right to find a small wooden gazebo with a small table, and open the small gold box on top to find a variety of medicines, including 2 **Tiger Subduing Pellets** , 1 **Evil Repelling Medicament** and 1 **Amplification Pellet**.\n\n\nAnother good strategy to note is that if you’re in danger of getting close to becoming poisoned, using the Red Tides spell can help you transform out of danger. Any status effects suffered while transformed as Guangzhi will be removed when you regain your regular health bar. As an added bonus, Guangmou will even comment on your transformation.\n\nOnce you’ve learned how to evade his projectiles, the rest of the fight will just boil down to chasing him down and stunning him however you can with Immobilize, your Spirit Attack, and other heavy hits. When he falls, you’ll gain Guangmou’s Spirit to add to your collection, allowing you to summon venomous snakes of your own!\n\n\nWhen you’re ready to move on, make sure you’re fully healed up from dealing with that snake, as the end of this downward path leads to the titular marsh where a very strong boss waits to block your path.\n\n\nOn the other side, you’ll find a large open area where several Wolf Guais are seated in front of the final bell, as well as a hanged wolf on a nearby tree.\n\n## Black Wind Mountain’s Secret - Ringing the Final Bell",
    "img_below_text": "Defeat the Wolves that guard this area, and you can find and ring the last bell in Black Wind Mountain. Doing so will allow you to be taken to a secret area with its own boss: **The Ancient Guanyin Temple**.\n\nIf you’re ready for a tough secret boss fight, you can enter the burned temple to face off against Elder Jinchi, and you can view strategies to defeat this boss here.\n\nOtherwise, return to the marsh and head through the structure the Whiteclad Noble was guarding to leave the Bamboo Grove behind and enter the final area of the Black Wind Mountain - **Black Wind Cave**.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bamboo Grove Walkthrough\n            - Section Title: Black Wind Mountain’s Secret - Ringing the Final Bell\n\n            Context:\n            - Preceding Text: \"# Bamboo Grove Walkthrough\n\nThe Bamboo Grove is the second main region of Chapter 1's Black Wind Mountain in Black Myth: Wukong. Below you'll find a guide to the progressing through the grove and learning how to cultivate Spirits, accessing a secret realm, as well as how to defeat the many bosses of this area that include Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble.\n\n* **Jump to A Section:**\n* **Back Hills**\n* **Snake Trail**\n- Yaoguai Chief - Baw-Li-Guhh-Lang\n- Yaoguai Chief - Guangmo\n* **Marsh of the White Mist**\n- Boss FIght - Whiteclad Noble\n\n\nTo advance, keep heading up the stairway to cross the high bridge over the falls, where you’ll soon see the golden trail of a nearby shrine beckoning you left. Before making that turn, be sure to look to the right to find a small wooden gazebo with a small table, and open the small gold box on top to find a variety of medicines, including 2 **Tiger Subduing Pellets** , 1 **Evil Repelling Medicament** and 1 **Amplification Pellet**.\n\n\nAnother good strategy to note is that if you’re in danger of getting close to becoming poisoned, using the Red Tides spell can help you transform out of danger. Any status effects suffered while transformed as Guangzhi will be removed when you regain your regular health bar. As an added bonus, Guangmou will even comment on your transformation.\n\nOnce you’ve learned how to evade his projectiles, the rest of the fight will just boil down to chasing him down and stunning him however you can with Immobilize, your Spirit Attack, and other heavy hits. When he falls, you’ll gain Guangmou’s Spirit to add to your collection, allowing you to summon venomous snakes of your own!\n\n\nWhen you’re ready to move on, make sure you’re fully healed up from dealing with that snake, as the end of this downward path leads to the titular marsh where a very strong boss waits to block your path.\n\n\nOn the other side, you’ll find a large open area where several Wolf Guais are seated in front of the final bell, as well as a hanged wolf on a nearby tree.\n\n## Black Wind Mountain’s Secret - Ringing the Final Bell\"\n            - Following Text: \"Defeat the Wolves that guard this area, and you can find and ring the last bell in Black Wind Mountain. Doing so will allow you to be taken to a secret area with its own boss: **The Ancient Guanyin Temple**.\n\nIf you’re ready for a tough secret boss fight, you can enter the burned temple to face off against Elder Jinchi, and you can view strategies to defeat this boss here.\n\nOtherwise, return to the marsh and head through the structure the Whiteclad Noble was guarding to leave the Bamboo Grove behind and enter the final area of the Black Wind Mountain - **Black Wind Cave**.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the progression through the Bamboo Grove region in *Black Myth: Wukong*, focusing on strategies for defeating bosses and navigating the area. It highlights key items, such as medicines found in a gazebo, and spells like Red Tides for avoiding poison. The text also mentions the marsh leading to a strong boss encounter and a large open area with wolves near the final bell.\n\nImage Summary:\nThe image depicts a serene yet ominous scene featuring a traditional wooden structure resembling a shrine or bell pavilion surrounded by dense greenery and mist. The atmosphere is dark and mysterious, with scattered leaves and birds adding to the sense of movement and life. A figure stands near the structure, possibly interacting with it, suggesting the location's significance in the narrative as a pivotal area tied to the final bell.\n\nFollowing Text Summary:\nThe following text explains the importance of defeating the wolves near the final bell to access a secret area, the Ancient Guanyin Temple, containing a challenging boss fight against Elder Jinchi. Alternatively, players can return to the marsh and proceed to the next region, Black Wind Cave, marking the end of the Bamboo Grove area."
}