{
    "chunk_id": 928865617823,
    "source_file": "Chen_Loong.md",
    "h1_title": "Chen Loong",
    "h2_title": "Where to Find Chen Loong",
    "h3_title": "Chen Loong Boss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7e/Wukong_Bitter_7.jpg",
    "alt_text": "Wukong Bitter 7.jpg",
    "position_desc": 7,
    "img_above_text": "# Chen Loong\n\nChen Loong is a character and possible boss fight first found in Chapter 3 of Black Myth Wukong. Though initially hostile, you can perform a task after defeating him in combat to unlock a Painted Realm where you can quickly access multiple merchants and services.\n\n* **Rewards:** TBA\n\n## Where to Find Chen Loong\n\nChen Loong is an optional opponent who has their own quest, which you can find shortly after leaving Turtle Rock for the North Shore of the Bitter Lake. From the Shrine, head left while facing it to head along the lakeshore toward a lone shack by the water.\n\nSearch the shallows near this shack, and you'll find the old dragon wandering the waters, and will become hostile as you approach.\n\n### Chen Loong Boss Fight and Guide\n\nHe can also shoot lightning directly out of his mouth in a beam of energy. This can happen both when he's on the ground in a quick straight burst right in front of him, or when floating above you in a quick sweep in front of him, and both need quick dodges to stop a quick attack.",
    "img_below_text": "While Chen Loong is highly susceptible to being staggered, he has a few tricks to stop you from pressing the attack for too long. His tail can be pretty impressive, and will use it to spin around and attack with it for two rotations, and then leap into the air to perform a delayed third electric slash.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chen Loong\n            - Section Title: Where to Find Chen Loong\n            - Sub-Section Title: Chen Loong Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Chen Loong\n\nChen Loong is a character and possible boss fight first found in Chapter 3 of Black Myth Wukong. Though initially hostile, you can perform a task after defeating him in combat to unlock a Painted Realm where you can quickly access multiple merchants and services.\n\n* **Rewards:** TBA\n\n## Where to Find Chen Loong\n\nChen Loong is an optional opponent who has their own quest, which you can find shortly after leaving Turtle Rock for the North Shore of the Bitter Lake. From the Shrine, head left while facing it to head along the lakeshore toward a lone shack by the water.\n\nSearch the shallows near this shack, and you'll find the old dragon wandering the waters, and will become hostile as you approach.\n\n### Chen Loong Boss Fight and Guide\n\nHe can also shoot lightning directly out of his mouth in a beam of energy. This can happen both when he's on the ground in a quick straight burst right in front of him, or when floating above you in a quick sweep in front of him, and both need quick dodges to stop a quick attack.\"\n            - Following Text: \"While Chen Loong is highly susceptible to being staggered, he has a few tricks to stop you from pressing the attack for too long. His tail can be pretty impressive, and will use it to spin around and attack with it for two rotations, and then leap into the air to perform a delayed third electric slash.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Chen Loong, a character and optional boss in *Black Myth Wukong*, encountered in Chapter 3 near the North Shore of the Bitter Lake. Players can find him by exploring the shallows near a shack by the water, where he becomes hostile. The text highlights one of his key attacks: a lightning beam emitted from his mouth, which requires quick dodging to avoid.\n\nImage Summary:\nThe image depicts an intense moment during the boss fight with Chen Loong in *Black Myth Wukong*. Chen Loong is shown unleashing a powerful lightning beam attack, sweeping across the ground. The player character is mid-dodge, wielding a glowing staff, while the environment features snowy terrain and a lakeside shack in the background. The health bar at the bottom indicates the ongoing combat, emphasizing the challenge of the encounter.\n\nFollowing Text Summary:\nThe following text elaborates on Chen Loong's susceptibility to being staggered but warns players of his defensive tactics. It describes his tail-based spinning attack, which includes two rotations followed by a delayed third electric slash, adding complexity to the fight and requiring strategic timing to overcome."
}