{
    "chunk_id": 561591622595,
    "source_file": "Purple-Veined_Peach_Pit.md",
    "h1_title": "Purple-Veined Peach Pit",
    "h2_title": "Black Myth: Wukong Purple-Veined Peach Pit Location",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5b/Wukong_MiddleHollow_6.jpg",
    "alt_text": "Wukong MiddleHollow 6.jpg",
    "position_desc": 1,
    "img_above_text": "# Purple-Veined Peach Pit\n\nThe Purple-Veined Peach Pit is one of the Rare Soaks for your Gourds in Black Myth: Wukong. The Soak's ability is incredibly strong if you like to heal at the last possible moment.\n\nWith the Purple-Veined Peach Pit equipped as your Soak, each Gourd use, massively increases the health recovery when at Critical Health.\n\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor.\n\n## Black Myth: Wukong Purple-Veined Peach Pit Location\n\nThe Purple-Veined Peach Pit can be found at The Verdure Bridge Shrine in The Webbed Hollow's Middle Hollow. From the Shrine, follow the path towards the lanterns on the left. Head through the opening on the right by them and open one of the chests in the area to get the Soak.",
    "img_below_text": "Soaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Purple-Veined Peach Pit\n            - Section Title: Black Myth: Wukong Purple-Veined Peach Pit Location\n\n            Context:\n            - Preceding Text: \"# Purple-Veined Peach Pit\n\nThe Purple-Veined Peach Pit is one of the Rare Soaks for your Gourds in Black Myth: Wukong. The Soak's ability is incredibly strong if you like to heal at the last possible moment.\n\nWith the Purple-Veined Peach Pit equipped as your Soak, each Gourd use, massively increases the health recovery when at Critical Health.\n\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor.\n\n## Black Myth: Wukong Purple-Veined Peach Pit Location\n\nThe Purple-Veined Peach Pit can be found at The Verdure Bridge Shrine in The Webbed Hollow's Middle Hollow. From the Shrine, follow the path towards the lanterns on the left. Head through the opening on the right by them and open one of the chests in the area to get the Soak.\"\n            - Following Text: \"Soaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}