{
    "chunk_id": 201487504131,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "h1_title": "Furnace Valley Walkthrough",
    "h2_title": "The Emerald Hall",
    "h3_title": "Yaoguai King - Keeper of the Flaming Mountains and Yin-Yang Fish",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fe/Furnace_Valley_Walkthrough_%2883%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(83\\).png",
    "position_desc": 45,
    "img_above_text": "# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n\nOpen the giant door at the top of the stairs. Go straight ahead and activate the Rakshasa Palace Keeper's Shrine.\n\n\nInside here, you'll find the old man who gave you the gourd at the start of the game and an Awaken Wine Worm to the left.\n\nSpeak to the old man, and he'll tell you to find yourself a decent gourd (if you haven't already upgraded yours fully) and you can share a drink with him.\n\n\n## The Emerald Hall\n\nFrom The Emerald Hall Keeper's Shrine, go left and up the stairs. A cutscene will start to play, where you'll transform into a Cicada and fly toward the center of the hall. This is where you'll find Pingping speaking to her mother, Rakshasi, accompanied by the Keeper of the Flaming Mountains.\n\nAfter they discuss The Destined One obtaining the relics, the Keeper of the Flaming Mountains offers to care for Rakshashi, which Pingping protests. After he binds Pingping, Rakshashi is revealed to be Zhu Bajie transformed and it's time to take on the Keeper of the Flaming Mountains for yourself.\n\n### Yaoguai King - Keeper of the Flaming Mountains and Yin-Yang Fish",
    "img_below_text": "The Keeper of the Flaming Mountains will transport you to another place, in a monochrome illusion where he uses the power of yin-yang. Zhu Bajie will be there to help you at first, so focus on attacking the Keeper of the Flaming Mountains as quickly as you can. This is a two-phase fight, and as you might expect, the second phase is where the action really begins.\n\nIn the first phase, try to hold off on using your spells as much as you can. Instead, try to be aggressive and relentlessly attack the Keeper of the Flaming Mountains while he's on the ground.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Furnace Valley Walkthrough\n            - Section Title: The Emerald Hall\n            - Sub-Section Title: Yaoguai King - Keeper of the Flaming Mountains and Yin-Yang Fish\n\n            Context:\n            - Preceding Text: \"# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n\nOpen the giant door at the top of the stairs. Go straight ahead and activate the Rakshasa Palace Keeper's Shrine.\n\n\nInside here, you'll find the old man who gave you the gourd at the start of the game and an Awaken Wine Worm to the left.\n\nSpeak to the old man, and he'll tell you to find yourself a decent gourd (if you haven't already upgraded yours fully) and you can share a drink with him.\n\n\n## The Emerald Hall\n\nFrom The Emerald Hall Keeper's Shrine, go left and up the stairs. A cutscene will start to play, where you'll transform into a Cicada and fly toward the center of the hall. This is where you'll find Pingping speaking to her mother, Rakshasi, accompanied by the Keeper of the Flaming Mountains.\n\nAfter they discuss The Destined One obtaining the relics, the Keeper of the Flaming Mountains offers to care for Rakshashi, which Pingping protests. After he binds Pingping, Rakshashi is revealed to be Zhu Bajie transformed and it's time to take on the Keeper of the Flaming Mountains for yourself.\n\n### Yaoguai King - Keeper of the Flaming Mountains and Yin-Yang Fish\"\n            - Following Text: \"The Keeper of the Flaming Mountains will transport you to another place, in a monochrome illusion where he uses the power of yin-yang. Zhu Bajie will be there to help you at first, so focus on attacking the Keeper of the Flaming Mountains as quickly as you can. This is a two-phase fight, and as you might expect, the second phase is where the action really begins.\n\nIn the first phase, try to hold off on using your spells as much as you can. Instead, try to be aggressive and relentlessly attack the Keeper of the Flaming Mountains while he's on the ground.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the progression of the walkthrough in the game \"Furnace Valley,\" leading up to the encounter in The Emerald Hall. Players are instructed to revisit key shrines and NPCs, culminating in a cutscene where Pingping interacts with Rakshasi and the Keeper of the Flaming Mountains. This sets up the confrontation with the Keeper, who is revealed to be Zhu Bajie in disguise.\n\nImage Summary:\nThe image depicts a monochrome, surreal environment with two figures walking across a reflective water-like surface. One figure appears to be Zhu Bajie, while the other is likely the Keeper of the Flaming Mountains. In the distance, a towering, ornate structure looms, suggesting a mystical or illusionary realm. The visual tone aligns with the narrative of being transported to a yin-yang-themed monochrome illusion during the boss fight.\n\nFollowing Text Summary:\nThe following text provides strategic advice for the boss fight against the Keeper of the Flaming Mountains in the monochrome illusion. Players are advised to focus on attacking aggressively during the first phase while conserving spells for the more challenging second phase. Zhu Bajie assists initially, emphasizing teamwork in the early part of the battle."
}