{
    "chunk_id": 636811316399,
    "source_file": "Bitter_Lake_Walkthrough.md",
    "h1_title": "Bitter Lake Walkthrough",
    "h2_title": "Boss Fight - Chen Loong",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2e/Wukong_Bitter_10.jpg",
    "alt_text": "Wukong Bitter 10.jpg",
    "position_desc": 48,
    "img_above_text": "# Bitter Lake Walkthrough\n\nAs you draw close, you'll hear a voice coming from the cymbals, who is arguing with a woman refusing to let the trapped person out. With a loud gong, the trapped \"Admiral\" will use the cymbal to awaken a giant turtle whose mountainous shell you're actually standing on.\n\nAs the turtle begins to swim through the Bitter Seal, the woman will become aware of your presence, starting this new region off with a bang of a boss fight.\n\n\nAs long as your patient to wait for the right moments to get in close and attack, and make sure you're using shock-quelling medicine, you'll be able to come out on top. Even as Kang-Jin Star tries to flee in her dragon form, the Destined One will see to it that she crashes into the large cymbals, freeing the prisoner inside!\n\nThis imprisoned Pig Guai is none other than Zhu Bajie, who traveled with Sun Wukong during his adventures in Journey to the West!\n\n\nAs you start exploring the path over to the right, an echoing voice will lead you to a large open platform where dragon humanoid figure appears to be frozen in place with its fishing rod. If you interact with it while holding the Loong Scales, it will crackle to life, and begin a new secret boss fight.\n\n\nWhen he falls, you'll earn some Fine Gold Thread and another Loong Pearl, and can loot a nearby chest that appears for the Mountain-Shaking Claw material and Breath of Fire Soak for your Gourd. This new material will unlock the upgrade path for your Loongwreathe Staff into the Golden Loong Staff, but you'll need to find and defeat the last of the four Loongs to craft it.\n\nOnce you've had your fill of exploring the \"Turtle Island\", you can head to the front where the small Pig Guai stands waiting, and interact with him for the turtle to finally make its landing at the next part of the Bitter Lake.\n\n\nStart by heading along the shore and defeating various Frozen Corpses, and look for a small building in the distance by the water's edge. As you near it, you can also spot a dragon man standing alone in the shallows. Zhu Bajie seems to know him, but as you approach, you'll be pulled into another boss fight.\n\n## Boss Fight - Chen Loong\n\nThe dragon won't just stop at wacking you with his tail up close, either. If he proclaims \"To the deepest trench I dive!\" Be ready for him to stick his tail in the ground, only for several giant electrified tails to sprout up in a cluster nearby. You'll need to quickly break off your attack and give them a wide berth, as they'll quickly perform a single huge spin attack all at once!",
    "img_below_text": "Other times, he may only summon one smaller tail, but this one can expel its electrical energy in a projectile blast when the tail swings.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bitter Lake Walkthrough\n            - Section Title: Boss Fight - Chen Loong\n\n            Context:\n            - Preceding Text: \"# Bitter Lake Walkthrough\n\nAs you draw close, you'll hear a voice coming from the cymbals, who is arguing with a woman refusing to let the trapped person out. With a loud gong, the trapped \"Admiral\" will use the cymbal to awaken a giant turtle whose mountainous shell you're actually standing on.\n\nAs the turtle begins to swim through the Bitter Seal, the woman will become aware of your presence, starting this new region off with a bang of a boss fight.\n\n\nAs long as your patient to wait for the right moments to get in close and attack, and make sure you're using shock-quelling medicine, you'll be able to come out on top. Even as Kang-Jin Star tries to flee in her dragon form, the Destined One will see to it that she crashes into the large cymbals, freeing the prisoner inside!\n\nThis imprisoned Pig Guai is none other than Zhu Bajie, who traveled with Sun Wukong during his adventures in Journey to the West!\n\n\nAs you start exploring the path over to the right, an echoing voice will lead you to a large open platform where dragon humanoid figure appears to be frozen in place with its fishing rod. If you interact with it while holding the Loong Scales, it will crackle to life, and begin a new secret boss fight.\n\n\nWhen he falls, you'll earn some Fine Gold Thread and another Loong Pearl, and can loot a nearby chest that appears for the Mountain-Shaking Claw material and Breath of Fire Soak for your Gourd. This new material will unlock the upgrade path for your Loongwreathe Staff into the Golden Loong Staff, but you'll need to find and defeat the last of the four Loongs to craft it.\n\nOnce you've had your fill of exploring the \"Turtle Island\", you can head to the front where the small Pig Guai stands waiting, and interact with him for the turtle to finally make its landing at the next part of the Bitter Lake.\n\n\nStart by heading along the shore and defeating various Frozen Corpses, and look for a small building in the distance by the water's edge. As you near it, you can also spot a dragon man standing alone in the shallows. Zhu Bajie seems to know him, but as you approach, you'll be pulled into another boss fight.\n\n## Boss Fight - Chen Loong\n\nThe dragon won't just stop at wacking you with his tail up close, either. If he proclaims \"To the deepest trench I dive!\" Be ready for him to stick his tail in the ground, only for several giant electrified tails to sprout up in a cluster nearby. You'll need to quickly break off your attack and give them a wide berth, as they'll quickly perform a single huge spin attack all at once!\"\n            - Following Text: \"Other times, he may only summon one smaller tail, but this one can expel its electrical energy in a projectile blast when the tail swings.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes a narrative within the Bitter Lake Walkthrough, where players encounter various characters and events. It mentions a giant turtle awakening and swimming through Bitter Seal, leading to a series of interactions and battles, including freeing Zhu Bajie from imprisonment. Players explore Turtle Island, engage in secret boss fights, and collect materials to upgrade their equipment.\n\nImage Summary:\nThe image depicts a boss fight scene from the Bitter Lake Walkthrough, specifically against Chen Loong. The scene shows the player character engaged in combat with Chen Loong, who is using an electrified attack. The environment suggests a dynamic and intense battle, with visual effects highlighting the electrified tails mentioned in the context.\n\nFollowing Text Summary:\nThe following text provides additional details about the boss fight with Chen Loong. It describes his attack patterns, including the summoning of electrified tails that perform a spin attack. Players are advised to avoid these attacks by breaking off their own offensive moves and keeping a safe distance."
}