{
    "chunk_id": 28048970897,
    "source_file": "Secrets_in_Black_Myth_Wukong.md",
    "h1_title": "Chapter 4 Secrets",
    "h2_title": "Skandha of Choice",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/6c/Five_Skandhas_%289%29.png",
    "alt_text": "Five Skandhas \\(9\\).png",
    "position_desc": 14,
    "img_above_text": "# Chapter 4 Secrets\n\n## Skandha of Choice",
    "img_below_text": "The Skandha of Choice can be found in Chapter 4. Go right from The Purifying Spring Keeper's Choice and up the stairs and through the gap in the wall. Follow this path along to the right, and cross the bridge. Then turn left and look for the white sacs that block a path going down. Smash through these and go down here to find a Buddha head, where the monkey from previous chapters will be sitting. Once the monkey has run off, take the Skandha of Choice from the Buddha's head.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chapter 4 Secrets\n            - Section Title: Skandha of Choice\n\n            Context:\n            - Preceding Text: \"# Chapter 4 Secrets\n\n## Skandha of Choice\"\n            - Following Text: \"The Skandha of Choice can be found in Chapter 4. Go right from The Purifying Spring Keeper's Choice and up the stairs and through the gap in the wall. Follow this path along to the right, and cross the bridge. Then turn left and look for the white sacs that block a path going down. Smash through these and go down here to find a Buddha head, where the monkey from previous chapters will be sitting. Once the monkey has run off, take the Skandha of Choice from the Buddha's head.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}