{
    "chunk_id": 156607008450,
    "source_file": "Black_Loong.md",
    "h1_title": "Black Loong",
    "h2_title": "Black Loong Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/73/Wukong_BlackLoong_11.jpg",
    "alt_text": "Wukong BlackLoong 11.jpg",
    "position_desc": 16,
    "img_above_text": "# Black Loong\n\nBlack Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Hidden beyond a waterfall of sand in the Fright Cliff, you won't be able to encounter this boss until you obtain a Key Item elswhere in this chapter, Black Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* **Rewards:** Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n\n\nWith the Loong Scales, you'll be able to interact with the sandfall and remove it as a barrier, revealing a door behind it to take you into the Black Loong's lair.\n\n## Black Loong Boss Fight and Guide\n\nOne method to evade reliably is to listen to the drum beats to anticipate the spacing of the rings, and then dodge parallel to Black Loong, moving from side to side as you evade, instead of toward the next ring or backward into a previous one. It will take a bit of practice, so having electric resistance augmented can help when you slip up.",
    "img_below_text": "Another cheekier way to evade this attack is to simply find some high ground. There are a few raised rocks in the arena — some that he may destroy over time — but can be used to get off the floor where the electric rings travel. There’s one large rock as you first enter the arena, two more near the back on either side of the stairs, and one more opposite the stairs in the far corner.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Black Loong\n            - Section Title: Black Loong Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Black Loong\n\nBlack Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Hidden beyond a waterfall of sand in the Fright Cliff, you won't be able to encounter this boss until you obtain a Key Item elswhere in this chapter, Black Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* **Rewards:** Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n\n\nWith the Loong Scales, you'll be able to interact with the sandfall and remove it as a barrier, revealing a door behind it to take you into the Black Loong's lair.\n\n## Black Loong Boss Fight and Guide\n\nOne method to evade reliably is to listen to the drum beats to anticipate the spacing of the rings, and then dodge parallel to Black Loong, moving from side to side as you evade, instead of toward the next ring or backward into a previous one. It will take a bit of practice, so having electric resistance augmented can help when you slip up.\"\n            - Following Text: \"Another cheekier way to evade this attack is to simply find some high ground. There are a few raised rocks in the arena — some that he may destroy over time — but can be used to get off the floor where the electric rings travel. There’s one large rock as you first enter the arena, two more near the back on either side of the stairs, and one more opposite the stairs in the far corner.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Black Loong, an optional secret boss in *Black Myth: Wukong*, encountered in Chapter 2. To access its lair, players must use the Loong Scales to remove a sandfall barrier. Defeating Black Loong rewards players with valuable crafting materials and items. The text also provides an initial strategy for evading one of Black Loong's electric ring attacks by dodging parallel to the boss.\n\nImage Summary:\nThe image depicts the player character facing Black Loong in a sandy, rocky arena. Red arrows highlight elevated rocks scattered throughout the battlefield, suggesting their importance as strategic high ground to avoid the electric ring attacks mentioned in the guide. The arena features a pagoda-like structure and rugged terrain, emphasizing the environmental elements relevant to the fight.\n\nFollowing Text Summary:\nThe following text elaborates on an alternative strategy for evading Black Loong's electric ring attacks by using elevated rocks in the arena. It identifies specific locations of these rocks, noting that while some may be destroyed during the fight, they can provide temporary safety from ground-based attacks."
}