{
    "chunk_id": 776405970789,
    "source_file": "Captain_Lotus-Vision.md",
    "h1_title": "Captain Lotus-Vision",
    "h2_title": "Where to Find Captain Lotus-Vision",
    "h3_title": "Captain Lotus-Vision Miniboss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/24/Wukong_Pagoda_32.jpg",
    "alt_text": "Wukong Pagoda 32.jpg",
    "position_desc": 2,
    "img_above_text": "# Captain Lotus-Vision\n\nCaptain Lotus-Vision is an optional miniboss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Responsible for sealing captives in the cells of the Pagoda Realm, you can find this boss in a secret chamber within the Pagoda Prison.\n\n* **Rewards:** Spirit of Captain Lotus-Vision, Frostsprout Twig, Mind Core, Cold Iron Leaves, 1847 Experience, 1198 Will\n\n## Where to Find Captain Lotus-Vision\n\nCaptain Lotus-Vision is one of the four captains you can find in Chapter 3, and is an optional Yaoguai Chief you can encounter in the Pagoda Realm.\n\nTo find him, you'll need to reach the Upper Pagoda Shrine on the third level of the prison. Just behind the shrine, there is a pit with purple light emanating below that you can drop into and find this boss.\n\n### Captain Lotus-Vision Miniboss Fight and Guide\n\nOne of four Captains of the Pagoda Realm, Captain Lotus-Vision is responsible for sealing many of the prison cells, and must be defeated before you can unlock them. He is a strange Yaoguai Chief, and doesn't really have any melee attacks to speak of, instead opting for a series of projectiles and lasers to attack you with. With that in mind, it's highly recommended that you equip the Cloud Step Spell over Rock Solid for help evading some of his attacks.",
    "img_below_text": "You'll find find Captain Lotus-Vision in front of a large group of kneeling corpses, which he can randomly imbue with magic to create a Withered Corpse that will come to life and attack you. These are nothing more than a distraction, but should still be dealt with immediately so they don't hamstring you later.\n\nLuckily, he'll get rid of all the corpses later in the fight, and they won't respawn for future attempts.\n\nMuch of this boss's power comes from a purple crystal mounted on the tip of a staff he carries against his shoulder, which will expend a variety of projectile attacks. Some will be easier to anticipate than others, but you'll always want to keep that crystal in view.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Captain Lotus-Vision\n            - Section Title: Where to Find Captain Lotus-Vision\n            - Sub-Section Title: Captain Lotus-Vision Miniboss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Captain Lotus-Vision\n\nCaptain Lotus-Vision is an optional miniboss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Responsible for sealing captives in the cells of the Pagoda Realm, you can find this boss in a secret chamber within the Pagoda Prison.\n\n* **Rewards:** Spirit of Captain Lotus-Vision, Frostsprout Twig, Mind Core, Cold Iron Leaves, 1847 Experience, 1198 Will\n\n## Where to Find Captain Lotus-Vision\n\nCaptain Lotus-Vision is one of the four captains you can find in Chapter 3, and is an optional Yaoguai Chief you can encounter in the Pagoda Realm.\n\nTo find him, you'll need to reach the Upper Pagoda Shrine on the third level of the prison. Just behind the shrine, there is a pit with purple light emanating below that you can drop into and find this boss.\n\n### Captain Lotus-Vision Miniboss Fight and Guide\n\nOne of four Captains of the Pagoda Realm, Captain Lotus-Vision is responsible for sealing many of the prison cells, and must be defeated before you can unlock them. He is a strange Yaoguai Chief, and doesn't really have any melee attacks to speak of, instead opting for a series of projectiles and lasers to attack you with. With that in mind, it's highly recommended that you equip the Cloud Step Spell over Rock Solid for help evading some of his attacks.\"\n            - Following Text: \"You'll find find Captain Lotus-Vision in front of a large group of kneeling corpses, which he can randomly imbue with magic to create a Withered Corpse that will come to life and attack you. These are nothing more than a distraction, but should still be dealt with immediately so they don't hamstring you later.\n\nLuckily, he'll get rid of all the corpses later in the fight, and they won't respawn for future attempts.\n\nMuch of this boss's power comes from a purple crystal mounted on the tip of a staff he carries against his shoulder, which will expend a variety of projectile attacks. Some will be easier to anticipate than others, but you'll always want to keep that crystal in view.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Captain Lotus-Vision as an optional miniboss in Chapter 3 of *Black Myth Wukong*. He is one of four captains in the Pagoda Realm and is responsible for sealing prisoners in the Pagoda Prison. Players can find him in a secret chamber beneath the Upper Pagoda Shrine. The text also mentions the rewards for defeating him and recommends strategies for the fight, such as using the Cloud Step Spell to evade his projectile and laser attacks.\n\nImage Summary:  \nThe image depicts the boss fight with Captain Lotus-Vision in a dimly lit chamber adorned with intricate carvings of statues on the walls. The boss, a floating figure wielding a glowing purple crystal, is surrounded by several enemies and emits a dark, magical aura. The player's interface is visible, showing health, abilities, and the boss's name and health bar, indicating an ongoing battle.\n\nFollowing Text Summary:  \nThe following text describes the mechanics of the fight, highlighting Captain Lotus-Vision's ability to animate kneeling corpses into Withered Corpses that attack the player. These corpses serve as distractions and should be dealt with promptly. Later in the fight, the corpses disappear permanently. The text also emphasizes the importance of the purple crystal on the boss's staff, which is the source of his powerful projectile attacks."
}