{
    "chunk_id": 889556646800,
    "source_file": "Bitter_Lake_Walkthrough.md",
    "h1_title": "Bitter Lake Walkthrough",
    "h2_title": "Yoaguai King Boss Fight - Kang-Jin Star",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f7/Wukong_Turtle_5.jpg",
    "alt_text": "Wukong Turtle 5.jpg",
    "position_desc": 5,
    "img_above_text": "# Bitter Lake Walkthrough\n\nAs you draw close, you'll hear a voice coming from the cymbals, who is arguing with a woman refusing to let the trapped person out. With a loud gong, the trapped \"Admiral\" will use the cymbal to awaken a giant turtle whose mountainous shell you're actually standing on.\n\nAs the turtle begins to swim through the Bitter Seal, the woman will become aware of your presence, starting this new region off with a bang of a boss fight.\n\n## Yoaguai King Boss Fight - Kang-Jin Star\n\nEven when you get in close range to fight, she has a few close-range lightning attacks to deal with. One starts with another mantra \"Spin...\" causing her to slash at you with lightning sweeps in two quick attacks, before performing a third attack while yelling \"and flush!\" This third attack can take the form of a floating downward slash, or creating a cross slash in front of her that moves outward. Whichever it is, a Cloud Step can let you bypass her attack by dodging to the side and then hit her from the flank.",
    "img_below_text": "Other times, watch her hand movements when attacking up close -- if she waves them around with electric energy before holding them at her side, be ready for an extremely quick lightning burst she'll slam down in front of her to block your advance.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bitter Lake Walkthrough\n            - Section Title: Yoaguai King Boss Fight - Kang-Jin Star\n\n            Context:\n            - Preceding Text: \"# Bitter Lake Walkthrough\n\nAs you draw close, you'll hear a voice coming from the cymbals, who is arguing with a woman refusing to let the trapped person out. With a loud gong, the trapped \"Admiral\" will use the cymbal to awaken a giant turtle whose mountainous shell you're actually standing on.\n\nAs the turtle begins to swim through the Bitter Seal, the woman will become aware of your presence, starting this new region off with a bang of a boss fight.\n\n## Yoaguai King Boss Fight - Kang-Jin Star\n\nEven when you get in close range to fight, she has a few close-range lightning attacks to deal with. One starts with another mantra \"Spin...\" causing her to slash at you with lightning sweeps in two quick attacks, before performing a third attack while yelling \"and flush!\" This third attack can take the form of a floating downward slash, or creating a cross slash in front of her that moves outward. Whichever it is, a Cloud Step can let you bypass her attack by dodging to the side and then hit her from the flank.\"\n            - Following Text: \"Other times, watch her hand movements when attacking up close -- if she waves them around with electric energy before holding them at her side, be ready for an extremely quick lightning burst she'll slam down in front of her to block your advance.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the setup for the Yoaguai King boss fight against Kang-Jin Star in the Bitter Lake region. The encounter begins after a dramatic sequence involving a cymbal awakening a giant turtle, which serves as the setting for the fight. Kang-Jin Star uses lightning-based attacks, including a sequence of slashes and a mantra-based attack pattern that players must dodge strategically.\n\nImage Summary:\nThe image depicts the intense Yoaguai King boss fight against Kang-Jin Star. The scene features a snowy battlefield with dramatic visual effects, including lightning energy and debris flying around. Kang-Jin Star, dressed in red, appears to be mid-attack, wielding a glowing weapon, while the player character counters with a fiery staff. The health bar at the bottom indicates the ongoing battle, and interface elements suggest available abilities or actions. The mountainous background adds to the epic atmosphere of the fight.\n\nFollowing Text Summary:\nThe following text provides additional details on Kang-Jin Star's close-range lightning attacks. It advises players to watch her hand movements, as they signal a quick lightning burst attack that she slams down to block advances. This emphasizes the importance of timing and observation during the fight."
}