{
    "chunk_id": 163337989669,
    "source_file": "Centipede_Guai.md",
    "h1_title": "Centipede Guai",
    "h2_title": "Centipede Guai Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/25/Wukong_MiddleHollow_42.jpg",
    "alt_text": "Wukong MiddleHollow 42.jpg",
    "position_desc": 3,
    "img_above_text": "# Centipede Guai\n\nThe Centipede Guai is a required Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the middle section of The Webbed Hollow, this imposing insect guards the Bonevault leading down to the lower parts of the hollow.\n\n* Rewards: Centipede Guai Spirit, Gold Tree Core, Knot of Voidness, 2274 Experience, 1968 Will\n\n\nThe Centipede Guai is an main boss and non-missable encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down to the Vedure Bridge Shrine, you'll find two paths divering when you head right to find a group of buildings in the underground hollow.\n\nBoth will take you on a path to the Centipede Guai's lair, either by way of the Middle Hollow Shrine and dropping down a ledge guarded by Skeletal Snakes, or taking the other lower path to the Bonevault Shrine that leads to his domain.\n\n## Centipede Guai Boss Fight and Guide\n\nWhen attacking from the front, he'll often slam down his head repeatedly to hit you with two times, and then quickly stand up while pivoting around to fall on its back to squash you with its armored hide. Be ready to dodge the third slam, and then immediately begin a combo attack while it struggles to rise up again.\n\nThe Centipede Guai can also perform two slow frontal sweeps with its main claws, alternating a claw on each side, but with its fairly slow swings you can step to the side to focus on its legs.",
    "img_below_text": "It can also rear back while still crouched on the ground, and extend its head to lunge at you up to two times in a row with reaching claw swipes.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Centipede Guai\n            - Section Title: Centipede Guai Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Centipede Guai\n\nThe Centipede Guai is a required Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the middle section of The Webbed Hollow, this imposing insect guards the Bonevault leading down to the lower parts of the hollow.\n\n* Rewards: Centipede Guai Spirit, Gold Tree Core, Knot of Voidness, 2274 Experience, 1968 Will\n\n\nThe Centipede Guai is an main boss and non-missable encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down to the Vedure Bridge Shrine, you'll find two paths divering when you head right to find a group of buildings in the underground hollow.\n\nBoth will take you on a path to the Centipede Guai's lair, either by way of the Middle Hollow Shrine and dropping down a ledge guarded by Skeletal Snakes, or taking the other lower path to the Bonevault Shrine that leads to his domain.\n\n## Centipede Guai Boss Fight and Guide\n\nWhen attacking from the front, he'll often slam down his head repeatedly to hit you with two times, and then quickly stand up while pivoting around to fall on its back to squash you with its armored hide. Be ready to dodge the third slam, and then immediately begin a combo attack while it struggles to rise up again.\n\nThe Centipede Guai can also perform two slow frontal sweeps with its main claws, alternating a claw on each side, but with its fairly slow swings you can step to the side to focus on its legs.\"\n            - Following Text: \"It can also rear back while still crouched on the ground, and extend its head to lunge at you up to two times in a row with reaching claw swipes.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Centipede Guai, a required boss fight in Chapter 4 of *Black Myth: Wukong*. It describes the boss's location in The Webbed Hollow and provides details on how to reach its lair via two paths. The Centipede Guai is a significant encounter, offering rewards such as experience points, items, and progression in the game. Initial combat strategies are outlined, focusing on dodging its head slams and claw sweeps while exploiting openings for attacks.\n\nImage Summary:\nThe image depicts the Centipede Guai boss fight in a dark, web-covered cavern filled with skeletal remains. The player character, wielding a glowing weapon, faces the massive insect-like boss, which has a segmented body, sharp legs, and a menacing appearance. The health bar labeled \"Centipede Guai\" is visible, indicating an active battle. The game's interface displays player abilities and status, emphasizing the combat-focused nature of the scene.\n\nFollowing Text Summary:\nThe following text elaborates on additional attack patterns of the Centipede Guai, including a crouched lunge with extended claw swipes performed twice in succession. It provides further guidance for players to anticipate and counter these moves during the fight."
}