{
    "chunk_id": 924441942180,
    "source_file": "Wind_Tamer.md",
    "h1_title": "Wind Tamer",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/58/Wind_Tamer.jpg",
    "alt_text": "Wind Tamer.jpg",
    "position_desc": 1,
    "img_above_text": "# Wind Tamer\n\nThe Wind Tamer is one of the Vessels you can find in Black Myth: Wukong. These Vessels give you unique, powerful abilities that can significantly affect your gameplay and how you play.\n\nSimply equipping the Wind Tamer will significantly increase damage reduction during your playthrough, making it a great Vessel to have and arguably one of the best. Activating it during combat or exploration will massively increase your damage reduction for a short duration and grant immunity to strong winds, which is useful against enemies in Yellow Wind Ridge and in a few later game locations.",
    "img_below_text": "Vessels are so strong by default that they can completely change how you approach fights, or get you through really tough, tight battles. There are only a few of them in the game, however. Finding Black Myth: Wukong's secrets and killing some of the Black Myth: Wukong secret bosses will lead you to them.\n\n## Black Myth: Wukong Wind Tamer Location\n\nThe Wind Tamer can be found upon defeating Fuban in Secret: Kingdom of Sahali area in Yellow Wind Ridge. This will require you to complete the full Boar-Man questline",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Wind Tamer\n\n            Context:\n            - Preceding Text: \"# Wind Tamer\n\nThe Wind Tamer is one of the Vessels you can find in Black Myth: Wukong. These Vessels give you unique, powerful abilities that can significantly affect your gameplay and how you play.\n\nSimply equipping the Wind Tamer will significantly increase damage reduction during your playthrough, making it a great Vessel to have and arguably one of the best. Activating it during combat or exploration will massively increase your damage reduction for a short duration and grant immunity to strong winds, which is useful against enemies in Yellow Wind Ridge and in a few later game locations.\"\n            - Following Text: \"Vessels are so strong by default that they can completely change how you approach fights, or get you through really tough, tight battles. There are only a few of them in the game, however. Finding Black Myth: Wukong's secrets and killing some of the Black Myth: Wukong secret bosses will lead you to them.\n\n## Black Myth: Wukong Wind Tamer Location\n\nThe Wind Tamer can be found upon defeating Fuban in Secret: Kingdom of Sahali area in Yellow Wind Ridge. This will require you to complete the full Boar-Man questline\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}