{
    "chunk_id": 825859857482,
    "source_file": "Crouching_Tiger_Temple_Walkthrough.md",
    "h1_title": "Crouching Tiger Temple Walkthrough",
    "h2_title": "Yaoguai King Boss Fight - Tiger Vanguard",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/31/Wukong_Tiger_18.jpg",
    "alt_text": "Wukong Tiger 18.jpg",
    "position_desc": 16,
    "img_above_text": "# Crouching Tiger Temple Walkthrough\n\nOnce you reach the top, you’ll come face to bloody face with the Tiger Vanguard, who looks like he just found his next meal.\n\n## Yaoguai King Boss Fight - Tiger Vanguard\n\nThe last hit he’ll try to throw you off by spinning in place before the swing, so don’t be fooled! While there’s a chance he’ll perform a flourish and sheathe his sword after this, it’s more likely he’ll try to fool you again before starting up a second combo, which comes in three quick slashes with no delay at the end.\n\nIf you try to retreat from the second combo, be warned that he can slice the bloody water to form waves of force as projectile slices with three hits, so you’ll need to keep dodging either way.",
    "img_below_text": "There’s also the chance he can start the sword combo while doing a spinning retreating jump, sneakily taking out the blade in a reverse grip in the process. He’ll retaliate with a quick reverse slash, before getting a proper grip on the blade for two more quick slices, and then begin the normal combo attack.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Crouching Tiger Temple Walkthrough\n            - Section Title: Yaoguai King Boss Fight - Tiger Vanguard\n\n            Context:\n            - Preceding Text: \"# Crouching Tiger Temple Walkthrough\n\nOnce you reach the top, you’ll come face to bloody face with the Tiger Vanguard, who looks like he just found his next meal.\n\n## Yaoguai King Boss Fight - Tiger Vanguard\n\nThe last hit he’ll try to throw you off by spinning in place before the swing, so don’t be fooled! While there’s a chance he’ll perform a flourish and sheathe his sword after this, it’s more likely he’ll try to fool you again before starting up a second combo, which comes in three quick slashes with no delay at the end.\n\nIf you try to retreat from the second combo, be warned that he can slice the bloody water to form waves of force as projectile slices with three hits, so you’ll need to keep dodging either way.\"\n            - Following Text: \"There’s also the chance he can start the sword combo while doing a spinning retreating jump, sneakily taking out the blade in a reverse grip in the process. He’ll retaliate with a quick reverse slash, before getting a proper grip on the blade for two more quick slices, and then begin the normal combo attack.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Tiger Vanguard, a fierce boss encountered at the top of the Crouching Tiger Temple. It describes the boss's attack patterns, including spinning maneuvers and deceptive flourishes, followed by a second combo of three quick slashes. Players are warned about retreating, as the boss can unleash projectile force waves from the bloody water.\n\nImage Summary:\nThe image depicts the Tiger Vanguard, a large tiger-like creature, engaged in combat with the player character in a blood-red environment. The boss is mid-action, showcasing its ferocity and physical dominance. The player's health and ability icons are visible, along with the Tiger Vanguard's health bar, emphasizing the intensity of the battle.\n\nFollowing Text Summary:\nThe following text elaborates on the Tiger Vanguard's attack patterns, including a spinning retreating jump where it unsheathes its sword in reverse grip. This is followed by a quick reverse slash and two additional slices before transitioning into its standard combo attack. Players are advised to anticipate these moves and strategize accordingly."
}