{
    "chunk_id": 424670113342,
    "source_file": "Bamboo_Grove_Walkthrough.md",
    "h1_title": "Bamboo Grove Walkthrough",
    "h2_title": "Snake Trail",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/74/Wukong_Bamboo_10.jpg",
    "alt_text": "Wukong Bamboo 10.jpg",
    "position_desc": 11,
    "img_above_text": "# Bamboo Grove Walkthrough\n\nThe Bamboo Grove is the second main region of Chapter 1's Black Wind Mountain in Black Myth: Wukong. Below you'll find a guide to the progressing through the grove and learning how to cultivate Spirits, accessing a secret realm, as well as how to defeat the many bosses of this area that include Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble.\n\n* **Jump to A Section:**\n* **Back Hills**\n* **Snake Trail**\n- Yaoguai Chief - Baw-Li-Guhh-Lang\n- Yaoguai Chief - Guangmo\n* **Marsh of the White Mist**\n- Boss FIght - Whiteclad Noble\n\n\nTo advance, keep heading up the stairway to cross the high bridge over the falls, where you’ll soon see the golden trail of a nearby shrine beckoning you left. Before making that turn, be sure to look to the right to find a small wooden gazebo with a small table, and open the small gold box on top to find a variety of medicines, including 2 **Tiger Subduing Pellets** , 1 **Evil Repelling Medicament** and 1 **Amplification Pellet**.\n\n## Snake Trail\n\nWhen you’re ready to proceed, head across the large bridge to find a new type of enemy, the Snake Patroller. These spear-wielding snake-men will stand up straight up before lunging at you with a bite that inflicts major damage while poisoning you, which may force you to use Anti-miasma powder to negate its effects. They can also put their spear in their teeth and dash with it held horizontally to swing it about in a combo attack.",
    "img_below_text": "Once you’ve cleared the snake, check out the next area to find another Snake-Head Mushroom, and continue along the path to a field of bones. Three bodies will come to life as Skeletal Snakes. Thankfully, since it takes a moment for them to come to life, and they are fairly weak, they’ll fall to only a couple of staff strikes — usually before they can try to grab at you.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bamboo Grove Walkthrough\n            - Section Title: Snake Trail\n\n            Context:\n            - Preceding Text: \"# Bamboo Grove Walkthrough\n\nThe Bamboo Grove is the second main region of Chapter 1's Black Wind Mountain in Black Myth: Wukong. Below you'll find a guide to the progressing through the grove and learning how to cultivate Spirits, accessing a secret realm, as well as how to defeat the many bosses of this area that include Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble.\n\n* **Jump to A Section:**\n* **Back Hills**\n* **Snake Trail**\n- Yaoguai Chief - Baw-Li-Guhh-Lang\n- Yaoguai Chief - Guangmo\n* **Marsh of the White Mist**\n- Boss FIght - Whiteclad Noble\n\n\nTo advance, keep heading up the stairway to cross the high bridge over the falls, where you’ll soon see the golden trail of a nearby shrine beckoning you left. Before making that turn, be sure to look to the right to find a small wooden gazebo with a small table, and open the small gold box on top to find a variety of medicines, including 2 **Tiger Subduing Pellets** , 1 **Evil Repelling Medicament** and 1 **Amplification Pellet**.\n\n## Snake Trail\n\nWhen you’re ready to proceed, head across the large bridge to find a new type of enemy, the Snake Patroller. These spear-wielding snake-men will stand up straight up before lunging at you with a bite that inflicts major damage while poisoning you, which may force you to use Anti-miasma powder to negate its effects. They can also put their spear in their teeth and dash with it held horizontally to swing it about in a combo attack.\"\n            - Following Text: \"Once you’ve cleared the snake, check out the next area to find another Snake-Head Mushroom, and continue along the path to a field of bones. Three bodies will come to life as Skeletal Snakes. Thankfully, since it takes a moment for them to come to life, and they are fairly weak, they’ll fall to only a couple of staff strikes — usually before they can try to grab at you.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Bamboo Grove region in *Black Myth: Wukong*, specifically focusing on the Snake Trail section. It describes the initial encounter with Snake Patrollers, spear-wielding enemies that inflict poison and perform combo attacks. Players are advised to use Anti-miasma powder to counteract the poison and prepare for challenging combat scenarios.\n\nImage Summary:\nThe image depicts a gameplay scene from the Snake Trail section of *Black Myth: Wukong*. The player character, armed with a staff, is positioned in a muddy, bone-littered field surrounded by skeletal snake enemies. The environment features bamboo trees, wooden structures, and a dark, ominous atmosphere, emphasizing the combat-focused progression through this area.\n\nFollowing Text Summary:\nThe following text explains the next steps after encountering the skeletal snake enemies shown in the image. Players are advised to defeat the weak Skeletal Snakes quickly before they fully animate and attack. The path continues through the field of bones, advancing the narrative and gameplay within the Snake Trail section."
}