{
    "chunk_id": 396008546625,
    "source_file": "Earth_Rakshasa_Spirit.md",
    "h1_title": "Earth Rakshasa Spirit",
    "h2_title": "Earth Rakshasa Spirit",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9e/Shield_Spirit.jpg",
    "alt_text": "Shield Spirit.jpg",
    "position_desc": 3,
    "img_above_text": "# Earth Rakshasa Spirit\n\n\n\nEarth Rakshasa enemies are one of the more difficult overworld enemies in Black Myth: Wukong. They are armed with giant, metal shields akin to those of Spearbones and use them to perform a similar charge move. Unlike Spearbones, however, the Earth Rakshasa can also create an explosion of fire to damage you even further.\n\nTo defeat the Earth Rakshasa, hang back and wait until the enemy charges you. Dodge to the side just before the attack hits and quickly run back to hit it in the back and damage the Earth Rakshasa's body instead of its shield. It can be difficult to get around the shield, but casting Immobilize makes it much easier if you're struggling.\n\n## Earth Rakshasa Spirit",
    "img_below_text": "* **Bulwark Shield**\n* Equipped Effect: Moderately increases Damage Reduction for a short duration after being hit.\n\nThe Earth Rakshasa's Spirit allows you to take the form of the creature and charge forward before smashing its giant shield into the ground, creating a barrier between you and your enemies. This not only damages foes but also creates a blockade, protecting you from enemy attacks while the shield remains. This can be an excellent way to block yourself from your enemy for a moment to take a sip from your Gourd or take some Medicine in relative safety.\n\nThe equipped effect is also defensive, increasing your Damage Reduction after you get hit. This allows you to take less damage when experiencing a bombardment of attacks.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Earth Rakshasa Spirit\n            - Section Title: Earth Rakshasa Spirit\n\n            Context:\n            - Preceding Text: \"# Earth Rakshasa Spirit\n\n\n\nEarth Rakshasa enemies are one of the more difficult overworld enemies in Black Myth: Wukong. They are armed with giant, metal shields akin to those of Spearbones and use them to perform a similar charge move. Unlike Spearbones, however, the Earth Rakshasa can also create an explosion of fire to damage you even further.\n\nTo defeat the Earth Rakshasa, hang back and wait until the enemy charges you. Dodge to the side just before the attack hits and quickly run back to hit it in the back and damage the Earth Rakshasa's body instead of its shield. It can be difficult to get around the shield, but casting Immobilize makes it much easier if you're struggling.\n\n## Earth Rakshasa Spirit\"\n            - Following Text: \"* **Bulwark Shield**\n* Equipped Effect: Moderately increases Damage Reduction for a short duration after being hit.\n\nThe Earth Rakshasa's Spirit allows you to take the form of the creature and charge forward before smashing its giant shield into the ground, creating a barrier between you and your enemies. This not only damages foes but also creates a blockade, protecting you from enemy attacks while the shield remains. This can be an excellent way to block yourself from your enemy for a moment to take a sip from your Gourd or take some Medicine in relative safety.\n\nThe equipped effect is also defensive, increasing your Damage Reduction after you get hit. This allows you to take less damage when experiencing a bombardment of attacks.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the Earth Rakshasa as a challenging enemy in the game \"Black Myth: Wukong.\" It is equipped with a large metal shield and can perform a charge attack and create a fire explosion. To defeat it, players are advised to dodge its charge and attack from behind, with the suggestion to use the Immobilize ability to bypass its shield.\n\nImage Summary:\nThe image displays the in-game equipment menu for the Earth Rakshasa Spirit in \"Black Myth: Wukong.\" It highlights the spirit's abilities, including taking the form of the Earth Rakshasa, using a heavy shield to damage enemies, and creating a defensive blockade. The interface shows various spirits available for selection, with the Earth Rakshasa Spirit being the focus.\n\nFollowing Text Summary:\nThe following text elaborates on the Earth Rakshasa Spirit's abilities. It explains that the spirit allows the player to charge forward and use a giant shield to create a barrier, providing both offensive and defensive benefits. The equipped effect enhances damage reduction after being hit, offering protection during enemy attacks."
}