{
    "chunk_id": 235659202801,
    "source_file": "Cuo_Jin-Yin_Belt_Hook.md",
    "h1_title": "Cuo Jin-Yin Belt Hook",
    "h2_title": "Black Myth: Wukong Cuo Jin-Yin Belt Hook Location",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b1/Wukong_UpperHollow_2.jpg",
    "alt_text": "Wukong UpperHollow 2.jpg",
    "position_desc": 1,
    "img_above_text": "# Cuo Jin-Yin Belt Hook\n\nThe Cuo Jin-Yin Belt Hook is one of the many Curios items you can find in Black Myth: Wukong. Like the rest of these items, once found, it can be equipped from the Equipment menu.\n\nWith the Cuo Jin-Yin Belt Hook equipped your Poison resistance is moderately increased.\n\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, the item will stay at its current power throughout the game. If you want a better buff or something else to fit your build, you will need to switch it out.\n\n## Black Myth: Wukong Cuo Jin-Yin Belt Hook Location\n\nThe Cuo Jin-Yin Belt Hook is located in the Village of Lanxi in The Webbed Hollow. Upon defeating The Second Sister and waking up underground, it can be found in a chest.",
    "img_below_text": "For even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Cuo Jin-Yin Belt Hook\n            - Section Title: Black Myth: Wukong Cuo Jin-Yin Belt Hook Location\n\n            Context:\n            - Preceding Text: \"# Cuo Jin-Yin Belt Hook\n\nThe Cuo Jin-Yin Belt Hook is one of the many Curios items you can find in Black Myth: Wukong. Like the rest of these items, once found, it can be equipped from the Equipment menu.\n\nWith the Cuo Jin-Yin Belt Hook equipped your Poison resistance is moderately increased.\n\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, the item will stay at its current power throughout the game. If you want a better buff or something else to fit your build, you will need to switch it out.\n\n## Black Myth: Wukong Cuo Jin-Yin Belt Hook Location\n\nThe Cuo Jin-Yin Belt Hook is located in the Village of Lanxi in The Webbed Hollow. Upon defeating The Second Sister and waking up underground, it can be found in a chest.\"\n            - Following Text: \"For even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Cuo Jin-Yin Belt Hook, a Curios item in *Black Myth: Wukong*. It explains that the item provides a moderate increase in Poison resistance when equipped but cannot be upgraded. The text also specifies its location in the Village of Lanxi within The Webbed Hollow, where it is found in a chest after defeating The Second Sister and waking up underground.\n\nImage Summary:  \nThe image depicts a character navigating a dark, rocky, and web-covered underground area. A red circle highlights a chest in the distance, indicating the location of the Cuo Jin-Yin Belt Hook as described in the preceding text. The inventory on the screen shows items recently acquired, such as Antimiasma Powder and Longevity Decoction, suggesting exploration and item collection in this area.\n\nFollowing Text Summary:  \nThe following text encourages players to explore additional guides for locating other items in *Black Myth: Wukong*, including Drinks, Soaks, Weapons, Armor, and Gear sets, providing further assistance for item discovery and gameplay optimization."
}