{
    "chunk_id": 776640306415,
    "source_file": "Bitter_Lake_Walkthrough.md",
    "h1_title": "Bitter Lake Walkthrough",
    "h2_title": "Yoaguai King Boss Fight - Kang-Jin Star",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4c/Wukong_Turtle_4.jpg",
    "alt_text": "Wukong Turtle 4.jpg",
    "position_desc": 4,
    "img_above_text": "# Bitter Lake Walkthrough\n\nAs you draw close, you'll hear a voice coming from the cymbals, who is arguing with a woman refusing to let the trapped person out. With a loud gong, the trapped \"Admiral\" will use the cymbal to awaken a giant turtle whose mountainous shell you're actually standing on.\n\nAs the turtle begins to swim through the Bitter Seal, the woman will become aware of your presence, starting this new region off with a bang of a boss fight.\n\n## Yoaguai King Boss Fight - Kang-Jin Star\n\nOften after proclaiming \"Tremors forge thunder\" she can create electrical spots on the ground to erupt with lightning after a moment. The problem is these rings will follow you for a moment before she enacts the strike, so again you'll need to watch when she crackles with light to know the strike is coming and dodge it. At the start of the fight you'll only have to dodge one, but over time she'll do more and more of these for the first part of her attack.\n\nShe'll often follow up these strikes by finishing her sentence with \"clashes form bolts\" and then toss a projectile straight at you from her hand, requiring a second dodge before can get close and retaliate.",
    "img_below_text": "Even when you get in close range to fight, she has a few close-range lightning attacks to deal with. One starts with another mantra \"Spin...\" causing her to slash at you with lightning sweeps in two quick attacks, before performing a third attack while yelling \"and flush!\" This third attack can take the form of a floating downward slash, or creating a cross slash in front of her that moves outward. Whichever it is, a Cloud Step can let you bypass her attack by dodging to the side and then hit her from the flank.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bitter Lake Walkthrough\n            - Section Title: Yoaguai King Boss Fight - Kang-Jin Star\n\n            Context:\n            - Preceding Text: \"# Bitter Lake Walkthrough\n\nAs you draw close, you'll hear a voice coming from the cymbals, who is arguing with a woman refusing to let the trapped person out. With a loud gong, the trapped \"Admiral\" will use the cymbal to awaken a giant turtle whose mountainous shell you're actually standing on.\n\nAs the turtle begins to swim through the Bitter Seal, the woman will become aware of your presence, starting this new region off with a bang of a boss fight.\n\n## Yoaguai King Boss Fight - Kang-Jin Star\n\nOften after proclaiming \"Tremors forge thunder\" she can create electrical spots on the ground to erupt with lightning after a moment. The problem is these rings will follow you for a moment before she enacts the strike, so again you'll need to watch when she crackles with light to know the strike is coming and dodge it. At the start of the fight you'll only have to dodge one, but over time she'll do more and more of these for the first part of her attack.\n\nShe'll often follow up these strikes by finishing her sentence with \"clashes form bolts\" and then toss a projectile straight at you from her hand, requiring a second dodge before can get close and retaliate.\"\n            - Following Text: \"Even when you get in close range to fight, she has a few close-range lightning attacks to deal with. One starts with another mantra \"Spin...\" causing her to slash at you with lightning sweeps in two quick attacks, before performing a third attack while yelling \"and flush!\" This third attack can take the form of a floating downward slash, or creating a cross slash in front of her that moves outward. Whichever it is, a Cloud Step can let you bypass her attack by dodging to the side and then hit her from the flank.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the \"Yoaguai King Boss Fight - Kang-Jin Star,\" describing the boss's initial attack patterns. The boss uses lightning-based abilities, including ground-targeted strikes that follow the player before erupting and a projectile attack that requires precise dodging. The fight begins with manageable attacks that escalate in intensity over time.\n\nImage Summary:  \nThe image depicts a dynamic moment from the boss fight against Kang-Jin Star. The scene shows a snowy battlefield where the boss is mid-attack, unleashing a powerful lightning strike. The player character appears to be struck or in the process of dodging, with visible effects like sparks, lightning arcs, and environmental details such as a barren tree and rocky terrain. The user interface displays health bars, ability icons, and the boss's name, emphasizing the combat-focused nature of the encounter.\n\nFollowing Text Summary:  \nThe following text elaborates on the boss's close-range attacks, which are triggered by specific mantras. Kang-Jin Star uses a combination of quick lightning slashes and a more powerful third attack, which can vary in form. Players are advised to use a \"Cloud Step\" maneuver to evade these attacks and counter from the flank."
}