{
    "chunk_id": 30642098398,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "h1_title": "Furnace Valley Walkthrough",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/93/Furnace_Valley_Walkthrough_%2811%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(11\\).png",
    "position_desc": 3,
    "img_above_text": "# Furnace Valley Walkthrough\n\nGo straight up toward the valley, but be careful as you explore the area. Some of the rocks in this area glow with lava, and that's because they're actually Searing-Fire enemies. These resemble the Palestones from Chapter 2 and are particularly annoying. They will leap in the air and drop on their back and front to cause explosions. For the sake of unlocking portraits, you can defeat just one and ignore the others.",
    "img_below_text": "Continue straight up, following the gold trail to the Valley Entrance Keeper's Shrine. It's protected by an Earth Rakshasa, so either use heavy attacks to break down its shield, or get behind it to tackle it. When you've dealt with it, activate the Keeper's Shrine.\n\n### Return to the Pale-Axe Stalwart\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n## Valley Entrance",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Furnace Valley Walkthrough\n\n            Context:\n            - Preceding Text: \"# Furnace Valley Walkthrough\n\nGo straight up toward the valley, but be careful as you explore the area. Some of the rocks in this area glow with lava, and that's because they're actually Searing-Fire enemies. These resemble the Palestones from Chapter 2 and are particularly annoying. They will leap in the air and drop on their back and front to cause explosions. For the sake of unlocking portraits, you can defeat just one and ignore the others.\"\n            - Following Text: \"Continue straight up, following the gold trail to the Valley Entrance Keeper's Shrine. It's protected by an Earth Rakshasa, so either use heavy attacks to break down its shield, or get behind it to tackle it. When you've dealt with it, activate the Keeper's Shrine.\n\n### Return to the Pale-Axe Stalwart\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n## Valley Entrance\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the Furnace Valley area, warning of Searing-Fire enemies disguised as glowing rocks. These enemies resemble Palestones from Chapter 2 and are known for explosive attacks. Players are advised to defeat one for unlocking portraits and avoid unnecessary confrontations.\n\nImage Summary:\nThe image depicts a dark, rocky valley with glowing lava-like elements. A shrine-like structure, identified as the Valley Entrance Keeper's Shrine, is visible, along with a humanoid figure wielding a glowing weapon. The shrine appears to be a key narrative location, likely requiring interaction or activation as part of the walkthrough.\n\nFollowing Text Summary:\nThe following text instructs players to proceed to the Valley Entrance Keeper's Shrine, guarded by an Earth Rakshasa enemy. Strategies for defeating the Rakshasa include heavy attacks or flanking. Once defeated, players are directed to activate the shrine and continue their exploration toward the next objective."
}