{
    "chunk_id": 113408827152,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "h1_title": "Furnace Valley Walkthrough",
    "h2_title": "Valley Entrance",
    "h3_title": "A Note on Flamlings",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7b/Furnace_Valley_Walkthrough_%2832%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(32\\).png",
    "position_desc": 13,
    "img_above_text": "# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n## Valley Entrance\n\nUltimately, you're going to go left to continue on the main path (and you may start to hear characters talk as you approach this pillar), but for now, you'll want to detour and explore the area to the right.\n\nThe first thing you'll see as you go to the right is the Flamlings that sit in the lava. These will spit fire at you, so it's best to deal with them to remove the ranged attacks while you explore.\n\n### A Note on Flamlings\n\nGo left, at the first lava stream you can see running from the ceiling. Take another left, so you're heading back on yourself (just on the lower level) toward where you started Furnace Valley.",
    "img_below_text": "Right at the end of this path, you'll find a Turtle Treasure guarding a chest. This Turtle Treasure holds a Spirit for you to collect once you've beaten it. After grabbing the Turtle Treasure Spirit, open the chest to collect Kun Steel, Knot of Voidness, and Medicines.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Furnace Valley Walkthrough\n            - Section Title: Valley Entrance\n            - Sub-Section Title: A Note on Flamlings\n\n            Context:\n            - Preceding Text: \"# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n## Valley Entrance\n\nUltimately, you're going to go left to continue on the main path (and you may start to hear characters talk as you approach this pillar), but for now, you'll want to detour and explore the area to the right.\n\nThe first thing you'll see as you go to the right is the Flamlings that sit in the lava. These will spit fire at you, so it's best to deal with them to remove the ranged attacks while you explore.\n\n### A Note on Flamlings\n\nGo left, at the first lava stream you can see running from the ceiling. Take another left, so you're heading back on yourself (just on the lower level) toward where you started Furnace Valley.\"\n            - Following Text: \"Right at the end of this path, you'll find a Turtle Treasure guarding a chest. This Turtle Treasure holds a Spirit for you to collect once you've beaten it. After grabbing the Turtle Treasure Spirit, open the chest to collect Kun Steel, Knot of Voidness, and Medicines.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text provides guidance for players exploring the \"Valley Entrance\" section of the Furnace Valley Walkthrough. It advises players to initially detour to the right to deal with Flamlings, fire-spitting enemies that pose a ranged threat, before continuing on the main path.\n\nImage Summary:  \nThe image depicts a dark, lava-filled environment with glowing streams of molten rock. A player character, equipped with a weapon and armor, faces a large, menacing creature resembling a Turtle Treasure. Behind the creature, a treasure chest is visible, suggesting the area is a combat encounter with rewards for defeating the enemy.\n\nFollowing Text Summary:  \nThe following text explains that defeating the Turtle Treasure enemy will grant the player a Spirit and access to the treasure chest. The chest contains valuable items, including Kun Steel, Knot of Voidness, and Medicines, which are rewards for completing this encounter."
}