{
    "chunk_id": 786066559297,
    "source_file": "Sandgate_Village_Walkthrough.md",
    "h1_title": "Sandgate Village Walkthrough",
    "h2_title": "Village Entrance",
    "h3_title": "Yaoguai Chief Mini-Boss Fight - Earth Wolf",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9c/Wukong_Sandgate_46.jpg",
    "alt_text": "Wukong Sandgate 46.jpg",
    "position_desc": 44,
    "img_above_text": "# Sandgate Village Walkthrough\n\nIn Black Myth Wukong’s second chapter, you’ll leave behind the forests of Black Wind Mountain for the dry sands of the Yellow Wind Ridge. An energetic (yet headless) man playing a Chinese lute (known as a sanxian) will set the stage for this realm, and helpfully revive our Destined One from becoming a pincushion full of arrows.\n\n\nKeep following it along some wooden scaffolding above a ravine leading back to the pit, and you’ll see a settlement up ahead, plus the first of the Keeper’s Shrines guarded by another Rat Soldier.\n\n## Village Entrance\n\nThe Xu Dog as he’s known has a problem he needs help with: A large frog has swallowed one of his medicinal formulas, and you’re just the person he’s looking for to get it back.\n\n\nHeading to the left of the lone shack, you’ll find a gate guarded by a Rat Governor and another Archer on the rooftops that connects to the one you climbed earlier. Defeat them to gain access to a large open field inside the Village’s main area. From across the field, a voice pleading to be freed calls out, but in your way is a large loping creature that will want to engage you first.\n\n### Yaoguai Chief Mini-Boss Fight - Earth Wolf\n\nBe sure to head on over to the altar with the tiger statue to find the source of the person calling for help — it’s the same friendly Horse Guai you may have met in Chapter 1 by a Meditation Point right after Guanyin Temple. He’ll be thankful for your arrival, but stresses that he’ll be okay and can slip out on his own. Chat him up to learn more about the rats of this region, and then take him at his word and leave him to make his own way out.",
    "img_below_text": "Be sure to open up the gate nearby to unlock a shortcut back to the Village Entrance. As an added bonus, all the Rat Archers posted on the gate’s roof have jumped down, and you can ambush the entire group. Your Sage’s Relic should now indicate an enemy who has a Spirit you can absorb, and sure enough you can spot a tougher Rat Archer than the rest with blue flames. Defeat him, and you’ll be able to absorb the Rat Archer Spirit. As an added bonus, all the Rat Archers will no longer spawn here!",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Sandgate Village Walkthrough\n            - Section Title: Village Entrance\n            - Sub-Section Title: Yaoguai Chief Mini-Boss Fight - Earth Wolf\n\n            Context:\n            - Preceding Text: \"# Sandgate Village Walkthrough\n\nIn Black Myth Wukong’s second chapter, you’ll leave behind the forests of Black Wind Mountain for the dry sands of the Yellow Wind Ridge. An energetic (yet headless) man playing a Chinese lute (known as a sanxian) will set the stage for this realm, and helpfully revive our Destined One from becoming a pincushion full of arrows.\n\n\nKeep following it along some wooden scaffolding above a ravine leading back to the pit, and you’ll see a settlement up ahead, plus the first of the Keeper’s Shrines guarded by another Rat Soldier.\n\n## Village Entrance\n\nThe Xu Dog as he’s known has a problem he needs help with: A large frog has swallowed one of his medicinal formulas, and you’re just the person he’s looking for to get it back.\n\n\nHeading to the left of the lone shack, you’ll find a gate guarded by a Rat Governor and another Archer on the rooftops that connects to the one you climbed earlier. Defeat them to gain access to a large open field inside the Village’s main area. From across the field, a voice pleading to be freed calls out, but in your way is a large loping creature that will want to engage you first.\n\n### Yaoguai Chief Mini-Boss Fight - Earth Wolf\n\nBe sure to head on over to the altar with the tiger statue to find the source of the person calling for help — it’s the same friendly Horse Guai you may have met in Chapter 1 by a Meditation Point right after Guanyin Temple. He’ll be thankful for your arrival, but stresses that he’ll be okay and can slip out on his own. Chat him up to learn more about the rats of this region, and then take him at his word and leave him to make his own way out.\"\n            - Following Text: \"Be sure to open up the gate nearby to unlock a shortcut back to the Village Entrance. As an added bonus, all the Rat Archers posted on the gate’s roof have jumped down, and you can ambush the entire group. Your Sage’s Relic should now indicate an enemy who has a Spirit you can absorb, and sure enough you can spot a tougher Rat Archer than the rest with blue flames. Defeat him, and you’ll be able to absorb the Rat Archer Spirit. As an added bonus, all the Rat Archers will no longer spawn here!\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}