{
    "chunk_id": 228501627689,
    "source_file": "Cyan_Loong.md",
    "h1_title": "Cyan Loong",
    "h2_title": "Cyan Loong Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b5/Wukong_Turtle_27.jpg",
    "alt_text": "Wukong Turtle 27.jpg",
    "position_desc": 9,
    "img_above_text": "# Cyan Loong\n\nCyan Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 3 of Black Myth Wukong. Hiding on the far side of Turtle Island this frozen boss can't be activated until you obtain a Key Item in the previous chapter. Cyan Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* Rewards: Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n\n\nYou can enter the crack in the wall, and on the other side you’ll find a chest containing the Loong Scales. With this item, you’ll be able to unlock the boss.\n\n## Cyan Loong Boss Fight and Guide\n\nThe good news is his final sword slice allows for an extended moment to dodge around and attack him from behind. However, you'll need to keep your eyes open when trying to attack from behind, as he can easily whip his mace-like tail around to hit you. Watch for it to rise up to the top left before slashing down to the bottom right to know when to deflect or evade.",
    "img_below_text": "In addition to his standard sword swings and combos, the Cyan Loong can change things up by charging up and holding his sword back pointed straight at you before launching into a slow two-handed swing, or pausing to spin for a backhand slash as he whirls around.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Cyan Loong\n            - Section Title: Cyan Loong Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Cyan Loong\n\nCyan Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 3 of Black Myth Wukong. Hiding on the far side of Turtle Island this frozen boss can't be activated until you obtain a Key Item in the previous chapter. Cyan Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* Rewards: Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n\n\nYou can enter the crack in the wall, and on the other side you’ll find a chest containing the Loong Scales. With this item, you’ll be able to unlock the boss.\n\n## Cyan Loong Boss Fight and Guide\n\nThe good news is his final sword slice allows for an extended moment to dodge around and attack him from behind. However, you'll need to keep your eyes open when trying to attack from behind, as he can easily whip his mace-like tail around to hit you. Watch for it to rise up to the top left before slashing down to the bottom right to know when to deflect or evade.\"\n            - Following Text: \"In addition to his standard sword swings and combos, the Cyan Loong can change things up by charging up and holding his sword back pointed straight at you before launching into a slow two-handed swing, or pausing to spin for a backhand slash as he whirls around.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Cyan Loong, a secret optional boss in *Black Myth Wukong*, encountered in Chapter 3. It explains that the boss is located on Turtle Island and requires a specific key item, the Loong Scales, to unlock. Defeating Cyan Loong rewards players with rare crafting materials and items. The text also provides an initial tip for the fight, highlighting a moment to dodge and attack while warning of the boss's tail whip attack.\n\nImage Summary:  \nThe image depicts an in-game battle scene from *Black Myth Wukong*, showing the player character engaged in combat with Cyan Loong, a dragon-like boss. The snowy environment and rocky terrain suggest the setting is Turtle Island. The player wields an electrified weapon, and the boss's health bar is visible at the bottom, indicating an ongoing fight. The image serves to visually represent the boss fight and its setting.\n\nFollowing Text Summary:  \nThe following text elaborates on Cyan Loong's attack patterns, mentioning additional moves such as a charged two-handed sword swing and a spinning backhand slash. These details provide further guidance on anticipating and countering the boss's attacks during the fight."
}