{
    "chunk_id": 398449789700,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "h1_title": "Fright Cliff Walkthrough",
    "h2_title": "Rockrest Flat",
    "h3_title": "The Sixth Buddha’s Eyeball",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/cb/Wukong_Fright_42.jpg",
    "alt_text": "Wukong Fright 42.jpg",
    "position_desc": 45,
    "img_above_text": "# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n\nRealizing the error of his ways, the Man-in-Stone will promptly burrow right back in the ground and plead for mercy. You’ll then be able to re-harvest the Stone Essence from him, which will turn into the **Azure Dust Transformation Spell**! Finally, the slow yet sturdy power of the Rock Guai is yours to command in battle!\n\nUnlike the Red Waves wolf transformation, you’ll be extremely slow, unable to dodge, and overall be a pretty big target. On the plus side, you’ll be immune to all status effects while transformed, and deal incredible damage that staggers most enemies. Instead of Might building on attack, you’ll build it while taking damage, allowing you to soak blows and unleash a powerful jump attack spell in return!\n\nAs an added bonus, if you keep hassling the Man-in-Stone, he’ll promise to prepare wares to sell the next time you visit. Be sure to take him up on this offer, as he’ll have a decent selection of (very high-priced) goods!\n\nMan-in-Stone's Shop\n| Man-in-Stone's Shop                | Man-in-Stone's Shop           |\n| ---------------------------------- | ----------------------------- |\n| Blood of the Iron Bull - 3280 Will | Gold Ridge Beast - 12800 Will |\n| Iron Pellet - 6480 Will            |                               |\n| Goldflora Hairpin - 12800 Will     |                               |\n| Sobering Stone - 6480 Will         |                               |\n\n## Rockrest Flat\n\nBe sure to look around the vast field for items to gather like Fire Bellflower and Fragrant Jade Flowers. If you travel to the edge of the cliff past the field, you can find a **Meditation Point** by a large curved tree, giving you a free Skill Point!\n\nThe only other part of this field has a large gate that can’t currently be opened, so instead it’s time to return to the Shrine.\n\n### The Sixth Buddha’s Eyeball\nFrom the Shrine at Rockrest Flat, look off to the left for a path leading to a large opening in the rocks. Just before the path opens up, you can find the final statue head, and claiming its eyes will cause a mantra to be chanted, “Om Mani Padme Hum”, confirming you’ve found the final eye!",
    "img_below_text": "Just past this final Buddha statue head, look through the archway opening in the rocky wall. Ahead you’ll spot a group of stone floating in the air, signaling your next boss fight is at hand. There's also a strange large rock to the left - make a note of it and we'll inspect it later.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fright Cliff Walkthrough\n            - Section Title: Rockrest Flat\n            - Sub-Section Title: The Sixth Buddha’s Eyeball\n\n            Context:\n            - Preceding Text: \"# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n\nRealizing the error of his ways, the Man-in-Stone will promptly burrow right back in the ground and plead for mercy. You’ll then be able to re-harvest the Stone Essence from him, which will turn into the **Azure Dust Transformation Spell**! Finally, the slow yet sturdy power of the Rock Guai is yours to command in battle!\n\nUnlike the Red Waves wolf transformation, you’ll be extremely slow, unable to dodge, and overall be a pretty big target. On the plus side, you’ll be immune to all status effects while transformed, and deal incredible damage that staggers most enemies. Instead of Might building on attack, you’ll build it while taking damage, allowing you to soak blows and unleash a powerful jump attack spell in return!\n\nAs an added bonus, if you keep hassling the Man-in-Stone, he’ll promise to prepare wares to sell the next time you visit. Be sure to take him up on this offer, as he’ll have a decent selection of (very high-priced) goods!\n\nMan-in-Stone's Shop\n| Man-in-Stone's Shop                | Man-in-Stone's Shop           |\n| ---------------------------------- | ----------------------------- |\n| Blood of the Iron Bull - 3280 Will | Gold Ridge Beast - 12800 Will |\n| Iron Pellet - 6480 Will            |                               |\n| Goldflora Hairpin - 12800 Will     |                               |\n| Sobering Stone - 6480 Will         |                               |\n\n## Rockrest Flat\n\nBe sure to look around the vast field for items to gather like Fire Bellflower and Fragrant Jade Flowers. If you travel to the edge of the cliff past the field, you can find a **Meditation Point** by a large curved tree, giving you a free Skill Point!\n\nThe only other part of this field has a large gate that can’t currently be opened, so instead it’s time to return to the Shrine.\n\n### The Sixth Buddha’s Eyeball\nFrom the Shrine at Rockrest Flat, look off to the left for a path leading to a large opening in the rocks. Just before the path opens up, you can find the final statue head, and claiming its eyes will cause a mantra to be chanted, “Om Mani Padme Hum”, confirming you’ve found the final eye!\"\n            - Following Text: \"Just past this final Buddha statue head, look through the archway opening in the rocky wall. Ahead you’ll spot a group of stone floating in the air, signaling your next boss fight is at hand. There's also a strange large rock to the left - make a note of it and we'll inspect it later.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text describes the area of Rockrest Flat, where players are encouraged to explore the field for collectible items like Fire Bellflower and Fragrant Jade Flowers. A Meditation Point near a curved tree offers a free Skill Point, while a large gate remains inaccessible. The section transitions to the sub-section \"The Sixth Buddha’s Eyeball,\" where players are guided to locate the final Buddha statue head near a path leading to a large rock opening.\n\nImage Summary:  \nThe image depicts a player character in a grassy, open field at Rockrest Flat, approaching a rocky area with a large, curved tree and ruins in the background. A red arrow highlights a specific rock formation, suggesting its importance as a point of interest or interaction in the game. The scene emphasizes exploration and environmental detail, aligning with the narrative's focus on discovery.\n\nFollowing Text Summary:  \nThe following text continues the exploration of the area, noting that just beyond the Buddha statue head lies an archway in the rocky wall. This leads to floating stones that signal an upcoming boss fight. A strange large rock to the left is also mentioned as noteworthy for future inspection."
}