{
    "chunk_id": 756962297233,
    "source_file": "Chapter_4_Secret_-_Purple_Cloud_Mountain_Walkthrough.md",
    "h1_title": "Chapter 4 Secret - Purple Cloud Mountain Walkthrough",
    "h2_title": "Petalfall Hamlet",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/6f/Wukong_PurpleCloud_33.jpg",
    "alt_text": "Wukong PurpleCloud 33.jpg",
    "position_desc": 37,
    "img_above_text": "# Chapter 4 Secret - Purple Cloud Mountain Walkthrough\n\nThe Purple Cloud Mountain is a Secret Area found in Chapter 4's Webbed Hollow of Black Myth Wukong. Below you'll find a guide to accessing the mountain by defeating the Venom Daoist, and how to complete Hong Yi the Snake Guai's quest to defeat the Daoist Mi and Duskveil, as well as the formidable Scorpionlord.\n\n* **Jump to a Section:**\n* How to Access Purple Cloud Mountain\n* **Valley of Blooms**\n* **Bounds of Deity's Abode**\n- Yaoguai King - The Scorpionlord\n* **Petalfall Hamlet**\n- Yaoguai Chief - Daoist Mi\n* **Cloudnest Peak**\n- Yaoguai King - The Duskveil\n\nThis Chapter 4 Secret can only be accessed by finding and defeating the Venom Daoist in two different locations, and will transport you to a different location to fight a secret Yaoguai King and repair a Vessel that is instrumental in defeating the Hundred-Eyed Daoist Master.\n\n\nWhen the Venom Daoist is finally defeated, he'll point to a mural that will appear on a nearby wall, sending you to Purple Cloud Mountain.\n\n\nThe start of this region is a linear mountain path lined with a few materials to harvest, and up ahead you'll hear the sounds of someone crying. The \"someone\" is actually a snake guai (named Hong Yi). The widower was forced out of her mountaintop village by insect guais led by the Scorpionlord, rendering her unable to retrieve her late husband's keepsakes.\n\nShe'll warn you of the dangerous venom of the enemies ahead, and you can even find a **Treasure Chest** near her that holds 3 Antimiasma Powder that will be incredibly useful when taking on the Scorpionlord.\n\nHead across the bridge to the right and grab a green Wisp, and go through the archway into the next larger area.\n\n\nAs you might expect, this one will take a lot longer to kill with its strengthened spirit, so expend your big hits and spirit attacks, making sure to stop and take out whatever minions he summons. When he finally falls, you'll get the Verdant Glow Spirit, which allows you to heal rather than invoke an attack.\n\nBe sure to also look at the normal tree near where the Lushleaf was meditating. It has a **Luojia Fragrant Vine** wrapped around it that you can claim.\n\n\nWhen you head up the stairway path, you'll spot a large open area with a small building along the cliffside, and a large yaoguai lounging on the roof and grumbling to himself. As you approach, he'll tell you to get lost and leave him to his drink, so if you're spoiling for a fight, smack one of the pots on the ground, and he'll come leaping down for some action.\n\n\nNow you can return to the archway guarded by two Spear Daoists on the far left side of this area, and behind them you'll find the Shrine for the next area.\n\n## Petalfall Hamlet\n\nAfter resting at the Petalfall Hamlet Shrine, head up the path and across a small bridge to enter the small village. It's now overrun by various Daoists, which shouldn't prove too much of a problem if you take them out one at a time.",
    "img_below_text": "However, after climbing some stairs, you'll come across a special Sword Daoist playing a flute, and does not appear hostile. He'll actually ask a favor of you, noting that his fellow Daoists have all been partaking of Amourworm eggs, turning them into undying husks. He'll ask you to seek one out and return it to him.\n\nWhile it may sound like he's asking you to seek out a Worm Practitioner, in reality any of the Daoists you defeat in this hamlet has a chance to drop the item he seeks. We'll clear the village out before returning to him, but you may also need to rest and respawn them if you don't find one.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chapter 4 Secret - Purple Cloud Mountain Walkthrough\n            - Section Title: Petalfall Hamlet\n\n            Context:\n            - Preceding Text: \"# Chapter 4 Secret - Purple Cloud Mountain Walkthrough\n\nThe Purple Cloud Mountain is a Secret Area found in Chapter 4's Webbed Hollow of Black Myth Wukong. Below you'll find a guide to accessing the mountain by defeating the Venom Daoist, and how to complete Hong Yi the Snake Guai's quest to defeat the Daoist Mi and Duskveil, as well as the formidable Scorpionlord.\n\n* **Jump to a Section:**\n* How to Access Purple Cloud Mountain\n* **Valley of Blooms**\n* **Bounds of Deity's Abode**\n- Yaoguai King - The Scorpionlord\n* **Petalfall Hamlet**\n- Yaoguai Chief - Daoist Mi\n* **Cloudnest Peak**\n- Yaoguai King - The Duskveil\n\nThis Chapter 4 Secret can only be accessed by finding and defeating the Venom Daoist in two different locations, and will transport you to a different location to fight a secret Yaoguai King and repair a Vessel that is instrumental in defeating the Hundred-Eyed Daoist Master.\n\n\nWhen the Venom Daoist is finally defeated, he'll point to a mural that will appear on a nearby wall, sending you to Purple Cloud Mountain.\n\n\nThe start of this region is a linear mountain path lined with a few materials to harvest, and up ahead you'll hear the sounds of someone crying. The \"someone\" is actually a snake guai (named Hong Yi). The widower was forced out of her mountaintop village by insect guais led by the Scorpionlord, rendering her unable to retrieve her late husband's keepsakes.\n\nShe'll warn you of the dangerous venom of the enemies ahead, and you can even find a **Treasure Chest** near her that holds 3 Antimiasma Powder that will be incredibly useful when taking on the Scorpionlord.\n\nHead across the bridge to the right and grab a green Wisp, and go through the archway into the next larger area.\n\n\nAs you might expect, this one will take a lot longer to kill with its strengthened spirit, so expend your big hits and spirit attacks, making sure to stop and take out whatever minions he summons. When he finally falls, you'll get the Verdant Glow Spirit, which allows you to heal rather than invoke an attack.\n\nBe sure to also look at the normal tree near where the Lushleaf was meditating. It has a **Luojia Fragrant Vine** wrapped around it that you can claim.\n\n\nWhen you head up the stairway path, you'll spot a large open area with a small building along the cliffside, and a large yaoguai lounging on the roof and grumbling to himself. As you approach, he'll tell you to get lost and leave him to his drink, so if you're spoiling for a fight, smack one of the pots on the ground, and he'll come leaping down for some action.\n\n\nNow you can return to the archway guarded by two Spear Daoists on the far left side of this area, and behind them you'll find the Shrine for the next area.\n\n## Petalfall Hamlet\n\nAfter resting at the Petalfall Hamlet Shrine, head up the path and across a small bridge to enter the small village. It's now overrun by various Daoists, which shouldn't prove too much of a problem if you take them out one at a time.\"\n            - Following Text: \"However, after climbing some stairs, you'll come across a special Sword Daoist playing a flute, and does not appear hostile. He'll actually ask a favor of you, noting that his fellow Daoists have all been partaking of Amourworm eggs, turning them into undying husks. He'll ask you to seek one out and return it to him.\n\nWhile it may sound like he's asking you to seek out a Worm Practitioner, in reality any of the Daoists you defeat in this hamlet has a chance to drop the item he seeks. We'll clear the village out before returning to him, but you may also need to rest and respawn them if you don't find one.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Petalfall Hamlet, a small village overrun by hostile Daoists in the secret Purple Cloud Mountain area of Chapter 4 in *Black Myth: Wukong*. Players are guided to the hamlet after defeating the Venom Daoist and progressing through various challenges. The text describes the general layout of the area and hints at encounters with enemies, including a large yaoguai and two Spear Daoists guarding the next Shrine.\n\n---\n\nImage Summary:\nThe image depicts a scene from Petalfall Hamlet, showing the player character standing in front of a small building surrounded by autumnal grass and rocky terrain. A Daoist NPC is visible near the building, seemingly non-hostile, with a glowing green object highlighted in the background. The caption reads, \"It's been long since any soul has trodden these hidden bounds,\" suggesting the area is secluded and rarely visited.\n\n---\n\nFollowing Text Summary:\nThe following text elaborates on the encounter with the Daoist NPC shown in the image. This Sword Daoist is playing a flute and does not appear hostile. He requests the player to find an Amourworm egg, which can be obtained by defeating other Daoists in the hamlet. The text provides instructions for clearing the village and respawning enemies if necessary, emphasizing the importance of fulfilling the NPC's favor."
}