{
    "chunk_id": 514769980053,
    "source_file": "Civet_Sergeant_Spirit.md",
    "h1_title": "Civet Sergeant Spirit",
    "h2_title": "Civet Sergeant Spirit",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/18/Civet_Power.png",
    "alt_text": "Civet Power.png",
    "position_desc": 3,
    "img_above_text": "# Civet Sergeant Spirit\n\n\nThis will open a secret door in the pool of blood that leads you to the Civet Sergeant in the Crouching Tiger Temple Cellar.\n\n\nThe Civet Sergeant fight is no walk in the park. There are around five Civet Sergeants to deal with, all of which are hurling knives, flipping around you, and hounding you at once. Immobilize and A Pluck of Many spells will make this fight much easier and level the playing field a little.\n\n## Civet Sergeant Spirit",
    "img_below_text": "* **Heart Ripper**\n* Equipped Effect: Slightly increases Attack.\n\nThe Civet Sergeant's Spirit allows you to embody him long enough to hurl two blades straight into your foe's chest. This is a pretty decent attack that's further bolstered by the Civet Sergeant's equipped effect that increases your attack power. Having more attack power is always helpful in Black Myth: Wukong, making the Civet Sergeant a worthwhile Spirit to pour resources into upgrading.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Civet Sergeant Spirit\n            - Section Title: Civet Sergeant Spirit\n\n            Context:\n            - Preceding Text: \"# Civet Sergeant Spirit\n\n\nThis will open a secret door in the pool of blood that leads you to the Civet Sergeant in the Crouching Tiger Temple Cellar.\n\n\nThe Civet Sergeant fight is no walk in the park. There are around five Civet Sergeants to deal with, all of which are hurling knives, flipping around you, and hounding you at once. Immobilize and A Pluck of Many spells will make this fight much easier and level the playing field a little.\n\n## Civet Sergeant Spirit\"\n            - Following Text: \"* **Heart Ripper**\n* Equipped Effect: Slightly increases Attack.\n\nThe Civet Sergeant's Spirit allows you to embody him long enough to hurl two blades straight into your foe's chest. This is a pretty decent attack that's further bolstered by the Civet Sergeant's equipped effect that increases your attack power. Having more attack power is always helpful in Black Myth: Wukong, making the Civet Sergeant a worthwhile Spirit to pour resources into upgrading.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text describes the challenging fight against multiple Civet Sergeants in the Crouching Tiger Temple Cellar. These enemies are agile and aggressive, using knives and acrobatics to overwhelm the player. Spells like Immobilize and A Pluck of Many are recommended to make the fight more manageable.\n\nImage Summary:  \nThe image displays the equipment menu in the game, highlighting the \"Civet Sergeant\" Spirit. It provides details about the Spirit's ability, \"Heart Ripper,\" which allows the player to take the form of the Civet Sergeant and attack enemies by hurling twin blades. The Spirit also has an equipped effect that slightly increases attack power. A demo preview of the ability is visible in the top-right corner.\n\nFollowing Text Summary:  \nThe following text elaborates on the benefits of the Civet Sergeant Spirit. It emphasizes the utility of the \"Heart Ripper\" attack, which deals significant damage by piercing an enemy's chest. The Spirit's equipped effect boosts attack power, making it a valuable asset for players looking to enhance their offensive capabilities in *Black Myth: Wukong*."
}