{
    "chunk_id": 137136851118,
    "source_file": "Captain_Lotus-Vision.md",
    "h1_title": "Captain Lotus-Vision",
    "h2_title": "Where to Find Captain Lotus-Vision",
    "h3_title": "Captain Lotus-Vision Miniboss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b1/Wukong_Pagoda_37.jpg",
    "alt_text": "Wukong Pagoda 37.jpg",
    "position_desc": 7,
    "img_above_text": "# Captain Lotus-Vision\n\nCaptain Lotus-Vision is an optional miniboss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Responsible for sealing captives in the cells of the Pagoda Realm, you can find this boss in a secret chamber within the Pagoda Prison.\n\n* **Rewards:** Spirit of Captain Lotus-Vision, Frostsprout Twig, Mind Core, Cold Iron Leaves, 1847 Experience, 1198 Will\n\n## Where to Find Captain Lotus-Vision\n\nCaptain Lotus-Vision is one of the four captains you can find in Chapter 3, and is an optional Yaoguai Chief you can encounter in the Pagoda Realm.\n\nTo find him, you'll need to reach the Upper Pagoda Shrine on the third level of the prison. Just behind the shrine, there is a pit with purple light emanating below that you can drop into and find this boss.\n\n### Captain Lotus-Vision Miniboss Fight and Guide\n\nOnce you take out around a third of his health, he'll teleport back near his original position, and shatter the remaining corpses as he draws power, creating a large and intricate circle of runic power behind him.\n\nThings will get extremely dangerous and annoying at this point, as he'll not only unleash a constant beam from his crystal, but the ring behind him will form smaller rings to blast you from four different locations. This will result in dodging on top of dodging as you have to escape the constant laser, and also four different blasts, and a final blast from all four circles at once.",
    "img_below_text": "Because of the difficulty of this section (and that you may also be at half health from the chanting curse), we highly recommend using Cloud Step so at your decoy can draw fire for a large portion of this attack.\n\nAfter the four circles all emit their laser blasts, they'll float away from Captain Lotus-Vision to take up spots in each corner of the room. Each circle will emit a continuous laser that borders the room, and will slowly pan them around to cross over the floor and each other.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Captain Lotus-Vision\n            - Section Title: Where to Find Captain Lotus-Vision\n            - Sub-Section Title: Captain Lotus-Vision Miniboss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Captain Lotus-Vision\n\nCaptain Lotus-Vision is an optional miniboss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Responsible for sealing captives in the cells of the Pagoda Realm, you can find this boss in a secret chamber within the Pagoda Prison.\n\n* **Rewards:** Spirit of Captain Lotus-Vision, Frostsprout Twig, Mind Core, Cold Iron Leaves, 1847 Experience, 1198 Will\n\n## Where to Find Captain Lotus-Vision\n\nCaptain Lotus-Vision is one of the four captains you can find in Chapter 3, and is an optional Yaoguai Chief you can encounter in the Pagoda Realm.\n\nTo find him, you'll need to reach the Upper Pagoda Shrine on the third level of the prison. Just behind the shrine, there is a pit with purple light emanating below that you can drop into and find this boss.\n\n### Captain Lotus-Vision Miniboss Fight and Guide\n\nOnce you take out around a third of his health, he'll teleport back near his original position, and shatter the remaining corpses as he draws power, creating a large and intricate circle of runic power behind him.\n\nThings will get extremely dangerous and annoying at this point, as he'll not only unleash a constant beam from his crystal, but the ring behind him will form smaller rings to blast you from four different locations. This will result in dodging on top of dodging as you have to escape the constant laser, and also four different blasts, and a final blast from all four circles at once.\"\n            - Following Text: \"Because of the difficulty of this section (and that you may also be at half health from the chanting curse), we highly recommend using Cloud Step so at your decoy can draw fire for a large portion of this attack.\n\nAfter the four circles all emit their laser blasts, they'll float away from Captain Lotus-Vision to take up spots in each corner of the room. Each circle will emit a continuous laser that borders the room, and will slowly pan them around to cross over the floor and each other.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Captain Lotus-Vision as an optional miniboss in Chapter 3 of *Black Myth: Wukong*. He is one of four captains found in the Pagoda Realm, specifically in the Upper Pagoda Shrine's secret chamber. The text describes his role in sealing captives and outlines the rewards for defeating him, including experience points, items, and abilities. It also mentions the challenging mechanics of his fight, particularly his use of runic power and laser attacks.\n\nImage Summary:\nThe image depicts the intense battle against Captain Lotus-Vision during his second phase. He is surrounded by glowing purple runic circles emitting beams of energy, with additional smaller rings forming around him. The player character is visible in the foreground, with a health bar labeled \"Captain Lotus-Vision\" displayed at the bottom. The scene highlights the boss's intricate and dangerous attack patterns, emphasizing the visual chaos and difficulty of the encounter.\n\nFollowing Text Summary:\nThe following text provides strategies for surviving Captain Lotus-Vision's second phase, recommending the use of the Cloud Step ability to create a decoy that can absorb some of the attacks. It describes how the four runic circles will eventually move to the corners of the room, emitting continuous lasers that sweep across the battlefield, further complicating the fight and requiring precise movement and timing."
}