{
    "chunk_id": 320112173105,
    "source_file": "Bamboo_Grove_Walkthrough.md",
    "h1_title": "Bamboo Grove Walkthrough",
    "h2_title": "Back Hills",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f7/Wukong_Bamboo_5.jpg",
    "alt_text": "Wukong Bamboo 5.jpg",
    "position_desc": 5,
    "img_above_text": "# Bamboo Grove Walkthrough\n\nThe Bamboo Grove is the second main region of Chapter 1's Black Wind Mountain in Black Myth: Wukong. Below you'll find a guide to the progressing through the grove and learning how to cultivate Spirits, accessing a secret realm, as well as how to defeat the many bosses of this area that include Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble.\n\n* **Jump to A Section:**\n* **Back Hills**\n* **Snake Trail**\n- Yaoguai Chief - Baw-Li-Guhh-Lang\n- Yaoguai Chief - Guangmo\n* **Marsh of the White Mist**\n- Boss FIght - Whiteclad Noble\n\n## Back Hills\n\nAhead of you is the base of some small falls where a few Croaky frog Guai are waiting among some Jade Lotus, and a green wisp with a few Will to grab at. Another wisp can be found below the opposite falls, by starting to head up the stone stairs on the side and looking left for a small canyon.",
    "img_below_text": "To advance, keep heading up the stairway to cross the high bridge over the falls, where you’ll soon see the golden trail of a nearby shrine beckoning you left. Before making that turn, be sure to look to the right to find a small wooden gazebo with a small table, and open the small gold box on top to find a variety of medicines, including 2 **Tiger Subduing Pellets** , 1 **Evil Repelling Medicament** and 1 **Amplification Pellet**.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bamboo Grove Walkthrough\n            - Section Title: Back Hills\n\n            Context:\n            - Preceding Text: \"# Bamboo Grove Walkthrough\n\nThe Bamboo Grove is the second main region of Chapter 1's Black Wind Mountain in Black Myth: Wukong. Below you'll find a guide to the progressing through the grove and learning how to cultivate Spirits, accessing a secret realm, as well as how to defeat the many bosses of this area that include Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble.\n\n* **Jump to A Section:**\n* **Back Hills**\n* **Snake Trail**\n- Yaoguai Chief - Baw-Li-Guhh-Lang\n- Yaoguai Chief - Guangmo\n* **Marsh of the White Mist**\n- Boss FIght - Whiteclad Noble\n\n## Back Hills\n\nAhead of you is the base of some small falls where a few Croaky frog Guai are waiting among some Jade Lotus, and a green wisp with a few Will to grab at. Another wisp can be found below the opposite falls, by starting to head up the stone stairs on the side and looking left for a small canyon.\"\n            - Following Text: \"To advance, keep heading up the stairway to cross the high bridge over the falls, where you’ll soon see the golden trail of a nearby shrine beckoning you left. Before making that turn, be sure to look to the right to find a small wooden gazebo with a small table, and open the small gold box on top to find a variety of medicines, including 2 **Tiger Subduing Pellets** , 1 **Evil Repelling Medicament** and 1 **Amplification Pellet**.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Bamboo Grove, a significant region in the game Black Myth: Wukong, specifically within Chapter 1's Black Wind Mountain. It provides a guide on navigating the grove, cultivating Spirits, accessing secret realms, and defeating bosses such as Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble. The section titled \"Back Hills\" describes encountering Croaky frog Guai and Jade Lotus near a waterfall, along with wisps and items to collect.\n\nImage Summary:\nThe image depicts a character in a lush, forested area, likely part of the Bamboo Grove's \"Back Hills\" section. The character is approaching a wooden structure, possibly a gazebo, with a red circular indicator highlighting an object of interest. This suggests an interactive element or collectible item within the game environment, aligning with the narrative of exploring and gathering resources.\n\nFollowing Text Summary:\nThe following text instructs players to continue ascending the stairs to cross a bridge over the falls, leading to a shrine. Before turning left towards the shrine, players are advised to explore a small wooden gazebo on the right, where they can find a gold box containing various medicines, including Tiger Subduing Pellets, Evil Repelling Medicament, and Amplification Pellet."
}