{
    "chunk_id": 435281623345,
    "source_file": "Ashen_Slumber.md",
    "h1_title": "Ashen Slumber",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/65/Black-myth-wukong-ashen-slumber-1.jpg",
    "alt_text": "Black-myth-wukong-ashen-slumber-1.jpg",
    "position_desc": 1,
    "img_above_text": "# Ashen Slumber\n\nAshen Slumber is one of the best Transformation Spells in Black Myth: Wukong for crowd control and dealing sustained damage. It has a solid basic combo, a fantastic heavy attack, and a self-destruct attack that can completely destroy groups of enemies.\n\nWith it, you can transform into a rat guai, slashing at the enemy while blowing fierce flames at them, inflicting Scorch Bane. Focus built up before transformation can be converted for use afterwards within the rat guai's form.\n\nAshen Slumber's moveset is as follows:\n\n* **Light Attack: Chop Wood - Swing the iron blade to build up Focus.** This is a standard four-hit combo.",
    "img_below_text": "* **Heavy Attack: Blow Fire - Hold heavy attack to unleash, consuming Focus to continuously burn enemies ahead.** This is a great crowd-control move, damaging enemies with a continuous stream of fire for several seconds ahead of it.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Ashen Slumber\n\n            Context:\n            - Preceding Text: \"# Ashen Slumber\n\nAshen Slumber is one of the best Transformation Spells in Black Myth: Wukong for crowd control and dealing sustained damage. It has a solid basic combo, a fantastic heavy attack, and a self-destruct attack that can completely destroy groups of enemies.\n\nWith it, you can transform into a rat guai, slashing at the enemy while blowing fierce flames at them, inflicting Scorch Bane. Focus built up before transformation can be converted for use afterwards within the rat guai's form.\n\nAshen Slumber's moveset is as follows:\n\n* **Light Attack: Chop Wood - Swing the iron blade to build up Focus.** This is a standard four-hit combo.\"\n            - Following Text: \"* **Heavy Attack: Blow Fire - Hold heavy attack to unleash, consuming Focus to continuously burn enemies ahead.** This is a great crowd-control move, damaging enemies with a continuous stream of fire for several seconds ahead of it.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the spell \"Ashen Slumber\" from *Black Myth: Wukong*, highlighting its effectiveness for crowd control and sustained damage. It describes the spell's ability to transform the player into a rat guai, enabling them to attack enemies with slashes and flames while inflicting Scorch Bane. The moveset includes a light attack called \"Chop Wood,\" which builds Focus through a four-hit combo.\n\nImage Summary:\nThe image depicts gameplay from *Black Myth: Wukong*, showcasing the \"Ashen Slumber\" spell in action. A transformed rat guai is engaged in combat, using its abilities in a barren, rocky environment with twisted trees and stairs visible in the background. The overlay text provides details about the spell's moveset, including \"Chop Wood,\" \"Blow Fire,\" and \"Fiery Burst,\" along with their respective controls and effects.\n\nFollowing Text Summary:\nThe following text elaborates on the heavy attack \"Blow Fire,\" which consumes Focus to unleash a continuous stream of flames for crowd control and sustained damage. It emphasizes the attack's utility in burning enemies over several seconds."
}