{
    "chunk_id": 672688065866,
    "source_file": "Apramana_Bat.md",
    "h1_title": "Apramana Bat",
    "h2_title": "Where to Find the Apramana Bat",
    "h3_title": "Apramana Bat Miniboss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/13/Wukong_Bitter_35.jpg",
    "alt_text": "Wukong Bitter 35.jpg",
    "position_desc": 5,
    "img_above_text": "# Apramana Bat\n\nApramana Bat is an optional and missable Yaoguai Chief boss fight, and can be encountered in Chapter 3 of Black Myth Wukong. First located along the North Shore of the Bitter Lake, you'll want to face it before entering the Valley of Ecstasy or you'll miss out on this fight altogether.\n\n* **Rewards:** Cold Iron Leaves x2, 1847 Experience, 1176 Will (First Encounter), Apramana Bat Spirit (Second Encounter)\n\n## Where to Find the Apramana Bat\n\nA much larger gold variant of the Apramana Bats you can encounter elsewhere in Chapter 3, the Apramana Bat boss can be found once you leave the Turtle Island. From the North Shore of Bitter Lake, head right from the Shrine and along the coast until you come upon the skeletal remains of the Snake General. Once you arrive where his skull is located, the giant bat will ambush you.\n\n### Apramana Bat Miniboss Fight and Guide\n\nIt's most common attack in the air is spreading its wings wide before beating them together, creating a cross slash projectile down at your location that requires some quick dodging.",
    "img_below_text": "If you see its legs extend upwards (similar to the lesser variants) it's preparing to slam down its talons on you in a quick downward slam. However, deflecting with Rock Solid will send it flying backward, only to topple out of the sky and provide you a moment to sprint over and retaliate.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Apramana Bat\n            - Section Title: Where to Find the Apramana Bat\n            - Sub-Section Title: Apramana Bat Miniboss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Apramana Bat\n\nApramana Bat is an optional and missable Yaoguai Chief boss fight, and can be encountered in Chapter 3 of Black Myth Wukong. First located along the North Shore of the Bitter Lake, you'll want to face it before entering the Valley of Ecstasy or you'll miss out on this fight altogether.\n\n* **Rewards:** Cold Iron Leaves x2, 1847 Experience, 1176 Will (First Encounter), Apramana Bat Spirit (Second Encounter)\n\n## Where to Find the Apramana Bat\n\nA much larger gold variant of the Apramana Bats you can encounter elsewhere in Chapter 3, the Apramana Bat boss can be found once you leave the Turtle Island. From the North Shore of Bitter Lake, head right from the Shrine and along the coast until you come upon the skeletal remains of the Snake General. Once you arrive where his skull is located, the giant bat will ambush you.\n\n### Apramana Bat Miniboss Fight and Guide\n\nIt's most common attack in the air is spreading its wings wide before beating them together, creating a cross slash projectile down at your location that requires some quick dodging.\"\n            - Following Text: \"If you see its legs extend upwards (similar to the lesser variants) it's preparing to slam down its talons on you in a quick downward slam. However, deflecting with Rock Solid will send it flying backward, only to topple out of the sky and provide you a moment to sprint over and retaliate.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Apramana Bat, an optional miniboss in *Black Myth: Wukong*. It explains its location in Chapter 3 near the North Shore of Bitter Lake and highlights the importance of encountering it before entering the Valley of Ecstasy. Rewards for defeating the bat include items, experience, and a spirit collectible. The text also describes the bat as a larger gold variant of lesser bats found in the same chapter and provides directions to its ambush location near the skeletal remains of the Snake General.\n\nImage Summary:\nThe image depicts the Apramana Bat during its miniboss fight in *Black Myth: Wukong*. The bat is airborne, showcasing its large, menacing form against a cloudy sky. The player's interface is visible, displaying consumable items such as \"Evil Repelling Medicament\" and abilities like \"Rock Solid\" and \"Immobilize.\" The bat's health bar is labeled \"Apramana Bat,\" indicating the ongoing battle. This visual serves to illustrate the combat encounter and the player's tools for engaging the miniboss.\n\nFollowing Text Summary:\nThe following text provides a combat tip for the Apramana Bat fight, describing its talon slam attack. It explains that the attack can be deflected using the \"Rock Solid\" ability, which sends the bat flying backward and causes it to fall out of the sky. This creates an opportunity for the player to retaliate while the bat is vulnerable."
}