{
    "chunk_id": 688096511458,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "h1_title": "Fright Cliff Walkthrough",
    "h2_title": "Yaoguai King Boss Fight - Stone Vanguard",
    "h3_title": "Secret - Get Help from the Shigandang",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/34/Wukong_Fright_47.jpg",
    "alt_text": "Wukong Fright 47.jpg",
    "position_desc": 51,
    "img_above_text": "# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n\nRealizing the error of his ways, the Man-in-Stone will promptly burrow right back in the ground and plead for mercy. You’ll then be able to re-harvest the Stone Essence from him, which will turn into the **Azure Dust Transformation Spell**! Finally, the slow yet sturdy power of the Rock Guai is yours to command in battle!\n\nUnlike the Red Waves wolf transformation, you’ll be extremely slow, unable to dodge, and overall be a pretty big target. On the plus side, you’ll be immune to all status effects while transformed, and deal incredible damage that staggers most enemies. Instead of Might building on attack, you’ll build it while taking damage, allowing you to soak blows and unleash a powerful jump attack spell in return!\n\nAs an added bonus, if you keep hassling the Man-in-Stone, he’ll promise to prepare wares to sell the next time you visit. Be sure to take him up on this offer, as he’ll have a decent selection of (very high-priced) goods!\n\nMan-in-Stone's Shop\n| Man-in-Stone's Shop                | Man-in-Stone's Shop           |\n| ---------------------------------- | ----------------------------- |\n| Blood of the Iron Bull - 3280 Will | Gold Ridge Beast - 12800 Will |\n| Iron Pellet - 6480 Will            |                               |\n| Goldflora Hairpin - 12800 Will     |                               |\n| Sobering Stone - 6480 Will         |                               |\n\n\nJust past this final Buddha statue head, look through the archway opening in the rocky wall. Ahead you’ll spot a group of stone floating in the air, signaling your next boss fight is at hand. There's also a strange large rock to the left - make a note of it and we'll inspect it later.\n\n## Yaoguai King Boss Fight - Stone Vanguard\n\n### Secret - Get Help from the Shigandang\n\nIt’s these major slamming attacks you’ll need to be extra careful, and watch closely for when its front arms begin to glow. These types of attacks mean his arms will soon have a delayed detonation, and are designed to bait you into countering early and getting caught in the blast. Instead, hang back and use the Thrust Stance if possible to unleash a charged hit from a safe distance to the side, as the detonation will also trigger rocks to rip upwards in front of him.",
    "img_below_text": "While the explosion and rocky spikes can be dodged with good timing — it’s also possible to negate the effect by using your charged Pillar Stance. When done at a reasonable distance, you’ll simply ignore the tremor below you, and can follow up with a charged strike that often staggers the monster. However, if you try to create a pillar too close to his hands, the explosion can send you tumbling, though it usually absorbs the damage.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fright Cliff Walkthrough\n            - Section Title: Yaoguai King Boss Fight - Stone Vanguard\n            - Sub-Section Title: Secret - Get Help from the Shigandang\n\n            Context:\n            - Preceding Text: \"# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n\nRealizing the error of his ways, the Man-in-Stone will promptly burrow right back in the ground and plead for mercy. You’ll then be able to re-harvest the Stone Essence from him, which will turn into the **Azure Dust Transformation Spell**! Finally, the slow yet sturdy power of the Rock Guai is yours to command in battle!\n\nUnlike the Red Waves wolf transformation, you’ll be extremely slow, unable to dodge, and overall be a pretty big target. On the plus side, you’ll be immune to all status effects while transformed, and deal incredible damage that staggers most enemies. Instead of Might building on attack, you’ll build it while taking damage, allowing you to soak blows and unleash a powerful jump attack spell in return!\n\nAs an added bonus, if you keep hassling the Man-in-Stone, he’ll promise to prepare wares to sell the next time you visit. Be sure to take him up on this offer, as he’ll have a decent selection of (very high-priced) goods!\n\nMan-in-Stone's Shop\n| Man-in-Stone's Shop                | Man-in-Stone's Shop           |\n| ---------------------------------- | ----------------------------- |\n| Blood of the Iron Bull - 3280 Will | Gold Ridge Beast - 12800 Will |\n| Iron Pellet - 6480 Will            |                               |\n| Goldflora Hairpin - 12800 Will     |                               |\n| Sobering Stone - 6480 Will         |                               |\n\n\nJust past this final Buddha statue head, look through the archway opening in the rocky wall. Ahead you’ll spot a group of stone floating in the air, signaling your next boss fight is at hand. There's also a strange large rock to the left - make a note of it and we'll inspect it later.\n\n## Yaoguai King Boss Fight - Stone Vanguard\n\n### Secret - Get Help from the Shigandang\n\nIt’s these major slamming attacks you’ll need to be extra careful, and watch closely for when its front arms begin to glow. These types of attacks mean his arms will soon have a delayed detonation, and are designed to bait you into countering early and getting caught in the blast. Instead, hang back and use the Thrust Stance if possible to unleash a charged hit from a safe distance to the side, as the detonation will also trigger rocks to rip upwards in front of him.\"\n            - Following Text: \"While the explosion and rocky spikes can be dodged with good timing — it’s also possible to negate the effect by using your charged Pillar Stance. When done at a reasonable distance, you’ll simply ignore the tremor below you, and can follow up with a charged strike that often staggers the monster. However, if you try to create a pillar too close to his hands, the explosion can send you tumbling, though it usually absorbs the damage.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text provides context for the gameplay leading up to the Yaoguai King boss fight. It describes strategies for dealing with earlier enemies, such as the Pitstone and Man-in-Stone, and highlights the rewards for defeating them, including the **Azure Dust Transformation Spell** and access to Man-in-Stone's shop. The text also sets the stage for the upcoming boss fight by mentioning the floating stones and a notable rock near the area.\n\nImage Summary:\nThe image depicts the **Stone Vanguard**, a large, rocky boss in the Yaoguai King fight. The scene shows the player character engaged in combat, surrounded by debris and rocky spikes, emphasizing the destructive nature of the boss's attacks. The glowing arms of the Stone Vanguard suggest an imminent attack, aligning with the text's warning about delayed detonations. The health bar labeled \"Stone Vanguard\" further confirms the boss encounter.\n\nFollowing Text Summary:\nThe following text elaborates on strategies for dealing with the Stone Vanguard's explosive arm attacks and rocky spikes. It advises using the **Pillar Stance** at a safe distance to negate tremors and stagger the boss with a charged strike. The text warns against creating pillars too close to the boss's hands, as the explosion can knock the player back, though it may absorb damage."
}