{
    "chunk_id": 635550179996,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "h1_title": "Furnace Valley Walkthrough",
    "h2_title": "Valley Entrance",
    "h3_title": "Yaoguai Chief - Cloudy Mist, Misty Cloud",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0f/Furnace_Valley_Walkthrough_%2861%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(61\\).png",
    "position_desc": 31,
    "img_above_text": "# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n## Valley Entrance\n\nUltimately, you're going to go left to continue on the main path (and you may start to hear characters talk as you approach this pillar), but for now, you'll want to detour and explore the area to the right.\n\nThe first thing you'll see as you go to the right is the Flamlings that sit in the lava. These will spit fire at you, so it's best to deal with them to remove the ranged attacks while you explore.\n\n\nDrop down here, and head right first to collect the Fire Date from the tree. Then go in the opposite direction toward the lava streaming from the ceiling. This is where you can find one of the optional bosses in Chapter 5, the Flint Chief.\n\n\nNow turn back the other way and continue up the valley. At the top of the path, you'll come to another archway and the start of Rakshasa Palace.\n\nAs soon as you pass through the archway, the next boss battle will begin and you'll discover who was responsible for the voices you heard earlier.\n\n### Yaoguai Chief - Cloudy Mist, Misty Cloud\n\nThe fight can feel quite fast-paced as they swap in and out to attack, so to put an end to their teamwork and slow things down, make use of spells like Immobilize. You should then aim to build as much Focus as possible and look for opportunities to perform heavy attacks. Both bosses can be staggered by this, giving you a chance to whittle down their health.",
    "img_below_text": "After defeating them collect the Spirit they drop, then continue up the stairs toward the palace.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Furnace Valley Walkthrough\n            - Section Title: Valley Entrance\n            - Sub-Section Title: Yaoguai Chief - Cloudy Mist, Misty Cloud\n\n            Context:\n            - Preceding Text: \"# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n## Valley Entrance\n\nUltimately, you're going to go left to continue on the main path (and you may start to hear characters talk as you approach this pillar), but for now, you'll want to detour and explore the area to the right.\n\nThe first thing you'll see as you go to the right is the Flamlings that sit in the lava. These will spit fire at you, so it's best to deal with them to remove the ranged attacks while you explore.\n\n\nDrop down here, and head right first to collect the Fire Date from the tree. Then go in the opposite direction toward the lava streaming from the ceiling. This is where you can find one of the optional bosses in Chapter 5, the Flint Chief.\n\n\nNow turn back the other way and continue up the valley. At the top of the path, you'll come to another archway and the start of Rakshasa Palace.\n\nAs soon as you pass through the archway, the next boss battle will begin and you'll discover who was responsible for the voices you heard earlier.\n\n### Yaoguai Chief - Cloudy Mist, Misty Cloud\n\nThe fight can feel quite fast-paced as they swap in and out to attack, so to put an end to their teamwork and slow things down, make use of spells like Immobilize. You should then aim to build as much Focus as possible and look for opportunities to perform heavy attacks. Both bosses can be staggered by this, giving you a chance to whittle down their health.\"\n            - Following Text: \"After defeating them collect the Spirit they drop, then continue up the stairs toward the palace.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the player's progression through the Furnace Valley Walkthrough, specifically the Valley Entrance section. It outlines exploration routes, encounters with enemies like Flamlings, and optional bosses such as the Flint Chief. It also introduces the next major encounter with the Yaoguai Chief duo, Cloudy Mist and Misty Cloud, emphasizing their fast-paced teamwork and strategies for defeating them.\n\nImage Summary:\nThe image depicts a player character standing in a dimly lit area with rocky terrain and snow-like ground. The character is facing a glowing purple object labeled \"E Take,\" suggesting an interactable item or reward. This likely represents the Spirit dropped after defeating the Yaoguai Chief duo, Cloudy Mist and Misty Cloud, as described in the walkthrough.\n\nFollowing Text Summary:\nThe following text instructs the player to collect the Spirit dropped by the Yaoguai Chief duo after defeating them. It then directs the player to continue ascending the stairs toward Rakshasa Palace, the next area in the walkthrough."
}