{
    "chunk_id": 772149309073,
    "source_file": "Chapter_2_Secret_-_Kingdom_of_Sahali_Walkthrough.md",
    "h1_title": "Chapter 2 Secret - Kingdom of Sahali Walkthrough",
    "h2_title": "How to Access the Kingdom of Sahali",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/ae/Wukong_Sahali_1.jpg",
    "alt_text": "Wukong Sahali 1.jpg",
    "position_desc": 9,
    "img_above_text": "# Chapter 2 Secret - Kingdom of Sahali Walkthrough\n\nThe Kingdom of Sahali is a Secret Area found in Chapter 2's Yellow Wind Ridge of Black Myth Wukong. Below you'll find a guide to accessing the kingdom of the past by undertaking the Drunk Boar's Questline to find a Sobering Stone, and how to defeat the Tiger Vanguard and secret Yaoguai King Boss, Fuban.\n\n* Jump to a Section:\n* **How to Access the Kingdom of Sahali**\n- Yaoguai Chief - \"Tiger Vanguard\"\n* **Sandgate Bound**\n- Yaoguai King - Fuban\n\nThis Chapter 2 Secret can only be accessed by meeting the Yellow-Robed Square in Fright Cliff (aka the Drunken Boar), and helping him in his search for the \"Realm of Gold\" which requires a few steps (and for you to best him in combat).\n\n## How to Access the Kingdom of Sahali\n\nThis “senior brother” is the First Prince of Flowing Sand — aka the giant rat Yaoguai Chief that you can fight in the Valley of Despair on the road from Sandgate Village to the Crouching Tiger Temple. If you didn’t kill the rat king, he’ll summon the prince to fight you. Otherwise, you can use the Pungent Flesh Chunk to summon and defeat him yourself. He’ll drop the Arhat Gold Piece when defeated, which is the gold the Boar needs.",
    "img_below_text": "The Boar will actually return to near where you first met him at the Rockrest Flat area of the Fright Cliff. However, instead of sitting on a rock, he’ll now be standing over by the stairs leading to a large door you can’t access yet.\n\nUnfortunately, he’s not too pleased that you’re in possession of the gold, and will challenge you to a duel. Upon defeat, he’ll relent and offer to let you join him in exploring the Realm of Gold together, before vanishing off behind the giant gate up the stairs.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chapter 2 Secret - Kingdom of Sahali Walkthrough\n            - Section Title: How to Access the Kingdom of Sahali\n\n            Context:\n            - Preceding Text: \"# Chapter 2 Secret - Kingdom of Sahali Walkthrough\n\nThe Kingdom of Sahali is a Secret Area found in Chapter 2's Yellow Wind Ridge of Black Myth Wukong. Below you'll find a guide to accessing the kingdom of the past by undertaking the Drunk Boar's Questline to find a Sobering Stone, and how to defeat the Tiger Vanguard and secret Yaoguai King Boss, Fuban.\n\n* Jump to a Section:\n* **How to Access the Kingdom of Sahali**\n- Yaoguai Chief - \"Tiger Vanguard\"\n* **Sandgate Bound**\n- Yaoguai King - Fuban\n\nThis Chapter 2 Secret can only be accessed by meeting the Yellow-Robed Square in Fright Cliff (aka the Drunken Boar), and helping him in his search for the \"Realm of Gold\" which requires a few steps (and for you to best him in combat).\n\n## How to Access the Kingdom of Sahali\n\nThis “senior brother” is the First Prince of Flowing Sand — aka the giant rat Yaoguai Chief that you can fight in the Valley of Despair on the road from Sandgate Village to the Crouching Tiger Temple. If you didn’t kill the rat king, he’ll summon the prince to fight you. Otherwise, you can use the Pungent Flesh Chunk to summon and defeat him yourself. He’ll drop the Arhat Gold Piece when defeated, which is the gold the Boar needs.\"\n            - Following Text: \"The Boar will actually return to near where you first met him at the Rockrest Flat area of the Fright Cliff. However, instead of sitting on a rock, he’ll now be standing over by the stairs leading to a large door you can’t access yet.\n\nUnfortunately, he’s not too pleased that you’re in possession of the gold, and will challenge you to a duel. Upon defeat, he’ll relent and offer to let you join him in exploring the Realm of Gold together, before vanishing off behind the giant gate up the stairs.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the process of accessing the Kingdom of Sahali, a secret area in Chapter 2 of Black Myth Wukong. To enter this kingdom, players must undertake the Drunk Boar's Questline, which involves finding a Sobering Stone and defeating the Tiger Vanguard and the secret Yaoguai King Boss, Fuban. The quest begins by meeting the Yellow-Robed Square, also known as the Drunken Boar, at Fright Cliff and assisting him in his search for the \"Realm of Gold.\"\n\nImage Summary:\nThe image depicts a rugged landscape with a prominent stone structure and stairs leading to a large door, suggesting a significant location within the game. Two characters are visible; one appears to be a boar-like figure standing near the stairs, possibly representing the Drunken Boar mentioned in the context. The other character is in motion, possibly indicating a dynamic or action-oriented scene related to the questline described.\n\nFollowing Text Summary:\nThe following text explains that after acquiring the gold needed for the quest, the Boar returns to the Rockrest Flat area of Fright Cliff. He stands by the stairs leading to a large door, challenging the player to a duel due to displeasure over the possession of the gold. Upon defeat, the Boar agrees to explore the Realm of Gold with the player and disappears behind the giant gate up the stairs."
}