{
    "chunk_id": 412312668723,
    "source_file": "Supreme_Celestial_Inspector_.md",
    "h1_title": "Supreme Celestial Inspector",
    "h2_title": "How to Find the Supreme Celestial Inspector",
    "h3_title": "Yaoguai Chief - Supreme Inspector",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d5/Foothills_Walkthrough_%2815%29.png",
    "alt_text": "Foothills Walkthrough \\(15\\).png",
    "position_desc": 5,
    "img_above_text": "# Supreme Celestial Inspector\n\nSupreme Inspector is one of the main Character Bosses you'll need to fight in Chapter 6 of Black Myth: Wukong. The winged creature is the first boss you'll encounter in the Chapter, as The Destined One makes the climb to the top of the mountain.\n\n## How to Find the Supreme Celestial Inspector\n\nMake your way into the center of the clearing, where Bajie will exclaim it's a dead end. However, you'll soon be joined by the Supreme Celestial Inspector. If you found all of the Purple Talismans in Chapter 4, then this will be a familiar face to you.\n\n### Yaoguai Chief - Supreme Inspector\n\nSecondly, you can expect The Supreme Inspector to fly up into the air quite often, where it will continue to attack you but be unreachable. When it's up in the air, it will largely use projectiles. These are typically in groups and need to be dodged to avoid them. You can throw the Plantain Fan out when it's airborne to immediately bring it back down and leave it vulnerable to attacks.",
    "img_below_text": "The Supreme Inspector is also able to turn its wings to solid gold and deflect your attacks. You can still do damage when this happens, but it'll be minimal. Bajie will explain to you that when this happens, it's best to wait until it spreads its wings again. Still, you should try to be as aggressive as you can while you have Bajie helping you in the first part of the fight. As always, try to reserve any Gourd usage while you have Bajie, as he'll often top up your health.\n\nBesides the projectiles and using its wings to attack, the Supreme Inspector also uses a sword. This is where the thunder attacks come from, and they can vary significantly.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Supreme Celestial Inspector\n            - Section Title: How to Find the Supreme Celestial Inspector\n            - Sub-Section Title: Yaoguai Chief - Supreme Inspector\n\n            Context:\n            - Preceding Text: \"# Supreme Celestial Inspector\n\nSupreme Inspector is one of the main Character Bosses you'll need to fight in Chapter 6 of Black Myth: Wukong. The winged creature is the first boss you'll encounter in the Chapter, as The Destined One makes the climb to the top of the mountain.\n\n## How to Find the Supreme Celestial Inspector\n\nMake your way into the center of the clearing, where Bajie will exclaim it's a dead end. However, you'll soon be joined by the Supreme Celestial Inspector. If you found all of the Purple Talismans in Chapter 4, then this will be a familiar face to you.\n\n### Yaoguai Chief - Supreme Inspector\n\nSecondly, you can expect The Supreme Inspector to fly up into the air quite often, where it will continue to attack you but be unreachable. When it's up in the air, it will largely use projectiles. These are typically in groups and need to be dodged to avoid them. You can throw the Plantain Fan out when it's airborne to immediately bring it back down and leave it vulnerable to attacks.\"\n            - Following Text: \"The Supreme Inspector is also able to turn its wings to solid gold and deflect your attacks. You can still do damage when this happens, but it'll be minimal. Bajie will explain to you that when this happens, it's best to wait until it spreads its wings again. Still, you should try to be as aggressive as you can while you have Bajie helping you in the first part of the fight. As always, try to reserve any Gourd usage while you have Bajie, as he'll often top up your health.\n\nBesides the projectiles and using its wings to attack, the Supreme Inspector also uses a sword. This is where the thunder attacks come from, and they can vary significantly.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}