{
    "chunk_id": 721110708740,
    "source_file": "Captain_Kalpa-Wave.md",
    "h1_title": "Captain Kalpa-Wave",
    "h2_title": "Where to Find Captain Kalpa-Wave",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/05/Wukong_Longevity_20.jpg",
    "alt_text": "Wukong Longevity 20.jpg",
    "position_desc": 2,
    "img_above_text": "# Captain Kalpa-Wave\n\nCaptain Kalpa-Wave is an required miniboss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Guarding the entrance to the New Thunderclap Temple, you will have to defeat him to gain access to the final region of The New West.\n\n* **Rewards:** Spirit of Captain Kalpa-Wave, Mind Core, Refined Iron Sand, Random Materials, 1847 Experience, 1190 Will\n\n## Where to Find Captain Kalpa-Wave\n\nTo find him, you'll need to make your way through the Valley of Ecstasy after crossing the Bitter Lake, and head through the Path of Longevity toward the large pagoda tower rising above the New Thunderclap Temple in the distance.",
    "img_below_text": "As you approach, a large bloody miasma will block your advance. Once it congeals, you'll find yourself facing the last of the four captains.\n\n### Captain Kalpa-Wave Miniboss Fight and Guide\n\nAs the last of the four captains, Kalpa-Wave looks scarier than he actually is, especially once you learn his tricks.\n\nWith his large towering body, Kapla-Wave has a few physical attacks that generally alternate between stomps of his legs, or a mighty leap that causes him to crash into the ground, but both attacks aren't too bad to deal with.\n\nWhat really makes Kalpa-Wave unique is his ability to spew blood out. Lots of it. This can take on many forms, and you'll need to know how to deal with each of them.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Captain Kalpa-Wave\n            - Section Title: Where to Find Captain Kalpa-Wave\n\n            Context:\n            - Preceding Text: \"# Captain Kalpa-Wave\n\nCaptain Kalpa-Wave is an required miniboss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Guarding the entrance to the New Thunderclap Temple, you will have to defeat him to gain access to the final region of The New West.\n\n* **Rewards:** Spirit of Captain Kalpa-Wave, Mind Core, Refined Iron Sand, Random Materials, 1847 Experience, 1190 Will\n\n## Where to Find Captain Kalpa-Wave\n\nTo find him, you'll need to make your way through the Valley of Ecstasy after crossing the Bitter Lake, and head through the Path of Longevity toward the large pagoda tower rising above the New Thunderclap Temple in the distance.\"\n            - Following Text: \"As you approach, a large bloody miasma will block your advance. Once it congeals, you'll find yourself facing the last of the four captains.\n\n### Captain Kalpa-Wave Miniboss Fight and Guide\n\nAs the last of the four captains, Kalpa-Wave looks scarier than he actually is, especially once you learn his tricks.\n\nWith his large towering body, Kapla-Wave has a few physical attacks that generally alternate between stomps of his legs, or a mighty leap that causes him to crash into the ground, but both attacks aren't too bad to deal with.\n\nWhat really makes Kalpa-Wave unique is his ability to spew blood out. Lots of it. This can take on many forms, and you'll need to know how to deal with each of them.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Captain Kalpa-Wave as a required miniboss in Chapter 3 of Black Myth Wukong, guarding the entrance to the New Thunderclap Temple. Players must defeat him to access the final region of The New West. The text provides details on the rewards for defeating him and describes the path to reach him through the Valley of Ecstasy and the Path of Longevity.\n\nImage Summary:\nThe image depicts a scene from the game Black Myth Wukong, showing a character approaching a large, ominous structure with a bloody miasma blocking the entrance. This visual likely represents the moment before encountering Captain Kalpa-Wave, emphasizing the foreboding atmosphere and the challenge ahead.\n\nFollowing Text Summary:\nThe following text describes the encounter with Captain Kalpa-Wave, noting that he appears intimidating but can be managed once his attack patterns are understood. It details his physical attacks, such as stomps and leaps, and highlights his unique ability to spew blood, which players must learn to counter effectively."
}