{
    "chunk_id": 253036151273,
    "source_file": "Elder_Armourworm_Spirit.md",
    "h1_title": "Elder Armourworm Spirit",
    "h2_title": "Elder Armourworm Location",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4e/Elder_Armourworm_Location.jpg",
    "alt_text": "Elder Armourworm Location.jpg",
    "position_desc": 2,
    "img_above_text": "# Elder Armourworm Spirit\n\n## Elder Armourworm Location\n\nThe Elder Armourworm can be found in a small clearing overlooking the forest outside the Webbed Hollow. To get there from the Verdure Bridge Keeper's Shrine, take the path on the left of the Shrine (if you're facing it). Stick to the left and pass through a wooden gate to find a room full of chests. Loot them and continue through the opening on the opposite wall to find a small clearing overlooking the Webbed Hollow. Drop down to find the Elder Armourworm.",
    "img_below_text": "",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Elder Armourworm Spirit\n            - Section Title: Elder Armourworm Location\n\n            Context:\n            - Preceding Text: \"# Elder Armourworm Spirit\n\n## Elder Armourworm Location\n\nThe Elder Armourworm can be found in a small clearing overlooking the forest outside the Webbed Hollow. To get there from the Verdure Bridge Keeper's Shrine, take the path on the left of the Shrine (if you're facing it). Stick to the left and pass through a wooden gate to find a room full of chests. Loot them and continue through the opening on the opposite wall to find a small clearing overlooking the Webbed Hollow. Drop down to find the Elder Armourworm.\"\n            - Following Text: \"\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text provides directions to locate the Elder Armourworm Spirit in a game or narrative setting. It describes the path starting from the Verdure Bridge Keeper's Shrine, passing through a wooden gate, and a room with chests before reaching a clearing overlooking the Webbed Hollow. Dropping down from this clearing leads to the Elder Armourworm's location.\n\nImage Summary:\nThe image depicts a dark, atmospheric clearing surrounded by rocky cliffs and dense vegetation, consistent with the described location of the Elder Armourworm Spirit. A character dressed in detailed armor and wielding a staff stands amidst a field littered with web-like textures and egg-like objects, suggesting the presence of a creature or entity tied to the environment. The interface elements indicate gameplay, possibly involving exploration or combat.\n\nFollowing Text Summary:\nNo following text is provided, suggesting the image serves as a visual representation or confirmation of the described location and atmosphere for the Elder Armourworm Spirit encounter."
}