{
    "chunk_id": 253062390142,
    "source_file": "Apramana_Bat.md",
    "h1_title": "Apramana Bat",
    "h2_title": "Where to Find the Apramana Bat",
    "h3_title": "Apramana Bat Miniboss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0b/Wukong_Bitter_41.jpg",
    "alt_text": "Wukong Bitter 41.jpg",
    "position_desc": 7,
    "img_above_text": "# Apramana Bat\n\nApramana Bat is an optional and missable Yaoguai Chief boss fight, and can be encountered in Chapter 3 of Black Myth Wukong. First located along the North Shore of the Bitter Lake, you'll want to face it before entering the Valley of Ecstasy or you'll miss out on this fight altogether.\n\n* **Rewards:** Cold Iron Leaves x2, 1847 Experience, 1176 Will (First Encounter), Apramana Bat Spirit (Second Encounter)\n\n## Where to Find the Apramana Bat\n\nA much larger gold variant of the Apramana Bats you can encounter elsewhere in Chapter 3, the Apramana Bat boss can be found once you leave the Turtle Island. From the North Shore of Bitter Lake, head right from the Shrine and along the coast until you come upon the skeletal remains of the Snake General. Once you arrive where his skull is located, the giant bat will ambush you.\n\n### Apramana Bat Miniboss Fight and Guide\n\nIf you aren't getting enough time in, consider using Immobilize to keep him grounded, and use the Pillar Stance to extend your height as it tries to take off.",
    "img_below_text": "Once you've gotten it on the ground for an extended period to dish out damage, be mindful not to get overconfident. If you see it hunch over and turn completely gold, it will use its own rock solid deflection to make your attack bounce off.\n\nListen for the sound cue of your attack being deflected, and it will quickly rise up and extend a bladed wing up in the air before slamming it down on you. You can turn the tables with your own deflection (though it will send you sliding back), or dodge to the side and bash it with a Spirit Attack.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Apramana Bat\n            - Section Title: Where to Find the Apramana Bat\n            - Sub-Section Title: Apramana Bat Miniboss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Apramana Bat\n\nApramana Bat is an optional and missable Yaoguai Chief boss fight, and can be encountered in Chapter 3 of Black Myth Wukong. First located along the North Shore of the Bitter Lake, you'll want to face it before entering the Valley of Ecstasy or you'll miss out on this fight altogether.\n\n* **Rewards:** Cold Iron Leaves x2, 1847 Experience, 1176 Will (First Encounter), Apramana Bat Spirit (Second Encounter)\n\n## Where to Find the Apramana Bat\n\nA much larger gold variant of the Apramana Bats you can encounter elsewhere in Chapter 3, the Apramana Bat boss can be found once you leave the Turtle Island. From the North Shore of Bitter Lake, head right from the Shrine and along the coast until you come upon the skeletal remains of the Snake General. Once you arrive where his skull is located, the giant bat will ambush you.\n\n### Apramana Bat Miniboss Fight and Guide\n\nIf you aren't getting enough time in, consider using Immobilize to keep him grounded, and use the Pillar Stance to extend your height as it tries to take off.\"\n            - Following Text: \"Once you've gotten it on the ground for an extended period to dish out damage, be mindful not to get overconfident. If you see it hunch over and turn completely gold, it will use its own rock solid deflection to make your attack bounce off.\n\nListen for the sound cue of your attack being deflected, and it will quickly rise up and extend a bladed wing up in the air before slamming it down on you. You can turn the tables with your own deflection (though it will send you sliding back), or dodge to the side and bash it with a Spirit Attack.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe Apramana Bat is an optional miniboss in Chapter 3 of *Black Myth: Wukong*. It is a larger, gold variant of the regular bats encountered earlier and can be found near the skeletal remains of the Snake General at the North Shore of Bitter Lake. Players must face it before entering the Valley of Ecstasy to avoid missing the fight. Rewards include Cold Iron Leaves, experience points, Will, and a Spirit item upon subsequent encounters.\n\nImage Summary:\nThe image depicts an intense combat scene between the player character and the Apramana Bat miniboss. The bat is in its gold form, signifying its defensive state, while the player wields a weapon mid-action. The snowy terrain and skeletal remains in the background match the described location near the Snake General’s skull. Visual cues such as the health bar, combat abilities, and glowing effects emphasize the boss fight's challenging nature.\n\nFollowing Text Summary:\nThe following text provides tactical advice for fighting the Apramana Bat. Players are warned to avoid overconfidence when the bat turns completely gold, as it can deflect attacks and counter with a powerful wing slam. Strategies include deflecting its attack or dodging to the side before retaliating with a Spirit Attack."
}