{
    "chunk_id": 407953079765,
    "source_file": "Fungiwoman_Spirit.md",
    "h1_title": "Fungiwoman Spirit",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d7/Funghi_Woman.jpg",
    "alt_text": "Funghi Woman.jpg",
    "position_desc": 1,
    "img_above_text": "# Fungiwoman Spirit\n\nThe **Fungiwoman** is a foe that you will face off against in Black Myth: Wukong. Once defeated, the Fungiwoman offers up her Spirit for you to absorb, allowing you to use some of her powers for a short time. On this page, we will go over everything you need to know about the Fungiwoman, including where to find her, how to defeat her, and what power her Spirit gives you.\n\n* Fungiwoman Location\n* Fungiwoman Fight\n* Fungiwoman Spirit",
    "img_below_text": "## Fungiwoman Location\n\nThe Fungiwoman can be found near the Temple of the Yellow Flowers. From the temple entrance, take the path on the left and head up the stairs, taking out enemies as you go. You will come across a small, concrete clearing with two Snake Herbalists and a couple of centipedes to defeat.\n\nDefeat the enemies and run to the back of the clearing. Turn right and make your way up the hill to reach another small clearing containing a shack and three mushrooms. One of these mushrooms is the Fungiwoman.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fungiwoman Spirit\n\n            Context:\n            - Preceding Text: \"# Fungiwoman Spirit\n\nThe **Fungiwoman** is a foe that you will face off against in Black Myth: Wukong. Once defeated, the Fungiwoman offers up her Spirit for you to absorb, allowing you to use some of her powers for a short time. On this page, we will go over everything you need to know about the Fungiwoman, including where to find her, how to defeat her, and what power her Spirit gives you.\n\n* Fungiwoman Location\n* Fungiwoman Fight\n* Fungiwoman Spirit\"\n            - Following Text: \"## Fungiwoman Location\n\nThe Fungiwoman can be found near the Temple of the Yellow Flowers. From the temple entrance, take the path on the left and head up the stairs, taking out enemies as you go. You will come across a small, concrete clearing with two Snake Herbalists and a couple of centipedes to defeat.\n\nDefeat the enemies and run to the back of the clearing. Turn right and make your way up the hill to reach another small clearing containing a shack and three mushrooms. One of these mushrooms is the Fungiwoman.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Fungiwoman, a foe encountered in *Black Myth: Wukong*. Upon defeating her, players can absorb her Spirit to temporarily gain her powers. The section outlines the topics covered, including her location, combat strategies, and the abilities granted by her Spirit.\n\nImage Summary:  \nThe image depicts an in-game scene from *Black Myth: Wukong*, showcasing the player character engaged in combat with the Fungiwoman. The environment features a forested area with stone pathways and scattered vegetation. The Fungiwoman, a humanoid figure with mushroom-like features, is visible in the background, while the player character wields a weapon and prepares for battle. Game interface elements, such as health bars and ability icons, are displayed, emphasizing the active combat scenario.\n\nFollowing Text Summary:  \nThe following text provides detailed instructions on locating the Fungiwoman near the Temple of the Yellow Flowers. Players are guided through a path involving stairs, enemy encounters, and clearings, ultimately leading to a shack surrounded by mushrooms, one of which transforms into the Fungiwoman."
}