{
    "chunk_id": 608871807155,
    "source_file": "Commander_Beetle_Spirit.md",
    "h1_title": "Commander Beetle Spirit",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/18/Commander_Beetle.jpg",
    "alt_text": "Commander Beetle.jpg",
    "position_desc": 1,
    "img_above_text": "# Commander Beetle Spirit\n\nThe **Commander Beetle** is a foe that you will face off against in Black Myth: Wukong. Once defeated, the Commander Beetle offers up its Spirit for you to absorb, allowing you to use some of its powers for a short time. On this page, we will go over everything you need to know about the Commander Beetle, including where to find it, how to defeat it, and what power its Spirit gives you.\n\n* Commander Beetle Location\n* Commander Beetle Fight\n* Commander Beetle Spirit",
    "img_below_text": "## Commander Beetle Location\n\nThe Commander Beetle can be found teaching a class just outside the Temple of Yellow Flowers in the Webbed Hollow. To find him, defeat Zhu Bajie and the Violet Spider and make your way out of the Webbed Hollow cavern. Pass through the Forest of Felicity and look to the right on the path to the Temple of the Yellow Flowers to find the Commander Beetle teaching his class.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Commander Beetle Spirit\n\n            Context:\n            - Preceding Text: \"# Commander Beetle Spirit\n\nThe **Commander Beetle** is a foe that you will face off against in Black Myth: Wukong. Once defeated, the Commander Beetle offers up its Spirit for you to absorb, allowing you to use some of its powers for a short time. On this page, we will go over everything you need to know about the Commander Beetle, including where to find it, how to defeat it, and what power its Spirit gives you.\n\n* Commander Beetle Location\n* Commander Beetle Fight\n* Commander Beetle Spirit\"\n            - Following Text: \"## Commander Beetle Location\n\nThe Commander Beetle can be found teaching a class just outside the Temple of Yellow Flowers in the Webbed Hollow. To find him, defeat Zhu Bajie and the Violet Spider and make your way out of the Webbed Hollow cavern. Pass through the Forest of Felicity and look to the right on the path to the Temple of the Yellow Flowers to find the Commander Beetle teaching his class.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Commander Beetle, a boss enemy in *Black Myth: Wukong*. It explains that defeating the Commander Beetle allows the player to absorb its Spirit, granting temporary access to its powers. The section outlines the topics covered, including the beetle's location, the fight, and the abilities gained from its Spirit.\n\nImage Summary:  \nThe image depicts an in-game encounter with the Commander Beetle in *Black Myth: Wukong*. The player character is engaged in combat with the humanoid beetle-like boss, whose health bar is visible at the bottom of the screen. The environment suggests an outdoor setting near a temple, with stone pathways and surrounding greenery. The image highlights the intense action and the boss's menacing appearance.\n\nFollowing Text Summary:  \nThe following text provides details on the Commander Beetle's location. It explains that the boss can be found near the Temple of Yellow Flowers, just outside the Webbed Hollow. Players must first defeat other enemies, such as Zhu Bajie and the Violet Spider, before reaching the Commander Beetle, who is described as teaching a class in this area."
}