{
    "chunk_id": 325183781001,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "h1_title": "Fright Cliff Walkthrough",
    "h2_title": "Squall Hideout",
    "h3_title": "The Fourth Buddha’s Eyeball",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/11/Wukong_Fright_26.jpg",
    "alt_text": "Wukong Fright 26.jpg",
    "position_desc": 27,
    "img_above_text": "# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n## Squall Hideout\n\n\nThe large cave entrance has a few paths, with the outer one on the right leading past another Pitstone to a wooden coffin chest holding 3 **Silk** and some **Will**.\n\n\nStart by luring the shieldless Spearbone out of range of the Blazebones above, then climb the stairs to rush down the projectile throwers. Be sure to look at the ruined home at the first landing below the first Blazebone for a yellow chest that has 2 **Yaoguai Core** and 3 **Tiny Piece of Gold**.\n\n\nAt the end of the crevice, you’ll find an unusual looking stone. He’s actually a Man-in-Stone, and claims to have been trapped within the rock form. He’s betting on one of the rock guai in the large cave nearby to hold the secrets to reversing his fate, and asks you to seek it out.\n\n### The Fourth Buddha’s Eyeball\n\nLook for the continuing cave path left of the exit that heads up a grassy slope, and collect the Fire Bellflower before you reach an open area with a Poisetone seemingly praying at an altar on the left with a green Wisp.",
    "img_below_text": "You’ll soon be ambushed by another Poisestone nearby, but this one is wreathed in blue flames and is much stronger. On the plus side, defeating it will earn you the Poisestone Spirit to transform into!",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fright Cliff Walkthrough\n            - Section Title: Squall Hideout\n            - Sub-Section Title: The Fourth Buddha’s Eyeball\n\n            Context:\n            - Preceding Text: \"# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n## Squall Hideout\n\n\nThe large cave entrance has a few paths, with the outer one on the right leading past another Pitstone to a wooden coffin chest holding 3 **Silk** and some **Will**.\n\n\nStart by luring the shieldless Spearbone out of range of the Blazebones above, then climb the stairs to rush down the projectile throwers. Be sure to look at the ruined home at the first landing below the first Blazebone for a yellow chest that has 2 **Yaoguai Core** and 3 **Tiny Piece of Gold**.\n\n\nAt the end of the crevice, you’ll find an unusual looking stone. He’s actually a Man-in-Stone, and claims to have been trapped within the rock form. He’s betting on one of the rock guai in the large cave nearby to hold the secrets to reversing his fate, and asks you to seek it out.\n\n### The Fourth Buddha’s Eyeball\n\nLook for the continuing cave path left of the exit that heads up a grassy slope, and collect the Fire Bellflower before you reach an open area with a Poisetone seemingly praying at an altar on the left with a green Wisp.\"\n            - Following Text: \"You’ll soon be ambushed by another Poisestone nearby, but this one is wreathed in blue flames and is much stronger. On the plus side, defeating it will earn you the Poisestone Spirit to transform into!\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text describes the exploration of the Squall Hideout in *Fright Cliff Walkthrough*. It provides instructions for navigating the area, defeating enemies like Spearbones and Blazebones, and interacting with a Man-in-Stone who requests help in reversing his curse. The section transitions to \"The Fourth Buddha’s Eyeball,\" where players are guided to a cave path leading to an altar with a Poisetone enemy.\n\nImage Summary:  \nThe image depicts an intense combat scene in a dark, grassy area. The player character is engaged in battle with two enemies: one appears to be a Poisetone engulfed in blue flames, while the other is a standard Poisetone. The environment is illuminated by fire and glowing effects, and the on-screen text provides attack options: \"Moon Dance\" (light attack) and \"Moon Chase\" (heavy attack). The image highlights the challenging encounter and the use of specific combat abilities.\n\nFollowing Text Summary:  \nThe following text warns of an ambush by a stronger Poisestone wreathed in blue flames. Defeating this enemy rewards the player with the Poisestone Spirit, a transformation ability. This encounter is part of the ongoing progression in the \"The Fourth Buddha’s Eyeball\" sub-section."
}