{
    "chunk_id": 924768942195,
    "source_file": "Black_Bear_Guai.md",
    "h1_title": "Black Bear Guai",
    "h2_title": "Black Bear Guai Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2f/Wukong_BlackWind_36.jpg",
    "alt_text": "Wukong BlackWind 36.jpg",
    "position_desc": 5,
    "img_above_text": "# Black Bear Guai\n\nThe Black Bear Guai is a required Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located at the very end of Chapter 1 at the top of Black Wind Mountain, this is the second of two forms you'll fight the self-imposed King. Now in the form of a giant bear, he'll harness the power of fire to try and burn you alive.\n\n* **Rewards:** Craving Eyes Relic, Flame Ebongold, Yarn x5, Silk x2, Spirit Stone x1, Yaoguai Core x1, Mind Core x1, 1641 Experience, 990 Will\n\n\nAs a required boss, you won't be able to miss running into the Black Wind King. You can find him at the very end of the chapter by progressing through Black Wind Cave and up the mountain, past all of the wolf defenses until you reach Bodhi Peak.\n\n## Black Bear Guai Boss Fight and Guide\n\nFor most of this fight, your key strategy should involve picking your moments to attack wisely, waiting for his bigger slams that take him a while to get back up and unleash your combo attacks.",
    "img_below_text": "However, once he’s at a bit less than half of his health, he’ll retreat away and let loose a roar as he slams the ground, engulfing himself in flames as several eruptions take over the arena. Dodge away from them, and if you find yourself burning, either roll repeatedly or use a cooling powder.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Black Bear Guai\n            - Section Title: Black Bear Guai Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Black Bear Guai\n\nThe Black Bear Guai is a required Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located at the very end of Chapter 1 at the top of Black Wind Mountain, this is the second of two forms you'll fight the self-imposed King. Now in the form of a giant bear, he'll harness the power of fire to try and burn you alive.\n\n* **Rewards:** Craving Eyes Relic, Flame Ebongold, Yarn x5, Silk x2, Spirit Stone x1, Yaoguai Core x1, Mind Core x1, 1641 Experience, 990 Will\n\n\nAs a required boss, you won't be able to miss running into the Black Wind King. You can find him at the very end of the chapter by progressing through Black Wind Cave and up the mountain, past all of the wolf defenses until you reach Bodhi Peak.\n\n## Black Bear Guai Boss Fight and Guide\n\nFor most of this fight, your key strategy should involve picking your moments to attack wisely, waiting for his bigger slams that take him a while to get back up and unleash your combo attacks.\"\n            - Following Text: \"However, once he’s at a bit less than half of his health, he’ll retreat away and let loose a roar as he slams the ground, engulfing himself in flames as several eruptions take over the arena. Dodge away from them, and if you find yourself burning, either roll repeatedly or use a cooling powder.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Black Bear Guai, a required boss fight in Chapter 1 of *Black Myth: Wukong*. This boss, located at the top of Black Wind Mountain, is the second form of the Yaoguai King and uses fire-based attacks to challenge players. The text provides details about the rewards for defeating the boss and mentions the path leading to the encounter.\n\nImage Summary:\nThe image depicts the intense battle against the Black Bear Guai during its fire-engulfed phase. The arena is ablaze with flames, showcasing the boss's fire-based attacks and the chaotic environment players must navigate. The health bar labeled \"Black Bear Guai\" is visible, along with player interface elements such as health, abilities, and items, emphasizing the gameplay mechanics during this challenging phase.\n\nFollowing Text Summary:\nThe following text describes the Black Bear Guai's behavior when its health drops below half. The boss retreats, roars, and triggers fiery eruptions across the arena, increasing the difficulty of the fight. Players are advised to dodge the eruptions and use strategies like rolling or cooling powder to mitigate burning effects."
}