{
    "chunk_id": 189507464682,
    "source_file": "black-myth-wukong.md",
    "h1_title": "Black Myth: Wukong Wiki Sections",
    "h2_title": "Beginner's Guide and Getting Started",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3d/Main_Page_BMW_.png",
    "alt_text": "Main Page BMW .png",
    "position_desc": 2,
    "img_above_text": "# Black Myth: Wukong Wiki Sections\n\n## Beginner's Guide and Getting Started",
    "img_below_text": "Black Myth: Wukong throws you into the action with only a brief tutorial. So, to help you understand some of the gameplay mechanics and features, we've compiled a list of handy beginner tips and tricks, as well as things that the game doesn't explain to you.\n\n* Essential Tips and Tricks\n* Things Black Myth Wukong Doesn't Tell You\n* Best Skills to Unlock\n\nAnd if you're looking to get ahead on achievements so you don't miss a thing, see our **Achievements and Trophies Guide.**",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Black Myth: Wukong Wiki Sections\n            - Section Title: Beginner's Guide and Getting Started\n\n            Context:\n            - Preceding Text: \"# Black Myth: Wukong Wiki Sections\n\n## Beginner's Guide and Getting Started\"\n            - Following Text: \"Black Myth: Wukong throws you into the action with only a brief tutorial. So, to help you understand some of the gameplay mechanics and features, we've compiled a list of handy beginner tips and tricks, as well as things that the game doesn't explain to you.\n\n* Essential Tips and Tricks\n* Things Black Myth Wukong Doesn't Tell You\n* Best Skills to Unlock\n\nAnd if you're looking to get ahead on achievements so you don't miss a thing, see our **Achievements and Trophies Guide.**\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the \"Beginner's Guide and Getting Started\" section of the \"Black Myth: Wukong Wiki.\" It sets the stage for providing new players with essential information and tips to help them navigate the game.\n\nImage Summary:  \nThe image appears to depict a detailed in-game character from \"Black Myth: Wukong,\" showcasing intricate armor design and a staff weapon. The text overlay at the bottom, \"My Master - safe!\" suggests a narrative moment or dialogue related to the game's story.\n\nFollowing Text Summary:  \nThe following text provides an overview of the beginner-friendly content in the guide, including essential tips, hidden gameplay mechanics, recommended skills, and a link to an achievements guide for players aiming to complete the game thoroughly."
}