{
    "chunk_id": 865195992546,
    "source_file": "Green-Capped_Martialist.md",
    "h1_title": "Green-Capped Martialist",
    "h2_title": "Where to Find the Green-Capped Martialist",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e8/Wukong_Brook_6.jpg",
    "alt_text": "Wukong Brook 6.jpg",
    "position_desc": 5,
    "img_above_text": "# Green-Capped Martialist\n\nThe Green-Capped Martialist is an optional and secret Character Boss fight that you can encounter in Chapter 3 of Black Myth Wukong. This boss can only be fought by undertaking a Treasure Hunter's Quest that begins along the Bitter Lake and leads to the Valley of Ecstasy, where you'll have to uncover a secret Melon Field.\n\n* Rewards: Spell-Binder Spell, Cold Iron Leaves, Random Materials, 1847 Experience, 1190 Will\n\n## Where to Find the Green-Capped Martialist\n\nPerform the Circle of Fire Spell to warm him up, and he'll thank you, while giving you more clues to the location of a secret Melon Field.",
    "img_below_text": "This secret spot can be found by going right down the hill from the Forest of Felicity and down to the end of the Brook of Bliss' stream.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Green-Capped Martialist\n            - Section Title: Where to Find the Green-Capped Martialist\n\n            Context:\n            - Preceding Text: \"# Green-Capped Martialist\n\nThe Green-Capped Martialist is an optional and secret Character Boss fight that you can encounter in Chapter 3 of Black Myth Wukong. This boss can only be fought by undertaking a Treasure Hunter's Quest that begins along the Bitter Lake and leads to the Valley of Ecstasy, where you'll have to uncover a secret Melon Field.\n\n* Rewards: Spell-Binder Spell, Cold Iron Leaves, Random Materials, 1847 Experience, 1190 Will\n\n## Where to Find the Green-Capped Martialist\n\nPerform the Circle of Fire Spell to warm him up, and he'll thank you, while giving you more clues to the location of a secret Melon Field.\"\n            - Following Text: \"This secret spot can be found by going right down the hill from the Forest of Felicity and down to the end of the Brook of Bliss' stream.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Green-Capped Martialist, a secret boss in Chapter 3 of *Black Myth Wukong*. Players must complete a Treasure Hunter's Quest starting at Bitter Lake and progressing to the Valley of Ecstasy to uncover a hidden Melon Field. The boss rewards players with valuable items, experience points, and Will upon defeat. Additionally, players must perform the Circle of Fire Spell to warm the Martialist and receive clues to the Melon Field's location.\n\nImage Summary:\nThe image depicts a snowy environment with a character holding a staff near a serene lake surrounded by trees and rocky terrain. The interface shows in-game elements, including inventory, spells, and a notification for collecting \"Gentian x2.\" This scene likely represents a location relevant to the Treasure Hunter's Quest, possibly near Bitter Lake or along the path to the Valley of Ecstasy.\n\nFollowing Text Summary:\nThe following text provides directions to the secret Melon Field, stating that players should head downhill from the Forest of Felicity and follow the Brook of Bliss' stream to its endpoint. This guidance helps players locate the Green-Capped Martialist and progress in the quest."
}