{
    "chunk_id": 579669051829,
    "source_file": "Father_of_Stones.md",
    "h1_title": "Father of Stones",
    "h2_title": "Father of Stones Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/ab/Woods_Ember_Walkthrough_%2876%29.png",
    "alt_text": "Woods Ember Walkthrough \\(76\\).png",
    "position_desc": 7,
    "img_above_text": "# Father of Stones\n\nFather of Stones is a Yaoguai Chief you'll fight soon after you reach the Heights of Ember in Chapter 5 of Black Myth: Wukong.\n\n\nFrom the Heights of Ember Keeper's Shrine, continue toward the open space on the left. When you reach a certain point, the Father of Stones miniboss will jump over the wall near the door on the right.\n\n## Father of Stones Boss Fight and Guide\n\nThe way to approach this fight is to build up your combos and then land a finishing blow on him as often as you can. When you attack like this, the heavy blow will knock him over and leave him vulnerable to a beat down.",
    "img_below_text": "When you've bested him, collect the Father of Stones Spirit he leaves behind.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Father of Stones\n            - Section Title: Father of Stones Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Father of Stones\n\nFather of Stones is a Yaoguai Chief you'll fight soon after you reach the Heights of Ember in Chapter 5 of Black Myth: Wukong.\n\n\nFrom the Heights of Ember Keeper's Shrine, continue toward the open space on the left. When you reach a certain point, the Father of Stones miniboss will jump over the wall near the door on the right.\n\n## Father of Stones Boss Fight and Guide\n\nThe way to approach this fight is to build up your combos and then land a finishing blow on him as often as you can. When you attack like this, the heavy blow will knock him over and leave him vulnerable to a beat down.\"\n            - Following Text: \"When you've bested him, collect the Father of Stones Spirit he leaves behind.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Father of Stones, a miniboss encountered in Chapter 5 of *Black Myth: Wukong*. Players are guided to the fight location near the Heights of Ember, where the Father of Stones ambushes them by jumping over a wall. A strategy for the fight is briefly outlined, emphasizing building combos and landing heavy blows to knock the boss down.\n\nImage Summary:  \nThe image depicts a desolate, eerie outdoor environment with a cobblestone path leading into a misty, barren landscape. A player character, armed with a staff, stands near a glowing blue spirit-like object, suggesting the aftermath of a battle. The setting and the object imply this is the location where the Father of Stones miniboss was defeated, and the spirit is likely the reward for victory.\n\nFollowing Text Summary:  \nThe following text confirms that upon defeating the Father of Stones, players can collect the \"Father of Stones Spirit,\" which is the glowing object left behind in the image."
}