{
    "chunk_id": 475546308749,
    "source_file": "Feng-Tail_General.md",
    "h1_title": "Feng-Tail General",
    "h2_title": "Feng-Tail General Boss Fight and Guides",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c5/Foothills_Walkthrough_%2830%29.png",
    "alt_text": "Foothills Walkthrough \\(30\\).png",
    "position_desc": 3,
    "img_above_text": "# Feng-Tail General\n\nFeng-Tail General is one of the main Yaoguai Chiefs you'll need to find in Chapter 6 of Black Myth: Wukong. Rather than being a traditional boss fight, the Feng-Tail General acts as a test of your stamina and health to make sure you're fit for the journey ahead.\n\n\nWhen the first Poison Chief is down, fly up and continue left toward the water. Go almost to the end of the water, where you should see a giant creature. When you get close to it, it will leap in the air and jump to a nearby rock. Fly over to it, then land on its head.\n\n## Feng-Tail General Boss Fight and Guides\n\nThe boss fight against the Feng-Tail General is more of a skill check than anything, testing out whether you've got the necessary health and stamina to continue.",
    "img_below_text": "Firstly, it will test your stamina. When you approach it near the Mantis-Catching Swamp, and land on its head you'll need to approach its antennae. Interact with them and hold on. It will begin to jump around the water, eventually ending up near the Rhino Watch Slope. Your stamina bar will drain as it does this, and you'll only be able to complete the test if it doesn't completely run out before the critter stops jumping. If you're finding it hard to hold on, reset some skills and ensure that Rampant Vigor is maxed out under Survival, and see if you've missed any Celestial Nonary Pill Locations.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Feng-Tail General\n            - Section Title: Feng-Tail General Boss Fight and Guides\n\n            Context:\n            - Preceding Text: \"# Feng-Tail General\n\nFeng-Tail General is one of the main Yaoguai Chiefs you'll need to find in Chapter 6 of Black Myth: Wukong. Rather than being a traditional boss fight, the Feng-Tail General acts as a test of your stamina and health to make sure you're fit for the journey ahead.\n\n\nWhen the first Poison Chief is down, fly up and continue left toward the water. Go almost to the end of the water, where you should see a giant creature. When you get close to it, it will leap in the air and jump to a nearby rock. Fly over to it, then land on its head.\n\n## Feng-Tail General Boss Fight and Guides\n\nThe boss fight against the Feng-Tail General is more of a skill check than anything, testing out whether you've got the necessary health and stamina to continue.\"\n            - Following Text: \"Firstly, it will test your stamina. When you approach it near the Mantis-Catching Swamp, and land on its head you'll need to approach its antennae. Interact with them and hold on. It will begin to jump around the water, eventually ending up near the Rhino Watch Slope. Your stamina bar will drain as it does this, and you'll only be able to complete the test if it doesn't completely run out before the critter stops jumping. If you're finding it hard to hold on, reset some skills and ensure that Rampant Vigor is maxed out under Survival, and see if you've missed any Celestial Nonary Pill Locations.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Feng-Tail General, a significant Yaoguai Chief encountered in Chapter 6 of *Black Myth: Wukong*. This encounter is described as a stamina and health test rather than a traditional boss fight. Players are guided to locate the creature near the water after defeating the Poison Chief, where they must approach and land on its head to initiate the challenge.\n\nImage Summary:\nThe image depicts a player character standing on the head of a large, grotesque creature with visible antennae and rope-like bindings. The surrounding environment features lush greenery, cliffs, and water, suggesting the location is part of the described swampy area. The image visually represents the moment when the player interacts with the Feng-Tail General, preparing for the stamina-based test.\n\nFollowing Text Summary:\nThe following text elaborates on the stamina challenge, explaining that players must interact with the creature's antennae and hold on while it jumps around the water. Success depends on maintaining stamina until the creature stops. Recommendations include resetting skills, maximizing Rampant Vigor under Survival, and ensuring Celestial Nonary Pill locations are utilized to improve stamina management."
}