{
    "chunk_id": 524897062104,
    "source_file": "Elder_Amourworm.md",
    "h1_title": "Elder Amourworm",
    "h2_title": "Elder Amourworm Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/84/Wukong_MiddleHollow_10.jpg",
    "alt_text": "Wukong MiddleHollow 10.jpg",
    "position_desc": 3,
    "img_above_text": "# Elder Amourworm\n\nThe Elder Amourworm is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the middle section of The Webbed Hollow, this creepy worm hides on an outer cliff past a trove of treasure.\n\n* Rewards: Proto-Amourworm, Cold Iron Leaves, Silk, 1562 Experience, 1465 Will\n\n\nThe Elder Amourworm is an optional encounter that you can seek out while exploring the massive Webbed Hollow Portion of Chapter 4. After descending down to the Vedure Bridge Shrine, head right and cross the nearby bridge, staying to the left to find an archway with two lanterns who seem to be chattering \"Big day!\".\n\nAfter meeting a suspicious ally who will tell you of treasure nearby, head through the gate to find several treasure chests, and an exit onto a cliff filled with cocoons where the Elder Amourworm sits.\n\n## Elder Amourworm Boss Fight and Guide\n\nIf the sticky webs weren't bad enough, its other main trick is the ability to shoot out globs of poison, that will stay on the ground for a short duration even if it misses you. The Elder Amourworm can shoot out these poison globs when facing you, but also when you try to attack from its back, making it dangerous no matter which direction you fight from.",
    "img_below_text": "Even when knocked down, it can behave erratically, wriggling and slamming down to splash out more poison from its sides before getting back up, which can sometimes limit where you can press your attack.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Elder Amourworm\n            - Section Title: Elder Amourworm Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Elder Amourworm\n\nThe Elder Amourworm is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the middle section of The Webbed Hollow, this creepy worm hides on an outer cliff past a trove of treasure.\n\n* Rewards: Proto-Amourworm, Cold Iron Leaves, Silk, 1562 Experience, 1465 Will\n\n\nThe Elder Amourworm is an optional encounter that you can seek out while exploring the massive Webbed Hollow Portion of Chapter 4. After descending down to the Vedure Bridge Shrine, head right and cross the nearby bridge, staying to the left to find an archway with two lanterns who seem to be chattering \"Big day!\".\n\nAfter meeting a suspicious ally who will tell you of treasure nearby, head through the gate to find several treasure chests, and an exit onto a cliff filled with cocoons where the Elder Amourworm sits.\n\n## Elder Amourworm Boss Fight and Guide\n\nIf the sticky webs weren't bad enough, its other main trick is the ability to shoot out globs of poison, that will stay on the ground for a short duration even if it misses you. The Elder Amourworm can shoot out these poison globs when facing you, but also when you try to attack from its back, making it dangerous no matter which direction you fight from.\"\n            - Following Text: \"Even when knocked down, it can behave erratically, wriggling and slamming down to splash out more poison from its sides before getting back up, which can sometimes limit where you can press your attack.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe Elder Amourworm is an optional boss fight in *Black Myth: Wukong*, encountered during Chapter 4 in the Webbed Hollow area. Players can find it after crossing a bridge near the Vedure Bridge Shrine and following a path to a cliff filled with cocoons. The boss uses poison-based attacks, making it dangerous from all angles. Rewards for defeating it include items such as Proto-Amourworm and Cold Iron Leaves, along with experience points and Will.\n\nImage Summary:\nThe image depicts the Elder Amourworm boss fight in *Black Myth: Wukong*. The player character, wielding a fiery staff, is engaged in combat with the massive worm-like creature in a dark, web-filled environment surrounded by cocoons and skeletal remains. The boss health bar labeled \"Elder Amourworm\" is visible at the bottom of the screen, along with player interface elements such as health, abilities, and status indicators.\n\nFollowing Text Summary:\nThe Elder Amourworm can behave unpredictably even when knocked down, wriggling and slamming its body to release poison from its sides. This erratic behavior can limit the player's ability to attack safely, adding complexity to the fight."
}