{
    "chunk_id": 129943469394,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "h1_title": "The Forest of Wolves",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d8/Wukong_Wolves_4.jpg",
    "alt_text": "Wukong Wolves 4.jpg",
    "position_desc": 12,
    "img_above_text": "# The Forest of Wolves\n\nA voice will call out as you defeat the first two enemies, and we’ll be meeting the owner of this voice soon enough. For now, head straight up the woodland path, and you should spot a red plant to the right. Pluck it to gain some **Aged Ginseng** \\- a crafting material that we won’t be able to make use of until Chapter 2, but there’s no reason you can’t start stocking up on them now!",
    "img_below_text": "When you reach the next Wolf Scout, you’ll be prompted to perform a Heavy Attack. Heavy Attacks work a bit differently here than in most other games: The more you land hits, the more your Focus bar in the bottom right corner grows. When it fills, you’ll gain a Focus Point, which allows you to add a Heavy Attack into your Light Attack Combos for massive damage. While you can still perform a Heavy Attack on its own, it will lack added punch without that Focus Point, and can’t be included in a combo attack without it.\n\nAlternatively, you can simply hold the Heavy Attack button to begin charging up your Focus, and letting go of the button will unleash the attack, which can be devastating on slow or unsuspecting enemies. It’s important to note that Focus won’t decay from performing light attacks, but you can’t keep the Focus from charging up, so knowing when to use which type of heavy attack can prove useful.\n\nHead up the stone stairway into a narrow path full of boulders, where the path splits in two:",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: The Forest of Wolves\n\n            Context:\n            - Preceding Text: \"# The Forest of Wolves\n\nA voice will call out as you defeat the first two enemies, and we’ll be meeting the owner of this voice soon enough. For now, head straight up the woodland path, and you should spot a red plant to the right. Pluck it to gain some **Aged Ginseng** \\- a crafting material that we won’t be able to make use of until Chapter 2, but there’s no reason you can’t start stocking up on them now!\"\n            - Following Text: \"When you reach the next Wolf Scout, you’ll be prompted to perform a Heavy Attack. Heavy Attacks work a bit differently here than in most other games: The more you land hits, the more your Focus bar in the bottom right corner grows. When it fills, you’ll gain a Focus Point, which allows you to add a Heavy Attack into your Light Attack Combos for massive damage. While you can still perform a Heavy Attack on its own, it will lack added punch without that Focus Point, and can’t be included in a combo attack without it.\n\nAlternatively, you can simply hold the Heavy Attack button to begin charging up your Focus, and letting go of the button will unleash the attack, which can be devastating on slow or unsuspecting enemies. It’s important to note that Focus won’t decay from performing light attacks, but you can’t keep the Focus from charging up, so knowing when to use which type of heavy attack can prove useful.\n\nHead up the stone stairway into a narrow path full of boulders, where the path splits in two:\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the setting of a woodland path in the game *The Forest of Wolves*. Players are instructed to collect **Aged Ginseng**, a crafting material, while progressing through the area after defeating initial enemies. The narrative hints at an upcoming encounter with a mysterious voice and sets the stage for exploration and preparation.\n\nImage Summary:\nThe image depicts a combat scene from *The Forest of Wolves*, showing a player character engaged in battle with a wolf-like enemy in a forested environment. The on-screen prompt \"Perform Heavy Attack\" suggests that the player is being instructed to use a specific combat mechanic. The environment features rocky terrain, roots, and foliage, emphasizing the natural woodland setting.\n\nFollowing Text Summary:\nThe following text explains the mechanics of Heavy Attacks in the game, including how they interact with the Focus bar. Players are encouraged to strategically use Heavy Attacks, either by charging them or incorporating them into combos for maximum damage. The text also describes the next area, a stone stairway leading to a split path, further advancing the player's journey."
}