{
    "chunk_id": 641609421951,
    "source_file": "Father_of_Stones.md",
    "h1_title": "Father of Stones",
    "h2_title": "How to Find Father of Stones",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c4/Woods_Ember_Walkthrough_%2854%29.png",
    "alt_text": "Woods Ember Walkthrough \\(54\\).png",
    "position_desc": 1,
    "img_above_text": "# Father of Stones\n\nFather of Stones is a Yaoguai Chief you'll fight soon after you reach the Heights of Ember in Chapter 5 of Black Myth: Wukong.\n\n## How to Find Father of Stones",
    "img_below_text": "From the Heights of Ember Keeper's Shrine, continue toward the open space on the left. When you reach a certain point, the Father of Stones miniboss will jump over the wall near the door on the right.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Father of Stones\n            - Section Title: How to Find Father of Stones\n\n            Context:\n            - Preceding Text: \"# Father of Stones\n\nFather of Stones is a Yaoguai Chief you'll fight soon after you reach the Heights of Ember in Chapter 5 of Black Myth: Wukong.\n\n## How to Find Father of Stones\"\n            - Following Text: \"From the Heights of Ember Keeper's Shrine, continue toward the open space on the left. When you reach a certain point, the Father of Stones miniboss will jump over the wall near the door on the right.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the \"Father of Stones,\" a Yaoguai Chief miniboss encountered in Chapter 5 of *Black Myth: Wukong*. It sets the stage for the player's journey to the Heights of Ember, where they will soon face this enemy.\n\nImage Summary:\nThe image depicts a detailed environment from *Black Myth: Wukong*, showing a player character approaching a shrine under a large tree. The scene is atmospheric, with rocky terrain and structures in the background. A glowing marker surrounded by a red outline is visible, likely indicating an interactive element or a point of interest tied to the gameplay, such as a path or objective leading to the miniboss encounter.\n\nFollowing Text Summary:\nThe following text provides directions for locating the Father of Stones miniboss. It instructs the player to move from the Heights of Ember Keeper's Shrine toward an open area on the left, where the miniboss will appear by jumping over a wall near a door on the right."
}