{
    "chunk_id": 872236185420,
    "source_file": "Agate_Jar.md",
    "h1_title": "Agate Jar",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4b/Agate_Jar_2.jpg",
    "alt_text": "Agate Jar 2.jpg",
    "position_desc": 1,
    "img_above_text": "# Agate Jar\n\nThe Agate Jar is one of the Curios items you can find throughout Black Myth: Wukong. It is one of the strongest early-game Curios' thanks to its effect.\n\nWith the Agate Jar equipped, you will get a flat-out, moderate defense buff, which is incredibly useful early on in the game.",
    "img_below_text": "The Curios items in Black Myth: Wukong can't be upgraded, so you can't enhance their buffs in any way. Therefore, if you find a better item for your build, you will want to switch the items out as soon as you can.\n\n## Black Myth: Wukong Agate Jar Location\n\nThe Agate Jar can be found in a box in the arena after fighting the Black Wind King in Black Wind Cave \\- Cave Interior in Black Wind Mountain. Simply defeat the Black Wind King and head over to this box in the arena to get the Agate Jar.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Agate Jar\n\n            Context:\n            - Preceding Text: \"# Agate Jar\n\nThe Agate Jar is one of the Curios items you can find throughout Black Myth: Wukong. It is one of the strongest early-game Curios' thanks to its effect.\n\nWith the Agate Jar equipped, you will get a flat-out, moderate defense buff, which is incredibly useful early on in the game.\"\n            - Following Text: \"The Curios items in Black Myth: Wukong can't be upgraded, so you can't enhance their buffs in any way. Therefore, if you find a better item for your build, you will want to switch the items out as soon as you can.\n\n## Black Myth: Wukong Agate Jar Location\n\nThe Agate Jar can be found in a box in the arena after fighting the Black Wind King in Black Wind Cave \\- Cave Interior in Black Wind Mountain. Simply defeat the Black Wind King and head over to this box in the arena to get the Agate Jar.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe Agate Jar is a Curios item in *Black Myth: Wukong* that provides a moderate defense buff, making it a valuable asset in the early stages of the game. It is described as one of the strongest early-game Curios due to its defensive capabilities.\n\nImage Summary:  \nThe image displays the in-game equipment menu from *Black Myth: Wukong*, specifically highlighting the Agate Jar Curios item. The Agate Jar is categorized as a \"Rare\" item and is described as moderately increasing the player's defense. The item's design is visually detailed, resembling a white and red ornamental jar. The menu also shows other Curios items and the player's stats, with the Agate Jar contributing a +14 boost to defense.\n\nFollowing Text Summary:  \nCurios items in *Black Myth: Wukong* cannot be upgraded, meaning their effects remain static. Players are encouraged to replace the Agate Jar with a more suitable item if it better fits their build. The Agate Jar can be obtained after defeating the Black Wind King in the Black Wind Cave, where it is located in a box in the arena."
}