{
    "chunk_id": 518310039519,
    "source_file": "Buddha's_Right_Hand.md",
    "h1_title": "Buddha's Right Hand",
    "h2_title": "Buddha's Right Hand Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/82/Wukong_MiddleHollow_61.jpg",
    "alt_text": "Wukong MiddleHollow 61.jpg",
    "position_desc": 11,
    "img_above_text": "# Buddha's Right Hand\n\nThe Buddha's Right Hand is a required Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the middle section of The Webbed Hollow, this creepy long hand is more than it seems, and blocks the passage down to the Lower Hollow.\n\n* Rewards: Buddha's Right Hand (Key Item), Past-Echo, Fine Gold Thread, Cold Iron Leaves, 2274 Experience, 1933 Will\n\n\nThe Buddha's Right Hand is an main boss and non-missable encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down to the Vedure Bridge Shrine and defeating the Centipede Guai in the Bonevault, follow the linear path up to the Cliff of Oblivion.\n\nJust past the Shrine, you'll find a narrow passageway with a creepy hand holding a mirror, but this is actually the boss fight you seek!\n\n## Buddha's Right Hand Boss Fight and Guide\n\nIf the body appears to rise up and lurch backwards out of reach instead of straight up, it means that the boss is preparing to lunge forward with a headbutt, but this can be deflected and countered while its head is lowered for some prime damage output.",
    "img_below_text": "The Buddha's Right Hand can also use its hand above to swing its body backward, at which point you'll need to be ready for it to rapidly swing forward and slide through the arena with its talons dragging along. Don't bother trying to deflect it, as you'll just be knocked backward without slowing its momentum.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Buddha's Right Hand\n            - Section Title: Buddha's Right Hand Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Buddha's Right Hand\n\nThe Buddha's Right Hand is a required Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the middle section of The Webbed Hollow, this creepy long hand is more than it seems, and blocks the passage down to the Lower Hollow.\n\n* Rewards: Buddha's Right Hand (Key Item), Past-Echo, Fine Gold Thread, Cold Iron Leaves, 2274 Experience, 1933 Will\n\n\nThe Buddha's Right Hand is an main boss and non-missable encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down to the Vedure Bridge Shrine and defeating the Centipede Guai in the Bonevault, follow the linear path up to the Cliff of Oblivion.\n\nJust past the Shrine, you'll find a narrow passageway with a creepy hand holding a mirror, but this is actually the boss fight you seek!\n\n## Buddha's Right Hand Boss Fight and Guide\n\nIf the body appears to rise up and lurch backwards out of reach instead of straight up, it means that the boss is preparing to lunge forward with a headbutt, but this can be deflected and countered while its head is lowered for some prime damage output.\"\n            - Following Text: \"The Buddha's Right Hand can also use its hand above to swing its body backward, at which point you'll need to be ready for it to rapidly swing forward and slide through the arena with its talons dragging along. Don't bother trying to deflect it, as you'll just be knocked backward without slowing its momentum.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Buddha's Right Hand as a mandatory boss fight encountered in Chapter 4 of *Black Myth: Wukong*. It describes the boss as a long, creepy hand blocking the path to the Lower Hollow in the Webbed Hollow area. Players must defeat this boss to progress, earning key rewards such as the Buddha's Right Hand (a key item), experience points, and crafting materials. The fight begins when players encounter the hand holding a mirror in a narrow passageway.\n\nImage Summary:\nThe image depicts the in-game boss fight against Buddha's Right Hand in *Black Myth: Wukong*. The setting is a narrow, rocky cavern illuminated by torches, with the massive hand-like boss looming ahead. The player character is positioned in the foreground, ready for battle, while the boss's health bar is displayed at the bottom of the screen. The interface shows various abilities and resources available to the player, emphasizing the active combat scenario.\n\nFollowing Text Summary:\nThe following text provides additional details about the boss's attack patterns. It explains that the Buddha's Right Hand can swing its body backward and then rapidly slide forward with its talons dragging along the arena. Players are advised not to attempt deflecting this attack, as it will knock them back without halting the boss's momentum."
}