{
    "chunk_id": 90570479498,
    "source_file": "Cosmo_Radiance.md",
    "h1_title": "Cosmo Radiance",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b0/Wukong_Thunderclap_78.jpg",
    "alt_text": "Wukong Thunderclap 78.jpg",
    "position_desc": 1,
    "img_above_text": "# Cosmo Radiance\n\nCosmo Radiance is one of the unique materials in Black Myth: Wukong. It is used for weapon and armor crafting to craft unique gear unlocked upon defeating a boss.\n\nThe Cosmo Radiance can be used to craft the Spikeshaft Staff from the Shrine.\n\nTo obtain the Cosmo Radiance, you need to defeat Yellowbrow in New Thunderclap Temple in The New West. This is the final boss of the chapter.",
    "img_below_text": "For even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Weapons locations and Armor and Gear locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Cosmo Radiance\n\n            Context:\n            - Preceding Text: \"# Cosmo Radiance\n\nCosmo Radiance is one of the unique materials in Black Myth: Wukong. It is used for weapon and armor crafting to craft unique gear unlocked upon defeating a boss.\n\nThe Cosmo Radiance can be used to craft the Spikeshaft Staff from the Shrine.\n\nTo obtain the Cosmo Radiance, you need to defeat Yellowbrow in New Thunderclap Temple in The New West. This is the final boss of the chapter.\"\n            - Following Text: \"For even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Weapons locations and Armor and Gear locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces \"Cosmo Radiance,\" a unique material in *Black Myth: Wukong* used for crafting special weapons and armor, such as the Spikeshaft Staff. It explains that the material can be obtained by defeating Yellowbrow, the final boss of the New Thunderclap Temple chapter in The New West.\n\nImage Summary:  \nThe image depicts a gameplay scene from *Black Myth: Wukong*, showcasing the boss Yellowbrow in combat. The boss is visually imposing, adorned with intricate details and wielding a spiked weapon. The player character is engaged in battle, as indicated by the health bar and combat interface elements.\n\nFollowing Text Summary:  \nThe following text directs readers to additional guides for locating weapons, armor, gear, and other items in *Black Myth: Wukong*, including consumables, medicine ingredients, and transformation spells, providing further assistance for gameplay progression."
}