{
    "chunk_id": 271170143725,
    "source_file": "Best_Spirits_to_Use.md",
    "h1_title": "Best Spirits to Use",
    "h2_title": "Best Spirits to Use in Black Myth: Wukong",
    "h3_title": "Guangmou",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/ad/Best_Spirits_%282%29.png",
    "alt_text": "Best Spirits \\(2\\).png",
    "position_desc": 2,
    "img_above_text": "# Best Spirits to Use\n\nPicking the right Spirit to use in your loadout for Black Myth: Wukong can be as important as Weapons and Armor. After unlocking the Gourd in Chapter 1, you can start to capture the spirits of enemies and use them in battle. But if you're searching for tips on what the best spirits to use are, here's what we'd recommend.\n\nLooking for information on every Spirit in the game and how to collect them? Visit our Spirit Locations page.\n\n## Best Spirits to Use in Black Myth: Wukong\n\nWhen you use a Spirit, you will temporarily transform into them and be able to perform their special move. Alongside these skills, each Spirit provides a boost to a general stat or status effect, such as an increase in Poison damage or an increase in Defense when performing a particular move like Rock Solid.\n\nUnlike Transformations, you will share the same health bar with Spirits, so it's crucial to pull them out at the right time. Not sure which Spirits to equip? Here are some we consider to be the best spirits to use in Black Myth: Wukong.\n\nWandering Wight| Guangmou| Tiger's Acolyte\n---|---|---\nBlade Monk| Non-White| Falcon Hermit\nClay Vajra| Flint Vanguard| Baw-Li-Guhh-Lang (Upgraded)\n\nRemember that Spirits can be upgraded! At any Keeper's Shrine, you can choose to Cultivate Spirits from the Self-Advance menu. This will allow you to upgrade your Spirits using a combination of Will and items like Blood of the Iron Bull and Tadpoles. If you like a Spirit, cultivate them so you can max out their buffs.\n\n\nThis Spirit is entirely missable if you get to the end of Chapter 1 without picking it up, but you'll also likely encounter it before you've got your Gourd. Thankfully, you can pick it up from the nearest Keeper's Shrine once you've got the Gourd, and we'd recommend you do so because it's a great one to have equipped especially in the early game.\n\nThe Wandering Wight provides a substantial buff to your defence, which can make all the difference in fights. Not only this, but its Faithful Kowtow special attack allows you to deal a chunk of damage by smashing the giant's head into an enemy.\n\n### Guangmou",
    "img_below_text": "This is another Spirit you can collect from Chapter 1, and with it, you can use the Veiled Vipers special attack. When you perform this, four snakes will appear to help you out, dealing poison damage to enemies.\n\nYou'll gain a moderate increase in the poison damage you deal, and have the added bonus of poison resistance alongside it. Even if you're not going up against too many enemies that use poison attacks, you will find plenty are susceptible to poison damage and the status will build up letting you chip away at an enemy's health bar while you use other moves.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Best Spirits to Use\n            - Section Title: Best Spirits to Use in Black Myth: Wukong\n            - Sub-Section Title: Guangmou\n\n            Context:\n            - Preceding Text: \"# Best Spirits to Use\n\nPicking the right Spirit to use in your loadout for Black Myth: Wukong can be as important as Weapons and Armor. After unlocking the Gourd in Chapter 1, you can start to capture the spirits of enemies and use them in battle. But if you're searching for tips on what the best spirits to use are, here's what we'd recommend.\n\nLooking for information on every Spirit in the game and how to collect them? Visit our Spirit Locations page.\n\n## Best Spirits to Use in Black Myth: Wukong\n\nWhen you use a Spirit, you will temporarily transform into them and be able to perform their special move. Alongside these skills, each Spirit provides a boost to a general stat or status effect, such as an increase in Poison damage or an increase in Defense when performing a particular move like Rock Solid.\n\nUnlike Transformations, you will share the same health bar with Spirits, so it's crucial to pull them out at the right time. Not sure which Spirits to equip? Here are some we consider to be the best spirits to use in Black Myth: Wukong.\n\nWandering Wight| Guangmou| Tiger's Acolyte\n---|---|---\nBlade Monk| Non-White| Falcon Hermit\nClay Vajra| Flint Vanguard| Baw-Li-Guhh-Lang (Upgraded)\n\nRemember that Spirits can be upgraded! At any Keeper's Shrine, you can choose to Cultivate Spirits from the Self-Advance menu. This will allow you to upgrade your Spirits using a combination of Will and items like Blood of the Iron Bull and Tadpoles. If you like a Spirit, cultivate them so you can max out their buffs.\n\n\nThis Spirit is entirely missable if you get to the end of Chapter 1 without picking it up, but you'll also likely encounter it before you've got your Gourd. Thankfully, you can pick it up from the nearest Keeper's Shrine once you've got the Gourd, and we'd recommend you do so because it's a great one to have equipped especially in the early game.\n\nThe Wandering Wight provides a substantial buff to your defence, which can make all the difference in fights. Not only this, but its Faithful Kowtow special attack allows you to deal a chunk of damage by smashing the giant's head into an enemy.\n\n### Guangmou\"\n            - Following Text: \"This is another Spirit you can collect from Chapter 1, and with it, you can use the Veiled Vipers special attack. When you perform this, four snakes will appear to help you out, dealing poison damage to enemies.\n\nYou'll gain a moderate increase in the poison damage you deal, and have the added bonus of poison resistance alongside it. Even if you're not going up against too many enemies that use poison attacks, you will find plenty are susceptible to poison damage and the status will build up letting you chip away at an enemy's health bar while you use other moves.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the concept of Spirits in *Black Myth: Wukong*, explaining their importance in gameplay. Spirits allow players to temporarily transform into enemies and perform special moves, while also providing buffs to stats or status effects. The Wandering Wight Spirit is highlighted for its defensive boost and powerful Faithful Kowtow attack, making it a strong choice for early-game use.\n\nImage Summary:  \nThe image displays the in-game equipment menu in *Black Myth: Wukong*, showcasing a character wearing detailed armor and holding a weapon. This visual likely represents the Guangmou Spirit, emphasizing its appearance and role in gameplay customization. The menu options, such as \"Self-Advance,\" \"Relics,\" and \"Equipment,\" suggest this is where players manage their loadout and upgrades.\n\nFollowing Text Summary:  \nThe following text describes the Guangmou Spirit, which can be collected in Chapter 1. Its Veiled Vipers special attack summons snakes to deal poison damage to enemies, while also providing buffs to poison damage and resistance. This Spirit is particularly useful against poison-susceptible enemies, allowing players to inflict damage over time while using other abilities."
}