{
    "chunk_id": 464674402221,
    "source_file": "Fungiwoman.md",
    "h1_title": "Fungiwoman",
    "h2_title": "Fungiwoman Beetle Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5a/Wukong_YellowFlower_39.jpg",
    "alt_text": "Wukong YellowFlower 39.jpg",
    "position_desc": 1,
    "img_above_text": "# Fungiwoman\n\nThe Fungiwoman is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong, though she is not officially tracked as a yaoguai chief in your journal. Located in the Temple of Yellow Flowers on a high hill, she hides among Monkey-Head Mushrooms.\n\n* Rewards: Fungiwoman Spirit, Monkey-Head Fungus Seed, Knot of Voidness, 1562 Experience, 1473 Will\n\n\nThe Fungiwoman is a hidden optional boss that hides like most other fungi guai. After reaching the entrance of the Temple of Yellow Flowers, proceed on the main path until you find a fork in the road, with the left path leading to the Court of Illumination.\n\nTake the right path instead, and climb a mountain path up to a high ridge, leading to a shack with several mushrooms around it. One of the Monkey-Head Fungus on the right will actually be the Fungiwoman in hiding.\n\n## Fungiwoman Beetle Boss Fight and Guide\n\nThe Fungiwoman behaves almost identically to the Fungiman you fight fought in the Pagoda Realm (and a few times after), only they'll have a bit more health, and deal a bit more damage, but you should know what to expect for most of their attacks. Though they have a boss healthbar, they aren't tracked in your journal for Yaoguai Chief entries.\n\nWhen they rise out of their hiding spot, they'll flood the immediate area with poison, and can do so multiple times, so always be ready to back off when you see noxious fumes billowing up and swap to Thrust Stance.",
    "img_below_text": "The Fungiwoman can also expel toxic strands from its side to seek you out, but can thankfully by swept aside with a staff spin. The same can also happen if they slam their staff down, creating geysers that spawn additional projectiles.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fungiwoman\n            - Section Title: Fungiwoman Beetle Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Fungiwoman\n\nThe Fungiwoman is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong, though she is not officially tracked as a yaoguai chief in your journal. Located in the Temple of Yellow Flowers on a high hill, she hides among Monkey-Head Mushrooms.\n\n* Rewards: Fungiwoman Spirit, Monkey-Head Fungus Seed, Knot of Voidness, 1562 Experience, 1473 Will\n\n\nThe Fungiwoman is a hidden optional boss that hides like most other fungi guai. After reaching the entrance of the Temple of Yellow Flowers, proceed on the main path until you find a fork in the road, with the left path leading to the Court of Illumination.\n\nTake the right path instead, and climb a mountain path up to a high ridge, leading to a shack with several mushrooms around it. One of the Monkey-Head Fungus on the right will actually be the Fungiwoman in hiding.\n\n## Fungiwoman Beetle Boss Fight and Guide\n\nThe Fungiwoman behaves almost identically to the Fungiman you fight fought in the Pagoda Realm (and a few times after), only they'll have a bit more health, and deal a bit more damage, but you should know what to expect for most of their attacks. Though they have a boss healthbar, they aren't tracked in your journal for Yaoguai Chief entries.\n\nWhen they rise out of their hiding spot, they'll flood the immediate area with poison, and can do so multiple times, so always be ready to back off when you see noxious fumes billowing up and swap to Thrust Stance.\"\n            - Following Text: \"The Fungiwoman can also expel toxic strands from its side to seek you out, but can thankfully by swept aside with a staff spin. The same can also happen if they slam their staff down, creating geysers that spawn additional projectiles.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Fungiwoman, an optional boss in *Black Myth Wukong*, located in the Temple of Yellow Flowers during Chapter 4. She hides among Monkey-Head Mushrooms and is not officially tracked as a Yaoguai Chief in the journal. Players are guided to her location via a specific path and are warned about her poison-based attacks. Rewards for defeating her include experience points, items, and the Fungiwoman Spirit.\n\nImage Summary:\nThe image depicts the Fungiwoman boss fight in *Black Myth Wukong*. The player character is positioned in a lush, forested area with rocky terrain, facing the Fungiwoman, who is emerging with glowing, toxic energy. The boss health bar labeled \"Fungiwoman\" is visible at the bottom of the screen, along with player interface elements such as abilities and health indicators. This scene visually represents the encounter described in the text.\n\nFollowing Text Summary:\nThe following text elaborates on the Fungiwoman's attack patterns, including toxic strands that seek out the player and geysers created by staff slams, which spawn additional projectiles. Players are advised to use defensive maneuvers, such as sweeping aside projectiles with a staff spin, to counter these attacks effectively."
}