{
    "chunk_id": 669641135965,
    "source_file": "Bamboo_Grove_Walkthrough.md",
    "h1_title": "Bamboo Grove Walkthrough",
    "h2_title": "Snake Trail",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1d/Wukong_Bamboo_7.jpg",
    "alt_text": "Wukong Bamboo 7.jpg",
    "position_desc": 7,
    "img_above_text": "# Bamboo Grove Walkthrough\n\nThe Bamboo Grove is the second main region of Chapter 1's Black Wind Mountain in Black Myth: Wukong. Below you'll find a guide to the progressing through the grove and learning how to cultivate Spirits, accessing a secret realm, as well as how to defeat the many bosses of this area that include Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble.\n\n* **Jump to A Section:**\n* **Back Hills**\n* **Snake Trail**\n- Yaoguai Chief - Baw-Li-Guhh-Lang\n- Yaoguai Chief - Guangmo\n* **Marsh of the White Mist**\n- Boss FIght - Whiteclad Noble\n\n\nTo advance, keep heading up the stairway to cross the high bridge over the falls, where you’ll soon see the golden trail of a nearby shrine beckoning you left. Before making that turn, be sure to look to the right to find a small wooden gazebo with a small table, and open the small gold box on top to find a variety of medicines, including 2 **Tiger Subduing Pellets** , 1 **Evil Repelling Medicament** and 1 **Amplification Pellet**.\n\n## Snake Trail\n\nAs you reach the site of the Shrine, you’ll need to deal with an angry Crow Diviner who guards it (these types of enemies don’t respawn, thankfully). Be wary of their fast reverse blade swings and jumping claw kicks, and rest up after they’ve been defeated.\n\nThe main path lies up the stairs to the right, but be sure to look in the awning over to the left of the shrine first for some pots to break. Technically, you can find a big shortcut by simply jumping over the rocks to the nearby canyon stream, but there’s important things to find while taking the main route first.",
    "img_below_text": "The most important of which is just up the stairs and to the right before reaching a large bridge. A strange human man with a giant gourd on his back will be reciting poetry and drawing with his back to you.\n\nAs you approach, he’ll ask if you’ve seen the nameless souls in your travels - referring to the green wisps floating about that only offer a small amount of Will as they fly away. The wise master will take your gourd and inscribe a blessing on it, allowing you to absorb wayward spirits. This will allow you to finally capture the floating green wisps to not only gain much more Will, but also slightly replenish your Gourd’s healing charges.\n\nEven more importantly, you’ll now find that certain enemies will leave behind departed Spirits that can be claimed, and allow you to temporarily transform into them to unleash a specific attack. Unlike the Red Waves spell, these Spirits can be equipped to a special slot, and will become charged as you fight and earn Qi. Once the bar is filled, you can then unleash their attack by holding the right trigger and then the left trigger (R2/RT + L2/LT).",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bamboo Grove Walkthrough\n            - Section Title: Snake Trail\n\n            Context:\n            - Preceding Text: \"# Bamboo Grove Walkthrough\n\nThe Bamboo Grove is the second main region of Chapter 1's Black Wind Mountain in Black Myth: Wukong. Below you'll find a guide to the progressing through the grove and learning how to cultivate Spirits, accessing a secret realm, as well as how to defeat the many bosses of this area that include Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble.\n\n* **Jump to A Section:**\n* **Back Hills**\n* **Snake Trail**\n- Yaoguai Chief - Baw-Li-Guhh-Lang\n- Yaoguai Chief - Guangmo\n* **Marsh of the White Mist**\n- Boss FIght - Whiteclad Noble\n\n\nTo advance, keep heading up the stairway to cross the high bridge over the falls, where you’ll soon see the golden trail of a nearby shrine beckoning you left. Before making that turn, be sure to look to the right to find a small wooden gazebo with a small table, and open the small gold box on top to find a variety of medicines, including 2 **Tiger Subduing Pellets** , 1 **Evil Repelling Medicament** and 1 **Amplification Pellet**.\n\n## Snake Trail\n\nAs you reach the site of the Shrine, you’ll need to deal with an angry Crow Diviner who guards it (these types of enemies don’t respawn, thankfully). Be wary of their fast reverse blade swings and jumping claw kicks, and rest up after they’ve been defeated.\n\nThe main path lies up the stairs to the right, but be sure to look in the awning over to the left of the shrine first for some pots to break. Technically, you can find a big shortcut by simply jumping over the rocks to the nearby canyon stream, but there’s important things to find while taking the main route first.\"\n            - Following Text: \"The most important of which is just up the stairs and to the right before reaching a large bridge. A strange human man with a giant gourd on his back will be reciting poetry and drawing with his back to you.\n\nAs you approach, he’ll ask if you’ve seen the nameless souls in your travels - referring to the green wisps floating about that only offer a small amount of Will as they fly away. The wise master will take your gourd and inscribe a blessing on it, allowing you to absorb wayward spirits. This will allow you to finally capture the floating green wisps to not only gain much more Will, but also slightly replenish your Gourd’s healing charges.\n\nEven more importantly, you’ll now find that certain enemies will leave behind departed Spirits that can be claimed, and allow you to temporarily transform into them to unleash a specific attack. Unlike the Red Waves spell, these Spirits can be equipped to a special slot, and will become charged as you fight and earn Qi. Once the bar is filled, you can then unleash their attack by holding the right trigger and then the left trigger (R2/RT + L2/LT).\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text provides guidance for progressing through the Snake Trail section of the Bamboo Grove in *Black Myth: Wukong*. Players encounter a Shrine guarded by a Crow Diviner, a challenging enemy. After defeating it, players are advised to explore the area for hidden items and consider taking the main path rather than shortcuts to uncover important discoveries.\n\nImage Summary:  \nThe image depicts a serene yet mysterious forested area along the Snake Trail in the Bamboo Grove. A character, likely the player, approaches a small clearing with stone lanterns and a figure in the distance. The figure appears to be a human with a large gourd on their back, possibly an NPC of significance. The setting is lush with bamboo, moss-covered rocks, and a soft, misty atmosphere, suggesting an important narrative or gameplay moment.\n\nFollowing Text Summary:  \nThe following text describes the interaction with the NPC seen in the image. The NPC, a wise master, enhances the player's gourd with a blessing, enabling the absorption of wayward spirits. This upgrade allows players to gain Will, replenish healing charges, and utilize new spirit-based attacks during combat. This moment marks a significant progression in the player's abilities."
}