{
    "chunk_id": 398797171386,
    "source_file": "Crouching_Tiger_Temple_Walkthrough.md",
    "h1_title": "Crouching Tiger Temple Walkthrough",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9e/Wukong_Sandgate_82.jpg",
    "alt_text": "Wukong Sandgate 82.jpg",
    "position_desc": 1,
    "img_above_text": "# Crouching Tiger Temple Walkthrough\n\nThe Crouching Tiger Temple is one of two possible second main regions of Chapter 2 in the Yellow Wind Ridge of Black Myth: Wukong. Below you'll find a guide for the Temple and its main boss fight against the Tiger Vanguard, as well as the secret Cellar beneath it once you have the Keeness of Tiger.\n\n* **Jump to A Section:**\n* **Temple Entrance**\n- Yaoguai King - Tiger Vanguard\n* **Temple Cellar**\n\nThe Crouching Tiger Temple is one of the two sub-regions you’ll need to explore in Chapter 2 of Black Myth Wukong in order to unlock the large sealed doors that lead to the end of the chapter. You can first reach this area by heading through the Sandgate Village and defeating the King of Flowing Sands and Second Rat Prince, taking the left path through the Valley of Despair and through a crack in the wall leading to a small canyon.",
    "img_below_text": "Exiting the tunnels of the Valley of Despair and fending off a few Swift Bats, you’ll spot the imposing Crouching Tiger Temple down a narrow canyon. There’s some **Aged Ginseng** and **Licorice** to harvest along the path, but beyond that there isn’t much to worry about in terms of enemies.\n\n### Temple Entrance",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Crouching Tiger Temple Walkthrough\n\n            Context:\n            - Preceding Text: \"# Crouching Tiger Temple Walkthrough\n\nThe Crouching Tiger Temple is one of two possible second main regions of Chapter 2 in the Yellow Wind Ridge of Black Myth: Wukong. Below you'll find a guide for the Temple and its main boss fight against the Tiger Vanguard, as well as the secret Cellar beneath it once you have the Keeness of Tiger.\n\n* **Jump to A Section:**\n* **Temple Entrance**\n- Yaoguai King - Tiger Vanguard\n* **Temple Cellar**\n\nThe Crouching Tiger Temple is one of the two sub-regions you’ll need to explore in Chapter 2 of Black Myth Wukong in order to unlock the large sealed doors that lead to the end of the chapter. You can first reach this area by heading through the Sandgate Village and defeating the King of Flowing Sands and Second Rat Prince, taking the left path through the Valley of Despair and through a crack in the wall leading to a small canyon.\"\n            - Following Text: \"Exiting the tunnels of the Valley of Despair and fending off a few Swift Bats, you’ll spot the imposing Crouching Tiger Temple down a narrow canyon. There’s some **Aged Ginseng** and **Licorice** to harvest along the path, but beyond that there isn’t much to worry about in terms of enemies.\n\n### Temple Entrance\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Crouching Tiger Temple as one of two main regions in Chapter 2 of *Black Myth: Wukong*. It explains that players can access this area after progressing through Sandgate Village and defeating key enemies. The temple plays a critical role in unlocking the sealed doors that conclude the chapter. The text also mentions the path leading to the temple via the Valley of Despair.\n\nImage Summary:\nThe image depicts the approach to the Crouching Tiger Temple, showcasing its imposing architecture nestled within a rocky canyon. The foreground features the player character standing amidst rugged terrain, with visible game UI elements indicating active gameplay. The distant view of the temple highlights its significance as a major location in the game, emphasizing its scale and atmosphere.\n\nFollowing Text Summary:\nThe following text describes the immediate approach to the Crouching Tiger Temple after exiting the Valley of Despair. It mentions minor encounters with Swift Bats and opportunities to gather resources like **Aged Ginseng** and **Licorice** along the path. The text transitions to the next section, \"Temple Entrance,\" signaling the start of exploration within the temple."
}