{
    "chunk_id": 849773191417,
    "source_file": "Fungiman_Spirit.md",
    "h1_title": "Fungiman Spirit",
    "h2_title": "Fungiman Spirit",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/21/Fungiman_attack.png",
    "alt_text": "Fungiman attack.png",
    "position_desc": 3,
    "img_above_text": "# Fungiman Spirit\n\n\n\nFungiman is armed with a giant staff and plenty of poisonous spores to surround you with. In addition to blunt attacks with the staff, make sure not to step on any of the poison gas on the floor. Making contact with the gas will start to poison you and eat away at your health. When casting Immobilize, wait until the ground is clear of poison so you can really lay it on him without worrying about getting poisoned at the same time.\n\n## Fungiman Spirit",
    "img_below_text": "* **Whirl**\n* Equipped Effect: Moderately increases the recovery speed of Might.\n\nThe Fungiman's Spirit Power allows you to embody the creature and swing your staff around in a circle, creating a vortex of pain that will damage anything that makes contact with it. The attack itself is pretty strong, and the equipped effect is also handy, increasing the recovery speed of your Might. **Might is the power you need to hold your Transformations in Black Myth: Wukong.**",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fungiman Spirit\n            - Section Title: Fungiman Spirit\n\n            Context:\n            - Preceding Text: \"# Fungiman Spirit\n\n\n\nFungiman is armed with a giant staff and plenty of poisonous spores to surround you with. In addition to blunt attacks with the staff, make sure not to step on any of the poison gas on the floor. Making contact with the gas will start to poison you and eat away at your health. When casting Immobilize, wait until the ground is clear of poison so you can really lay it on him without worrying about getting poisoned at the same time.\n\n## Fungiman Spirit\"\n            - Following Text: \"* **Whirl**\n* Equipped Effect: Moderately increases the recovery speed of Might.\n\nThe Fungiman's Spirit Power allows you to embody the creature and swing your staff around in a circle, creating a vortex of pain that will damage anything that makes contact with it. The attack itself is pretty strong, and the equipped effect is also handy, increasing the recovery speed of your Might. **Might is the power you need to hold your Transformations in Black Myth: Wukong.**\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Fungiman Spirit, a character armed with a giant staff and poisonous spores. It warns players about the dangers of the poison gas emitted by Fungiman, which can cause health damage. The text also advises players to wait for the poison to clear before using the Immobilize ability for an effective attack.\n\nImage Summary:  \nThe image depicts the equipment menu of a game, showcasing the Fungiman Spirit as a selectable option. The Fungiman Spirit is categorized as \"Rare\" and has a special ability called \"Whirl,\" which allows the player to transform into Fungiman and perform a spinning staff attack that damages nearby enemies. The equipped effect of this spirit moderately increases the recovery speed of \"Might,\" a resource used for transformations. The interface also displays stats, other spirits, and a demo of the ability in action.\n\nFollowing Text Summary:  \nThe following text elaborates on the Fungiman Spirit's \"Whirl\" ability, describing it as a powerful spinning staff attack that creates a damaging vortex. It highlights the utility of the equipped effect, which boosts the recovery speed of \"Might,\" a resource crucial for maintaining transformations in the game \"Black Myth: Wukong.\""
}