{
    "chunk_id": 95519262181,
    "source_file": "Tiger_Vanguard.md",
    "h1_title": "Tiger Vanguard",
    "h2_title": "Tiger Vanguard Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/76/Wukong_Tiger_10.jpg",
    "alt_text": "Wukong Tiger 10.jpg",
    "position_desc": 6,
    "img_above_text": "# Tiger Vanguard\n\nThe Tiger Vanguard is a required Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Located in the center of the Crouching Tiger Temple, this fearsome Tiger Guai is one of the hardest bosses to overcome in all of Chapter 2.\n\n* **Rewards:** Rock Solid Spell, Keeness of Tiger, Mind Core x1, Silk x3, 1652 Experience, 1362 Will\n\n\nYou can find him inside the Crouching Tiger Temple, which is located at the end of the Sandgate Village, taking a left after defeating the King of Flowing Sands and through a crack in the wall in the Valley of Despair.\n\n## Tiger Vanguard Boss Fight and Guide\n\nHowever, if he starts with a right hook and then a delayed forward moving punch with his left, he’ll always follow up with a quick leg sweep as he bounds away to safety, making it an unwise move to try and counter, unless you’re playing things safe with a long-ranged jab from the Thrusting Stance.",
    "img_below_text": "Things can get even more dangerous when you see him assume a martial arts stance with one fist in front of him. Be ready for him to approach with a spinning kick that you’ll need to wait to dodge until the last moment. He’ll follow up with two quick punches, and then leap high into the air for a moment before twisting his body to come crashing down with a punching slam. He won’t shake this hand off, but you will at least have some room to fight back after he lands and slowly pulls his fist back up.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Tiger Vanguard\n            - Section Title: Tiger Vanguard Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Tiger Vanguard\n\nThe Tiger Vanguard is a required Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Located in the center of the Crouching Tiger Temple, this fearsome Tiger Guai is one of the hardest bosses to overcome in all of Chapter 2.\n\n* **Rewards:** Rock Solid Spell, Keeness of Tiger, Mind Core x1, Silk x3, 1652 Experience, 1362 Will\n\n\nYou can find him inside the Crouching Tiger Temple, which is located at the end of the Sandgate Village, taking a left after defeating the King of Flowing Sands and through a crack in the wall in the Valley of Despair.\n\n## Tiger Vanguard Boss Fight and Guide\n\nHowever, if he starts with a right hook and then a delayed forward moving punch with his left, he’ll always follow up with a quick leg sweep as he bounds away to safety, making it an unwise move to try and counter, unless you’re playing things safe with a long-ranged jab from the Thrusting Stance.\"\n            - Following Text: \"Things can get even more dangerous when you see him assume a martial arts stance with one fist in front of him. Be ready for him to approach with a spinning kick that you’ll need to wait to dodge until the last moment. He’ll follow up with two quick punches, and then leap high into the air for a moment before twisting his body to come crashing down with a punching slam. He won’t shake this hand off, but you will at least have some room to fight back after he lands and slowly pulls his fist back up.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}