{
    "chunk_id": 314743942238,
    "source_file": "Chen_Loong.md",
    "h1_title": "Chen Loong",
    "h2_title": "Where to Find Chen Loong",
    "h3_title": "Chen Loong Boss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0d/Wukong_Bitter_6.jpg",
    "alt_text": "Wukong Bitter 6.jpg",
    "position_desc": 8,
    "img_above_text": "# Chen Loong\n\nChen Loong is a character and possible boss fight first found in Chapter 3 of Black Myth Wukong. Though initially hostile, you can perform a task after defeating him in combat to unlock a Painted Realm where you can quickly access multiple merchants and services.\n\n* **Rewards:** TBA\n\n## Where to Find Chen Loong\n\nChen Loong is an optional opponent who has their own quest, which you can find shortly after leaving Turtle Rock for the North Shore of the Bitter Lake. From the Shrine, head left while facing it to head along the lakeshore toward a lone shack by the water.\n\nSearch the shallows near this shack, and you'll find the old dragon wandering the waters, and will become hostile as you approach.\n\n### Chen Loong Boss Fight and Guide\n\nWhile Chen Loong is highly susceptible to being staggered, he has a few tricks to stop you from pressing the attack for too long. His tail can be pretty impressive, and will use it to spin around and attack with it for two rotations, and then leap into the air to perform a delayed third electric slash.",
    "img_below_text": "He'll often vary this combo up making it hard to read, and either trick you into thinking he's preparing a cast before tail-whipping, or throwing more quick slashes in-between tail attacks -- or even just doing single hits.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chen Loong\n            - Section Title: Where to Find Chen Loong\n            - Sub-Section Title: Chen Loong Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Chen Loong\n\nChen Loong is a character and possible boss fight first found in Chapter 3 of Black Myth Wukong. Though initially hostile, you can perform a task after defeating him in combat to unlock a Painted Realm where you can quickly access multiple merchants and services.\n\n* **Rewards:** TBA\n\n## Where to Find Chen Loong\n\nChen Loong is an optional opponent who has their own quest, which you can find shortly after leaving Turtle Rock for the North Shore of the Bitter Lake. From the Shrine, head left while facing it to head along the lakeshore toward a lone shack by the water.\n\nSearch the shallows near this shack, and you'll find the old dragon wandering the waters, and will become hostile as you approach.\n\n### Chen Loong Boss Fight and Guide\n\nWhile Chen Loong is highly susceptible to being staggered, he has a few tricks to stop you from pressing the attack for too long. His tail can be pretty impressive, and will use it to spin around and attack with it for two rotations, and then leap into the air to perform a delayed third electric slash.\"\n            - Following Text: \"He'll often vary this combo up making it hard to read, and either trick you into thinking he's preparing a cast before tail-whipping, or throwing more quick slashes in-between tail attacks -- or even just doing single hits.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Chen Loong as a character and optional boss in *Black Myth Wukong*. He is first encountered in Chapter 3 near the North Shore of the Bitter Lake after leaving Turtle Rock. Players can find him near a shack by the water, where he becomes hostile upon approach. The text also highlights his susceptibility to being staggered and briefly describes his tail-based attack patterns, which include spinning strikes and a delayed electric slash.\n\nImage Summary:\nThe image depicts the boss fight with Chen Loong in *Black Myth Wukong*. The scene shows the player character facing off against Chen Loong, a dragon-like creature with glowing purple energy emanating from its body. The battle takes place in a snowy, rocky environment near shallow water. The user interface displays health bars, abilities, and other combat-related elements, while dialogue at the bottom of the screen warns about Chen Loong’s unpredictable and dangerous nature.\n\nFollowing Text Summary:\nThe following text elaborates on Chen Loong's attack patterns, emphasizing his ability to vary combos to confuse players. He can mix tail-whipping attacks with quick slashes or single hits, making his moves difficult to predict. This variability adds complexity to the fight, requiring players to stay alert and adapt to his unpredictable behavior."
}