{
    "chunk_id": 817186981157,
    "source_file": "Fireproof_Mantle.md",
    "h1_title": "Fireproof Mantle",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/cc/Fireproof_Mantle.jpg",
    "alt_text": "Fireproof Mantle.jpg",
    "position_desc": 1,
    "img_above_text": "# Fireproof Mantle\n\nThe Fireproof Mantle is one of the Vessels you can find in Black Myth: Wukong. These Vessels give you powerful, active abilities that completely change combat for a brief moment, enhancing your power, defense, and more.\n\nThe Fireproof Mantle has two effects. Having it equipped significantly increases Burn resistance, and grants immunity to Scorch damage from lava-covered terrain in the game. While, activating the Vessel in combat will, for a short duration after activation, grants Burn immunity and gradually increases Focus. There are specific lava-filled environments where this will be extremely effective.",
    "img_below_text": "Vessels come as they are, and as they are extremely strong already you should be more than able to feel the effect of the powerful abilities during fights and bosses. There are only a handful of them in the game, however, so you will need to seek them out by finding Black Myth: Wukong's many secrets and killing some of the Black Myth: Wukong secret bosses.\n\n## Black Myth: Wukong Fireproof Mantle Location\n\nThe Fireproof Mantle can be found upon ringing all three bells in Black Wind Mountain and defeating Elder Jinchi in the Secret: Ancient Guanyin Temple area (secret boss) in Black Wind Mountain.\n\nThis will require you to search around for all of the bells which can be found in the Forest of Wolves and Bamboo Grove. Our guide has a full step-by-step walkthrough of where to find these bells and gain access to the secret Ancient Guanyin Temple area. Additionally, you can find our video guide below:\n\nVessels are one of the many items you can find scattered around the game across its chapters. For even more guides on some of the rarer materials, be sure to check out our guides on the Blood of the Iron Bull Locations, Mind Core Locations, Awaken Wine Worm Locations and Luojia Fragrant Vine Locations.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fireproof Mantle\n\n            Context:\n            - Preceding Text: \"# Fireproof Mantle\n\nThe Fireproof Mantle is one of the Vessels you can find in Black Myth: Wukong. These Vessels give you powerful, active abilities that completely change combat for a brief moment, enhancing your power, defense, and more.\n\nThe Fireproof Mantle has two effects. Having it equipped significantly increases Burn resistance, and grants immunity to Scorch damage from lava-covered terrain in the game. While, activating the Vessel in combat will, for a short duration after activation, grants Burn immunity and gradually increases Focus. There are specific lava-filled environments where this will be extremely effective.\"\n            - Following Text: \"Vessels come as they are, and as they are extremely strong already you should be more than able to feel the effect of the powerful abilities during fights and bosses. There are only a handful of them in the game, however, so you will need to seek them out by finding Black Myth: Wukong's many secrets and killing some of the Black Myth: Wukong secret bosses.\n\n## Black Myth: Wukong Fireproof Mantle Location\n\nThe Fireproof Mantle can be found upon ringing all three bells in Black Wind Mountain and defeating Elder Jinchi in the Secret: Ancient Guanyin Temple area (secret boss) in Black Wind Mountain.\n\nThis will require you to search around for all of the bells which can be found in the Forest of Wolves and Bamboo Grove. Our guide has a full step-by-step walkthrough of where to find these bells and gain access to the secret Ancient Guanyin Temple area. Additionally, you can find our video guide below:\n\nVessels are one of the many items you can find scattered around the game across its chapters. For even more guides on some of the rarer materials, be sure to check out our guides on the Blood of the Iron Bull Locations, Mind Core Locations, Awaken Wine Worm Locations and Luojia Fragrant Vine Locations.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe Fireproof Mantle is a Vessel in *Black Myth: Wukong* that provides powerful combat benefits. When equipped, it increases Burn resistance and grants immunity to Scorch damage from lava-covered terrain. Activating the Vessel during combat temporarily provides Burn immunity and gradually increases Focus, making it highly effective in specific environments and against certain enemies.\n\nImage Summary:  \nThe image showcases the Fireproof Mantle in the game's Equipment menu. It is categorized as a Legendary Vessel with high Qi cost. The description highlights its effects, including Burn immunity, increased Focus, and resistance to Scorch damage. The interface also displays the player's stats, the item's equipped status, and an option to watch a demo of its use.\n\nFollowing Text Summary:  \nThe Fireproof Mantle can be obtained by completing a specific quest in Black Wind Mountain, which involves ringing three bells and defeating the secret boss Elder Jinchi in the Ancient Guanyin Temple area. The text also mentions the rarity of Vessels in the game and provides links to guides for locating other rare items."
}