{
    "chunk_id": 946294887678,
    "source_file": "Baw-Li-Guhh-Lang_Spirit.md",
    "h1_title": "Baw-Li-Guhh-Lang Spirit",
    "h2_title": "Baw-Li-Guhh-Lang Spirit",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/97/Spirit_Power_Baw_Li_Guhh_Lang.jpg",
    "alt_text": "Spirit Power Baw Li Guhh Lang.jpg",
    "position_desc": 3,
    "img_above_text": "# Baw-Li-Guhh-Lang Spirit\n\n\n\nBaw-Li-Guhh-Lang is a relentless fighter with attacks that require some quick reaction times to avoid. Here's what you can expect from the fight:\n\n* A Swipe move where Baw-Li-Guhh-Lang sweeps your feet out from underneath you with its hands. It can also do this with its tongue.\n* A Smash move where the boss leaps into the sky before crashing back down.\n* A Double-Leg Kick where both legs are thrust backward with incredible speed and force.\n\nThe main thing to remember when fighting Baw-Lu-Guhh-Lang or any other frog boss is to avoid getting caught behind it. The Double-Leg Kick can be devastating and is very sudden. Stick to its front where you can more easily predict its moves.\n\n## Baw-Li-Guhh-Lang Spirit",
    "img_below_text": "* **Tongue Whip**\n* Equipped Effect: Moderately reduces the Stamina cost for Jumps and Jump Attacks.\n\nBaw-Li-Guhh-Lang's Spirit Power allows you to take the form of the massive frog and perform a sweeping strike with it's long tongue. This attack can deal some decent damage and has great reach. Having Baw-Li-Guhh-Lang equipped as your Spirit also reduces Stamina cost for jumping, including jump attacks, which is a nice bonus.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Baw-Li-Guhh-Lang Spirit\n            - Section Title: Baw-Li-Guhh-Lang Spirit\n\n            Context:\n            - Preceding Text: \"# Baw-Li-Guhh-Lang Spirit\n\n\n\nBaw-Li-Guhh-Lang is a relentless fighter with attacks that require some quick reaction times to avoid. Here's what you can expect from the fight:\n\n* A Swipe move where Baw-Li-Guhh-Lang sweeps your feet out from underneath you with its hands. It can also do this with its tongue.\n* A Smash move where the boss leaps into the sky before crashing back down.\n* A Double-Leg Kick where both legs are thrust backward with incredible speed and force.\n\nThe main thing to remember when fighting Baw-Lu-Guhh-Lang or any other frog boss is to avoid getting caught behind it. The Double-Leg Kick can be devastating and is very sudden. Stick to its front where you can more easily predict its moves.\n\n## Baw-Li-Guhh-Lang Spirit\"\n            - Following Text: \"* **Tongue Whip**\n* Equipped Effect: Moderately reduces the Stamina cost for Jumps and Jump Attacks.\n\nBaw-Li-Guhh-Lang's Spirit Power allows you to take the form of the massive frog and perform a sweeping strike with it's long tongue. This attack can deal some decent damage and has great reach. Having Baw-Li-Guhh-Lang equipped as your Spirit also reduces Stamina cost for jumping, including jump attacks, which is a nice bonus.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes a boss character named Baw-Li-Guhh-Lang, highlighting its combat abilities such as a Swipe move, a Smash move, and a Double-Leg Kick. It advises players to avoid being behind the boss due to the powerful Double-Leg Kick and suggests staying in front to better predict its moves.\n\nImage Summary:\nThe image shows an in-game equipment screen featuring the Baw-Li-Guhh-Lang Spirit. It details the Spirit's abilities, including the \"Tongue Whip\" attack, which allows players to take the form of Baw-Li-Guhh-Lang and use its tongue to attack from a distance. The Spirit also provides an equipped effect that reduces the stamina cost for jumps and jump attacks.\n\nFollowing Text Summary:\nThe following text elaborates on the Baw-Li-Guhh-Lang Spirit's abilities, specifically the \"Tongue Whip\" attack, which offers a long-reaching strike that deals significant damage. Additionally, equipping this Spirit reduces the stamina cost for jumps and jump attacks, providing a strategic advantage in combat."
}