{
    "chunk_id": 103669167534,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "h1_title": "The Forest of Wolves",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b2/Wukong_Wolves_1.jpg",
    "alt_text": "Wukong Wolves 1.jpg",
    "position_desc": 9,
    "img_above_text": "# The Forest of Wolves\n\nWhile he may not be Sun Wukong, the Destined One is not above a bit of trickery and foolishness — as evidenced by luring some lesser Wolf Guais into trying to take a bite out of him disguised as a peach.",
    "img_below_text": "These basic enemies, the Wolf Scout and Wolf Swornsword, are perfect for getting a feel for some real combat. They tend to attack fairly slowly and draw out their sword slices giving you ample time to dodge even while using light combo attacks.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: The Forest of Wolves\n\n            Context:\n            - Preceding Text: \"# The Forest of Wolves\n\nWhile he may not be Sun Wukong, the Destined One is not above a bit of trickery and foolishness — as evidenced by luring some lesser Wolf Guais into trying to take a bite out of him disguised as a peach.\"\n            - Following Text: \"These basic enemies, the Wolf Scout and Wolf Swornsword, are perfect for getting a feel for some real combat. They tend to attack fairly slowly and draw out their sword slices giving you ample time to dodge even while using light combo attacks.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the protagonist, referred to as the Destined One, who uses clever tactics to lure lesser Wolf Guais into combat. The narrative highlights his playful and cunning nature, drawing a comparison to Sun Wukong, a legendary trickster figure.\n\nImage Summary:\nThe image depicts a forest setting where the protagonist, armed with a staff-like weapon, confronts two wolf-like humanoid enemies. The scene visually represents an early combat encounter, aligning with the narrative's description of engaging lesser Wolf Guais. The atmosphere is tense and grounded, emphasizing the protagonist's readiness for battle and the enemies' approach.\n\nFollowing Text Summary:\nThe following text elaborates on the enemies shown in the image, identifying them as Wolf Scout and Wolf Swornsword. These basic foes are described as slow attackers, making them ideal for players to practice combat mechanics, such as dodging and executing light combo attacks."
}