{
    "chunk_id": 606342883472,
    "source_file": "Violet_Spider.md",
    "h1_title": "Violet Spider",
    "h2_title": "Violet Spider Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/13/Wukong_LowerHollow_76.jpg",
    "alt_text": "Wukong LowerHollow 76.jpg",
    "position_desc": 5,
    "img_above_text": "# Violet Spider\n\nThe Violet Spider is a main Yaoguai \"Queen\" boss fight that you can encounter in Chapter 4 of Black Myth Wukong. The leader of the Spider Guai and master of The Webbed Hollow, the Violet Spider and her six daughters control this region, and their mother has particular plans for the pig known as Zhu Bajie.\n\n* Rewards: Spider Leg, Refined Iron Sand, 3410 Experience, 2608 Will\n\n\nThe Violet Spider is a required and non-missable boss in Chapter 4. She is the final boss of the Webbed Hollow Section, and must be defeated to progress to the next area. After you have reached the Lower Hollow and defeated Zhu Bajie to free him of his bewitching curse, he'll be abducted again.\n\nTo reach him (and the Violet Spider), you'll need to ascend the Purfiying Spring outside the Hut of Immortality, and follow the trail upwards to The Gathering Cave where the spider queen awaits you.\n\n## Violet Spider Boss Fight and Guide\n\nThe same goes for their shared moveset of leaping forward to stab straight ahead with two talons, as she'll quickly follow the stab with a concentrated poison spray right in front of her, which you can avoid by dodging to the sides rather than rolling forward or backward.",
    "img_below_text": "When she goes into a frenzy of stamping down all of her legs quickly, she'll do so while spewing out poison in several directions. Try to stay one step ahead of her by keeping to her right side, and watch for her final talon stab at her front to your right, sending out another plume of poison, but leaving the rest of that area exposed to a counter attack.\n\nShe also has a nasty habit of rapidly twitching her body while standing still, only to suddenly pivot and slam her rear into you at full force, which can deal a ton of damage. Even if you're at range, expect webbing strands to fly out that you need to dodge or deflect with your staff spin.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Violet Spider\n            - Section Title: Violet Spider Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Violet Spider\n\nThe Violet Spider is a main Yaoguai \"Queen\" boss fight that you can encounter in Chapter 4 of Black Myth Wukong. The leader of the Spider Guai and master of The Webbed Hollow, the Violet Spider and her six daughters control this region, and their mother has particular plans for the pig known as Zhu Bajie.\n\n* Rewards: Spider Leg, Refined Iron Sand, 3410 Experience, 2608 Will\n\n\nThe Violet Spider is a required and non-missable boss in Chapter 4. She is the final boss of the Webbed Hollow Section, and must be defeated to progress to the next area. After you have reached the Lower Hollow and defeated Zhu Bajie to free him of his bewitching curse, he'll be abducted again.\n\nTo reach him (and the Violet Spider), you'll need to ascend the Purfiying Spring outside the Hut of Immortality, and follow the trail upwards to The Gathering Cave where the spider queen awaits you.\n\n## Violet Spider Boss Fight and Guide\n\nThe same goes for their shared moveset of leaping forward to stab straight ahead with two talons, as she'll quickly follow the stab with a concentrated poison spray right in front of her, which you can avoid by dodging to the sides rather than rolling forward or backward.\"\n            - Following Text: \"When she goes into a frenzy of stamping down all of her legs quickly, she'll do so while spewing out poison in several directions. Try to stay one step ahead of her by keeping to her right side, and watch for her final talon stab at her front to your right, sending out another plume of poison, but leaving the rest of that area exposed to a counter attack.\n\nShe also has a nasty habit of rapidly twitching her body while standing still, only to suddenly pivot and slam her rear into you at full force, which can deal a ton of damage. Even if you're at range, expect webbing strands to fly out that you need to dodge or deflect with your staff spin.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}