{
    "chunk_id": 774203432874,
    "source_file": "Red_Boy.md",
    "h1_title": "Red Boy",
    "h2_title": "Red Boy Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c2/Field_Fire_Walkthrough_%2852%29.png",
    "alt_text": "Field Fire Walkthrough \\(52\\).png",
    "position_desc": 8,
    "img_above_text": "# Red Boy\n\nRed Boy is one of the Yaoguai Kings you'll need to fight at the end of Chapter 5 in Black Myth: Wukong. This agile fighter will use flames and duplicates to try and overwhelm you during this heated altercation at the end of the chapter.\n\n\nRed Boy can be found toward the end of Chapter 5, by following the main path. Head up the slope to see Pingping speak to her father. The Bull King isn't best pleased with The Destined One, but also has an issue with Pingping and her deception. It turns out that Pingping is actually the Red Boy, and he will transform before your eyes, ready for a battle.\n\n## Red Boy Boss Fight and Guide\n\nOnce the duplicates are gone, he will immediately follow with a strong attack. Most of his attacks can actually be interrupted by your own heavy attack, so try to build focus with cautious half-combos or equip items that will let you gain it quickly. Performing heavy attacks will stagger him and stop him from going into certain moves entirely if timed right.",
    "img_below_text": "When he's back down on the floor after sending out the duplicates, his attacks will be way more aggressive and he'll be more agile. You'll find that he repeats the same variations of attack, they'll just have a wider reach. For example, he'll spin his spear for longer, resulting in fire emerging around him, and then will leave areas of the ground covered in flames.\n\nYou can approach the second part of the fight in much the same way you did the first, and if you haven't used too many spells, now is the time to unleash them and get the rest of his health down as soon as possible.\n\nAfter being the Red Boy, the Bull King will reveal the stone that was kept in his belly. At the end of the conversation, the Red Boy's body will begin to disappear. But before The Destined One can collect the stone, the Red Boy emerges, showing that he used a False Death Talisman and is actually alive. He consumes the stone and immediately transforms into the Yaksha King.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Red Boy\n            - Section Title: Red Boy Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Red Boy\n\nRed Boy is one of the Yaoguai Kings you'll need to fight at the end of Chapter 5 in Black Myth: Wukong. This agile fighter will use flames and duplicates to try and overwhelm you during this heated altercation at the end of the chapter.\n\n\nRed Boy can be found toward the end of Chapter 5, by following the main path. Head up the slope to see Pingping speak to her father. The Bull King isn't best pleased with The Destined One, but also has an issue with Pingping and her deception. It turns out that Pingping is actually the Red Boy, and he will transform before your eyes, ready for a battle.\n\n## Red Boy Boss Fight and Guide\n\nOnce the duplicates are gone, he will immediately follow with a strong attack. Most of his attacks can actually be interrupted by your own heavy attack, so try to build focus with cautious half-combos or equip items that will let you gain it quickly. Performing heavy attacks will stagger him and stop him from going into certain moves entirely if timed right.\"\n            - Following Text: \"When he's back down on the floor after sending out the duplicates, his attacks will be way more aggressive and he'll be more agile. You'll find that he repeats the same variations of attack, they'll just have a wider reach. For example, he'll spin his spear for longer, resulting in fire emerging around him, and then will leave areas of the ground covered in flames.\n\nYou can approach the second part of the fight in much the same way you did the first, and if you haven't used too many spells, now is the time to unleash them and get the rest of his health down as soon as possible.\n\nAfter being the Red Boy, the Bull King will reveal the stone that was kept in his belly. At the end of the conversation, the Red Boy's body will begin to disappear. But before The Destined One can collect the stone, the Red Boy emerges, showing that he used a False Death Talisman and is actually alive. He consumes the stone and immediately transforms into the Yaksha King.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}