{
    "chunk_id": 48389798901,
    "source_file": "Chapter_3_Secret_-_Mount_Mei_Walkthrough.md",
    "h1_title": "Chapter 3 Secret - Mount Mei Walkthrough",
    "h2_title": "Mei-Jian Peak",
    "h3_title": "Erlang, The Sacred Divinity",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/47/Mount_Mei_Walkthrough_%2811%29.png",
    "alt_text": "Mount Mei Walkthrough \\(11\\).png",
    "position_desc": 8,
    "img_above_text": "# Chapter 3 Secret - Mount Mei Walkthrough\n\nMount Mei is the secret area in Chapter 3 - White Snow, Ice Cold of Black Myth: Wukong. However, you'll only be able to access it in Chapter 5 after completing all the secret areas in the game. We'd recommend waiting until you've finished Chapter 6 of the game and beat it before you visit Mount Mei, due to it being a vital place to see for the secret ending of the game.\n\n* **Jump to a Section:**\n* **How to Unlock Mount Mei**\n* **How to Enter Mount Mei from The Great Pagoda**\n* **Mount Mei**\n- Erlang, The Sacred Divinity\n- The Four Heavenly Kings\n- Erlang Shen\n\n\nThere are several steps you need to take to unlock Mount Mei. You can find a detailed breakdown on our dedicated page: How to Unlock the Secret Ending (True Ending). But here's a quick rundown of everything you'll need to do by Chapter 6 to reach it.\n\n1. Complete the Chapter 1 secret area of the Ancient Guanyin Temple\n2. Complete the Chapter 2 secret area of the Kingdom of Sahali\n3. Complete the Green-Capped Martialist/Treasure Hunter quest in Chapter 3\n4. Complete the Chapter 4 secret area of the Purple Cloud Mountain\n5. Complete the Chapter 5 secret area of Bishui Cave\n6. Return to **The Great Pagoda in Chapter 3**. You can find it on the Snow-Veiled Trail in the Pagoda Realm.\n\n\nWhen you’re in The Great Pagoda, you’ll see tapestries around the room. One tapestry, at the very top of the room, will be red. Head for this, and a cutscene will begin where the small Buddha from Chapter 3 will be waiting for you. He'll open the tapestry and let you into Mount Mei.\n\n\nWhen you're through the tapestry, head up the stairs and follow the path. About halfway up you'll need to shimmy across a ledge on the left to reach the other side, then you'll continue up to the Mei-Jian Peak Keeper's Shrine.\n\n## Mei-Jian Peak\n\nHere is where you'll need to get your gear together before you go up to the tip of the mountain, where you'll be entering a boss battle against a familiar face.\n\n### Erlang, The Sacred Divinity\n\nWhen his shield is down again, follow up with heavy attacks, and Immobilize if you're using Spells. He'll quickly reach 50% health and go up in the air again.\n\nThis time, he'll shoot a laser beam from his forehead toward you, and duplicates will appear one after the other, pointing beams at you. You can dodge these to build up focus and avoid their attacks.",
    "img_below_text": "However, when he brings his duplicates back together, he will be surrounded by swirling spears. This is when the attacks start to get far more dangerous. You'll see pulses of red flashing as well as lightning as the spears spin faster and faster. The projectiles can be reflected, but it's the end of this attack that causes the greatest damage.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chapter 3 Secret - Mount Mei Walkthrough\n            - Section Title: Mei-Jian Peak\n            - Sub-Section Title: Erlang, The Sacred Divinity\n\n            Context:\n            - Preceding Text: \"# Chapter 3 Secret - Mount Mei Walkthrough\n\nMount Mei is the secret area in Chapter 3 - White Snow, Ice Cold of Black Myth: Wukong. However, you'll only be able to access it in Chapter 5 after completing all the secret areas in the game. We'd recommend waiting until you've finished Chapter 6 of the game and beat it before you visit Mount Mei, due to it being a vital place to see for the secret ending of the game.\n\n* **Jump to a Section:**\n* **How to Unlock Mount Mei**\n* **How to Enter Mount Mei from The Great Pagoda**\n* **Mount Mei**\n- Erlang, The Sacred Divinity\n- The Four Heavenly Kings\n- Erlang Shen\n\n\nThere are several steps you need to take to unlock Mount Mei. You can find a detailed breakdown on our dedicated page: How to Unlock the Secret Ending (True Ending). But here's a quick rundown of everything you'll need to do by Chapter 6 to reach it.\n\n1. Complete the Chapter 1 secret area of the Ancient Guanyin Temple\n2. Complete the Chapter 2 secret area of the Kingdom of Sahali\n3. Complete the Green-Capped Martialist/Treasure Hunter quest in Chapter 3\n4. Complete the Chapter 4 secret area of the Purple Cloud Mountain\n5. Complete the Chapter 5 secret area of Bishui Cave\n6. Return to **The Great Pagoda in Chapter 3**. You can find it on the Snow-Veiled Trail in the Pagoda Realm.\n\n\nWhen you’re in The Great Pagoda, you’ll see tapestries around the room. One tapestry, at the very top of the room, will be red. Head for this, and a cutscene will begin where the small Buddha from Chapter 3 will be waiting for you. He'll open the tapestry and let you into Mount Mei.\n\n\nWhen you're through the tapestry, head up the stairs and follow the path. About halfway up you'll need to shimmy across a ledge on the left to reach the other side, then you'll continue up to the Mei-Jian Peak Keeper's Shrine.\n\n## Mei-Jian Peak\n\nHere is where you'll need to get your gear together before you go up to the tip of the mountain, where you'll be entering a boss battle against a familiar face.\n\n### Erlang, The Sacred Divinity\n\nWhen his shield is down again, follow up with heavy attacks, and Immobilize if you're using Spells. He'll quickly reach 50% health and go up in the air again.\n\nThis time, he'll shoot a laser beam from his forehead toward you, and duplicates will appear one after the other, pointing beams at you. You can dodge these to build up focus and avoid their attacks.\"\n            - Following Text: \"However, when he brings his duplicates back together, he will be surrounded by swirling spears. This is when the attacks start to get far more dangerous. You'll see pulses of red flashing as well as lightning as the spears spin faster and faster. The projectiles can be reflected, but it's the end of this attack that causes the greatest damage.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text provides an overview of Mount Mei, a secret area in *Black Myth: Wukong* that becomes accessible after completing specific tasks across various chapters. It introduces Mei-Jian Peak as a critical location within Mount Mei, where players prepare for a boss battle against Erlang, The Sacred Divinity. The text outlines the initial phase of the fight, describing Erlang's attacks, including aerial movements and laser beams.\n\nImage Summary:\nThe image depicts a dramatic scene set in a snowy, mountainous landscape with barren trees. A central figure is airborne, surrounded by streaks of light resembling projectiles or energy trails, suggesting an intense battle or attack sequence. The visual aligns with the narrative of the boss fight against Erlang, The Sacred Divinity, emphasizing the dynamic and challenging nature of the encounter.\n\nFollowing Text Summary:\nThe following text elaborates on the escalating difficulty of Erlang's attacks during the boss battle. It describes how swirling spears and red pulses intensify the danger, with projectiles becoming harder to manage. The text highlights the importance of timing and strategy to mitigate damage and survive the encounter."
}