{
    "chunk_id": 477815622321,
    "source_file": "Centipede_Guai_Spirit.md",
    "h1_title": "Centipede Guai Spirit",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/30/Centipede_Guai_Pic.jpg",
    "alt_text": "Centipede Guai Pic.jpg",
    "position_desc": 1,
    "img_above_text": "# Centipede Guai Spirit\n\nThe **Centipede Guai** is a foe that you will face off against in Black Myth: Wukong. Once defeated, the Centipede Guai offers up its Spirit for you to absorb, allowing you to use some of its powers for a short time. On this page, we will go over everything you need to know about the Centipede Guai, including where to find it, how to defeat it, and what power its Spirit gives you.\n\n* Centipede Guai Location\n* Centipede Guai Fight\n* Centipede Guai Spirit",
    "img_below_text": "## Centipede Guai Location\n\nThe Centipede Guai can be found in a massive pit full of skulls called the Bonevault. To reach the Bonevault, head to the Middle Hollow Keeper's Shrine in the Webbed Hollow. Drop down the wooden platform beside the Shrine and head straight forward to drop into the pit of bones.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Centipede Guai Spirit\n\n            Context:\n            - Preceding Text: \"# Centipede Guai Spirit\n\nThe **Centipede Guai** is a foe that you will face off against in Black Myth: Wukong. Once defeated, the Centipede Guai offers up its Spirit for you to absorb, allowing you to use some of its powers for a short time. On this page, we will go over everything you need to know about the Centipede Guai, including where to find it, how to defeat it, and what power its Spirit gives you.\n\n* Centipede Guai Location\n* Centipede Guai Fight\n* Centipede Guai Spirit\"\n            - Following Text: \"## Centipede Guai Location\n\nThe Centipede Guai can be found in a massive pit full of skulls called the Bonevault. To reach the Bonevault, head to the Middle Hollow Keeper's Shrine in the Webbed Hollow. Drop down the wooden platform beside the Shrine and head straight forward to drop into the pit of bones.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Centipede Guai, a formidable enemy in the game *Black Myth: Wukong*. It explains that once defeated, the Centipede Guai provides its Spirit, which grants temporary powers to the player. The section outlines the structure of the guide, covering the Centipede Guai's location, combat strategies, and the abilities gained from its Spirit.\n\nImage Summary:\nThe image depicts the Centipede Guai, a large, menacing centipede-like creature encountered in *Black Myth: Wukong*. The setting is dark and eerie, with a ground littered with bones and skulls, reinforcing the hostile and ominous atmosphere. The player character is engaged in combat with the Centipede Guai, as indicated by the health bar and combat-related UI elements visible on the screen. The image visually represents the encounter described in the text.\n\nFollowing Text Summary:\nThe following text provides specific details about the Centipede Guai's location. It explains that the creature resides in the Bonevault, a pit filled with skulls, accessible by dropping down from the Middle Hollow Keeper's Shrine in the Webbed Hollow. This section serves as a guide for players to locate the Centipede Guai for the battle depicted in the image."
}