{
    "chunk_id": 742257801685,
    "source_file": "Fungiwoman.md",
    "h1_title": "Fungiwoman",
    "h2_title": "Fungiwoman Beetle Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/30/Wukong_YellowFlower_40.jpg",
    "alt_text": "Wukong YellowFlower 40.jpg",
    "position_desc": 2,
    "img_above_text": "# Fungiwoman\n\nThe Fungiwoman is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong, though she is not officially tracked as a yaoguai chief in your journal. Located in the Temple of Yellow Flowers on a high hill, she hides among Monkey-Head Mushrooms.\n\n* Rewards: Fungiwoman Spirit, Monkey-Head Fungus Seed, Knot of Voidness, 1562 Experience, 1473 Will\n\n\nThe Fungiwoman is a hidden optional boss that hides like most other fungi guai. After reaching the entrance of the Temple of Yellow Flowers, proceed on the main path until you find a fork in the road, with the left path leading to the Court of Illumination.\n\nTake the right path instead, and climb a mountain path up to a high ridge, leading to a shack with several mushrooms around it. One of the Monkey-Head Fungus on the right will actually be the Fungiwoman in hiding.\n\n## Fungiwoman Beetle Boss Fight and Guide\n\nThe Fungiwoman can also expel toxic strands from its side to seek you out, but can thankfully by swept aside with a staff spin. The same can also happen if they slam their staff down, creating geysers that spawn additional projectiles.",
    "img_below_text": "Like the Fungiman, this variant can fly through the air to slam down from above on you, only with this move they'll also create poison geysers all around them to spawn the aforementioned projectiles.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fungiwoman\n            - Section Title: Fungiwoman Beetle Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Fungiwoman\n\nThe Fungiwoman is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong, though she is not officially tracked as a yaoguai chief in your journal. Located in the Temple of Yellow Flowers on a high hill, she hides among Monkey-Head Mushrooms.\n\n* Rewards: Fungiwoman Spirit, Monkey-Head Fungus Seed, Knot of Voidness, 1562 Experience, 1473 Will\n\n\nThe Fungiwoman is a hidden optional boss that hides like most other fungi guai. After reaching the entrance of the Temple of Yellow Flowers, proceed on the main path until you find a fork in the road, with the left path leading to the Court of Illumination.\n\nTake the right path instead, and climb a mountain path up to a high ridge, leading to a shack with several mushrooms around it. One of the Monkey-Head Fungus on the right will actually be the Fungiwoman in hiding.\n\n## Fungiwoman Beetle Boss Fight and Guide\n\nThe Fungiwoman can also expel toxic strands from its side to seek you out, but can thankfully by swept aside with a staff spin. The same can also happen if they slam their staff down, creating geysers that spawn additional projectiles.\"\n            - Following Text: \"Like the Fungiman, this variant can fly through the air to slam down from above on you, only with this move they'll also create poison geysers all around them to spawn the aforementioned projectiles.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Fungiwoman, an optional boss in *Black Myth: Wukong*, encountered in Chapter 4 at the Temple of Yellow Flowers. She disguises herself among Monkey-Head Mushrooms and is accessible via a hidden path. Defeating her rewards players with valuable items and experience points. The text also describes her ability to expel toxic strands and create geysers that spawn projectiles, which can be countered with specific staff techniques.\n\nImage Summary:\nThe image depicts the boss fight against the Fungiwoman in a lush, forested setting near a shack. The player character is engaged in combat, facing the Fungiwoman, whose appearance includes glowing mushroom-like features. Toxic effects and projectiles are visible in the environment, reflecting her described abilities. The game's interface shows health bars, abilities, and status effects, emphasizing the active battle scenario.\n\nFollowing Text Summary:\nThe following text elaborates on the Fungiwoman’s attack patterns, noting her ability to fly and slam down from above, creating poison geysers that spawn additional projectiles. This move adds complexity to the fight, requiring players to adapt to her aerial and area-of-effect attacks."
}