{
    "chunk_id": 132855939425,
    "source_file": "Glazed_Reliquary.md",
    "h1_title": "Glazed Reliquary",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/27/Glazed_Reliquary_2.jpg",
    "alt_text": "Glazed Reliquary 2.jpg",
    "position_desc": 1,
    "img_above_text": "# Glazed Reliquary\n\nThe Glazed Reliquary is one of the Curios items in Chapter 2 of Black Myth: Wukong. Unlike some of the other Curios' in this chapter, this one can easily be missed as it is in a rather well-hidden area.\n\nWhile perfect dodging, you will recover a small amount of stamina with this Curios equipped. Compared to most of the others, this one is particularly situational and unlikely to be as helpful for most players compared to many of the other Curios items.",
    "img_below_text": "Curios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, you will want to switch to other Curios items to better fit your build as you play if you find the Glazed Reliquary isn't working for you anymore. This can be done from the Equipment menu.\n\n## Black Myth: Wukong Glazed Reliquary Location\n\nThe Glazed Reliquary can be found in a box by a statue, within the Windrest Hamelet area of the Yellow Sand Formation in Yellow Wind Ridge. As you make your way through this area, you will fight the Tiger Acolyte, obtain the Old Rattle-Drum, and be able to continue onwards into a cave.\n\nJust ahead, you can find the box with the Curios in.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Glazed Reliquary\n\n            Context:\n            - Preceding Text: \"# Glazed Reliquary\n\nThe Glazed Reliquary is one of the Curios items in Chapter 2 of Black Myth: Wukong. Unlike some of the other Curios' in this chapter, this one can easily be missed as it is in a rather well-hidden area.\n\nWhile perfect dodging, you will recover a small amount of stamina with this Curios equipped. Compared to most of the others, this one is particularly situational and unlikely to be as helpful for most players compared to many of the other Curios items.\"\n            - Following Text: \"Curios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, you will want to switch to other Curios items to better fit your build as you play if you find the Glazed Reliquary isn't working for you anymore. This can be done from the Equipment menu.\n\n## Black Myth: Wukong Glazed Reliquary Location\n\nThe Glazed Reliquary can be found in a box by a statue, within the Windrest Hamelet area of the Yellow Sand Formation in Yellow Wind Ridge. As you make your way through this area, you will fight the Tiger Acolyte, obtain the Old Rattle-Drum, and be able to continue onwards into a cave.\n\nJust ahead, you can find the box with the Curios in.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Glazed Reliquary, a Curios item in Chapter 2 of *Black Myth: Wukong*. It explains its functionality, allowing players to recover a small amount of stamina when performing perfect dodges. The text notes that the item is situational and may not be as useful as other Curios, emphasizing its hidden location and potential to be overlooked.\n\nImage Summary:\nThe image depicts the in-game Equipment menu in *Black Myth: Wukong*, showcasing the Glazed Reliquary. The item is described as \"Rare\" and its effect is detailed: it recovers a small amount of stamina during perfect dodges. The visual includes the item's design—a glazed vase-like object—and its stats, alongside other Curios items in the player's inventory. The interface highlights the item's role and usability within the game.\n\nFollowing Text Summary:\nThe following text elaborates on the mechanics of Curios items in *Black Myth: Wukong*, noting that they cannot be upgraded. Players are encouraged to switch to other Curios that better suit their build if the Glazed Reliquary becomes less effective. It also provides specific location details for finding the Glazed Reliquary, describing its placement in a box near a statue in the Windrest Hamlet area within Yellow Wind Ridge."
}