{
    "chunk_id": 72357163268,
    "source_file": "Elder_Jinchi.md",
    "h1_title": "Elder Jinchi",
    "h2_title": "Elder Jinchi Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e8/Wukong_Guanyin_6.jpg",
    "alt_text": "Wukong Guanyin 6.jpg",
    "position_desc": 5,
    "img_above_text": "# Elder Jinchi\n\nElder Jinchi is an optional secret Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located in a secret realm locked away in the past, you'll need to activate three bells in order to locate and defeat him.\n\n* **Rewards:** Fireproof Mantle, 2,000 Will\n\n\n* **Bamboo Grove** \\- Traveling through the very short region of the Marsh of the White Mists, you’ll have to defeat a character boss, the Whiteclad Noble. Once he retreats, look for a path off to the left instead of heading straight into Black Wind Cave, and you’ll find a large plaza past the marsh where several Wolf Guai sit before a wolf that has been hung from a tree. Just beyond them is the final bell.\n\nNote - Before facing this boss, be sure to defeat the optional **Wandering Wight** that is found in the Forest of Wolves region of Black Wind Mountain if you haven’t faced him already. Not only does he share many attacks with this secret boss, but defeating this one will cause the Wandering Wight to disappear, and you will not be able to gain the Curio and Spirit that the Wight drops.\n\n## Elder Jinchi Fight and Guide\n\nThe big twist on this fight that you’ll notice immediately is all the wandering bronze-colored corpses milling about the arena. The good news is they actually aren’t a threat — at least at first. This means you can focus on attacking the boss without worrying about one of them randomly clawing at you, but there’s more to it than that.\n\nThough you can’t directly target them, you can kill them with a single swipe of your staff. Doing so will actually cause their spirit to be directly absorbed, and heal you for a small amount. It’s not enough that you should be turning your back to the boss to seek them out exactly, but there are situations where you’ll need to distance yourself from Jinchi’s tremor and earthquake attacks that provide a pause in combat where you might as well hit one nearby to get a bit of your health restored. That’s not all these corpses do, but we’ll get to the rest in a bit.",
    "img_below_text": "As previously mentioned, Jinchi shares a lot of moves with the Wandering Wight. He can perform one or several spinning attacks that can be hard to judge the range of their attack, and can combo them into other moves like one or two stomp attacks, or a frighteningly fast jumping stomp attack.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Elder Jinchi\n            - Section Title: Elder Jinchi Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Elder Jinchi\n\nElder Jinchi is an optional secret Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located in a secret realm locked away in the past, you'll need to activate three bells in order to locate and defeat him.\n\n* **Rewards:** Fireproof Mantle, 2,000 Will\n\n\n* **Bamboo Grove** \\- Traveling through the very short region of the Marsh of the White Mists, you’ll have to defeat a character boss, the Whiteclad Noble. Once he retreats, look for a path off to the left instead of heading straight into Black Wind Cave, and you’ll find a large plaza past the marsh where several Wolf Guai sit before a wolf that has been hung from a tree. Just beyond them is the final bell.\n\nNote - Before facing this boss, be sure to defeat the optional **Wandering Wight** that is found in the Forest of Wolves region of Black Wind Mountain if you haven’t faced him already. Not only does he share many attacks with this secret boss, but defeating this one will cause the Wandering Wight to disappear, and you will not be able to gain the Curio and Spirit that the Wight drops.\n\n## Elder Jinchi Fight and Guide\n\nThe big twist on this fight that you’ll notice immediately is all the wandering bronze-colored corpses milling about the arena. The good news is they actually aren’t a threat — at least at first. This means you can focus on attacking the boss without worrying about one of them randomly clawing at you, but there’s more to it than that.\n\nThough you can’t directly target them, you can kill them with a single swipe of your staff. Doing so will actually cause their spirit to be directly absorbed, and heal you for a small amount. It’s not enough that you should be turning your back to the boss to seek them out exactly, but there are situations where you’ll need to distance yourself from Jinchi’s tremor and earthquake attacks that provide a pause in combat where you might as well hit one nearby to get a bit of your health restored. That’s not all these corpses do, but we’ll get to the rest in a bit.\"\n            - Following Text: \"As previously mentioned, Jinchi shares a lot of moves with the Wandering Wight. He can perform one or several spinning attacks that can be hard to judge the range of their attack, and can combo them into other moves like one or two stomp attacks, or a frighteningly fast jumping stomp attack.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Elder Jinchi as a secret boss in *Black Myth: Wukong*, encountered in Chapter 1 after activating three bells. The fight takes place in a unique arena filled with bronze-colored corpses that can heal the player when defeated. The text also advises players to defeat the Wandering Wight beforehand, as it shares similar attacks with Elder Jinchi and drops valuable rewards.\n\nImage Summary:\nThe image depicts the intense combat against Elder Jinchi, showcasing a chaotic scene with debris and dust swirling around. Elder Jinchi, a large and menacing figure, is prominently visible, emphasizing the ferocity of the battle. The player interface is visible, including health bars, abilities, and the boss's name and health bar (\"Elder Jinchi\"), reinforcing the image's role as a visual representation of the boss fight.\n\nFollowing Text Summary:\nThe following text elaborates on Elder Jinchi's combat mechanics, highlighting his shared moves with the Wandering Wight, such as spinning attacks, stomps, and a fast jumping stomp. These moves require careful observation and strategy to avoid and counter during the fight."
}