{
    "chunk_id": 790779723405,
    "source_file": "Pagoda_Realm_Walkthrough.md",
    "h1_title": "The Beguiling Chant of the Pagoda Realm",
    "h2_title": "Lower Pagoda (Level 2)",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/96/Wukong_Pagoda_30X.jpg",
    "alt_text": "Wukong Pagoda 30X.jpg",
    "position_desc": 31,
    "img_above_text": "# The Beguiling Chant of the Pagoda Realm\n\nIf you see them perform a hand gesture, expect them to disappear, only to reappear from a different angle to try and kick you without warning.\n\n\nNext, head past the stairs to continue along the cell tunnel to find a dead end with one more Blade Monk guarding a **Treasure Chest** with assorted materials inside.\n\n## Lower Pagoda (Level 2)\n\nA word of warning: You'll soon spot the telltale trail of gold that means the next Shrine is close at hand, but to reach it, you'll need to pass through one last tunnel section guarded by another Red-Haired Yaksha. If the last encounter proved difficult, you may want to Immobilize or Cloud Step and run past him to get the Shrine, rather than risk having to come all this way again.",
    "img_below_text": "As you reach the Upper Pagoda Shrine, you might notice a large pit nearby in the cell tunnel, with a familiar purple glow coming from below. You're right above where you crossed the wooden beam, meaning the strange chamber you saw through the window is also right below you, and it houses a very important but optional Yaoguai Chief. Defeating him will be the key to unlocking the purple seals you've spotted all over this realm, but it's also worth pointing out that until you defeat the Yaoguai King of this area, you'll have to defeat this optional boss with the chanting curse sapping half your health at any point.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: The Beguiling Chant of the Pagoda Realm\n            - Section Title: Lower Pagoda (Level 2)\n\n            Context:\n            - Preceding Text: \"# The Beguiling Chant of the Pagoda Realm\n\nIf you see them perform a hand gesture, expect them to disappear, only to reappear from a different angle to try and kick you without warning.\n\n\nNext, head past the stairs to continue along the cell tunnel to find a dead end with one more Blade Monk guarding a **Treasure Chest** with assorted materials inside.\n\n## Lower Pagoda (Level 2)\n\nA word of warning: You'll soon spot the telltale trail of gold that means the next Shrine is close at hand, but to reach it, you'll need to pass through one last tunnel section guarded by another Red-Haired Yaksha. If the last encounter proved difficult, you may want to Immobilize or Cloud Step and run past him to get the Shrine, rather than risk having to come all this way again.\"\n            - Following Text: \"As you reach the Upper Pagoda Shrine, you might notice a large pit nearby in the cell tunnel, with a familiar purple glow coming from below. You're right above where you crossed the wooden beam, meaning the strange chamber you saw through the window is also right below you, and it houses a very important but optional Yaoguai Chief. Defeating him will be the key to unlocking the purple seals you've spotted all over this realm, but it's also worth pointing out that until you defeat the Yaoguai King of this area, you'll have to defeat this optional boss with the chanting curse sapping half your health at any point.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}