{
    "chunk_id": 980193124294,
    "source_file": "Captain_Lotus-Vision.md",
    "h1_title": "Captain Lotus-Vision",
    "h2_title": "Where to Find Captain Lotus-Vision",
    "h3_title": "Captain Lotus-Vision Miniboss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3d/Wukong_Pagoda_45.jpg",
    "alt_text": "Wukong Pagoda 45.jpg",
    "position_desc": 15,
    "img_above_text": "# Captain Lotus-Vision\n\nCaptain Lotus-Vision is an optional miniboss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Responsible for sealing captives in the cells of the Pagoda Realm, you can find this boss in a secret chamber within the Pagoda Prison.\n\n* **Rewards:** Spirit of Captain Lotus-Vision, Frostsprout Twig, Mind Core, Cold Iron Leaves, 1847 Experience, 1198 Will\n\n## Where to Find Captain Lotus-Vision\n\nCaptain Lotus-Vision is one of the four captains you can find in Chapter 3, and is an optional Yaoguai Chief you can encounter in the Pagoda Realm.\n\nTo find him, you'll need to reach the Upper Pagoda Shrine on the third level of the prison. Just behind the shrine, there is a pit with purple light emanating below that you can drop into and find this boss.\n\n### Captain Lotus-Vision Miniboss Fight and Guide\n\n* Level 1 - Right next to where you entered the realm, you can open the door to speak face to face with the Prisoner. He mentions Lotus-Vision was one of his four Captains, and that Yellowbrow tricked him and imprisoned him here, taking control of his Captains in the process. He'll request that you kill them all to ease their suffering. You can also pull the sword out of the dead two-headed Rat Captain and gain the Ashen Slumber Transformation Spell, letting you turn into a Rat Captain yourself and inflict fire, building up focus to transfer back to your main form.",
    "img_below_text": "* Level 1 - On the path from the first locked cell to the Lower Pagoda Shrine, another locked cell holds a Bandit Chief (like the one you encountered in the Forest of Wolves) that guards a **Treasure Chest** of materials.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Captain Lotus-Vision\n            - Section Title: Where to Find Captain Lotus-Vision\n            - Sub-Section Title: Captain Lotus-Vision Miniboss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Captain Lotus-Vision\n\nCaptain Lotus-Vision is an optional miniboss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Responsible for sealing captives in the cells of the Pagoda Realm, you can find this boss in a secret chamber within the Pagoda Prison.\n\n* **Rewards:** Spirit of Captain Lotus-Vision, Frostsprout Twig, Mind Core, Cold Iron Leaves, 1847 Experience, 1198 Will\n\n## Where to Find Captain Lotus-Vision\n\nCaptain Lotus-Vision is one of the four captains you can find in Chapter 3, and is an optional Yaoguai Chief you can encounter in the Pagoda Realm.\n\nTo find him, you'll need to reach the Upper Pagoda Shrine on the third level of the prison. Just behind the shrine, there is a pit with purple light emanating below that you can drop into and find this boss.\n\n### Captain Lotus-Vision Miniboss Fight and Guide\n\n* Level 1 - Right next to where you entered the realm, you can open the door to speak face to face with the Prisoner. He mentions Lotus-Vision was one of his four Captains, and that Yellowbrow tricked him and imprisoned him here, taking control of his Captains in the process. He'll request that you kill them all to ease their suffering. You can also pull the sword out of the dead two-headed Rat Captain and gain the Ashen Slumber Transformation Spell, letting you turn into a Rat Captain yourself and inflict fire, building up focus to transfer back to your main form.\"\n            - Following Text: \"* Level 1 - On the path from the first locked cell to the Lower Pagoda Shrine, another locked cell holds a Bandit Chief (like the one you encountered in the Forest of Wolves) that guards a **Treasure Chest** of materials.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Captain Lotus-Vision as an optional miniboss in Chapter 3 of *Black Myth: Wukong*. It explains that this boss resides in the Pagoda Prison and is one of four captains under the control of Yellowbrow. Players are tasked with defeating these captains to ease their suffering, as requested by a Prisoner. Rewards for defeating Captain Lotus-Vision include valuable items and experience points.\n\nImage Summary:\nThe image depicts a player character standing in front of a locked cell within the Pagoda Prison. Inside the cell, there is a Bandit Chief guarding a treasure chest, which is highlighted with a red dashed circle. The environment is dimly lit with reddish tones, and the player is equipped with a staff-like weapon. The image serves to visually guide players to the location of the treasure chest and Bandit Chief, emphasizing the importance of exploring locked cells for rewards.\n\nFollowing Text Summary:\nThe following text describes the path leading to another locked cell in the Pagoda Prison. This cell contains a Bandit Chief, similar to one encountered earlier in the game, who guards a treasure chest filled with materials. It highlights the significance of unlocking cells to access valuable resources and progress further in the game."
}