{
    "chunk_id": 245069263859,
    "source_file": "Black_Wind_Cave_Walkthrough.md",
    "h1_title": "Black Wind Cave Walkthrough",
    "h2_title": "Yaoguai King Boss Fight - Black Wind King",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d5/Wukong_BlackWind_10.jpg",
    "alt_text": "Wukong BlackWind 10.jpg",
    "position_desc": 11,
    "img_above_text": "# Black Wind Cave Walkthrough\n\nThe Black Wind Cave is the final region of Chapter 2's Black Wind Mountain in Black Myth: Wukong. Though it is a short area, it will prove to be a challenging one as you go up against the greedy King of the Mountain. Below you'll find a guide to the progressing through the cave to the mountaintop, as well as how to defeat the boss of this area in his two forms, the Black Wind King and the Black Bear Guai.\n\n* **Jump to A Section:**\n* **Cave Interior**\n- Black Wind King\n* **Outside the Cave**\n* **Bodhi Peak**\n- Black Bear Guai\n\n\nReturn to the path and take the stairs up to fight against another Wolf Assassin as the cave grows dark, and draw them into the light if needed.\n\nAs you reach an open part of the cave, you’ll have to face one more assassin along the darkened path, and you may notice they’ll go out of their way to destroy the torches along the path to further envelop them in darkness. If you have trouble facing them, always try to bring them to a brighter spot.\n\nNote that if you went ahead and defeated the Secret Boss by ringing the three bells, you should also have access to craft an additional Bronze Set that improves your abilities using the Immobilize Spell!\n\nCraft and upgrade whatever you can afford at the moment, because a boss is waiting inside the temple to test your might, and he’s no pushover.\n\n## Yaoguai King Boss Fight - Black Wind King\n\nIf you see him raise one foot up, quickly Immobilize or dash to the side, as he’ll try to stagger you with a quick kick, and then race forward with his spear to keep charging into you for multiple hits that’s nearly impossible to get out of once he starts.",
    "img_below_text": "His most frustrating attack will come when he transforms into the Black Wind itself, becoming a wisp-like thing that floats around the arena. You’ll need to look carefully for the small “bursts” emanating from the wisp that denote its charge attack straight at you, and can happen in two quick dashes back and forth.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Black Wind Cave Walkthrough\n            - Section Title: Yaoguai King Boss Fight - Black Wind King\n\n            Context:\n            - Preceding Text: \"# Black Wind Cave Walkthrough\n\nThe Black Wind Cave is the final region of Chapter 2's Black Wind Mountain in Black Myth: Wukong. Though it is a short area, it will prove to be a challenging one as you go up against the greedy King of the Mountain. Below you'll find a guide to the progressing through the cave to the mountaintop, as well as how to defeat the boss of this area in his two forms, the Black Wind King and the Black Bear Guai.\n\n* **Jump to A Section:**\n* **Cave Interior**\n- Black Wind King\n* **Outside the Cave**\n* **Bodhi Peak**\n- Black Bear Guai\n\n\nReturn to the path and take the stairs up to fight against another Wolf Assassin as the cave grows dark, and draw them into the light if needed.\n\nAs you reach an open part of the cave, you’ll have to face one more assassin along the darkened path, and you may notice they’ll go out of their way to destroy the torches along the path to further envelop them in darkness. If you have trouble facing them, always try to bring them to a brighter spot.\n\nNote that if you went ahead and defeated the Secret Boss by ringing the three bells, you should also have access to craft an additional Bronze Set that improves your abilities using the Immobilize Spell!\n\nCraft and upgrade whatever you can afford at the moment, because a boss is waiting inside the temple to test your might, and he’s no pushover.\n\n## Yaoguai King Boss Fight - Black Wind King\n\nIf you see him raise one foot up, quickly Immobilize or dash to the side, as he’ll try to stagger you with a quick kick, and then race forward with his spear to keep charging into you for multiple hits that’s nearly impossible to get out of once he starts.\"\n            - Following Text: \"His most frustrating attack will come when he transforms into the Black Wind itself, becoming a wisp-like thing that floats around the arena. You’ll need to look carefully for the small “bursts” emanating from the wisp that denote its charge attack straight at you, and can happen in two quick dashes back and forth.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text provides context for the Black Wind Cave, the final area of Chapter 2 in *Black Myth: Wukong*. It describes the challenges leading up to the boss fight against the Black Wind King, emphasizing preparation through crafting and upgrades. It also introduces the boss's initial attack patterns, warning players to avoid his stagger kick and spear charge by using the Immobilize Spell or dodging.\n\nImage Summary:  \nThe image depicts the arena for the Black Wind King boss fight in *Black Myth: Wukong*. The player character is engaged in combat against the boss, who appears to have transformed into a wisp-like form, surrounded by swirling energy effects. The health bar at the bottom identifies the boss as \"Black Wind King,\" and the text overlay reads, \"I am the Black Wind!\" This visual highlights the boss's transformation phase and the chaotic nature of the fight.\n\nFollowing Text Summary:  \nThe following text elaborates on the Black Wind King's transformation into a wisp-like form during the fight. It describes his charge attack, which is signaled by small bursts of energy before quick dashes across the arena. Players are advised to carefully observe these bursts to anticipate and evade his attacks."
}