{
    "chunk_id": 133380821646,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "h1_title": "Fright Cliff Walkthrough",
    "h2_title": "Yaoguai King Boss Fight - Stone Vanguard",
    "h3_title": "Secret - Get Help from the Shigandang",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/64/Wukong_Fright_46.jpg",
    "alt_text": "Wukong Fright 46.jpg",
    "position_desc": 54,
    "img_above_text": "# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n\nRealizing the error of his ways, the Man-in-Stone will promptly burrow right back in the ground and plead for mercy. You’ll then be able to re-harvest the Stone Essence from him, which will turn into the **Azure Dust Transformation Spell**! Finally, the slow yet sturdy power of the Rock Guai is yours to command in battle!\n\nUnlike the Red Waves wolf transformation, you’ll be extremely slow, unable to dodge, and overall be a pretty big target. On the plus side, you’ll be immune to all status effects while transformed, and deal incredible damage that staggers most enemies. Instead of Might building on attack, you’ll build it while taking damage, allowing you to soak blows and unleash a powerful jump attack spell in return!\n\nAs an added bonus, if you keep hassling the Man-in-Stone, he’ll promise to prepare wares to sell the next time you visit. Be sure to take him up on this offer, as he’ll have a decent selection of (very high-priced) goods!\n\nMan-in-Stone's Shop\n| Man-in-Stone's Shop                | Man-in-Stone's Shop           |\n| ---------------------------------- | ----------------------------- |\n| Blood of the Iron Bull - 3280 Will | Gold Ridge Beast - 12800 Will |\n| Iron Pellet - 6480 Will            |                               |\n| Goldflora Hairpin - 12800 Will     |                               |\n| Sobering Stone - 6480 Will         |                               |\n\n\nJust past this final Buddha statue head, look through the archway opening in the rocky wall. Ahead you’ll spot a group of stone floating in the air, signaling your next boss fight is at hand. There's also a strange large rock to the left - make a note of it and we'll inspect it later.\n\n## Yaoguai King Boss Fight - Stone Vanguard\n\n### Secret - Get Help from the Shigandang\n\nIf you watch him raise both arms to the side in a half-swing motion, he’ll begin to stab the ground repeatedly, alternating his arms four times, before raising both arms high for a ground-bursting blast with both of his arms.",
    "img_below_text": "Finally, the Stone Vanguard has a rather unique attack signaled by him tapping the ground repeatedly with one arm. This will summon a horde of Rock Guai to burrow up out of the ground and launch themselves at you in a steady succession, exploding on impact. You’ll need to either backpedal and take evasive action, or use Cloud Step to get the slip on them. Be warned that as the last two make their leap attack, the Stone Vanguard will join in requiring you to time your evasion right.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fright Cliff Walkthrough\n            - Section Title: Yaoguai King Boss Fight - Stone Vanguard\n            - Sub-Section Title: Secret - Get Help from the Shigandang\n\n            Context:\n            - Preceding Text: \"# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n\nRealizing the error of his ways, the Man-in-Stone will promptly burrow right back in the ground and plead for mercy. You’ll then be able to re-harvest the Stone Essence from him, which will turn into the **Azure Dust Transformation Spell**! Finally, the slow yet sturdy power of the Rock Guai is yours to command in battle!\n\nUnlike the Red Waves wolf transformation, you’ll be extremely slow, unable to dodge, and overall be a pretty big target. On the plus side, you’ll be immune to all status effects while transformed, and deal incredible damage that staggers most enemies. Instead of Might building on attack, you’ll build it while taking damage, allowing you to soak blows and unleash a powerful jump attack spell in return!\n\nAs an added bonus, if you keep hassling the Man-in-Stone, he’ll promise to prepare wares to sell the next time you visit. Be sure to take him up on this offer, as he’ll have a decent selection of (very high-priced) goods!\n\nMan-in-Stone's Shop\n| Man-in-Stone's Shop                | Man-in-Stone's Shop           |\n| ---------------------------------- | ----------------------------- |\n| Blood of the Iron Bull - 3280 Will | Gold Ridge Beast - 12800 Will |\n| Iron Pellet - 6480 Will            |                               |\n| Goldflora Hairpin - 12800 Will     |                               |\n| Sobering Stone - 6480 Will         |                               |\n\n\nJust past this final Buddha statue head, look through the archway opening in the rocky wall. Ahead you’ll spot a group of stone floating in the air, signaling your next boss fight is at hand. There's also a strange large rock to the left - make a note of it and we'll inspect it later.\n\n## Yaoguai King Boss Fight - Stone Vanguard\n\n### Secret - Get Help from the Shigandang\n\nIf you watch him raise both arms to the side in a half-swing motion, he’ll begin to stab the ground repeatedly, alternating his arms four times, before raising both arms high for a ground-bursting blast with both of his arms.\"\n            - Following Text: \"Finally, the Stone Vanguard has a rather unique attack signaled by him tapping the ground repeatedly with one arm. This will summon a horde of Rock Guai to burrow up out of the ground and launch themselves at you in a steady succession, exploding on impact. You’ll need to either backpedal and take evasive action, or use Cloud Step to get the slip on them. Be warned that as the last two make their leap attack, the Stone Vanguard will join in requiring you to time your evasion right.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text provides context for the Fright Cliff walkthrough, detailing gameplay mechanics and interactions with the Man-in-Stone character. Players are advised to avoid locking onto smaller threats and use the Cloud Step ability for strategic positioning. The text introduces the Stone Vanguard boss fight, signaling its location near floating stones and a notable large rock. It also highlights the rewards from the Man-in-Stone, including transformation spells and items available for purchase.\n\nImage Summary:\nThe image depicts the Yaoguai King boss fight against the Stone Vanguard. The player character is engaged in combat in a rocky, barren environment, dodging an attack from the massive Stone Vanguard enemy. The boss is shown mid-action, creating a dust cloud as it strikes the ground, emphasizing its size and power. The UI displays health bars, abilities, and other gameplay elements, reinforcing the intensity of the fight.\n\nFollowing Text Summary:\nThe following text elaborates on the Stone Vanguard's unique attack patterns, including summoning explosive Rock Guai minions and performing synchronized leap attacks. Players are advised to evade these threats using backpedaling or Cloud Step, and to time their movements carefully to avoid simultaneous attacks from the boss and its minions."
}