{
    "chunk_id": 607027273921,
    "source_file": "Thunderbolt_Horn.md",
    "h1_title": "Thunderbolt Horn",
    "h2_title": "Black Myth: Wukong Thunderbolt Horn Location",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/33/Thunderbolt_Horn_1.jpg",
    "alt_text": "Thunderbolt Horn 1.jpg",
    "position_desc": 2,
    "img_above_text": "# Thunderbolt Horn\n\nYour Soaks can't be upgraded. Unlike the Drinks and the Gourd itself, which can be upgraded. Therefore, you can't enhance the effect of the Thunderbolt Horn. If you want to switch to a different Soak, be sure to visit the Shen Monkey Vendor throughout your game to continue equipping new ones.\n\n## Black Myth: Wukong Thunderbolt Horn Location\n\nThe Thunderbolt Horn is found at the Shen Monkey Vendor in Bamboo Grove \\- Marsh of White Mist Shrine in Black Wind Mountain after completing Chapter 2 - Yellow Wind Ridge. Simply visit him after starting Chapter 3 - The New West and you will be able to buy the Soak from him for 3600 Will.",
    "img_below_text": "Soaks are more common than the Drinks for your Gourds in the game. They are scattered throughout the chapters. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Thunderbolt Horn\n            - Section Title: Black Myth: Wukong Thunderbolt Horn Location\n\n            Context:\n            - Preceding Text: \"# Thunderbolt Horn\n\nYour Soaks can't be upgraded. Unlike the Drinks and the Gourd itself, which can be upgraded. Therefore, you can't enhance the effect of the Thunderbolt Horn. If you want to switch to a different Soak, be sure to visit the Shen Monkey Vendor throughout your game to continue equipping new ones.\n\n## Black Myth: Wukong Thunderbolt Horn Location\n\nThe Thunderbolt Horn is found at the Shen Monkey Vendor in Bamboo Grove \\- Marsh of White Mist Shrine in Black Wind Mountain after completing Chapter 2 - Yellow Wind Ridge. Simply visit him after starting Chapter 3 - The New West and you will be able to buy the Soak from him for 3600 Will.\"\n            - Following Text: \"Soaks are more common than the Drinks for your Gourds in the game. They are scattered throughout the chapters. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}