{
    "chunk_id": 371361343427,
    "source_file": "Chapter_1_Secret_-_Ancient_Guanyin_Temple_Walkthrough.md",
    "h1_title": "Chapter 1 Secret - Ancient Guanyin Temple Walkthrough",
    "h2_title": "Ancient Guanyin Temple",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2d/Wukong_Guanyin_3.jpg",
    "alt_text": "Wukong Guanyin 3.jpg",
    "position_desc": 5,
    "img_above_text": "# Chapter 1 Secret - Ancient Guanyin Temple Walkthrough\n\nThe Ancient Guanyin Temple is a Secret Area found in Chapter 1's Black Wind Mountain of Black Myth Wukong. Below you'll find a guide to accessing the temple with all three bell locations, and how to defeat the secret Yaoguai King boss, Elder Jinchi.\n\nThis Chapter 1 Secret can only be accessed by ringing three large bells found around Black Wind Mountain, and will transport you to a different location to fight the secret boss that possess a magical item that is instrumental in defeating the Black Wind King.\n\n\n* **Bamboo Grove** \\- Traveling through the very short region of the Marsh of the White Mists, you’ll have to defeat a character boss, the Whiteclad Noble. Once he retreats, look for a path off to the left instead of heading straight into Black Wind Cave, and you’ll find a large plaza past the marsh where several Wolf Guai sit before a wolf that has been hung from a tree. Just beyond them is the final bell.\n\n## Ancient Guanyin Temple\n\nRinging all three bells will transport you back in time to an earlier version of the Guanyin Temple, presumably shortly after it was set on fire long ago. Despite looking similar to the area you explored previously to fight the Yaoguai King, Lingxuzi, you’ll find new items at the entrance.",
    "img_below_text": "Activate the shrine in the entrance plaza, and then be sure to look around this area before proceeding inside. Opposite the Shrine, look around the other withered tree for three nearby chests that hold lots of Will, 2 **Yarn** , 3 **Stone Spirit** , and **Guanyin’s Prayer Beads** arm gear.\n\nYou will also find that unlike the rest of Chapter 1, the Keeper's Shrine here sells a unique selection in the shop only purchasable at this Secret Area, and it's worth stocking up on the items since they're pretty rare for this point in the game:\n\n| Ancient Guanyin Temple Shrine Shop | Ancient Guanyin Temple Shrine Shop |\n| ---------------------------------- | ---------------------------------- |\n| Evil Repelling Medicament (x2)     | Longevity Decoction (x2)           |\n| Silk (x2)                          | Yaoguai Core (x2)                  |\n\nNote - Before facing this boss, be sure to defeat the optional **Wandering Wight** that is found in the Forest of Wolves region of Black Wind Mountain if you haven’t faced him already. Not only does he share many attacks with this secret boss, but defeating this one will cause the Wandering Wight to disappear, and you will not be able to gain the Curio and Spirit that the Wight drops.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chapter 1 Secret - Ancient Guanyin Temple Walkthrough\n            - Section Title: Ancient Guanyin Temple\n\n            Context:\n            - Preceding Text: \"# Chapter 1 Secret - Ancient Guanyin Temple Walkthrough\n\nThe Ancient Guanyin Temple is a Secret Area found in Chapter 1's Black Wind Mountain of Black Myth Wukong. Below you'll find a guide to accessing the temple with all three bell locations, and how to defeat the secret Yaoguai King boss, Elder Jinchi.\n\nThis Chapter 1 Secret can only be accessed by ringing three large bells found around Black Wind Mountain, and will transport you to a different location to fight the secret boss that possess a magical item that is instrumental in defeating the Black Wind King.\n\n\n* **Bamboo Grove** \\- Traveling through the very short region of the Marsh of the White Mists, you’ll have to defeat a character boss, the Whiteclad Noble. Once he retreats, look for a path off to the left instead of heading straight into Black Wind Cave, and you’ll find a large plaza past the marsh where several Wolf Guai sit before a wolf that has been hung from a tree. Just beyond them is the final bell.\n\n## Ancient Guanyin Temple\n\nRinging all three bells will transport you back in time to an earlier version of the Guanyin Temple, presumably shortly after it was set on fire long ago. Despite looking similar to the area you explored previously to fight the Yaoguai King, Lingxuzi, you’ll find new items at the entrance.\"\n            - Following Text: \"Activate the shrine in the entrance plaza, and then be sure to look around this area before proceeding inside. Opposite the Shrine, look around the other withered tree for three nearby chests that hold lots of Will, 2 **Yarn** , 3 **Stone Spirit** , and **Guanyin’s Prayer Beads** arm gear.\n\nYou will also find that unlike the rest of Chapter 1, the Keeper's Shrine here sells a unique selection in the shop only purchasable at this Secret Area, and it's worth stocking up on the items since they're pretty rare for this point in the game:\n\n| Ancient Guanyin Temple Shrine Shop | Ancient Guanyin Temple Shrine Shop |\n| ---------------------------------- | ---------------------------------- |\n| Evil Repelling Medicament (x2)     | Longevity Decoction (x2)           |\n| Silk (x2)                          | Yaoguai Core (x2)                  |\n\nNote - Before facing this boss, be sure to defeat the optional **Wandering Wight** that is found in the Forest of Wolves region of Black Wind Mountain if you haven’t faced him already. Not only does he share many attacks with this secret boss, but defeating this one will cause the Wandering Wight to disappear, and you will not be able to gain the Curio and Spirit that the Wight drops.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Ancient Guanyin Temple as a secret area in Chapter 1 of *Black Myth: Wukong*. Accessing this area requires ringing three bells scattered across Black Wind Mountain. Once activated, players are transported to a past version of the temple to face the secret boss, Elder Jinchi, who holds a critical magical item for defeating the Black Wind King.\n\nImage Summary:\nThe image depicts the entrance plaza of the Ancient Guanyin Temple, showcasing a player character interacting with a chest near a large, withered tree. Red arrows highlight three nearby chests, which contain valuable items such as Will, Yarn, Stone Spirit, and Guanyin’s Prayer Beads. The setting reflects the temple’s ruined and overgrown state, consistent with the narrative of being transported to an earlier, fire-damaged version of the temple.\n\nFollowing Text Summary:\nThe following text elaborates on the items found in the highlighted chests near the entrance plaza, emphasizing their importance for progression. It also mentions the unique shop inventory available at the Keeper's Shrine in this area, offering rare items. Additionally, players are advised to defeat the optional Wandering Wight boss beforehand to gain useful rewards and prepare for the upcoming secret boss battle."
}