{
    "chunk_id": 190322801017,
    "source_file": "Azure_Dust.md",
    "h1_title": "Azure Dust",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/24/Black-myth-wukong-azure-dust-3.jpg",
    "alt_text": "Black-myth-wukong-azure-dust-3.jpg",
    "position_desc": 3,
    "img_above_text": "# Azure Dust\n\n* **De-transformation Attack: Body Slam - Slam your body into the ground.** This is the final attack Azure Dust will perform when it runs out of stamina. It turns around and slams its whole body into the ground.",
    "img_below_text": "## Black Myth: Wukong Azure Dust Location\n\nThe Azure Dust Transformation can be found in Fright Cliff - Squall Hideout in Yellow Wind Ridge. After defeating both the Mother of Stones boss and the Man-In-Stone boss with the Stone Essence in your inventory, you will unlock the Transformation. Our walkthrough and boss guides of the Fright Cliff area will help you complete this side quest.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Azure Dust\n\n            Context:\n            - Preceding Text: \"# Azure Dust\n\n* **De-transformation Attack: Body Slam - Slam your body into the ground.** This is the final attack Azure Dust will perform when it runs out of stamina. It turns around and slams its whole body into the ground.\"\n            - Following Text: \"## Black Myth: Wukong Azure Dust Location\n\nThe Azure Dust Transformation can be found in Fright Cliff - Squall Hideout in Yellow Wind Ridge. After defeating both the Mother of Stones boss and the Man-In-Stone boss with the Stone Essence in your inventory, you will unlock the Transformation. Our walkthrough and boss guides of the Fright Cliff area will help you complete this side quest.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the \"Azure Dust\" transformation and describes its final attack, the \"De-transformation Attack: Body Slam.\" This move is executed when Azure Dust runs out of stamina, involving a powerful slam of its body into the ground.\n\nImage Summary:\nThe image appears to depict a gameplay scene from the \"Azure Dust\" transformation, set in a rugged, barren environment with dry vegetation and twisted tree branches. On-screen prompts describe two attack options: \"Light Attack 'Earth Shatter'\" and \"Heavy Attack 'Mountain Splitter,'\" suggesting the player is in control of Azure Dust or a related character. The visual layout and action hints at a combat scenario or a moment of preparation for battle.\n\nFollowing Text Summary:\nThe following text provides details on the location of the Azure Dust transformation within the game \"Black Myth: Wukong.\" It specifies that the transformation can be unlocked in the Fright Cliff area after defeating two specific bosses while carrying a required item. Additional resources like walkthroughs and boss guides are mentioned to assist players in completing this side quest."
}