{
    "chunk_id": 526854366351,
    "source_file": "Drinks.md",
    "h1_title": "Drinks",
    "h2_title": "Black Myth: Wukong Drinks Locations",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/6a/Black-myth-wukong-pinebrew.jpg",
    "alt_text": "Black-myth-wukong-pinebrew.jpg",
    "position_desc": 5,
    "img_above_text": "# Drinks\n\nBlack Myth: Wukong has a selection of different Drinks you can equip that change the Gourd’s behavior. From restoring your health quickly, restoring it over time, or in alternative ways, the drink options allow you to pick an option that suits your playstyle.\n\nThese Gourd Drinks are rare in the game, and there are only a few different options to be found, mostly through exploration. You can also find individual Gourds and Soaks that provide additional perks.\n\n## Black Myth: Wukong Drinks Locations",
    "img_below_text": "",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Drinks\n            - Section Title: Black Myth: Wukong Drinks Locations\n\n            Context:\n            - Preceding Text: \"# Drinks\n\nBlack Myth: Wukong has a selection of different Drinks you can equip that change the Gourd’s behavior. From restoring your health quickly, restoring it over time, or in alternative ways, the drink options allow you to pick an option that suits your playstyle.\n\nThese Gourd Drinks are rare in the game, and there are only a few different options to be found, mostly through exploration. You can also find individual Gourds and Soaks that provide additional perks.\n\n## Black Myth: Wukong Drinks Locations\"\n            - Following Text: \"\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the concept of Drinks in *Black Myth: Wukong*, which are items that modify the behavior of the Gourd, a gameplay element. These Drinks provide various benefits, such as health restoration in different ways, catering to diverse playstyles. They are rare and mostly obtained through exploration, alongside other related items like Gourds and Soaks that offer additional perks.\n\nImage Summary:  \nThe image depicts an ornate Gourd with intricate golden designs, featuring two phoenix-like creatures and a decorative base. Its purpose is likely to visually represent one of the rare Drinks or related items mentioned in the game *Black Myth: Wukong*. The artistic detail suggests it is a significant or collectible item within the game.\n\nFollowing Text Summary:  \nThe following text is absent, leaving the preceding text as the primary context for understanding the image's role in the document."
}