{
    "chunk_id": 455243077687,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "h1_title": "Furnace Valley Walkthrough",
    "h2_title": "Valley Entrance",
    "h3_title": "Yaoguai Chief - Cloudy Mist, Misty Cloud",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5c/Furnace_Valley_Walkthrough_%2853%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(53\\).png",
    "position_desc": 27,
    "img_above_text": "# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n## Valley Entrance\n\nUltimately, you're going to go left to continue on the main path (and you may start to hear characters talk as you approach this pillar), but for now, you'll want to detour and explore the area to the right.\n\nThe first thing you'll see as you go to the right is the Flamlings that sit in the lava. These will spit fire at you, so it's best to deal with them to remove the ranged attacks while you explore.\n\n\nDrop down here, and head right first to collect the Fire Date from the tree. Then go in the opposite direction toward the lava streaming from the ceiling. This is where you can find one of the optional bosses in Chapter 5, the Flint Chief.\n\n\nNow turn back the other way and continue up the valley. At the top of the path, you'll come to another archway and the start of Rakshasa Palace.\n\nAs soon as you pass through the archway, the next boss battle will begin and you'll discover who was responsible for the voices you heard earlier.\n\n### Yaoguai Chief - Cloudy Mist, Misty Cloud\n\nThe lasers can be avoided by dodging or jumping over them, and the projectiles can be outrun or you can dodge to stop them hitting you. When there are numerous, we'd recommend outrunning them, and when there are just a few, dodge out of the way. During this fight, you want to stay as close to Cloudy Mist as possible, to remove the advantage of his long-range attacks.",
    "img_below_text": "Misty Cloud will soon appear, though he will look almost see-through initially. He will often pop up as soon as Cloudy Mist has finished a set of moves, hoping to catch you off guard and hit you with his flaming bundle.\n\nThe key to keeping track of this creature is to see where the cloud moves and jump out of the way when it gets close to you. Misty Cloud favors the use of a flaming bundle, operating it like a hammer and delivering fire attacks.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Furnace Valley Walkthrough\n            - Section Title: Valley Entrance\n            - Sub-Section Title: Yaoguai Chief - Cloudy Mist, Misty Cloud\n\n            Context:\n            - Preceding Text: \"# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n## Valley Entrance\n\nUltimately, you're going to go left to continue on the main path (and you may start to hear characters talk as you approach this pillar), but for now, you'll want to detour and explore the area to the right.\n\nThe first thing you'll see as you go to the right is the Flamlings that sit in the lava. These will spit fire at you, so it's best to deal with them to remove the ranged attacks while you explore.\n\n\nDrop down here, and head right first to collect the Fire Date from the tree. Then go in the opposite direction toward the lava streaming from the ceiling. This is where you can find one of the optional bosses in Chapter 5, the Flint Chief.\n\n\nNow turn back the other way and continue up the valley. At the top of the path, you'll come to another archway and the start of Rakshasa Palace.\n\nAs soon as you pass through the archway, the next boss battle will begin and you'll discover who was responsible for the voices you heard earlier.\n\n### Yaoguai Chief - Cloudy Mist, Misty Cloud\n\nThe lasers can be avoided by dodging or jumping over them, and the projectiles can be outrun or you can dodge to stop them hitting you. When there are numerous, we'd recommend outrunning them, and when there are just a few, dodge out of the way. During this fight, you want to stay as close to Cloudy Mist as possible, to remove the advantage of his long-range attacks.\"\n            - Following Text: \"Misty Cloud will soon appear, though he will look almost see-through initially. He will often pop up as soon as Cloudy Mist has finished a set of moves, hoping to catch you off guard and hit you with his flaming bundle.\n\nThe key to keeping track of this creature is to see where the cloud moves and jump out of the way when it gets close to you. Misty Cloud favors the use of a flaming bundle, operating it like a hammer and delivering fire attacks.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text describes the exploration of Furnace Valley, specifically the Valley Entrance area. Players are guided to detour to the right to collect items like the Fire Date and encounter optional bosses such as the Flint Chief. Progressing up the valley leads to an archway marking the start of Rakshasa Palace, where the next boss battle begins with the Yaoguai Chief, Cloudy Mist.\n\nImage Summary:  \nThe image depicts a dark, atmospheric scene with three distinct characters in what appears to be a boss battle setting. The central figure, likely Cloudy Mist, is wielding a fiery weapon and appears to be attacking. Another figure to the right holds a staff, possibly Misty Cloud, while the third character on the left seems to be preparing for combat. The environment is rugged and shadowy, consistent with the description of the Valley Entrance and Rakshasa Palace.\n\nFollowing Text Summary:  \nThe following text elaborates on the boss battle mechanics involving Misty Cloud, who appears after Cloudy Mist finishes his moves. Misty Cloud uses a flaming bundle as a weapon, delivering fire-based attacks. Players are advised to track Misty Cloud's movements and dodge his attacks to avoid damage."
}