{
    "chunk_id": 214210602104,
    "source_file": "Chapter_5_Secret_-_Bishui_Cave_Walkthrough.md",
    "h1_title": "Chapter 5 Secret - Bishui Cave Walkthrough",
    "h2_title": "Corridor of Fire and Ice",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bf/Bishui_Cave_Walkthrough_%2832%29.png",
    "alt_text": "Bishui Cave Walkthrough \\(32\\).png",
    "position_desc": 18,
    "img_above_text": "# Chapter 5 Secret - Bishui Cave Walkthrough\n\nTo your left, immediately as you enter the room, you'll find the Purge Pit Keeper's Shrine.\n\n\nAfter activating the first of the Keeper's Shrines, face away from it and head to the right. Go down the stairs and to the end of the path to find a Meditation Spot.\n\nReturn to the Keeper's Shrine and continue past it, following the path to the right. Head down to the slope, collecting the green Wisp on the left and into the center of the room. As you reach the middle, you'll be met by the first of the bosses in this secret area.\n\n\nGet back to the path and go past the next two bull guards to find the Cave Depths Keeper's Shrine.\n\n\nDrop down toward the lava and go left into the ice-covered portion of the room. Open the chest on the right to collect Celestial Ribbon and a Mind Core.\n\nHead down to the left, and slide all the way down the slope. Here you'll reach the final Keeper's Shrine of the hidden area, called the Corridor of Fire and Ice.\n\n## Corridor of Fire and Ice",
    "img_below_text": "Head right from the Keeper's Shrine and go down the stairs. A cutscene will play as you drop down, and the Bishui Golden-Eyed Beast will appear.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chapter 5 Secret - Bishui Cave Walkthrough\n            - Section Title: Corridor of Fire and Ice\n\n            Context:\n            - Preceding Text: \"# Chapter 5 Secret - Bishui Cave Walkthrough\n\nTo your left, immediately as you enter the room, you'll find the Purge Pit Keeper's Shrine.\n\n\nAfter activating the first of the Keeper's Shrines, face away from it and head to the right. Go down the stairs and to the end of the path to find a Meditation Spot.\n\nReturn to the Keeper's Shrine and continue past it, following the path to the right. Head down to the slope, collecting the green Wisp on the left and into the center of the room. As you reach the middle, you'll be met by the first of the bosses in this secret area.\n\n\nGet back to the path and go past the next two bull guards to find the Cave Depths Keeper's Shrine.\n\n\nDrop down toward the lava and go left into the ice-covered portion of the room. Open the chest on the right to collect Celestial Ribbon and a Mind Core.\n\nHead down to the left, and slide all the way down the slope. Here you'll reach the final Keeper's Shrine of the hidden area, called the Corridor of Fire and Ice.\n\n## Corridor of Fire and Ice\"\n            - Following Text: \"Head right from the Keeper's Shrine and go down the stairs. A cutscene will play as you drop down, and the Bishui Golden-Eyed Beast will appear.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes a walkthrough in a secret area of Bishui Cave, focusing on navigating through various Keeper's Shrines and collecting items like the Celestial Ribbon and Mind Core. It sets the stage for reaching the final Keeper's Shrine in the hidden area, known as the Corridor of Fire and Ice.\n\nImage Summary:\nThe image depicts a dark cave environment with contrasting elements of fire and ice, aligning with the Corridor of Fire and Ice theme. On the left, there is a glowing lava area, while on the right, there are ice formations. This visual contrast highlights the dual nature of the corridor, which is a significant location within the walkthrough.\n\nFollowing Text Summary:\nThe following text instructs the player to proceed right from the Keeper's Shrine and descend the stairs, triggering a cutscene where the Bishui Golden-Eyed Beast appears. This indicates an upcoming encounter or challenge within the Corridor of Fire and Ice."
}