{
    "chunk_id": 805931589807,
    "source_file": "Fine_China_Tea_Bowl.md",
    "h1_title": "Fine China Tea Bowl",
    "h2_title": "Black Myth: Wukong Fine China Tea Bowl Location",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1d/Fine_China_Tea_Bowl_1.jpg",
    "alt_text": "Fine China Tea Bowl 1.jpg",
    "position_desc": 2,
    "img_above_text": "# Fine China Tea Bowl\n\nCurios in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, you will want to switch to other Curios items to better fit your build as you play. This can be done at any point from the Equipment menu.\n\n## Black Myth: Wukong Fine China Tea Bowl Location\n\nAs mentioned, finding this Curios item isn't the easiest. The Fine China Tea Bowl is in a box by a statue and a blade-wielding enemy in the Pagoda Realm along the lowest level. From the Lower Pagoda Shrine in The New West continue along to the end of the path, ignoring the stairs up a level.\n\nAt the end of this lowest level, just ahead of the stairs, you can find the statue and box with the Curios item in it.",
    "img_below_text": "For even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fine China Tea Bowl\n            - Section Title: Black Myth: Wukong Fine China Tea Bowl Location\n\n            Context:\n            - Preceding Text: \"# Fine China Tea Bowl\n\nCurios in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, you will want to switch to other Curios items to better fit your build as you play. This can be done at any point from the Equipment menu.\n\n## Black Myth: Wukong Fine China Tea Bowl Location\n\nAs mentioned, finding this Curios item isn't the easiest. The Fine China Tea Bowl is in a box by a statue and a blade-wielding enemy in the Pagoda Realm along the lowest level. From the Lower Pagoda Shrine in The New West continue along to the end of the path, ignoring the stairs up a level.\n\nAt the end of this lowest level, just ahead of the stairs, you can find the statue and box with the Curios item in it.\"\n            - Following Text: \"For even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text explains that Curios items in *Black Myth: Wukong*, such as the Fine China Tea Bowl, cannot be upgraded to enhance their power or effectiveness. Players are encouraged to switch to other Curios items that better suit their build as they progress. The Fine China Tea Bowl is described as being located in the Pagoda Realm, at the lowest level near a statue and a blade-wielding enemy. Directions are provided from the Lower Pagoda Shrine to locate the item.\n\nImage Summary:  \nThe image depicts a player character in *Black Myth: Wukong* standing in a dimly lit area with rocky surroundings. A red dashed circle highlights a distant object near a statue, which is likely the box containing the Fine China Tea Bowl Curios item, as described in the preceding text. The environment matches the description of the Pagoda Realm's lowest level.\n\nFollowing Text Summary:  \nThe following text directs players to additional guides for locating various items in *Black Myth: Wukong*, including Drinks, Soaks, Weapons, Armor, and Gear sets. It encourages players to explore these resources for more comprehensive tips and strategies."
}