{
    "chunk_id": 472183896575,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "h1_title": "Furnace Valley Walkthrough",
    "h2_title": "How to Complete the Old Man's Questline",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e1/Furnace_Valley_Walkthrough_%28104%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(104\\).png",
    "position_desc": 44,
    "img_above_text": "# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n\nOpen the giant door at the top of the stairs. Go straight ahead and activate the Rakshasa Palace Keeper's Shrine.\n\n\nInside here, you'll find the old man who gave you the gourd at the start of the game and an Awaken Wine Worm to the left.\n\nSpeak to the old man, and he'll tell you to find yourself a decent gourd (if you haven't already upgraded yours fully) and you can share a drink with him.\n\n## How to Complete the Old Man's Questline\n\nReturn to the stairs where you first left to see the old man. Cross the covered bridge in the center, then take out the bull guard and master by the stairs on the left. Head up here, and activate the next Keeper's Shrine.",
    "img_below_text": "",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Furnace Valley Walkthrough\n            - Section Title: How to Complete the Old Man's Questline\n\n            Context:\n            - Preceding Text: \"# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n\nOpen the giant door at the top of the stairs. Go straight ahead and activate the Rakshasa Palace Keeper's Shrine.\n\n\nInside here, you'll find the old man who gave you the gourd at the start of the game and an Awaken Wine Worm to the left.\n\nSpeak to the old man, and he'll tell you to find yourself a decent gourd (if you haven't already upgraded yours fully) and you can share a drink with him.\n\n## How to Complete the Old Man's Questline\n\nReturn to the stairs where you first left to see the old man. Cross the covered bridge in the center, then take out the bull guard and master by the stairs on the left. Head up here, and activate the next Keeper's Shrine.\"\n            - Following Text: \"\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the progression of the walkthrough in *Furnace Valley*. Players are instructed to revisit the Pale-Axe Stalwart at the Camp of Seasons Keeper's Shrine after defeating two of the Five Element Carts. The text then guides players to open a giant door, activate the Rakshasa Palace Keeper's Shrine, and interact with the old man who initially gave them the gourd. The old man advises upgrading the gourd to share a drink with him.\n\nImage Summary:\nThe image depicts a dark, rocky environment with a staircase leading to an illuminated area at the top. A glowing object, highlighted with a red circle and arrow, is positioned at the top of the stairs, suggesting it is a key point of interest. The foreground shows a player character standing near a lava-filled area, emphasizing the hazardous terrain and the need to ascend the stairs to progress.\n\nFollowing Text Summary:\nThe following text provides instructions for continuing the old man's questline. Players are directed to return to the stairs where they first encountered the old man, cross a covered bridge, defeat enemies near the stairs on the left, and activate another Keeper's Shrine to advance further."
}