{
    "chunk_id": 159539308923,
    "source_file": "Centipede_Guai_Spirit.md",
    "h1_title": "Centipede Guai Spirit",
    "h2_title": "Centipede Guai Fight",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0c/Centipede_Guai_Minions.jpg",
    "alt_text": "Centipede Guai Minions.jpg",
    "position_desc": 3,
    "img_above_text": "# Centipede Guai Spirit\n\n\n## Centipede Guai Fight\n\nThe Centipede Guai is a huge armored centipede that has its own boss arena in the Webbed Hollow. It can be tricky to defeat as it's very fast, very strong, has some very hard-hitting attacks, and even has an army of minions on call. You can expect to see lots of belly-flop moves where the beast smashes its huge body into the ground multiple times, a roll-attack where it curls up into a ball and crashes around the arena, and a poison spray move where it spews pools of poison onto the ground.",
    "img_below_text": "The worst attack of all, however, occurs when the creature lets out a massive scream that summons a horde of small centipedes that explode on impact. Sprint and dodge out of the way to avoid the onslaught of poison. Bring some Antimiasma Powder just in case you need it.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Centipede Guai Spirit\n            - Section Title: Centipede Guai Fight\n\n            Context:\n            - Preceding Text: \"# Centipede Guai Spirit\n\n\n## Centipede Guai Fight\n\nThe Centipede Guai is a huge armored centipede that has its own boss arena in the Webbed Hollow. It can be tricky to defeat as it's very fast, very strong, has some very hard-hitting attacks, and even has an army of minions on call. You can expect to see lots of belly-flop moves where the beast smashes its huge body into the ground multiple times, a roll-attack where it curls up into a ball and crashes around the arena, and a poison spray move where it spews pools of poison onto the ground.\"\n            - Following Text: \"The worst attack of all, however, occurs when the creature lets out a massive scream that summons a horde of small centipedes that explode on impact. Sprint and dodge out of the way to avoid the onslaught of poison. Bring some Antimiasma Powder just in case you need it.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Centipede Guai, a large armored centipede boss encountered in the Webbed Hollow arena. It describes the creature's speed, strength, and powerful attacks, including belly-flops, rolling attacks, and poison sprays, making it a challenging foe.\n\nImage Summary:  \nThe image depicts a dark, cavernous boss arena where the Centipede Guai is engaged in combat. The massive centipede is visible in the background, surrounded by a swarm of smaller enemies. The player’s interface is visible, showing health, abilities, and the boss's health bar, emphasizing the ongoing battle.\n\nFollowing Text Summary:  \nThe following text highlights the Centipede Guai's most dangerous attack, where it summons explosive minion centipedes with a scream. It advises players to sprint and dodge to avoid the attack and to carry Antimiasma Powder as a precaution against poison."
}