{
    "chunk_id": 825710445488,
    "source_file": "Gore-Eye_Daoist_Spirit.md",
    "h1_title": "Gore-Eye Daoist Spirit",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ec/Gore_eye_daoist.png",
    "alt_text": "Gore eye daoist.png",
    "position_desc": 1,
    "img_above_text": "# Gore-Eye Daoist Spirit\n\n**Gore-Eye Daoist** is a foe that you will face off against in Black Myth: Wukong. Once defeated, Gore-Eye Daoist offers up his Spirit for you to absorb, allowing you to use some of his powers for a short time. On this page, we will go over everything you need to know about Gore-Eye Daoist, including where to find him, how to defeat him, and what power his Spirit gives you.\n\n* Gore-Eye Daoist Location\n* Gore-Eye Daoist Fight\n* Gore-Eye Daoist Spirit",
    "img_below_text": "## Gore-Eye Daoist Location\n\nGore-Eye Daoist can be found after defeating both the Stone Vanguard and Tiger Vanguard bosses. After defeating them, return to the area where you fought the King of Flowing Sands and Second Rat Price and place the Keenness of Tiger and Keenness of Stone items into the receptacle by the large stone door. Open the door, head down the hill, and over the bridge to reach an open cave area with a statue carved into the rock face.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Gore-Eye Daoist Spirit\n\n            Context:\n            - Preceding Text: \"# Gore-Eye Daoist Spirit\n\n**Gore-Eye Daoist** is a foe that you will face off against in Black Myth: Wukong. Once defeated, Gore-Eye Daoist offers up his Spirit for you to absorb, allowing you to use some of his powers for a short time. On this page, we will go over everything you need to know about Gore-Eye Daoist, including where to find him, how to defeat him, and what power his Spirit gives you.\n\n* Gore-Eye Daoist Location\n* Gore-Eye Daoist Fight\n* Gore-Eye Daoist Spirit\"\n            - Following Text: \"## Gore-Eye Daoist Location\n\nGore-Eye Daoist can be found after defeating both the Stone Vanguard and Tiger Vanguard bosses. After defeating them, return to the area where you fought the King of Flowing Sands and Second Rat Price and place the Keenness of Tiger and Keenness of Stone items into the receptacle by the large stone door. Open the door, head down the hill, and over the bridge to reach an open cave area with a statue carved into the rock face.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Gore-Eye Daoist as a boss character in the game *Black Myth: Wukong*. It explains that defeating him allows players to absorb his Spirit, granting temporary access to his powers. The section outlines the topics covered, including his location, fight mechanics, and the abilities gained from his Spirit.\n\nImage Summary:\nThe image depicts the Gore-Eye Daoist boss fight in *Black Myth: Wukong*. The scene shows a dark, rocky environment with pools of glowing red liquid, likely blood or energy, surrounding the combat area. The Gore-Eye Daoist is wielding a staff and appears to be attacking the player character. The game's interface is visible, including health bars, abilities, and the boss's name displayed prominently.\n\nFollowing Text Summary:\nThe following text provides details on the location of Gore-Eye Daoist. It explains that players must defeat two prior bosses, Stone Vanguard and Tiger Vanguard, and then return to a specific area to unlock access to Gore-Eye Daoist. The instructions include placing items into a receptacle to open a stone door and navigating through a bridge and cave to reach the boss's arena."
}