{
    "chunk_id": 509513076104,
    "source_file": "Snow_Fox_Questline.md",
    "h1_title": "Snow Fox Questline",
    "h2_title": "Where to Find the Snow Fox",
    "h3_title": "Yaoguai Chief Boss - Non-Void",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3a/Snow_Fox_Questline_%2864%29.png",
    "alt_text": "Snow Fox Questline \\(64\\).png",
    "position_desc": 15,
    "img_above_text": "# Snow Fox Questline\n\nThe Snow Fox is a character you can encounter in Chapter 3 of Black Myth: Wukong. Completing her side quest will unlock a secret boss for you to take on and a unique Curio.\n\n## Where to Find the Snow Fox\n\nWhen the story is over, examine the body and the fox will beg you to transform and wear the fur so you can confront the monk. After this, you'll automatically become the fox, and receive a Snow Fox Brush special item.\n\n\nGo up the sloped wooden bridge, and straight up the stairs to the left. This will bring you to the temple where the monk is. However, **this is also when you'll need to be in fox form**. Doing so will activate a cutscene and trigger a boss fight against the Yaoguai Chief Non-Void. Transform into the fox by using the Snow Fox Brush from your inventory, then step inside the temple.\n\n### Yaoguai Chief Boss - Non-Void\n\nIf you're having a hard time finding the right moment to attack, try getting him to stand still as often as possible by using Immobilize. We'd also recommend having Cloud Step equipped for this fight so you can match his dashing ability. Using Cloud Step will allow you to gain the upper hand on him at times and surprise him.",
    "img_below_text": "The biggest attack he performs is one where he whips up a load of papers into a tornado that will follow you around the temple. You can dodge this or run away from it, but he'll use it as cover at times to get closer to you. Toward the end of this move, the papers will start to fall and there's an opening where he doesn't move much at all. This is the perfect moment to Immobolize him or dash over to attack as much as you can.\n\nAny chance you get where you're able to make him stagger backward, keep attacking. When he appears to be losing his balance, he'll be slower to get back into his pattern of attacks and you can keep finishing combos and use your Focus points for heavier attacks.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Snow Fox Questline\n            - Section Title: Where to Find the Snow Fox\n            - Sub-Section Title: Yaoguai Chief Boss - Non-Void\n\n            Context:\n            - Preceding Text: \"# Snow Fox Questline\n\nThe Snow Fox is a character you can encounter in Chapter 3 of Black Myth: Wukong. Completing her side quest will unlock a secret boss for you to take on and a unique Curio.\n\n## Where to Find the Snow Fox\n\nWhen the story is over, examine the body and the fox will beg you to transform and wear the fur so you can confront the monk. After this, you'll automatically become the fox, and receive a Snow Fox Brush special item.\n\n\nGo up the sloped wooden bridge, and straight up the stairs to the left. This will bring you to the temple where the monk is. However, **this is also when you'll need to be in fox form**. Doing so will activate a cutscene and trigger a boss fight against the Yaoguai Chief Non-Void. Transform into the fox by using the Snow Fox Brush from your inventory, then step inside the temple.\n\n### Yaoguai Chief Boss - Non-Void\n\nIf you're having a hard time finding the right moment to attack, try getting him to stand still as often as possible by using Immobilize. We'd also recommend having Cloud Step equipped for this fight so you can match his dashing ability. Using Cloud Step will allow you to gain the upper hand on him at times and surprise him.\"\n            - Following Text: \"The biggest attack he performs is one where he whips up a load of papers into a tornado that will follow you around the temple. You can dodge this or run away from it, but he'll use it as cover at times to get closer to you. Toward the end of this move, the papers will start to fall and there's an opening where he doesn't move much at all. This is the perfect moment to Immobolize him or dash over to attack as much as you can.\n\nAny chance you get where you're able to make him stagger backward, keep attacking. When he appears to be losing his balance, he'll be slower to get back into his pattern of attacks and you can keep finishing combos and use your Focus points for heavier attacks.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}