{
    "chunk_id": 283231456163,
    "source_file": "Father_of_Stones_Spirit.md",
    "h1_title": "Father of Stones Spirit",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7f/Father_of_Stones.jpg",
    "alt_text": "Father of Stones.jpg",
    "position_desc": 1,
    "img_above_text": "# Father of Stones Spirit\n\nThe **Father of Stones** is a foe that you will face off against in Black Myth: Wukong. Once defeated, the Father of Stones offers up his Spirit for you to absorb, allowing you to use some of his powers for a short time. On this page, we will go over everything you need to know about the Father of Stones, including where to find him, how to defeat him, and what power his Spirit gives you.\n\n* Father of Stones Location\n* Father of Stones Fight\n* Father of Stones Spirit",
    "img_below_text": "## Father of Stones Location\n\nThe Father of Stones is a large, black creature clutching a skeleton like a doll. He can be found lurking in the Flaming Mountains just past the Heart of Ember Keeper's Shrine. You will walk straight into his path as you progress further up the mountain, so don't worry about accidentally missing him.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Father of Stones Spirit\n\n            Context:\n            - Preceding Text: \"# Father of Stones Spirit\n\nThe **Father of Stones** is a foe that you will face off against in Black Myth: Wukong. Once defeated, the Father of Stones offers up his Spirit for you to absorb, allowing you to use some of his powers for a short time. On this page, we will go over everything you need to know about the Father of Stones, including where to find him, how to defeat him, and what power his Spirit gives you.\n\n* Father of Stones Location\n* Father of Stones Fight\n* Father of Stones Spirit\"\n            - Following Text: \"## Father of Stones Location\n\nThe Father of Stones is a large, black creature clutching a skeleton like a doll. He can be found lurking in the Flaming Mountains just past the Heart of Ember Keeper's Shrine. You will walk straight into his path as you progress further up the mountain, so don't worry about accidentally missing him.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the \"Father of Stones,\" a formidable enemy in the game *Black Myth: Wukong*. Upon defeating this foe, players can absorb the Father of Stones' Spirit, granting temporary access to some of his powers. The text outlines the structure of the guide, which includes details on the enemy's location, strategies for defeating him, and the abilities gained from his Spirit.\n\nImage Summary:  \nThe image depicts an in-game scene from *Black Myth: Wukong*, showing the player character engaging in combat with the Father of Stones. The Father of Stones is a large, black, humanoid creature holding a skeleton, set in a dark, rocky environment. The game's interface is visible, including the player's health bar, abilities, and the enemy's name and health bar, emphasizing the active battle.\n\nFollowing Text Summary:  \nThe following text provides specific details about the Father of Stones' location. He is described as a large, black creature holding a skeleton, found in the Flaming Mountains near the Heart of Ember Keeper's Shrine. Players will encounter him naturally as they progress up the mountain, ensuring he cannot be missed."
}