{
    "chunk_id": 628200555012,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "h1_title": "Fright Cliff Walkthrough",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/88/Wukong_Sandgate_81.jpg",
    "alt_text": "Wukong Sandgate 81.jpg",
    "position_desc": 1,
    "img_above_text": "# Fright Cliff Walkthrough\n\nFright Cliff is one of two possible second main regions of Chapter 2 in the Yellow Wind Ridge of Black Myth: Wukong. Below you'll find a guide for the Fright Cliff Region and its side quests for the Man-in-Stone and Yellow-Robed Squire, as well as how to defeat its many bosses that include the Mother of Stones and Stone Vanguard to get the Sterness of Stone.\n\n* **Jump to A Section:**\n* **Squall Hideout**\n- Yaoguai Chief - Mother of Stones\n* **Rockrest Flat**\n- Yaoguai King - Stone Vanguard\n* **Rock Crash Platform**",
    "img_below_text": "Fright Cliff is one of the two sub-regions you’ll need to explore in Chapter 2 of Black Myth Wukong in order to unlock the large sealed doors that lead to the end of the chapter. You can first reach this area by heading through the Sandgate Village and defeating the King of Flowing Sands and Second Rat Prince, and then crossing the bridge to the right of the sealed door.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fright Cliff Walkthrough\n\n            Context:\n            - Preceding Text: \"# Fright Cliff Walkthrough\n\nFright Cliff is one of two possible second main regions of Chapter 2 in the Yellow Wind Ridge of Black Myth: Wukong. Below you'll find a guide for the Fright Cliff Region and its side quests for the Man-in-Stone and Yellow-Robed Squire, as well as how to defeat its many bosses that include the Mother of Stones and Stone Vanguard to get the Sterness of Stone.\n\n* **Jump to A Section:**\n* **Squall Hideout**\n- Yaoguai Chief - Mother of Stones\n* **Rockrest Flat**\n- Yaoguai King - Stone Vanguard\n* **Rock Crash Platform**\"\n            - Following Text: \"Fright Cliff is one of the two sub-regions you’ll need to explore in Chapter 2 of Black Myth Wukong in order to unlock the large sealed doors that lead to the end of the chapter. You can first reach this area by heading through the Sandgate Village and defeating the King of Flowing Sands and Second Rat Prince, and then crossing the bridge to the right of the sealed door.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Fright Cliff as a significant region in Chapter 2 of the game \"Black Myth: Wukong.\" It outlines the main areas and bosses within Fright Cliff, such as the Mother of Stones and Stone Vanguard, and mentions side quests involving characters like the Man-in-Stone and Yellow-Robed Squire. The text serves as a guide for navigating this region and defeating its bosses to obtain the Sterness of Stone.\n\nImage Summary:\nThe image depicts a scene from the game \"Black Myth: Wukong,\" showing a character navigating a rugged, rocky landscape, likely within the Fright Cliff region. The character is equipped with a staff and appears to be moving towards a wooden structure, suggesting exploration or progression within the game. The visual elements, including the character's stance and the surrounding environment, emphasize the adventurous and challenging nature of the game.\n\nFollowing Text Summary:\nThe following text explains that Fright Cliff is one of two sub-regions necessary to explore in Chapter 2 of \"Black Myth: Wukong\" to unlock large sealed doors leading to the chapter's end. It describes the path to reach Fright Cliff, which involves passing through Sandgate Village and defeating specific bosses like the King of Flowing Sands and Second Rat Prince before crossing a bridge near the sealed door."
}