{
    "chunk_id": 798587058259,
    "source_file": "Erlang,_The_Sacred_Divinity.md",
    "h1_title": "Erlang, The Sacred Divinity",
    "h2_title": "How to Enter Mount Mei from The Great Pagoda and Find Erlang, The Sacred Divinity",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c0/Mount_Mei_Walkthrough_.png",
    "alt_text": "Mount Mei Walkthrough .png",
    "position_desc": 1,
    "img_above_text": "# Erlang, The Sacred Divinity\n\nErlang, The Sacred Divinity is an optional secret boss you can find by entering Chapter 3's Secret Area of Mount Mei in Black Myth: Wukong. You'll need to complete all chapters' secret areas and an elusive side quest before you can find this tough boss.\n\n\nThere are several steps you need to take to unlock Mount Mei. You can find a detailed breakdown on our dedicated page: How to Unlock the Secret Ending (True Ending). But here's a quick rundown of everything you'll need to do by Chapter 6 to reach it.\n\n1. Complete the Chapter 1 secret area of the Ancient Guanyin Temple\n2. Complete the Chapter 2 secret area of the Kingdom of Sahali\n3. Complete the Green-Capped Martialist/Treasure Hunter quest in Chapter 3\n4. Complete the Chapter 4 secret area of the Purple Cloud Mountain\n5. Complete the Chapter 5 secret area of Bishui Cave\n6. Return to **The Great Pagoda in Chapter 3**. You can find it on the Snow-Veiled Trail in the Pagoda Realm.\n\n## How to Enter Mount Mei from The Great Pagoda and Find Erlang, The Sacred Divinity",
    "img_below_text": "When you’re in The Great Pagoda, you’ll see tapestries around the room. One tapestry, at the very top of the room, will be red. Head for this, and a cutscene will begin where the small Buddha from Chapter 3 will be waiting for you. He'll open the tapestry and let you into Mount Mei.\n\nWhen you're through the tapestry, head up the stairs and follow the path. About halfway up you'll need to shimmy across a ledge on the left to reach the other side, then you'll continue up to the Mei-Jian Peak Keeper's Shrine. At the top of the peak is where you'll find Erlang, The Sacred Divinity.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Erlang, The Sacred Divinity\n            - Section Title: How to Enter Mount Mei from The Great Pagoda and Find Erlang, The Sacred Divinity\n\n            Context:\n            - Preceding Text: \"# Erlang, The Sacred Divinity\n\nErlang, The Sacred Divinity is an optional secret boss you can find by entering Chapter 3's Secret Area of Mount Mei in Black Myth: Wukong. You'll need to complete all chapters' secret areas and an elusive side quest before you can find this tough boss.\n\n\nThere are several steps you need to take to unlock Mount Mei. You can find a detailed breakdown on our dedicated page: How to Unlock the Secret Ending (True Ending). But here's a quick rundown of everything you'll need to do by Chapter 6 to reach it.\n\n1. Complete the Chapter 1 secret area of the Ancient Guanyin Temple\n2. Complete the Chapter 2 secret area of the Kingdom of Sahali\n3. Complete the Green-Capped Martialist/Treasure Hunter quest in Chapter 3\n4. Complete the Chapter 4 secret area of the Purple Cloud Mountain\n5. Complete the Chapter 5 secret area of Bishui Cave\n6. Return to **The Great Pagoda in Chapter 3**. You can find it on the Snow-Veiled Trail in the Pagoda Realm.\n\n## How to Enter Mount Mei from The Great Pagoda and Find Erlang, The Sacred Divinity\"\n            - Following Text: \"When you’re in The Great Pagoda, you’ll see tapestries around the room. One tapestry, at the very top of the room, will be red. Head for this, and a cutscene will begin where the small Buddha from Chapter 3 will be waiting for you. He'll open the tapestry and let you into Mount Mei.\n\nWhen you're through the tapestry, head up the stairs and follow the path. About halfway up you'll need to shimmy across a ledge on the left to reach the other side, then you'll continue up to the Mei-Jian Peak Keeper's Shrine. At the top of the peak is where you'll find Erlang, The Sacred Divinity.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Erlang, The Sacred Divinity as a secret boss in *Black Myth: Wukong*, accessible through Mount Mei in Chapter 3. It outlines the prerequisites for unlocking Mount Mei, including completing secret areas and a side quest across multiple chapters, culminating in returning to The Great Pagoda in Chapter 3.\n\nImage Summary:  \nThe image depicts the interior of The Great Pagoda, featuring a dimly lit, atmospheric setting with a central Buddha statue surrounded by ornate architecture, tapestries, and numerous lit torches. The environment suggests a sacred and mystical location, serving as a key area in the narrative to access Mount Mei.\n\nFollowing Text Summary:  \nThe following text provides instructions for entering Mount Mei from The Great Pagoda. It describes locating a red tapestry at the top of the room, interacting with the small Buddha from Chapter 3, and proceeding through a cutscene to access Mount Mei. The path leads to Mei-Jian Peak Keeper's Shrine, where players can find Erlang, The Sacred Divinity."
}