{
    "chunk_id": 601967004519,
    "source_file": "Celestial_Taiyi_Pill_Locations.md",
    "h1_title": "Celestial Taiyi Pill Locations",
    "h2_title": "The Webbed Hollow Celestial Taiyi Pill",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/98/The_Webbed_Hollow_Taiyi.jpg",
    "alt_text": "The Webbed Hollow Taiyi.jpg",
    "position_desc": 5,
    "img_above_text": "# Celestial Taiyi Pill Locations\n\n**Celestial Taiyi Pills** are an item you can collect in Black Myth: Wukong to upgrade your maximum Mana. Mana is used to cast spells like Immobilize, A Pluck of Many, and Cloud Step. Spells are a massive part of combat in Black Myth: Wukong, and running out of Mana can be a problem. Here, we will review all the Celestial Taiyi locations so you can have as much Mana as possible.\n\n* Black Wind Mountain Celestial Taiyi Pill\n* Yellow Wind Ridge Celestial Taiyi Pill\n* Xu-Dog Celestial Taiyi Pills\n* The Webbed Hollow Celestial Taiyi Pill\n* The New West Celestial Taiyi Pill\n* Flaming Mountains Celestial Taiyi Pill\n\n\nThe Celestial Taiyi Pill on Black Wind Mountain is accessible after defeating the Black Wind King. After defeating the boss, explore the wooden platforms in the temple to find the Celestial Taiyi Pill sitting on a wooden bench.\n\n\nThe next Celestial Taiyi Pill is hidden near a Meditation Spot. This one is available after defeating the Stone Vanguard at Rock Clash Platform. Once you do, follow the light to unlock the Rock Clash Platform Keeper's Shrine. Take the path opposite the Shrine and defeat the Rat Governor Spirit. The pill is on a small side path, branching off to the right before the Meditation Spot.\n\n\nFall down the sand slide after exploring the Crouching Tiger Temple Cellar to meet the Xu-Dog. The Xu-Dog crafts Celestial Medicines for you in exchange for Mind Cores. You can craft a total of nine Celestial Taiyi Pills with the Xu-Dog. You can find Mind Cores in chests or as loot for defeating particularly vicious foes.\n\n\nThe Chapter 3 Celestial Taiyi Pill is accessible after defeating Captain Wise-Voice in the Pagoda Realm. Fight your way through each level of the Pagoda and take down the boss. Run out the opposite side of the boss arena to find yourself in a series of caves leading out to the snow. The Celestial Taiyi Pill is on the right side of a snowy path. Destroy the gate once you collect it to find another Meditation Spot.\n\n## The Webbed Hollow Celestial Taiyi Pill",
    "img_below_text": "After defeating the Buddha's Right Hand in the Webbed Hollow, run across the bridge it creates and turn left as soon as you reach solid ground. The Celestial Taiyi Pill is hidden around the corner.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Celestial Taiyi Pill Locations\n            - Section Title: The Webbed Hollow Celestial Taiyi Pill\n\n            Context:\n            - Preceding Text: \"# Celestial Taiyi Pill Locations\n\n**Celestial Taiyi Pills** are an item you can collect in Black Myth: Wukong to upgrade your maximum Mana. Mana is used to cast spells like Immobilize, A Pluck of Many, and Cloud Step. Spells are a massive part of combat in Black Myth: Wukong, and running out of Mana can be a problem. Here, we will review all the Celestial Taiyi locations so you can have as much Mana as possible.\n\n* Black Wind Mountain Celestial Taiyi Pill\n* Yellow Wind Ridge Celestial Taiyi Pill\n* Xu-Dog Celestial Taiyi Pills\n* The Webbed Hollow Celestial Taiyi Pill\n* The New West Celestial Taiyi Pill\n* Flaming Mountains Celestial Taiyi Pill\n\n\nThe Celestial Taiyi Pill on Black Wind Mountain is accessible after defeating the Black Wind King. After defeating the boss, explore the wooden platforms in the temple to find the Celestial Taiyi Pill sitting on a wooden bench.\n\n\nThe next Celestial Taiyi Pill is hidden near a Meditation Spot. This one is available after defeating the Stone Vanguard at Rock Clash Platform. Once you do, follow the light to unlock the Rock Clash Platform Keeper's Shrine. Take the path opposite the Shrine and defeat the Rat Governor Spirit. The pill is on a small side path, branching off to the right before the Meditation Spot.\n\n\nFall down the sand slide after exploring the Crouching Tiger Temple Cellar to meet the Xu-Dog. The Xu-Dog crafts Celestial Medicines for you in exchange for Mind Cores. You can craft a total of nine Celestial Taiyi Pills with the Xu-Dog. You can find Mind Cores in chests or as loot for defeating particularly vicious foes.\n\n\nThe Chapter 3 Celestial Taiyi Pill is accessible after defeating Captain Wise-Voice in the Pagoda Realm. Fight your way through each level of the Pagoda and take down the boss. Run out the opposite side of the boss arena to find yourself in a series of caves leading out to the snow. The Celestial Taiyi Pill is on the right side of a snowy path. Destroy the gate once you collect it to find another Meditation Spot.\n\n## The Webbed Hollow Celestial Taiyi Pill\"\n            - Following Text: \"After defeating the Buddha's Right Hand in the Webbed Hollow, run across the bridge it creates and turn left as soon as you reach solid ground. The Celestial Taiyi Pill is hidden around the corner.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the \"Celestial Taiyi Pills\" in *Black Myth: Wukong*, explaining their role in upgrading maximum Mana, which is essential for casting spells during combat. It lists various locations where these pills can be found, including \"The Webbed Hollow Celestial Taiyi Pill,\" and describes the process of obtaining pills in other areas.\n\nImage Summary:\nThe image depicts a dark cave environment with a character standing near a glowing object labeled \"Open,\" which appears to be a container or item. A lit candle is positioned next to the object, suggesting a hidden or significant discovery. The scene aligns with the narrative of exploring locations to collect Celestial Taiyi Pills in *Black Myth: Wukong*. The interface elements indicate gameplay mechanics, such as interaction prompts and abilities.\n\nFollowing Text Summary:\nThe following text provides instructions for obtaining the Celestial Taiyi Pill in the Webbed Hollow. After defeating the Buddha's Right Hand boss, players must cross a bridge and turn left upon reaching solid ground to locate the pill, which is hidden around a corner."
}