{
    "chunk_id": 153472192390,
    "source_file": "Elder_Armourworm_Spirit.md",
    "h1_title": "Elder Armourworm Spirit",
    "h2_title": "How to Get the Elder Armourworm Spirit",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/07/Zodiac_Village_2.jpg",
    "alt_text": "Zodiac Village 2.jpg",
    "position_desc": 3,
    "img_above_text": "# Elder Armourworm Spirit\n\n\n\nThe Elder Armourworm relies mostly on its large, fat body during the fight. Expect to dodge lots of belly flops and huge swipes with the upper portion of its body. Thankfully, the Elder Armourworm is quite slow, so you should be able to dodge most attacks without too much trouble.\n\n## How to Get the Elder Armourworm Spirit\n\nThe Elder Armourworm Spirit is the most unique one of all and has its own mini-side quest to complete before you can collect it. The first step to collecting the Elder Armourworm Spirit is to unlock the Zodiac Village. Fight the lightning dragon in the lake on the left side of the North Shore of the Bitter Lake to begin the quest. He will then ask you to visit the Xu Dog for medicine. Collect the medicine and bring it back to Chen Loong to complete the quest and unlock Zodiac Village.",
    "img_below_text": "Once unlocked, Zodiac Village is where you can find all of the 'shop' NCPs, like the Xu Dog, Shen Monkey, and a new blacksmith character named Yin Tiger. Chen Loong will also reside there.\n\nSpeak to Chen Loong and hand over an item called the Proto Armourworm. The Proto Armourworm will turn up in a small basket just above the seed baskets outside Chen Loong's hut. You need to feed the Proto Armourworm three Rice Cocoons to make it grow into a Spirit that you can absorb the next time you visit the village.\n\nYou can get Rice Cocoons from egg sacks throughout the Webbed Hollow!\n\n### Elder Armourworm Spirit",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Elder Armourworm Spirit\n            - Section Title: How to Get the Elder Armourworm Spirit\n\n            Context:\n            - Preceding Text: \"# Elder Armourworm Spirit\n\n\n\nThe Elder Armourworm relies mostly on its large, fat body during the fight. Expect to dodge lots of belly flops and huge swipes with the upper portion of its body. Thankfully, the Elder Armourworm is quite slow, so you should be able to dodge most attacks without too much trouble.\n\n## How to Get the Elder Armourworm Spirit\n\nThe Elder Armourworm Spirit is the most unique one of all and has its own mini-side quest to complete before you can collect it. The first step to collecting the Elder Armourworm Spirit is to unlock the Zodiac Village. Fight the lightning dragon in the lake on the left side of the North Shore of the Bitter Lake to begin the quest. He will then ask you to visit the Xu Dog for medicine. Collect the medicine and bring it back to Chen Loong to complete the quest and unlock Zodiac Village.\"\n            - Following Text: \"Once unlocked, Zodiac Village is where you can find all of the 'shop' NCPs, like the Xu Dog, Shen Monkey, and a new blacksmith character named Yin Tiger. Chen Loong will also reside there.\n\nSpeak to Chen Loong and hand over an item called the Proto Armourworm. The Proto Armourworm will turn up in a small basket just above the seed baskets outside Chen Loong's hut. You need to feed the Proto Armourworm three Rice Cocoons to make it grow into a Spirit that you can absorb the next time you visit the village.\n\nYou can get Rice Cocoons from egg sacks throughout the Webbed Hollow!\n\n### Elder Armourworm Spirit\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Elder Armourworm Spirit, describing its combat style as slow but powerful, relying on belly flops and large swipes. It also outlines the steps to begin the quest to obtain the Spirit, starting with unlocking Zodiac Village by defeating a lightning dragon and completing a task involving Xu Dog's medicine.\n\nImage Summary:\nThe image depicts a serene yet mystical environment, likely representing Zodiac Village. It features a traditional structure surrounded by trees, lanterns, and a warm, glowing shrine or brazier in the foreground. The setting conveys a sense of tranquility and ritual, aligning with the narrative of unlocking the village and interacting with its NPCs for quests and items.\n\nFollowing Text Summary:\nThe following text elaborates on Zodiac Village, describing it as a hub for NPCs like Xu Dog, Shen Monkey, and Yin Tiger, as well as Chen Loong. It explains how to transform the Proto Armourworm into the Elder Armourworm Spirit by feeding it Rice Cocoons, which can be collected from egg sacks in the Webbed Hollow."
}