{
    "chunk_id": 498741049194,
    "source_file": "Goat_Skull.md",
    "h1_title": "Goat Skull",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2d/Goat_Skull_3.jpg",
    "alt_text": "Goat Skull 3.jpg",
    "position_desc": 1,
    "img_above_text": "# Goat Skull\n\nGoat Skull is one of the Soaks for your Gourds that can be found throughout Black Myth: Wukong. It can be quite easy to miss if you aren't exploring thoroughly. But, the buff it offers is definitely useful for those looking for a pick-me-up in the middle of a fight.\n\nWith the Goat Skull equipped, using the Gourd moderately increases maximum health for a short duration. This duration is rather brief, but in the middle of a fight or when at low health, it can give you an extra buffer beyond your regular health to either be more aggressive, or flee and take out an enemy or two on the way.",
    "img_below_text": "Soaks can't be upgraded in the game, unlike the Drinks and the Gourd itself, so you are stuck with the length of this health boost. It can't be increased. Therefore, if you want to switch to a different Soak, be sure to visit the Shen Monkey Vendor throughout your game to continue equipping new ones.\n\n## Black Myth: Wukong Goat Skull Location\n\nThe Goat Skull can be found at random by picking up Licorice plants. There isn't a set location or spot, you will just need to search for the purple Licorice plants throughout the game's chapters and hope that it drops for you. Chapter 2 - Yellow Wind Ridge has the most, especially in the early Sandgate Village area.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Goat Skull\n\n            Context:\n            - Preceding Text: \"# Goat Skull\n\nGoat Skull is one of the Soaks for your Gourds that can be found throughout Black Myth: Wukong. It can be quite easy to miss if you aren't exploring thoroughly. But, the buff it offers is definitely useful for those looking for a pick-me-up in the middle of a fight.\n\nWith the Goat Skull equipped, using the Gourd moderately increases maximum health for a short duration. This duration is rather brief, but in the middle of a fight or when at low health, it can give you an extra buffer beyond your regular health to either be more aggressive, or flee and take out an enemy or two on the way.\"\n            - Following Text: \"Soaks can't be upgraded in the game, unlike the Drinks and the Gourd itself, so you are stuck with the length of this health boost. It can't be increased. Therefore, if you want to switch to a different Soak, be sure to visit the Shen Monkey Vendor throughout your game to continue equipping new ones.\n\n## Black Myth: Wukong Goat Skull Location\n\nThe Goat Skull can be found at random by picking up Licorice plants. There isn't a set location or spot, you will just need to search for the purple Licorice plants throughout the game's chapters and hope that it drops for you. Chapter 2 - Yellow Wind Ridge has the most, especially in the early Sandgate Village area.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the \"Goat Skull,\" a rare item classified as a \"Soak\" in the game *Black Myth: Wukong*. When equipped, it provides a temporary health boost upon using the Gourd, making it valuable during combat situations. The item is described as easy to miss without thorough exploration, but its health-enhancing buff can be strategically useful.\n\nImage Summary:\nThe image displays the inventory screen from *Black Myth: Wukong*, highlighting the \"Goat Skull\" item. It is categorized as a rare \"Soak\" and provides a brief description of its effect: using the Gourd moderately increases maximum health for a short duration. The item's visual representation features a goat skull resting on a stone base, accompanied by the quote, \"Live fully, die content.\"\n\nFollowing Text Summary:\nThe following text explains that Soaks, including the Goat Skull, cannot be upgraded in the game. Players are limited to the default duration of the health boost. To equip new Soaks, players must visit the Shen Monkey Vendor. Additionally, the Goat Skull can be obtained randomly by collecting purple Licorice plants, with Chapter 2 - Yellow Wind Ridge being the most promising location for finding these plants."
}