{
    "chunk_id": 283417449683,
    "source_file": "Buddha's_Right_Hand.md",
    "h1_title": "Buddha's Right Hand",
    "h2_title": "Buddha's Right Hand Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/32/Wukong_MiddleHollow_58.jpg",
    "alt_text": "Wukong MiddleHollow 58.jpg",
    "position_desc": 6,
    "img_above_text": "# Buddha's Right Hand\n\nThe Buddha's Right Hand is a required Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the middle section of The Webbed Hollow, this creepy long hand is more than it seems, and blocks the passage down to the Lower Hollow.\n\n* Rewards: Buddha's Right Hand (Key Item), Past-Echo, Fine Gold Thread, Cold Iron Leaves, 2274 Experience, 1933 Will\n\n\nThe Buddha's Right Hand is an main boss and non-missable encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down to the Vedure Bridge Shrine and defeating the Centipede Guai in the Bonevault, follow the linear path up to the Cliff of Oblivion.\n\nJust past the Shrine, you'll find a narrow passageway with a creepy hand holding a mirror, but this is actually the boss fight you seek!\n\n## Buddha's Right Hand Boss Fight and Guide\n\nAt range, it can also charge up a magical dart that can't be deflected with your staff spin. There's a somewhat quick version where it performs a flicking motion, and a longer charged shot where an aura appears behind the hand.\n\nThankfully, there's ample opportunities to attack the hand after many of its attacks, but the fun is only just beginning.\n\nAfter you get the Buddha's Right Hand to around half of its health it will retreat, and you'll finally meet the owner of the hand.",
    "img_below_text": "The terrifying creature will lunge down with a scream, and then begin to spew a literal river of poison into a narrow arena. This stream of bile will damage you continuously, and there are only two real ways to avoid it.\n\nIf you're quick, you can dash under it before it starts spewing poison to get around behind it. If not, quickly get up onto a Pillar Stance to perch above the poison.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Buddha's Right Hand\n            - Section Title: Buddha's Right Hand Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Buddha's Right Hand\n\nThe Buddha's Right Hand is a required Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the middle section of The Webbed Hollow, this creepy long hand is more than it seems, and blocks the passage down to the Lower Hollow.\n\n* Rewards: Buddha's Right Hand (Key Item), Past-Echo, Fine Gold Thread, Cold Iron Leaves, 2274 Experience, 1933 Will\n\n\nThe Buddha's Right Hand is an main boss and non-missable encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down to the Vedure Bridge Shrine and defeating the Centipede Guai in the Bonevault, follow the linear path up to the Cliff of Oblivion.\n\nJust past the Shrine, you'll find a narrow passageway with a creepy hand holding a mirror, but this is actually the boss fight you seek!\n\n## Buddha's Right Hand Boss Fight and Guide\n\nAt range, it can also charge up a magical dart that can't be deflected with your staff spin. There's a somewhat quick version where it performs a flicking motion, and a longer charged shot where an aura appears behind the hand.\n\nThankfully, there's ample opportunities to attack the hand after many of its attacks, but the fun is only just beginning.\n\nAfter you get the Buddha's Right Hand to around half of its health it will retreat, and you'll finally meet the owner of the hand.\"\n            - Following Text: \"The terrifying creature will lunge down with a scream, and then begin to spew a literal river of poison into a narrow arena. This stream of bile will damage you continuously, and there are only two real ways to avoid it.\n\nIf you're quick, you can dash under it before it starts spewing poison to get around behind it. If not, quickly get up onto a Pillar Stance to perch above the poison.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the \"Buddha's Right Hand,\" a mandatory boss fight in *Black Myth: Wukong*, encountered in Chapter 4 within the Webbed Hollow area. The boss, a large hand holding a mirror, initially blocks progress to the Lower Hollow. Players are warned about its ranged magical dart attacks and given advice on exploiting attack opportunities. The fight evolves after reducing the boss's health to half, leading to the appearance of the hand's owner.\n\nImage Summary:  \nThe image depicts the intense boss fight with \"Buddha's Right Hand\" in a dark, narrow arena. The player character is engaged in combat with a grotesque, insect-like creature, which appears to be the owner of the hand. The creature looms menacingly, spewing green poison into the arena, while the player's health and ability icons are visible on the screen. The boss's health bar, labeled \"Buddha's Right Hand,\" is partially depleted, indicating progress in the fight.\n\nFollowing Text Summary:  \nThe following text describes the next phase of the boss fight, where the creature spews a continuous stream of poison in the narrow arena. Players must either quickly dash underneath the poison to attack from behind or climb onto elevated platforms (Pillar Stance) to avoid taking damage."
}