{
    "chunk_id": 300988851830,
    "source_file": "Yellow_Wind_Sage.md",
    "h1_title": "Yellow Wind Sage",
    "h2_title": "Yellow Wind Sage Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b5/Wukong_Yellow_69.jpg",
    "alt_text": "Wukong Yellow 69.jpg",
    "position_desc": 19,
    "img_above_text": "# Yellow Wind Sage\n\nThe Yellow Wind Sage is a required Yaoguai King and the final boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Located at the center of the large black tornado in the Yellow Wind Formation in the center of the region, you'll need two Key Items to open a path to him.\n\n* **Rewards:** Samahdi Wind Agate, Cold Iron Leaves x2, Refined Iron Sand x1, Silk x5, Yaoguai Core x2, Mind Core x1, 2583 Experience, 1944 Will\n\n\nWith both pieces, you can open the door where you defeated the King of Flowing Sands, or open up the temple cellar in the Crouching Tiger Temple, or slide down past the Rock Crash Platform to the Windseal Gate.\n\n## Yellow Wind Sage Boss Fight and Guide\n\nHe can also create a glow in his hand before throwing it into the ground. He’ll then stab the spot with his spear, and cause a giant tremor all around him when he rips the spear out. The time it takes for this move is a bit lengthy, so if you’re feeling gutsy you can try to interrupt him with a big charged hit or Spirit Attack, Immobilize him, or even use the Pillar Stance charge attack to rise above the tremor and smack him after evading it.",
    "img_below_text": "The Yellow Wind Sage also has a tricky feint where he’ll appear to run past you, but then lunge back into a sliding swipe with his arm. If timed correctly, you can cast Rock Solid just as he lunges back after the feint, which will often knock him to the ground and let you get a decent amount of damage in as he struggles to get up.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Yellow Wind Sage\n            - Section Title: Yellow Wind Sage Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Yellow Wind Sage\n\nThe Yellow Wind Sage is a required Yaoguai King and the final boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Located at the center of the large black tornado in the Yellow Wind Formation in the center of the region, you'll need two Key Items to open a path to him.\n\n* **Rewards:** Samahdi Wind Agate, Cold Iron Leaves x2, Refined Iron Sand x1, Silk x5, Yaoguai Core x2, Mind Core x1, 2583 Experience, 1944 Will\n\n\nWith both pieces, you can open the door where you defeated the King of Flowing Sands, or open up the temple cellar in the Crouching Tiger Temple, or slide down past the Rock Crash Platform to the Windseal Gate.\n\n## Yellow Wind Sage Boss Fight and Guide\n\nHe can also create a glow in his hand before throwing it into the ground. He’ll then stab the spot with his spear, and cause a giant tremor all around him when he rips the spear out. The time it takes for this move is a bit lengthy, so if you’re feeling gutsy you can try to interrupt him with a big charged hit or Spirit Attack, Immobilize him, or even use the Pillar Stance charge attack to rise above the tremor and smack him after evading it.\"\n            - Following Text: \"The Yellow Wind Sage also has a tricky feint where he’ll appear to run past you, but then lunge back into a sliding swipe with his arm. If timed correctly, you can cast Rock Solid just as he lunges back after the feint, which will often knock him to the ground and let you get a decent amount of damage in as he struggles to get up.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}