{
    "chunk_id": 845509548330,
    "source_file": "Giant_Shigandang.md",
    "h1_title": "Giant Shigandang",
    "h2_title": "Giant Shigandang Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/71/Five_Skandhas_%2825%29.png",
    "alt_text": "Five Skandhas \\(25\\).png",
    "position_desc": 5,
    "img_above_text": "# Giant Shigandang\n\nGiant Shigandangis one of the optional Yaoguai Kings you can fight in Chapter 6 of Black Myth: Wukong. It's the only Yaoguai King that will be recorded in your Journal in Chapter 6. Unlocking it will require collecting Skandhas across the 5 previous chapters.\n\n\nAs you emerge in the wide open space, a Giant Shigandang will appear.\n\n## Giant Shigandang Boss Fight and Guide\n\nIts main attack is to punch down with its giant fists, which unsurprisingly, will one-shot you if you're hit by them. The easiest way to avoid them is to just back up as far away from them as possible. Then, once the Giant Shigandang pauses punching, run up to the fists and keep hitting the blue crystals.\n\nThe other attack that the Shigandang does is to punch both fists down and send out ripples. Again, you want to hang back as much as you can. The rings will come toward you, and you can jump over them to avoid them. There are times when he'll raise both hands in the air, and seem like he's about to perform this attack, but instead, he's actually going to slam his fists down and just lay there for a bit. This is the perfect time to get in close and attack him.",
    "img_below_text": "After defeating the boss, climb the arm that touches the ground and you'll meet the monkey again. Let the cutscene play and you'll get the Skandha of Consciousness.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Giant Shigandang\n            - Section Title: Giant Shigandang Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Giant Shigandang\n\nGiant Shigandangis one of the optional Yaoguai Kings you can fight in Chapter 6 of Black Myth: Wukong. It's the only Yaoguai King that will be recorded in your Journal in Chapter 6. Unlocking it will require collecting Skandhas across the 5 previous chapters.\n\n\nAs you emerge in the wide open space, a Giant Shigandang will appear.\n\n## Giant Shigandang Boss Fight and Guide\n\nIts main attack is to punch down with its giant fists, which unsurprisingly, will one-shot you if you're hit by them. The easiest way to avoid them is to just back up as far away from them as possible. Then, once the Giant Shigandang pauses punching, run up to the fists and keep hitting the blue crystals.\n\nThe other attack that the Shigandang does is to punch both fists down and send out ripples. Again, you want to hang back as much as you can. The rings will come toward you, and you can jump over them to avoid them. There are times when he'll raise both hands in the air, and seem like he's about to perform this attack, but instead, he's actually going to slam his fists down and just lay there for a bit. This is the perfect time to get in close and attack him.\"\n            - Following Text: \"After defeating the boss, climb the arm that touches the ground and you'll meet the monkey again. Let the cutscene play and you'll get the Skandha of Consciousness.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Giant Shigandang, an optional boss encountered in Chapter 6 of *Black Myth: Wukong*. It explains the boss's powerful attacks, including one-shot punches and ripple effects, and provides strategies for avoiding damage and exploiting attack pauses to strike its vulnerable blue crystals.\n\nImage Summary:  \nThe image depicts a dark, rocky landscape under a cloudy sky, featuring jagged formations and a foreboding atmosphere. This setting likely represents the wide open space where the Giant Shigandang boss fight occurs, as described in the preceding text. The environment visually conveys the sense of danger and scale associated with the encounter.\n\nFollowing Text Summary:  \nThe following text describes the aftermath of defeating the Giant Shigandang. Players are instructed to climb its fallen arm to trigger a cutscene involving a monkey character and obtain the Skandha of Consciousness, a key item in the game."
}