{
    "chunk_id": 487404730001,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "h1_title": "Prologue",
    "h2_title": "Boss Fight - Erlang, the Sacred Divinity",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/71/Wukong_Prologue_7.jpg",
    "alt_text": "Wukong Prologue 7.jpg",
    "position_desc": 7,
    "img_above_text": "# Prologue\n\nUpon beginning your journey, you’ll be thrust into the role of the mythical Sun Wukong as he rebels against the Court of Heaven and its Heavenly Kings. Undaunted by their army, Sun Wukong calls them out, prompting the nephew of the Jade Emperor, Erlang Shen, to meet him in combat.\n\n## Boss Fight - Erlang, the Sacred Divinity\n\nWhen Erlang returns to the ground, it's also a good time to try out your spells early if you want, by holding R2 and then pressing one of the three button icons:\n\n* The top button is **Rock Solid** , which acts like a parry that turns you into stone to deflect an incoming attack.\n* The left button is **Immobilize** , which temporarily freezes your opponent in place allowing you to score free hits\n* The bottom button is A **Pluck of Many** , which creates illusory copies of you to assist in combat.",
    "img_below_text": "Once nearly all his health is gone, a final scene will ensue, and as Sun Wukong transforms to fly off toward the forests, the Buddha’s magical circlet that Sun Wukong had been tricked into putting on flares, causing him to reel from an excruciating headache. Erlang seizes this moment to cast down Sun Wukong into the mountain, sealing him within a large stone egg and ending the tale of Sun Wukong.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Prologue\n            - Section Title: Boss Fight - Erlang, the Sacred Divinity\n\n            Context:\n            - Preceding Text: \"# Prologue\n\nUpon beginning your journey, you’ll be thrust into the role of the mythical Sun Wukong as he rebels against the Court of Heaven and its Heavenly Kings. Undaunted by their army, Sun Wukong calls them out, prompting the nephew of the Jade Emperor, Erlang Shen, to meet him in combat.\n\n## Boss Fight - Erlang, the Sacred Divinity\n\nWhen Erlang returns to the ground, it's also a good time to try out your spells early if you want, by holding R2 and then pressing one of the three button icons:\n\n* The top button is **Rock Solid** , which acts like a parry that turns you into stone to deflect an incoming attack.\n* The left button is **Immobilize** , which temporarily freezes your opponent in place allowing you to score free hits\n* The bottom button is A **Pluck of Many** , which creates illusory copies of you to assist in combat.\"\n            - Following Text: \"Once nearly all his health is gone, a final scene will ensue, and as Sun Wukong transforms to fly off toward the forests, the Buddha’s magical circlet that Sun Wukong had been tricked into putting on flares, causing him to reel from an excruciating headache. Erlang seizes this moment to cast down Sun Wukong into the mountain, sealing him within a large stone egg and ending the tale of Sun Wukong.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the boss fight against Erlang Shen, the nephew of the Jade Emperor, as part of Sun Wukong's rebellion against the Court of Heaven. It describes gameplay mechanics, including spells such as **Rock Solid**, **Immobilize**, and **A Pluck of Many**, which players can use during the battle.\n\nImage Summary:\nThe image depicts an intense moment in the boss fight against Erlang Shen. Sun Wukong is shown mid-air, seemingly leaping or attacking, while a bright burst of energy resembling lightning or divine power emanates nearby. The visual emphasizes the epic and supernatural nature of the confrontation.\n\nFollowing Text Summary:\nThe following text describes the conclusion of the fight, where Sun Wukong, weakened by the Buddha’s magical circlet, is defeated by Erlang Shen. Erlang seals Sun Wukong within a stone egg, marking the end of this chapter in the tale."
}