{
    "chunk_id": 370265887851,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "h1_title": "Furnace Valley Walkthrough",
    "h2_title": "Valley Entrance",
    "h3_title": "Yaoguai Chief - Cloudy Mist, Misty Cloud",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/27/Furnace_Valley_Walkthrough_%2850%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(50\\).png",
    "position_desc": 28,
    "img_above_text": "# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n## Valley Entrance\n\nUltimately, you're going to go left to continue on the main path (and you may start to hear characters talk as you approach this pillar), but for now, you'll want to detour and explore the area to the right.\n\nThe first thing you'll see as you go to the right is the Flamlings that sit in the lava. These will spit fire at you, so it's best to deal with them to remove the ranged attacks while you explore.\n\n\nDrop down here, and head right first to collect the Fire Date from the tree. Then go in the opposite direction toward the lava streaming from the ceiling. This is where you can find one of the optional bosses in Chapter 5, the Flint Chief.\n\n\nNow turn back the other way and continue up the valley. At the top of the path, you'll come to another archway and the start of Rakshasa Palace.\n\nAs soon as you pass through the archway, the next boss battle will begin and you'll discover who was responsible for the voices you heard earlier.\n\n### Yaoguai Chief - Cloudy Mist, Misty Cloud\n\nMisty Cloud will soon appear, though he will look almost see-through initially. He will often pop up as soon as Cloudy Mist has finished a set of moves, hoping to catch you off guard and hit you with his flaming bundle.\n\nThe key to keeping track of this creature is to see where the cloud moves and jump out of the way when it gets close to you. Misty Cloud favors the use of a flaming bundle, operating it like a hammer and delivering fire attacks.",
    "img_below_text": "As Cloudy Mist is the first to appear, this should be where you first attack. Things will change when you manage to hit Cloudy Mist enough times that it will send out a bright light as a flashbang that can stun both you and Misty Cloud. For a brief moment, Misty Cloud won't be able to see you and Cloudy Mist will become its eyes.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Furnace Valley Walkthrough\n            - Section Title: Valley Entrance\n            - Sub-Section Title: Yaoguai Chief - Cloudy Mist, Misty Cloud\n\n            Context:\n            - Preceding Text: \"# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n## Valley Entrance\n\nUltimately, you're going to go left to continue on the main path (and you may start to hear characters talk as you approach this pillar), but for now, you'll want to detour and explore the area to the right.\n\nThe first thing you'll see as you go to the right is the Flamlings that sit in the lava. These will spit fire at you, so it's best to deal with them to remove the ranged attacks while you explore.\n\n\nDrop down here, and head right first to collect the Fire Date from the tree. Then go in the opposite direction toward the lava streaming from the ceiling. This is where you can find one of the optional bosses in Chapter 5, the Flint Chief.\n\n\nNow turn back the other way and continue up the valley. At the top of the path, you'll come to another archway and the start of Rakshasa Palace.\n\nAs soon as you pass through the archway, the next boss battle will begin and you'll discover who was responsible for the voices you heard earlier.\n\n### Yaoguai Chief - Cloudy Mist, Misty Cloud\n\nMisty Cloud will soon appear, though he will look almost see-through initially. He will often pop up as soon as Cloudy Mist has finished a set of moves, hoping to catch you off guard and hit you with his flaming bundle.\n\nThe key to keeping track of this creature is to see where the cloud moves and jump out of the way when it gets close to you. Misty Cloud favors the use of a flaming bundle, operating it like a hammer and delivering fire attacks.\"\n            - Following Text: \"As Cloudy Mist is the first to appear, this should be where you first attack. Things will change when you manage to hit Cloudy Mist enough times that it will send out a bright light as a flashbang that can stun both you and Misty Cloud. For a brief moment, Misty Cloud won't be able to see you and Cloudy Mist will become its eyes.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text describes the player's progression through the Valley Entrance in the \"Furnace Valley Walkthrough.\" It details exploration to the right of the main path, where players encounter enemies like Flamlings and collect items such as the Fire Date. It also introduces an optional boss, the Flint Chief, and leads up to an archway marking the start of Rakshasa Palace. Upon entering the palace, players encounter the next boss, the Yaoguai Chief, consisting of two entities: Cloudy Mist and Misty Cloud.\n\nImage Summary:  \nThe image depicts the dramatic introduction of the Yaoguai Chief, a dual-entity boss named Cloudy Mist and Misty Cloud, within the Rakshasa Palace setting. The foreground shows a menacing figure wielding a staff, shrouded in darkness and illuminated by a faint glow. The background features the architectural elements of the palace, with fiery highlights and a foreboding atmosphere. The text overlay at the bottom reads, \"Halt! Intruders... to the Princess' palace face death,\" emphasizing the hostile confrontation.\n\nFollowing Text Summary:  \nThe following text provides strategies for the boss fight against the Yaoguai Chief. It explains that Cloudy Mist appears first and should be the initial target. The fight becomes more complex as Cloudy Mist uses a flashbang attack to stun both the player and Misty Cloud, temporarily blinding Misty Cloud and forcing it to rely on Cloudy Mist for guidance."
}