{
    "chunk_id": 199337915658,
    "source_file": "Captain_Lotus-Vision.md",
    "h1_title": "Captain Lotus-Vision",
    "h2_title": "Where to Find Captain Lotus-Vision",
    "h3_title": "Captain Lotus-Vision Miniboss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/32/Wukong_Pagoda_33.jpg",
    "alt_text": "Wukong Pagoda 33.jpg",
    "position_desc": 5,
    "img_above_text": "# Captain Lotus-Vision\n\nCaptain Lotus-Vision is an optional miniboss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Responsible for sealing captives in the cells of the Pagoda Realm, you can find this boss in a secret chamber within the Pagoda Prison.\n\n* **Rewards:** Spirit of Captain Lotus-Vision, Frostsprout Twig, Mind Core, Cold Iron Leaves, 1847 Experience, 1198 Will\n\n## Where to Find Captain Lotus-Vision\n\nCaptain Lotus-Vision is one of the four captains you can find in Chapter 3, and is an optional Yaoguai Chief you can encounter in the Pagoda Realm.\n\nTo find him, you'll need to reach the Upper Pagoda Shrine on the third level of the prison. Just behind the shrine, there is a pit with purple light emanating below that you can drop into and find this boss.\n\n### Captain Lotus-Vision Miniboss Fight and Guide\n\nFor each of these attacks, be ready with your Staff-Spin counter, and consider investing in skills to keep this move going and to attack out of it once you've deflected all the projectiles heading your way. A lot of this fight will come down to finding the right opportunities to strike after surviving his attacks, and you'll need all the boosts you can get.\n\nOther times, he may trigger a bunch of explosions on the floor, which only give you a moment's notice to dodge them, so stay mobile and roll around for a better chance of not getting hit.",
    "img_below_text": "Things will get more difficult any time you see the crystal on his staff flare brighter. These brief flashes indicate a laser beam blast that you'll only have a moment to dodge or take considerable damage, and you'll have to deal with even more as time goes on. Early on, watch for a laser to shoot out as he creates projectiles rings before you start spinning your staff.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Captain Lotus-Vision\n            - Section Title: Where to Find Captain Lotus-Vision\n            - Sub-Section Title: Captain Lotus-Vision Miniboss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Captain Lotus-Vision\n\nCaptain Lotus-Vision is an optional miniboss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Responsible for sealing captives in the cells of the Pagoda Realm, you can find this boss in a secret chamber within the Pagoda Prison.\n\n* **Rewards:** Spirit of Captain Lotus-Vision, Frostsprout Twig, Mind Core, Cold Iron Leaves, 1847 Experience, 1198 Will\n\n## Where to Find Captain Lotus-Vision\n\nCaptain Lotus-Vision is one of the four captains you can find in Chapter 3, and is an optional Yaoguai Chief you can encounter in the Pagoda Realm.\n\nTo find him, you'll need to reach the Upper Pagoda Shrine on the third level of the prison. Just behind the shrine, there is a pit with purple light emanating below that you can drop into and find this boss.\n\n### Captain Lotus-Vision Miniboss Fight and Guide\n\nFor each of these attacks, be ready with your Staff-Spin counter, and consider investing in skills to keep this move going and to attack out of it once you've deflected all the projectiles heading your way. A lot of this fight will come down to finding the right opportunities to strike after surviving his attacks, and you'll need all the boosts you can get.\n\nOther times, he may trigger a bunch of explosions on the floor, which only give you a moment's notice to dodge them, so stay mobile and roll around for a better chance of not getting hit.\"\n            - Following Text: \"Things will get more difficult any time you see the crystal on his staff flare brighter. These brief flashes indicate a laser beam blast that you'll only have a moment to dodge or take considerable damage, and you'll have to deal with even more as time goes on. Early on, watch for a laser to shoot out as he creates projectiles rings before you start spinning your staff.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Captain Lotus-Vision as an optional miniboss in *Black Myth Wukong*, encountered in Chapter 3 within the Pagoda Prison. It describes his role in sealing captives and provides instructions for locating him in a secret chamber behind the Upper Pagoda Shrine. Rewards for defeating him include various items and experience points. The text also briefly mentions strategies for countering his attacks, emphasizing the use of the Staff-Spin counter and staying mobile to avoid floor explosions.\n\nImage Summary:\nThe image depicts the in-game battle against Captain Lotus-Vision in *Black Myth Wukong*. The player character is shown wielding a fiery staff, facing the miniboss, who is casting a glowing purple projectile ring. The dark, ominous environment suggests the setting is the Pagoda Prison. HUD elements display health bars, abilities, and combat options, reinforcing the image's purpose as a visual representation of the miniboss fight.\n\nFollowing Text Summary:\nThe following text elaborates on Captain Lotus-Vision's attacks, warning players about the crystal on his staff flaring brighter, signaling imminent laser beam blasts. It advises players to dodge quickly to avoid significant damage and notes that these attacks become more frequent as the fight progresses. Additionally, it highlights the importance of anticipating laser beams during projectile ring creation and using the Staff-Spin counter effectively."
}