{
    "chunk_id": 695137923182,
    "source_file": "Captain_Kalpa-Wave.md",
    "h1_title": "Captain Kalpa-Wave",
    "h2_title": "Where to Find Captain Kalpa-Wave",
    "h3_title": "Captain Kalpa-Wave Miniboss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/72/Wukong_Longevity_22.jpg",
    "alt_text": "Wukong Longevity 22.jpg",
    "position_desc": 4,
    "img_above_text": "# Captain Kalpa-Wave\n\nCaptain Kalpa-Wave is an required miniboss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Guarding the entrance to the New Thunderclap Temple, you will have to defeat him to gain access to the final region of The New West.\n\n* **Rewards:** Spirit of Captain Kalpa-Wave, Mind Core, Refined Iron Sand, Random Materials, 1847 Experience, 1190 Will\n\n## Where to Find Captain Kalpa-Wave\n\nAs you approach, a large bloody miasma will block your advance. Once it congeals, you'll find yourself facing the last of the four captains.\n\n### Captain Kalpa-Wave Miniboss Fight and Guide\n\nOne of the most basic attacks will be when it spews out a group of bloody projectiles from its body. They'll take to the air before arcing slowly over in your direction, but spinning your staff can let you clear them without issue.\n\nSometimes he'll throw several blood attacks into the mix one after the other to mess you up. Expect these bloody trails to come out in multiple directions (both above and from the sides) to try and confuse you, but remain focused on deflecting them as they arrive.",
    "img_below_text": "Other times he'll mix up his blood projectiles by also creating more blood, which include a stomp attack (or bending down to tilt the wings on its back) that generates a trail of blood heading in your direction. Dodge the blood trails, or they'll burst into a bloody lotus flowers that damage you as they erupt.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Captain Kalpa-Wave\n            - Section Title: Where to Find Captain Kalpa-Wave\n            - Sub-Section Title: Captain Kalpa-Wave Miniboss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Captain Kalpa-Wave\n\nCaptain Kalpa-Wave is an required miniboss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Guarding the entrance to the New Thunderclap Temple, you will have to defeat him to gain access to the final region of The New West.\n\n* **Rewards:** Spirit of Captain Kalpa-Wave, Mind Core, Refined Iron Sand, Random Materials, 1847 Experience, 1190 Will\n\n## Where to Find Captain Kalpa-Wave\n\nAs you approach, a large bloody miasma will block your advance. Once it congeals, you'll find yourself facing the last of the four captains.\n\n### Captain Kalpa-Wave Miniboss Fight and Guide\n\nOne of the most basic attacks will be when it spews out a group of bloody projectiles from its body. They'll take to the air before arcing slowly over in your direction, but spinning your staff can let you clear them without issue.\n\nSometimes he'll throw several blood attacks into the mix one after the other to mess you up. Expect these bloody trails to come out in multiple directions (both above and from the sides) to try and confuse you, but remain focused on deflecting them as they arrive.\"\n            - Following Text: \"Other times he'll mix up his blood projectiles by also creating more blood, which include a stomp attack (or bending down to tilt the wings on its back) that generates a trail of blood heading in your direction. Dodge the blood trails, or they'll burst into a bloody lotus flowers that damage you as they erupt.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Captain Kalpa-Wave as a required miniboss fight in Chapter 3 of the game \"Black Myth Wukong.\" This character guards the entrance to the New Thunderclap Temple, and defeating him is necessary to access the final region of The New West. The text also lists the rewards for defeating Captain Kalpa-Wave.\n\nImage Summary:\nThe image depicts a dramatic scene from the miniboss fight against Captain Kalpa-Wave. It shows the character amidst a burst of red energy or blood-like substance, suggesting an attack or transformation. The environment appears to be a temple entrance, reinforcing the narrative context of the fight occurring at the New Thunderclap Temple.\n\nFollowing Text Summary:\nThe following text provides additional details on Captain Kalpa-Wave's attack patterns during the miniboss fight. It describes how the character mixes blood projectiles with other attacks, such as a stomp or wing tilt, which create damaging blood trails. Players are advised to dodge these trails to avoid damage from erupting bloody lotus flowers."
}