{
    "chunk_id": 5852919434,
    "source_file": "Cloudy_Mist,_Misty_Cloud.md",
    "h1_title": "Cloudy Mist, Misty Cloud",
    "h2_title": "Cloudy Mist, Misty Cloud Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5c/Furnace_Valley_Walkthrough_%2853%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(53\\).png",
    "position_desc": 5,
    "img_above_text": "# Cloudy Mist, Misty Cloud\n\nCloudy Mist, Misty Cloud are a pair of Yaoguai Chiefs you'll fight before you reach The Emerald Hall in Chapter 5 in Black Myth: Wukong. This is the second duo of chiefs you'll fight in Chapter 5 and they'll try a number of tricks to disappear right before your eyes.\n\n\nAs soon as you pass through the archway, the next boss battle will begin and you'll discover who was responsible for the voices you heard earlier.\n\n## Cloudy Mist, Misty Cloud Boss Fight and Guide\n\nThe lasers can be avoided by dodging or jumping over them, and the projectiles can be outrun or you can dodge to stop them hitting you. When there are numerous, we'd recommend outrunning them, and when there are just a few, dodge out of the way. During this fight, you want to stay as close to Cloudy Mist as possible, to remove the advantage of his long-range attacks.",
    "img_below_text": "Misty Cloud will soon appear, though he will look almost see-through initially. He will often pop up as soon as Cloudy Mist has finished a set of moves, hoping to catch you off guard and hit you with his flaming bundle.\n\nThe key to keeping track of this creature is to see where the cloud moves and jump out of the way when it gets close to you. Misty Cloud favors the use of a flaming bundle, operating it like a hammer and delivering fire attacks.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Cloudy Mist, Misty Cloud\n            - Section Title: Cloudy Mist, Misty Cloud Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Cloudy Mist, Misty Cloud\n\nCloudy Mist, Misty Cloud are a pair of Yaoguai Chiefs you'll fight before you reach The Emerald Hall in Chapter 5 in Black Myth: Wukong. This is the second duo of chiefs you'll fight in Chapter 5 and they'll try a number of tricks to disappear right before your eyes.\n\n\nAs soon as you pass through the archway, the next boss battle will begin and you'll discover who was responsible for the voices you heard earlier.\n\n## Cloudy Mist, Misty Cloud Boss Fight and Guide\n\nThe lasers can be avoided by dodging or jumping over them, and the projectiles can be outrun or you can dodge to stop them hitting you. When there are numerous, we'd recommend outrunning them, and when there are just a few, dodge out of the way. During this fight, you want to stay as close to Cloudy Mist as possible, to remove the advantage of his long-range attacks.\"\n            - Following Text: \"Misty Cloud will soon appear, though he will look almost see-through initially. He will often pop up as soon as Cloudy Mist has finished a set of moves, hoping to catch you off guard and hit you with his flaming bundle.\n\nThe key to keeping track of this creature is to see where the cloud moves and jump out of the way when it gets close to you. Misty Cloud favors the use of a flaming bundle, operating it like a hammer and delivering fire attacks.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the boss fight against Cloudy Mist and Misty Cloud, two Yaoguai Chiefs encountered in Chapter 5 of *Black Myth: Wukong*. It describes the battle's setting, starting as players pass through an archway, and outlines strategies for avoiding Cloudy Mist's long-range attacks, such as lasers and projectiles. Staying close to Cloudy Mist is recommended to minimize his ranged advantage.\n\nImage Summary:\nThe image depicts the boss fight against Cloudy Mist and Misty Cloud in a dimly lit, atmospheric environment. Cloudy Mist is visible wielding a flaming weapon, while Misty Cloud appears partially transparent, emphasizing his elusive nature. The setting is rugged and shadowy, with a mystical ambiance that complements the narrative of a challenging encounter. The player character is positioned in the foreground, ready to engage in combat.\n\nFollowing Text Summary:\nThe following text elaborates on Misty Cloud's role in the fight, highlighting his initial transparency and tendency to attack unexpectedly after Cloudy Mist finishes a move. Misty Cloud uses a flaming bundle as a hammer-like weapon to deliver fire-based attacks. Players are advised to track Misty Cloud's movements by observing the surrounding cloud and jumping away when he gets close."
}