{
    "chunk_id": 75522316590,
    "source_file": "Commander_Beetle.md",
    "h1_title": "Commander Beetle",
    "h2_title": "Commander Beetle Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2d/Wukong_YellowFlower_24.jpg",
    "alt_text": "Wukong YellowFlower 24.jpg",
    "position_desc": 5,
    "img_above_text": "# Commander Beetle\n\nThe Commander Beetle is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located between the Forest of Ferocity and the Temple Entrance itself, this boss trains a group of Daoists who will all try to stop you.\n\n* Rewards: Commander Beetle Spirit, Knot of Voidness, Refined Iron Sand, 1562 Experience, 1434 Will\n\n\nThe Commander Beetle is an optional boss -- though hard to miss as you explore the Temple of Yellow Flowers. From the Forest of Ferocity Shrine, you need only make your way along the main path and up the stairs to find a large courtyard where the boss trains a group of several Sword Daoists.\n\n## Commander Beetle Boss Fight and Guide\n\nAs mentioned previously, the Commander Beetle can also perform of series of sword slams with his bigger left sword. The small line that extends from his strike won't look like much for a moment, until a large fissure erupts from the path of his weapon which he can do several times in a row.",
    "img_below_text": "Even when not slamming the ground, his bigger sword can also cut through the air to send a slicing wave of force at you from a distance, which comes out much faster than his slams, and can be done multiple times.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Commander Beetle\n            - Section Title: Commander Beetle Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Commander Beetle\n\nThe Commander Beetle is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located between the Forest of Ferocity and the Temple Entrance itself, this boss trains a group of Daoists who will all try to stop you.\n\n* Rewards: Commander Beetle Spirit, Knot of Voidness, Refined Iron Sand, 1562 Experience, 1434 Will\n\n\nThe Commander Beetle is an optional boss -- though hard to miss as you explore the Temple of Yellow Flowers. From the Forest of Ferocity Shrine, you need only make your way along the main path and up the stairs to find a large courtyard where the boss trains a group of several Sword Daoists.\n\n## Commander Beetle Boss Fight and Guide\n\nAs mentioned previously, the Commander Beetle can also perform of series of sword slams with his bigger left sword. The small line that extends from his strike won't look like much for a moment, until a large fissure erupts from the path of his weapon which he can do several times in a row.\"\n            - Following Text: \"Even when not slamming the ground, his bigger sword can also cut through the air to send a slicing wave of force at you from a distance, which comes out much faster than his slams, and can be done multiple times.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Commander Beetle, an optional boss in *Black Myth: Wukong*, encountered in Chapter 4 between the Forest of Ferocity and the Temple Entrance. The boss trains a group of Sword Daoists and rewards players with items and experience upon defeat. It highlights the boss's sword-based attacks, including ground slams that create fissures.\n\nImage Summary:\nThe image depicts the Commander Beetle boss fight in a courtyard setting. A bright, vertical wave of force is shown cutting through the air, likely representing one of the boss's sword attacks described in the text. The player character is visible in combat stance, with health and ability indicators displayed on the screen. The environment includes traditional architecture and natural elements, consistent with the Temple Entrance location.\n\nFollowing Text Summary:\nThe following text elaborates on the Commander Beetle's ranged sword attack, which sends fast slicing waves of force through the air. These attacks are quicker than the ground slams and can be performed multiple times, adding complexity to the fight."
}