{
    "chunk_id": 637241639431,
    "source_file": "Chapter_1_Secret_-_Ancient_Guanyin_Temple_Walkthrough.md",
    "h1_title": "Chapter 1 Secret - Ancient Guanyin Temple Walkthrough",
    "h2_title": "How to Access the Ancient Guanyin Temple",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3e/Wukong_Wolves_42.jpg",
    "alt_text": "Wukong Wolves 42.jpg",
    "position_desc": 1,
    "img_above_text": "# Chapter 1 Secret - Ancient Guanyin Temple Walkthrough\n\nThe Ancient Guanyin Temple is a Secret Area found in Chapter 1's Black Wind Mountain of Black Myth Wukong. Below you'll find a guide to accessing the temple with all three bell locations, and how to defeat the secret Yaoguai King boss, Elder Jinchi.\n\nThis Chapter 1 Secret can only be accessed by ringing three large bells found around Black Wind Mountain, and will transport you to a different location to fight the secret boss that possess a magical item that is instrumental in defeating the Black Wind King.\n\n## How to Access the Ancient Guanyin Temple\n\nThe only way to be transported to this secret area in Chapter 1 is by locating and interacting with three bells found around the Black Wind Mountain region. They can be rung in any order, and ringing the third bell will automatically transport you to the Secret Area, which you can then fast travel to and from as you wish. The three bells are located in the following regions:",
    "img_below_text": "* **Forest of Wolves** \\- From the Outside the Forest Shrine, you can head up the left path to a higher road leading to a rope bridge across a stream. Follow the path straight past the bridge to find an optional Yaoguai Chief named Guangzhi who drops the Red Tides Transformation Spell. At the far end of the arena, you’ll find the first bell.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chapter 1 Secret - Ancient Guanyin Temple Walkthrough\n            - Section Title: How to Access the Ancient Guanyin Temple\n\n            Context:\n            - Preceding Text: \"# Chapter 1 Secret - Ancient Guanyin Temple Walkthrough\n\nThe Ancient Guanyin Temple is a Secret Area found in Chapter 1's Black Wind Mountain of Black Myth Wukong. Below you'll find a guide to accessing the temple with all three bell locations, and how to defeat the secret Yaoguai King boss, Elder Jinchi.\n\nThis Chapter 1 Secret can only be accessed by ringing three large bells found around Black Wind Mountain, and will transport you to a different location to fight the secret boss that possess a magical item that is instrumental in defeating the Black Wind King.\n\n## How to Access the Ancient Guanyin Temple\n\nThe only way to be transported to this secret area in Chapter 1 is by locating and interacting with three bells found around the Black Wind Mountain region. They can be rung in any order, and ringing the third bell will automatically transport you to the Secret Area, which you can then fast travel to and from as you wish. The three bells are located in the following regions:\"\n            - Following Text: \"* **Forest of Wolves** \\- From the Outside the Forest Shrine, you can head up the left path to a higher road leading to a rope bridge across a stream. Follow the path straight past the bridge to find an optional Yaoguai Chief named Guangzhi who drops the Red Tides Transformation Spell. At the far end of the arena, you’ll find the first bell.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Ancient Guanyin Temple as a secret area in Chapter 1 of *Black Myth Wukong*. Accessing this area requires ringing three large bells scattered across Black Wind Mountain. Once all three bells are rung, players are transported to the temple, where they can fight the secret boss, Elder Jinchi, who holds a magical item crucial for defeating the Black Wind King.\n\nImage Summary:\nThe image depicts a player character approaching one of the large bells required to access the Ancient Guanyin Temple. The bell is located within a shrine-like structure surrounded by natural elements, such as moss-covered rocks and greenery. A red arrow highlights the bell, emphasizing its importance in the walkthrough. The game's interface displays the player's stats and abilities, suggesting this is an in-game screenshot meant to guide players to the bell's location.\n\nFollowing Text Summary:\nThe following text provides specific instructions for finding the first bell in the Forest of Wolves area. Players are directed to follow a path leading to a rope bridge and an arena where an optional Yaoguai Chief, Guangzhi, can be defeated for a spell. The bell is located at the far end of this arena."
}