{
    "chunk_id": 20806691486,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "h1_title": "Fright Cliff Walkthrough",
    "h2_title": "Squall Hideout",
    "h3_title": "The Fourth Buddha’s Eyeball",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/df/Wukong_Fright_24.jpg",
    "alt_text": "Wukong Fright 24.jpg",
    "position_desc": 25,
    "img_above_text": "# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n## Squall Hideout\n\n\nThe large cave entrance has a few paths, with the outer one on the right leading past another Pitstone to a wooden coffin chest holding 3 **Silk** and some **Will**.\n\n\nStart by luring the shieldless Spearbone out of range of the Blazebones above, then climb the stairs to rush down the projectile throwers. Be sure to look at the ruined home at the first landing below the first Blazebone for a yellow chest that has 2 **Yaoguai Core** and 3 **Tiny Piece of Gold**.\n\n\nAt the end of the crevice, you’ll find an unusual looking stone. He’s actually a Man-in-Stone, and claims to have been trapped within the rock form. He’s betting on one of the rock guai in the large cave nearby to hold the secrets to reversing his fate, and asks you to seek it out.\n\n### The Fourth Buddha’s Eyeball\n\nAdvance cautiously to spy a Poisestone and two Bladebones on some scaffolding awaiting your arrival. Use Cloudstep to ambush the weaker enemies first, then slam into the Poisestone with a charged hit to put it down.",
    "img_below_text": "Near this defensive outpost is another tunnel exit, and you can step out quickly to find a Spearbone with a shield, who guards the outdoor path that connects back down to the crevice. Back in the cave, you can check the left wall to find another green Wisp to absorb, and note the golden trail of a nearby Shrine at another tunnel exit up ahead. It’s not a bad idea to activate and rest at this **Rockrest Flat Shrine** first, considering the quest we still have to finish the cave first that can be tough.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fright Cliff Walkthrough\n            - Section Title: Squall Hideout\n            - Sub-Section Title: The Fourth Buddha’s Eyeball\n\n            Context:\n            - Preceding Text: \"# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n## Squall Hideout\n\n\nThe large cave entrance has a few paths, with the outer one on the right leading past another Pitstone to a wooden coffin chest holding 3 **Silk** and some **Will**.\n\n\nStart by luring the shieldless Spearbone out of range of the Blazebones above, then climb the stairs to rush down the projectile throwers. Be sure to look at the ruined home at the first landing below the first Blazebone for a yellow chest that has 2 **Yaoguai Core** and 3 **Tiny Piece of Gold**.\n\n\nAt the end of the crevice, you’ll find an unusual looking stone. He’s actually a Man-in-Stone, and claims to have been trapped within the rock form. He’s betting on one of the rock guai in the large cave nearby to hold the secrets to reversing his fate, and asks you to seek it out.\n\n### The Fourth Buddha’s Eyeball\n\nAdvance cautiously to spy a Poisestone and two Bladebones on some scaffolding awaiting your arrival. Use Cloudstep to ambush the weaker enemies first, then slam into the Poisestone with a charged hit to put it down.\"\n            - Following Text: \"Near this defensive outpost is another tunnel exit, and you can step out quickly to find a Spearbone with a shield, who guards the outdoor path that connects back down to the crevice. Back in the cave, you can check the left wall to find another green Wisp to absorb, and note the golden trail of a nearby Shrine at another tunnel exit up ahead. It’s not a bad idea to activate and rest at this **Rockrest Flat Shrine** first, considering the quest we still have to finish the cave first that can be tough.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the player's progression through the Squall Hideout in the Fright Cliff Walkthrough. It provides strategies for dealing with enemies such as Poisestones and Bladebones, emphasizing the use of Cloud Step to ambush weaker foes and execute charged attacks. The narrative also introduces a quest involving a Man-in-Stone who seeks help to reverse his trapped state, hinting at further exploration within the cave.\n\nImage Summary:\nThe image depicts a player-character traversing a rocky outdoor area, heading toward a wooden bridge-like structure. The environment features rugged terrain, sparse vegetation, and distant structures, suggesting an open pathway leading to further exploration. The player appears equipped with a staff-like weapon, and the user interface displays health, abilities, and inventory icons, indicating active gameplay. This scene aligns with the walkthrough's description of navigating paths and encountering enemies in the Squall Hideout.\n\nFollowing Text Summary:\nThe following text elaborates on the exploration of the cave and its surroundings. It mentions encountering a Spearbone with a shield near an outdoor path that loops back to the crevice. Additionally, players are advised to absorb a green Wisp and follow a golden trail leading to the Rockrest Flat Shrine, which serves as a checkpoint before continuing the challenging quest within the cave."
}