{
    "chunk_id": 90852641517,
    "source_file": "Keeper_of_the_Flaming_Mountains_and_Yin-Yang_Fish.md",
    "h1_title": "Keeper of the Flaming Mountains and Yin-Yang Fish",
    "h2_title": "Keeper of the Flaming Mountains and Yin-Yang Fish Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fe/Furnace_Valley_Walkthrough_%2883%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(83\\).png",
    "position_desc": 1,
    "img_above_text": "# Keeper of the Flaming Mountains and Yin-Yang Fish\n\nThe Keeper of the Flaming Mountains is a Character boss, while the Yin-Yang Fish is a Yaoguai King you'll fight at the start of The Emerald Hall in Chapter 5 in Black Myth: Wukong. The Keeper of the Flaming Mountains is a master of deception and uses his Yin-Yang ability to produce more than just the Yin-Yang Fish in this showdown.\n\n\nFrom The Emerald Hall Keeper's Shrine, go left and up the stairs. A cutscene will start to play, where you'll transform into a Cicada and fly toward the center of the hall. This is where you'll find Pingping speaking to her mother, Rakshasi, accompanied by the Keeper of the Flaming Mountains.\n\nAfter they discuss The Destined One obtaining the relics, the Keeper of the Flaming Mountains offers to care for Rakshashi, which Pingping protests. After he binds Pingping, Rakshashi is revealed to be Zhu Bajie transformed and it's time to take on the Keeper of the Flaming Mountains for yourself.\n\n## Keeper of the Flaming Mountains and Yin-Yang Fish Boss Fight and Guide",
    "img_below_text": "The Keeper of the Flaming Mountains will transport you to another place, in a monochrome illusion where he uses the power of yin-yang. Zhu Bajie will be there to help you at first, so focus on attacking the Keeper of the Flaming Mountains as quickly as you can. This is a two-phase fight, and as you might expect, the second phase is where the action really begins.\n\nIn the first phase, try to hold off on using your spells as much as you can. Instead, try to be aggressive and relentlessly attack the Keeper of the Flaming Mountains while he's on the ground.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Keeper of the Flaming Mountains and Yin-Yang Fish\n            - Section Title: Keeper of the Flaming Mountains and Yin-Yang Fish Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Keeper of the Flaming Mountains and Yin-Yang Fish\n\nThe Keeper of the Flaming Mountains is a Character boss, while the Yin-Yang Fish is a Yaoguai King you'll fight at the start of The Emerald Hall in Chapter 5 in Black Myth: Wukong. The Keeper of the Flaming Mountains is a master of deception and uses his Yin-Yang ability to produce more than just the Yin-Yang Fish in this showdown.\n\n\nFrom The Emerald Hall Keeper's Shrine, go left and up the stairs. A cutscene will start to play, where you'll transform into a Cicada and fly toward the center of the hall. This is where you'll find Pingping speaking to her mother, Rakshasi, accompanied by the Keeper of the Flaming Mountains.\n\nAfter they discuss The Destined One obtaining the relics, the Keeper of the Flaming Mountains offers to care for Rakshashi, which Pingping protests. After he binds Pingping, Rakshashi is revealed to be Zhu Bajie transformed and it's time to take on the Keeper of the Flaming Mountains for yourself.\n\n## Keeper of the Flaming Mountains and Yin-Yang Fish Boss Fight and Guide\"\n            - Following Text: \"The Keeper of the Flaming Mountains will transport you to another place, in a monochrome illusion where he uses the power of yin-yang. Zhu Bajie will be there to help you at first, so focus on attacking the Keeper of the Flaming Mountains as quickly as you can. This is a two-phase fight, and as you might expect, the second phase is where the action really begins.\n\nIn the first phase, try to hold off on using your spells as much as you can. Instead, try to be aggressive and relentlessly attack the Keeper of the Flaming Mountains while he's on the ground.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}