{
    "chunk_id": 708187960584,
    "source_file": "Consumable_Items.md",
    "h1_title": "Consumable Items",
    "h2_title": "Black Myth: Wukong Consumables Locations",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a2/Mirage_Pill_.jpg",
    "alt_text": "Mirage Pill .jpg",
    "position_desc": 10,
    "img_above_text": "# Consumable Items\n\nConsumable Items are found throughout Black Myth: Wukong's chapters. These come in the form of additional drinks, which you can consume on the fly, providing a host of different buffs and stat boosts. From removing elemental effects, boosting resistance, supercharging your health, or granting bonus damage, each one can change the tide of a fight or boss battle, provided you use it at the right time.\n\nMost of these consumables can also be crafted from the Shrine once you reach the Shen Monkey Vendor in Chapter 1 - Black Wind Mountain and the end of Chapter 2 - Yellow Wind Ridge and meet Xu Dog. Our walkthrough has a full breakdown of each of those areas.\n\n## Black Myth: Wukong Consumables Locations",
    "img_below_text": "",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Consumable Items\n            - Section Title: Black Myth: Wukong Consumables Locations\n\n            Context:\n            - Preceding Text: \"# Consumable Items\n\nConsumable Items are found throughout Black Myth: Wukong's chapters. These come in the form of additional drinks, which you can consume on the fly, providing a host of different buffs and stat boosts. From removing elemental effects, boosting resistance, supercharging your health, or granting bonus damage, each one can change the tide of a fight or boss battle, provided you use it at the right time.\n\nMost of these consumables can also be crafted from the Shrine once you reach the Shen Monkey Vendor in Chapter 1 - Black Wind Mountain and the end of Chapter 2 - Yellow Wind Ridge and meet Xu Dog. Our walkthrough has a full breakdown of each of those areas.\n\n## Black Myth: Wukong Consumables Locations\"\n            - Following Text: \"\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces consumable items in *Black Myth: Wukong*, explaining their role in gameplay. These items provide various buffs, such as boosting health, resistance, or damage, and can be used strategically during fights or boss battles. Players can find consumables throughout the game’s chapters or craft them at Shrines after meeting specific vendors.\n\nImage Summary:  \nThe image depicts a consumable item from *Black Myth: Wukong*. It appears to be a uniquely designed container, likely holding a potion or drink used to grant buffs or effects during gameplay. The item's distinct appearance suggests it is one of the consumables mentioned in the preceding text.\n\nFollowing Text Summary:  \nThe following text is absent, but the section title \"Black Myth: Wukong Consumables Locations\" implies that the subsequent content will detail where players can find specific consumable items within the game."
}