{
    "chunk_id": 963053246124,
    "source_file": "Dragonfly_Guai_Spirit.md",
    "h1_title": "Dragonfly Guai Spirit",
    "h2_title": "Dragonfly Guai Spirit",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/57/Dragonfly_Guai_Spirit.jpg",
    "alt_text": "Dragonfly Guai Spirit.jpg",
    "position_desc": 3,
    "img_above_text": "# Dragonfly Guai Spirit\n\n\n\nThe Dragonfly Guai fights in the air with his bow and poison arrows. The fact that he's flying most of the battle makes it tricky, but you can still reach him with many of your attacks when he's hovering. The Dragonfly Guai does soar higher at times, so be careful when casting Immobilize that you don't accidentally freeze him so high that your attacks can't reach.\n\n## Dragonfly Guai Spirit",
    "img_below_text": "* **Rain of Arrows**\n* Equipped Effect: Slightly increases Qi gained from hits, but significantly reduces Maximum Health, Mana, and Stamina.\n\nThe Dragonfly Guai's Spirit allows you to take the form of the dragonfly and shoot your foes with poisonous arrows. The attack itself is good, but the equipped effect is a double-edged sword, reducing your health, mana, and stamina in return for increasing your Qi.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Dragonfly Guai Spirit\n            - Section Title: Dragonfly Guai Spirit\n\n            Context:\n            - Preceding Text: \"# Dragonfly Guai Spirit\n\n\n\nThe Dragonfly Guai fights in the air with his bow and poison arrows. The fact that he's flying most of the battle makes it tricky, but you can still reach him with many of your attacks when he's hovering. The Dragonfly Guai does soar higher at times, so be careful when casting Immobilize that you don't accidentally freeze him so high that your attacks can't reach.\n\n## Dragonfly Guai Spirit\"\n            - Following Text: \"* **Rain of Arrows**\n* Equipped Effect: Slightly increases Qi gained from hits, but significantly reduces Maximum Health, Mana, and Stamina.\n\nThe Dragonfly Guai's Spirit allows you to take the form of the dragonfly and shoot your foes with poisonous arrows. The attack itself is good, but the equipped effect is a double-edged sword, reducing your health, mana, and stamina in return for increasing your Qi.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe Dragonfly Guai is a flying enemy that uses poison arrows in combat, making it challenging to attack due to its aerial mobility. Players need to be cautious when using abilities like Immobilize, as freezing the enemy too high may render attacks ineffective.\n\nImage Summary:  \nThe image displays the \"Dragonfly Guai Spirit\" in the game's equipment menu. It highlights the spirit's ability, \"Rain of Arrows,\" which allows players to take the form of the Dragonfly Guai and attack enemies with poison arrows. The equipped effect increases Qi gained from hits but reduces maximum health, mana, and stamina. A demo preview of the ability is shown in a small inset.\n\nFollowing Text Summary:  \nThe Dragonfly Guai Spirit grants players the ability to transform into the dragonfly and use poison arrows against enemies. While the attack is effective, equipping the spirit comes with trade-offs, as it significantly reduces health, mana, and stamina in exchange for increased Qi generation."
}