{
    "chunk_id": 74211076189,
    "source_file": "Brown-Iron_Cart.md",
    "h1_title": "Brown-Iron Cart",
    "h2_title": "Brown-Iron Cart Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bc/Chapter_5_Secret_Area_.png",
    "alt_text": "Chapter 5 Secret Area .png",
    "position_desc": 2,
    "img_above_text": "# Brown-Iron Cart\n\nBrown-Iron Cart is a Yaoguai Chief boss fight that you'll go up against at the start of Chapter 5 in Black Myth: Wukong. Blocking the pathway from the Ashen Pass to the Camp of Seasons, the cart is just one of the Five Element Carts you'll need to fight in this Chapter.\n\n\nDash up the broken steps and run along the small path to get behind the cart. Drop down and you'll also be at the next Keeper's Shrine.\n\n## Brown-Iron Cart Boss Fight and Guide",
    "img_below_text": "The Brown-Iron Cart doesn't have much variation in attacks. If you approach it head-on, you'll want to use the Fireproof Mantle to help with its continuous fire attacks. But, you can also avoid these by sticking close to its arms. You'll just need to watch out for when it rears slightly up and slams its fists down. Thankfully, this attack can be dodged.\n\nIf you've taken the small path to get behind it as we suggested, and got to the Keeper's Shrine, you have the advantage. The cart can't turn around considering it's on such a small path, so you can ignore the fist-slamming attacks entirely and focus just on when it blows out fire all around it. Use the Fireproof Mantle and watch out for when it blows fire. As soon as it dies down, drop down and hit it relentlessly with combos. When it starts to get ready to unleash the fire, jump back up the little ledge to completely avoid it.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Brown-Iron Cart\n            - Section Title: Brown-Iron Cart Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Brown-Iron Cart\n\nBrown-Iron Cart is a Yaoguai Chief boss fight that you'll go up against at the start of Chapter 5 in Black Myth: Wukong. Blocking the pathway from the Ashen Pass to the Camp of Seasons, the cart is just one of the Five Element Carts you'll need to fight in this Chapter.\n\n\nDash up the broken steps and run along the small path to get behind the cart. Drop down and you'll also be at the next Keeper's Shrine.\n\n## Brown-Iron Cart Boss Fight and Guide\"\n            - Following Text: \"The Brown-Iron Cart doesn't have much variation in attacks. If you approach it head-on, you'll want to use the Fireproof Mantle to help with its continuous fire attacks. But, you can also avoid these by sticking close to its arms. You'll just need to watch out for when it rears slightly up and slams its fists down. Thankfully, this attack can be dodged.\n\nIf you've taken the small path to get behind it as we suggested, and got to the Keeper's Shrine, you have the advantage. The cart can't turn around considering it's on such a small path, so you can ignore the fist-slamming attacks entirely and focus just on when it blows out fire all around it. Use the Fireproof Mantle and watch out for when it blows fire. As soon as it dies down, drop down and hit it relentlessly with combos. When it starts to get ready to unleash the fire, jump back up the little ledge to completely avoid it.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Brown-Iron Cart, a Yaoguai Chief boss in *Black Myth: Wukong*. This boss blocks the pathway from the Ashen Pass to the Camp of Seasons and is one of the Five Element Carts encountered in Chapter 5. Players are advised to approach the cart by taking a small path behind it, which leads to a Keeper's Shrine and offers a strategic advantage.\n\nImage Summary:  \nThe image depicts the Brown-Iron Cart, a menacing boss characterized by its fiery design and imposing structure. It is situated in a rugged, desolate environment with barren trees, rocky terrain, and ancient architectural elements. The cart's design features flames and chains, emphasizing its dangerous and supernatural nature, aligning with its role as a Yaoguai Chief boss in the game.\n\nFollowing Text Summary:  \nThe following text provides guidance for defeating the Brown-Iron Cart. It describes the boss's limited attack patterns, including fire-based attacks and fist slams. Players are advised to use the Fireproof Mantle for protection and exploit the strategic advantage of attacking from behind, where the cart cannot turn around. Timing is crucial to avoid fire blasts and maximize damage during openings."
}