{
    "chunk_id": 743437912724,
    "source_file": "Fuban.md",
    "h1_title": "Fuban",
    "h2_title": "Where to Find Fuban",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4f/Wukong_Yellow_34.jpg",
    "alt_text": "Wukong Yellow 34.jpg",
    "position_desc": 6,
    "img_above_text": "# Fuban\n\nFuban is a secret optional Yaoguai King boss fight that you can encounter in Chapter 2's secret area in Black Myth Wukong. Located in the Kingdom of Sahali locked away in the past, you'll need to help fulfill a drunken Boar's quest to access this area.\n\n* **Rewards:** Wind Tamer, Sky-Piercing Horn\n\n## Where to Find Fuban\n\nWhen you return it to the Drunken Boar, he’ll thank you, and declare that he’s now off in search of a meaty meal. He doesn’t actually want you to get some for him, and will set off himself to the Crouching Tiger Temple.",
    "img_below_text": "At the temple entrance, start to head up the stairs, and then turn right before the top — opposite where the Meditation Spot is. You’ll find the Boar resting against a far wall under one of the giant tiger sculptures.He’ll complain of the poor meat quality, and instead ask that you bring him a **Jade Lotus**. If you don’t already have plenty gathered, you’ll find Jade Lotus to harvest in most ponds and bodies of water, like the one right at the start of the chapter.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fuban\n            - Section Title: Where to Find Fuban\n\n            Context:\n            - Preceding Text: \"# Fuban\n\nFuban is a secret optional Yaoguai King boss fight that you can encounter in Chapter 2's secret area in Black Myth Wukong. Located in the Kingdom of Sahali locked away in the past, you'll need to help fulfill a drunken Boar's quest to access this area.\n\n* **Rewards:** Wind Tamer, Sky-Piercing Horn\n\n## Where to Find Fuban\n\nWhen you return it to the Drunken Boar, he’ll thank you, and declare that he’s now off in search of a meaty meal. He doesn’t actually want you to get some for him, and will set off himself to the Crouching Tiger Temple.\"\n            - Following Text: \"At the temple entrance, start to head up the stairs, and then turn right before the top — opposite where the Meditation Spot is. You’ll find the Boar resting against a far wall under one of the giant tiger sculptures.He’ll complain of the poor meat quality, and instead ask that you bring him a **Jade Lotus**. If you don’t already have plenty gathered, you’ll find Jade Lotus to harvest in most ponds and bodies of water, like the one right at the start of the chapter.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Fuban, a secret optional boss in *Black Myth Wukong*, found in Chapter 2's secret area within the Kingdom of Sahali. To access this area, players must assist a Drunken Boar character with a quest.\n\nImage Summary:  \nThe image depicts the player character standing in front of a large, intricately carved tiger statue at the Crouching Tiger Temple. To the right, the Drunken Boar NPC is sitting against a wall, appearing disheveled and speaking to the player. Subtitles at the bottom indicate the Boar is requesting a \"Jade Lotus,\" a collectible item.\n\nFollowing Text Summary:  \nThe following text provides instructions for locating the Drunken Boar at the Crouching Tiger Temple and details his request for a Jade Lotus. It also mentions that Jade Lotus can be found in ponds and bodies of water, including one at the start of the chapter."
}