{
    "chunk_id": 436273413953,
    "source_file": "Celestial_Nonary_Pill_Locations.md",
    "h1_title": "Celestial Nonary Pill Locations",
    "h2_title": "Yellow Wind Ridge Celestial Nonary Pill",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/18/Yellow_Wind_Nonary.jpg",
    "alt_text": "Yellow Wind Nonary.jpg",
    "position_desc": 2,
    "img_above_text": "# Celestial Nonary Pill Locations\n\n**Celestial Nonary Pills** are items you can find in Black Myth: Wukong that permanently increase your maximum Stamina. Stamina is a core skill in Black Myth: Wukong that affects how far you can sprint and even how many combos you can produce. If you want as much Stamina as possible, here is where you can find each and every Celestial Nonary Pill.\n\n* Black Wind Mountain Celestial Nonary Pill\n* Yellow Wind Ridge Celestial Nonary Pill\n* Xu-Dog Celestial Nonary Pills\n* The New West Celestial Nonary Pill\n* The Webbed Hollow Celestial Nonary Pill\n* Flaming Mountains Celestial Nonary Pill\n\n\nAfter defeating the Black Wind King and unlocking the Cloud Step spell, continue along the path up the hill until you reach an ambush. Once you've fought through the enemies there, keep climbing to Bodhi Peak and you will find the pill in a golden chest on the left.\n\n## Yellow Wind Ridge Celestial Nonary Pill",
    "img_below_text": "The Yellow Wind Ridge Celestial Nonary Pill is hidden in a secret area near the First Prince of Flowing Sands. Take out the enemies near the wooden plank opposite the arena and follow the path to a crack in the wall. Squeeze through the crack, take out the Swift Bat, absorb its Spirit, and pass through the door at the end of the room. Head to the back of the rock alcove to find the Celestial Nonary Pill.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Celestial Nonary Pill Locations\n            - Section Title: Yellow Wind Ridge Celestial Nonary Pill\n\n            Context:\n            - Preceding Text: \"# Celestial Nonary Pill Locations\n\n**Celestial Nonary Pills** are items you can find in Black Myth: Wukong that permanently increase your maximum Stamina. Stamina is a core skill in Black Myth: Wukong that affects how far you can sprint and even how many combos you can produce. If you want as much Stamina as possible, here is where you can find each and every Celestial Nonary Pill.\n\n* Black Wind Mountain Celestial Nonary Pill\n* Yellow Wind Ridge Celestial Nonary Pill\n* Xu-Dog Celestial Nonary Pills\n* The New West Celestial Nonary Pill\n* The Webbed Hollow Celestial Nonary Pill\n* Flaming Mountains Celestial Nonary Pill\n\n\nAfter defeating the Black Wind King and unlocking the Cloud Step spell, continue along the path up the hill until you reach an ambush. Once you've fought through the enemies there, keep climbing to Bodhi Peak and you will find the pill in a golden chest on the left.\n\n## Yellow Wind Ridge Celestial Nonary Pill\"\n            - Following Text: \"The Yellow Wind Ridge Celestial Nonary Pill is hidden in a secret area near the First Prince of Flowing Sands. Take out the enemies near the wooden plank opposite the arena and follow the path to a crack in the wall. Squeeze through the crack, take out the Swift Bat, absorb its Spirit, and pass through the door at the end of the room. Head to the back of the rock alcove to find the Celestial Nonary Pill.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the concept of **Celestial Nonary Pills** in the game *Black Myth: Wukong*. These items permanently increase the player's maximum stamina, which is essential for sprinting and executing combos. The text provides a list of locations where these pills can be found, including Yellow Wind Ridge, and describes how to locate the pill at Black Wind Mountain.\n\nImage Summary:\nThe image depicts a player character standing in front of a golden chest in a dimly lit rocky alcove. The chest is surrounded by decorative elements, including candles and a shrine-like structure, suggesting it contains a significant item. The \"RT - Open\" prompt indicates the chest is interactable, likely holding the **Yellow Wind Ridge Celestial Nonary Pill**, as described in the context.\n\nFollowing Text Summary:\nThe following text explains the steps to locate the **Yellow Wind Ridge Celestial Nonary Pill**. It is hidden in a secret area near the First Prince of Flowing Sands. Players must defeat nearby enemies, navigate through a crack in the wall, eliminate a Swift Bat, absorb its Spirit, and proceed through a door to reach the pill in the back of a rock alcove."
}