{
    "chunk_id": 768316859750,
    "source_file": "Celestial_Taiyi_Pill_Locations.md",
    "h1_title": "Celestial Taiyi Pill Locations",
    "h2_title": "Xu-Dog Celestial Taiyi Pills",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e8/Taiyi_Xu_Dog.jpg",
    "alt_text": "Taiyi Xu Dog.jpg",
    "position_desc": 3,
    "img_above_text": "# Celestial Taiyi Pill Locations\n\n**Celestial Taiyi Pills** are an item you can collect in Black Myth: Wukong to upgrade your maximum Mana. Mana is used to cast spells like Immobilize, A Pluck of Many, and Cloud Step. Spells are a massive part of combat in Black Myth: Wukong, and running out of Mana can be a problem. Here, we will review all the Celestial Taiyi locations so you can have as much Mana as possible.\n\n* Black Wind Mountain Celestial Taiyi Pill\n* Yellow Wind Ridge Celestial Taiyi Pill\n* Xu-Dog Celestial Taiyi Pills\n* The Webbed Hollow Celestial Taiyi Pill\n* The New West Celestial Taiyi Pill\n* Flaming Mountains Celestial Taiyi Pill\n\n\nThe Celestial Taiyi Pill on Black Wind Mountain is accessible after defeating the Black Wind King. After defeating the boss, explore the wooden platforms in the temple to find the Celestial Taiyi Pill sitting on a wooden bench.\n\n\nThe next Celestial Taiyi Pill is hidden near a Meditation Spot. This one is available after defeating the Stone Vanguard at Rock Clash Platform. Once you do, follow the light to unlock the Rock Clash Platform Keeper's Shrine. Take the path opposite the Shrine and defeat the Rat Governor Spirit. The pill is on a small side path, branching off to the right before the Meditation Spot.\n\n## Xu-Dog Celestial Taiyi Pills",
    "img_below_text": "Fall down the sand slide after exploring the Crouching Tiger Temple Cellar to meet the Xu-Dog. The Xu-Dog crafts Celestial Medicines for you in exchange for Mind Cores. You can craft a total of nine Celestial Taiyi Pills with the Xu-Dog. You can find Mind Cores in chests or as loot for defeating particularly vicious foes.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Celestial Taiyi Pill Locations\n            - Section Title: Xu-Dog Celestial Taiyi Pills\n\n            Context:\n            - Preceding Text: \"# Celestial Taiyi Pill Locations\n\n**Celestial Taiyi Pills** are an item you can collect in Black Myth: Wukong to upgrade your maximum Mana. Mana is used to cast spells like Immobilize, A Pluck of Many, and Cloud Step. Spells are a massive part of combat in Black Myth: Wukong, and running out of Mana can be a problem. Here, we will review all the Celestial Taiyi locations so you can have as much Mana as possible.\n\n* Black Wind Mountain Celestial Taiyi Pill\n* Yellow Wind Ridge Celestial Taiyi Pill\n* Xu-Dog Celestial Taiyi Pills\n* The Webbed Hollow Celestial Taiyi Pill\n* The New West Celestial Taiyi Pill\n* Flaming Mountains Celestial Taiyi Pill\n\n\nThe Celestial Taiyi Pill on Black Wind Mountain is accessible after defeating the Black Wind King. After defeating the boss, explore the wooden platforms in the temple to find the Celestial Taiyi Pill sitting on a wooden bench.\n\n\nThe next Celestial Taiyi Pill is hidden near a Meditation Spot. This one is available after defeating the Stone Vanguard at Rock Clash Platform. Once you do, follow the light to unlock the Rock Clash Platform Keeper's Shrine. Take the path opposite the Shrine and defeat the Rat Governor Spirit. The pill is on a small side path, branching off to the right before the Meditation Spot.\n\n## Xu-Dog Celestial Taiyi Pills\"\n            - Following Text: \"Fall down the sand slide after exploring the Crouching Tiger Temple Cellar to meet the Xu-Dog. The Xu-Dog crafts Celestial Medicines for you in exchange for Mind Cores. You can craft a total of nine Celestial Taiyi Pills with the Xu-Dog. You can find Mind Cores in chests or as loot for defeating particularly vicious foes.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the concept of Celestial Taiyi Pills in *Black Myth: Wukong*, explaining their role in upgrading maximum Mana, which is essential for casting spells during combat. It lists various locations where these pills can be found, including Xu-Dog Celestial Taiyi Pills, which are the focus of the current section.\n\nImage Summary:  \nThe image displays an in-game crafting menu for creating Celestial Taiyi Pills. It highlights that these pills are a type of celestial medicine that permanently increases maximum Mana. The crafting process requires 360 Will and specific ingredients, including Mind Cores, with a limit of nine pills. The right side of the screen shows the player's current stats and the changes that will occur upon crafting the pill.\n\nFollowing Text Summary:  \nThe following text explains that the Xu-Dog, encountered after exploring the Crouching Tiger Temple Cellar, crafts Celestial Taiyi Pills in exchange for Mind Cores. Players can craft up to nine pills, with Mind Cores obtainable from chests or as loot from defeating strong enemies."
}