{
    "chunk_id": 881537389416,
    "source_file": "Chapter_5_Secret_-_Bishui_Cave_Walkthrough.md",
    "h1_title": "Chapter 5 Secret - Bishui Cave Walkthrough",
    "h2_title": "Yaoguai King - Bishui Golden-Eyed Beast",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/da/Bishui_Cave_Walkthrough_%2843%29.png",
    "alt_text": "Bishui Cave Walkthrough \\(43\\).png",
    "position_desc": 25,
    "img_above_text": "# Chapter 5 Secret - Bishui Cave Walkthrough\n\nTo your left, immediately as you enter the room, you'll find the Purge Pit Keeper's Shrine.\n\n\nAfter activating the first of the Keeper's Shrines, face away from it and head to the right. Go down the stairs and to the end of the path to find a Meditation Spot.\n\nReturn to the Keeper's Shrine and continue past it, following the path to the right. Head down to the slope, collecting the green Wisp on the left and into the center of the room. As you reach the middle, you'll be met by the first of the bosses in this secret area.\n\n\nGet back to the path and go past the next two bull guards to find the Cave Depths Keeper's Shrine.\n\n\nDrop down toward the lava and go left into the ice-covered portion of the room. Open the chest on the right to collect Celestial Ribbon and a Mind Core.\n\nHead down to the left, and slide all the way down the slope. Here you'll reach the final Keeper's Shrine of the hidden area, called the Corridor of Fire and Ice.\n\n\nHead right from the Keeper's Shrine and go down the stairs. A cutscene will play as you drop down, and the Bishui Golden-Eyed Beast will appear.\n\n## Yaoguai King - Bishui Golden-Eyed Beast\n\nHead up the stairs in this section and on the right, you'll be able to harvest a Fire Date. On the left, you can find an Awaken Wine Worm, and straight up ahead before the stairs, you'll see a green Wisp on the left.",
    "img_below_text": "Continue up the stairs, and you'll see the beast leaping around the rooftops. Go along the corridor, where you'll come to a frozen room with a doorway that has fire blocking it.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chapter 5 Secret - Bishui Cave Walkthrough\n            - Section Title: Yaoguai King - Bishui Golden-Eyed Beast\n\n            Context:\n            - Preceding Text: \"# Chapter 5 Secret - Bishui Cave Walkthrough\n\nTo your left, immediately as you enter the room, you'll find the Purge Pit Keeper's Shrine.\n\n\nAfter activating the first of the Keeper's Shrines, face away from it and head to the right. Go down the stairs and to the end of the path to find a Meditation Spot.\n\nReturn to the Keeper's Shrine and continue past it, following the path to the right. Head down to the slope, collecting the green Wisp on the left and into the center of the room. As you reach the middle, you'll be met by the first of the bosses in this secret area.\n\n\nGet back to the path and go past the next two bull guards to find the Cave Depths Keeper's Shrine.\n\n\nDrop down toward the lava and go left into the ice-covered portion of the room. Open the chest on the right to collect Celestial Ribbon and a Mind Core.\n\nHead down to the left, and slide all the way down the slope. Here you'll reach the final Keeper's Shrine of the hidden area, called the Corridor of Fire and Ice.\n\n\nHead right from the Keeper's Shrine and go down the stairs. A cutscene will play as you drop down, and the Bishui Golden-Eyed Beast will appear.\n\n## Yaoguai King - Bishui Golden-Eyed Beast\n\nHead up the stairs in this section and on the right, you'll be able to harvest a Fire Date. On the left, you can find an Awaken Wine Worm, and straight up ahead before the stairs, you'll see a green Wisp on the left.\"\n            - Following Text: \"Continue up the stairs, and you'll see the beast leaping around the rooftops. Go along the corridor, where you'll come to a frozen room with a doorway that has fire blocking it.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the progression through Bishui Cave, highlighting key landmarks such as Keeper's Shrines and collectible items. It details the approach to the final Keeper's Shrine, the Corridor of Fire and Ice, and introduces the appearance of the Bishui Golden-Eyed Beast after descending stairs and triggering a cutscene.\n\nImage Summary:\nThe image depicts a dramatic scene within Bishui Cave, showcasing a doorway engulfed in flames, surrounded by icy formations and dimly lit by hanging fire torches. The contrast between fire and ice visually represents the \"Corridor of Fire and Ice\" mentioned in the preceding text. This setting likely serves as a pivotal location where players encounter challenges or progress further in the walkthrough.\n\nFollowing Text Summary:\nThe following text describes the next steps after encountering the Bishui Golden-Eyed Beast. It mentions ascending stairs, collecting items such as Fire Date and Awaken Wine Worm, and observing the beast leaping across rooftops. The path leads to a frozen room with a doorway blocked by fire, suggesting a continuation of the fire-and-ice theme and further obstacles."
}