{
    "chunk_id": 691818821518,
    "source_file": "Black_Wind_King.md",
    "h1_title": "Black Wind King",
    "h2_title": "Black Wind King Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bd/Wukong_BlackWind_12.jpg",
    "alt_text": "Wukong BlackWind 12.jpg",
    "position_desc": 4,
    "img_above_text": "# Black Wind King\n\nThe Black Wind King is a required Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located in the middle of Black Wind Cave, this is the first of two forms you'll fight the self-imposed King of Black Wind Mountain. Even in his human form, he can be incredibly powerful.\n\n* **Rewards:** Cloud Step Spell, Yarn x3, 1049 Experience, 688 Will\n\n\nAs a required boss, you won't be able to miss running into the Black Wind King. Once you reach the Black Wind Cave area, simply head through the tunnel, take out any Wolf Assassins that may appear, and keep to the right when you spot a Meditation Spot to continue through the darkened passages to reach the Cave Interior Shrine, where the King waits beyond the nearby doors.\n\n## Black Wind King Boss Fight and Guide\n\nAny time he empowers his spear with the black wind effect, you can bet he’ll move close to perform up to three big slash attacks in short succession. Always wait until the third attack lands before trying to counter, and use your Spirit Attack when you know you have room to land the hit.",
    "img_below_text": "Be on your guard whenever you try to attack him head on, as his favorite attack at close range is taking a quick swig of his own gourd before breathing flames in front of him. A quick dodge can put you behind him, allowing you to continue your light attack combo as he finishes spraying the area in front of him.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Black Wind King\n            - Section Title: Black Wind King Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Black Wind King\n\nThe Black Wind King is a required Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located in the middle of Black Wind Cave, this is the first of two forms you'll fight the self-imposed King of Black Wind Mountain. Even in his human form, he can be incredibly powerful.\n\n* **Rewards:** Cloud Step Spell, Yarn x3, 1049 Experience, 688 Will\n\n\nAs a required boss, you won't be able to miss running into the Black Wind King. Once you reach the Black Wind Cave area, simply head through the tunnel, take out any Wolf Assassins that may appear, and keep to the right when you spot a Meditation Spot to continue through the darkened passages to reach the Cave Interior Shrine, where the King waits beyond the nearby doors.\n\n## Black Wind King Boss Fight and Guide\n\nAny time he empowers his spear with the black wind effect, you can bet he’ll move close to perform up to three big slash attacks in short succession. Always wait until the third attack lands before trying to counter, and use your Spirit Attack when you know you have room to land the hit.\"\n            - Following Text: \"Be on your guard whenever you try to attack him head on, as his favorite attack at close range is taking a quick swig of his own gourd before breathing flames in front of him. A quick dodge can put you behind him, allowing you to continue your light attack combo as he finishes spraying the area in front of him.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Black Wind King, a mandatory boss in Chapter 1 of *Black Myth: Wukong*. Players encounter him in the Black Wind Cave, where he wields powerful attacks in his human form. The text provides navigation tips to reach the boss and outlines rewards for defeating him, including spells, items, and experience points. It also highlights his combat style, particularly his empowered spear attacks, advising players to counter after his third strike.\n\nImage Summary:  \nThe image depicts an intense moment during the Black Wind King boss fight in *Black Myth: Wukong*. The boss is shown mid-action, breathing flames from his gourd while wielding a spear. The player character is engaged in combat, dodging or preparing to attack. The environment features a dark cave-like setting with scattered foliage, illuminated by firelight. The health bar at the bottom indicates the ongoing battle, while the UI displays player abilities and status.\n\nFollowing Text Summary:  \nThe following text provides additional combat strategies for fighting the Black Wind King. It warns players about his flame-breathing attack, triggered by drinking from his gourd, and suggests dodging behind him to continue light attack combos while he sprays flames in front."
}