{
    "chunk_id": 577296749254,
    "source_file": "Daoist_Mi.md",
    "h1_title": "Daoist Mi",
    "h2_title": "Where to Find the Daoist Mi",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/6f/Wukong_PurpleCloud_33.jpg",
    "alt_text": "Wukong PurpleCloud 33.jpg",
    "position_desc": 2,
    "img_above_text": "# Daoist Mi\n\nThe Daoist Mi is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the secret area of the Purple Cloud Mountain, the Daoist Mi will have a quest for you before you can face him in battle.\n\n* Rewards: Violet Hail Transformation Spell, Refined Iron Sand, 1562 Experience, 1451 Will\n\n## Where to Find the Daoist Mi\n\nAfter resting at the Petalfall Hamlet Shrine, head up the path and across a small bridge to enter the small village. It's now overrun by various Daoists, which shouldn't prove too much of a problem if you take them out one at a time.",
    "img_below_text": "However, after climbing some stairs, you'll come across a special Sword Daoist playing a flute, and does not appear hostile. He'll actually ask a favor of you, noting that his fellow Daoists have all been partaking of Amourworm eggs, turning them into undying husks. He'll ask you to seek one out and return it to him.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Daoist Mi\n            - Section Title: Where to Find the Daoist Mi\n\n            Context:\n            - Preceding Text: \"# Daoist Mi\n\nThe Daoist Mi is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the secret area of the Purple Cloud Mountain, the Daoist Mi will have a quest for you before you can face him in battle.\n\n* Rewards: Violet Hail Transformation Spell, Refined Iron Sand, 1562 Experience, 1451 Will\n\n## Where to Find the Daoist Mi\n\nAfter resting at the Petalfall Hamlet Shrine, head up the path and across a small bridge to enter the small village. It's now overrun by various Daoists, which shouldn't prove too much of a problem if you take them out one at a time.\"\n            - Following Text: \"However, after climbing some stairs, you'll come across a special Sword Daoist playing a flute, and does not appear hostile. He'll actually ask a favor of you, noting that his fellow Daoists have all been partaking of Amourworm eggs, turning them into undying husks. He'll ask you to seek one out and return it to him.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Daoist Mi, an optional boss in *Black Myth: Wukong*. He is located in a secret area of Purple Cloud Mountain during Chapter 4. Players must complete a quest before battling him, and defeating him yields rewards such as a spell, crafting material, and experience points. The journey begins at the Petalfall Hamlet Shrine, leading to a village overrun by hostile Daoists.\n\nImage Summary:\nThe image depicts a player character approaching a small, rustic building in an overgrown area, likely part of the village mentioned in the preceding text. A Daoist NPC stands outside the building, suggesting potential interaction or quest progression. A glowing object inside the building, highlighted with a red circle, may indicate an important item or quest objective. The caption, \"It's been long since any soul has trodden these hidden bounds,\" adds a sense of mystery and isolation to the setting.\n\nFollowing Text Summary:\nThe following text describes an encounter with a unique Sword Daoist playing a flute, who is non-hostile and requests the player’s help. He explains that other Daoists have consumed Amourworm eggs, transforming them into undying husks. The player is tasked with finding and returning an Amourworm egg to him."
}