{
    "chunk_id": 355053563461,
    "source_file": "Nine-Capped_Lingzhi_Guai.md",
    "h1_title": "Nine-Capped Lingzhi Guai",
    "h2_title": "Nine-Capped Lingzhi Guai Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d3/Field_Fire_Walkthrough_%284%29.png",
    "alt_text": "Field Fire Walkthrough \\(4\\).png",
    "position_desc": 4,
    "img_above_text": "# Nine-Capped Lingzhi Guai\n\nNine-Capped Lingzhi Guai is untracked in the journal, but is a Yaoguai Chief you'll fight as head up the Flaming Mountains in Chapter 5 in Black Myth: Wukong. The optional boss has to be plucked from the ground and uses poisonous moves to attack.\n\n\nBefore you continue along the path, face the Ashen Pass III Keeper's Shrine and turn to the right. You'll see a Purple Lingzhi to harvest and another mushroom in the center of the clearing. When you pull this second one, you'll be confronted by the Nine-Capped Lingzhi Guai, which is an optional boss.\n\n## Nine-Capped Lingzhi Guai Boss Fight and Guide\n\nHe uses a spiked mace to attack and generally will perform a series of combos where he'll swing the mace, or leap up in the air and smash it down.\n\nThough these are fairly standard attacks, in the sense that they can be dodged and evaded, the problem with them is the small red mushrooms that appear with each one.",
    "img_below_text": "These tiny red mushrooms will appear in any area that his attack lands -- including on you. If they start to grow on you, they'll reduce your movement significantly. This doesn't affect dodging, however, just walking. The biggest problem with this is that as you move around, the red mushrooms will appear on the floor around you and continue to explode, so you'll need to keep moving.\n\nWhen they land in areas of the clearing, they will explode into a red mist. This is poisonous, so you'll want to evade the direct blows from the mace and the fungi to avoid poison buildup. Be sure to have Antimiasma Powder equipped to help with any poison buildup during this fight.\n\nAt times, he will also throw his cap and it acts like a boomerang. This is his only ranged attack, and it will try to hit you from behind, so again, keep moving to avoid this.\n\nOnce you've beaten him, be sure to collect the Nine-Capped Lingzhi Guai Spirit that he leaves behind.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Nine-Capped Lingzhi Guai\n            - Section Title: Nine-Capped Lingzhi Guai Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Nine-Capped Lingzhi Guai\n\nNine-Capped Lingzhi Guai is untracked in the journal, but is a Yaoguai Chief you'll fight as head up the Flaming Mountains in Chapter 5 in Black Myth: Wukong. The optional boss has to be plucked from the ground and uses poisonous moves to attack.\n\n\nBefore you continue along the path, face the Ashen Pass III Keeper's Shrine and turn to the right. You'll see a Purple Lingzhi to harvest and another mushroom in the center of the clearing. When you pull this second one, you'll be confronted by the Nine-Capped Lingzhi Guai, which is an optional boss.\n\n## Nine-Capped Lingzhi Guai Boss Fight and Guide\n\nHe uses a spiked mace to attack and generally will perform a series of combos where he'll swing the mace, or leap up in the air and smash it down.\n\nThough these are fairly standard attacks, in the sense that they can be dodged and evaded, the problem with them is the small red mushrooms that appear with each one.\"\n            - Following Text: \"These tiny red mushrooms will appear in any area that his attack lands -- including on you. If they start to grow on you, they'll reduce your movement significantly. This doesn't affect dodging, however, just walking. The biggest problem with this is that as you move around, the red mushrooms will appear on the floor around you and continue to explode, so you'll need to keep moving.\n\nWhen they land in areas of the clearing, they will explode into a red mist. This is poisonous, so you'll want to evade the direct blows from the mace and the fungi to avoid poison buildup. Be sure to have Antimiasma Powder equipped to help with any poison buildup during this fight.\n\nAt times, he will also throw his cap and it acts like a boomerang. This is his only ranged attack, and it will try to hit you from behind, so again, keep moving to avoid this.\n\nOnce you've beaten him, be sure to collect the Nine-Capped Lingzhi Guai Spirit that he leaves behind.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}