{
    "chunk_id": 229661951968,
    "source_file": "Yellowbrow.md",
    "h1_title": "Yellowbrow",
    "h2_title": "Yellowbrow Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/ba/Wukong_Thunderclap_84.jpg",
    "alt_text": "Wukong Thunderclap 84.jpg",
    "position_desc": 13,
    "img_above_text": "# Yellowbrow\n\nYellowbrow is a required Yaoguai King fight that you can encounter at the end of Chapter 3 in Black Myth Wukong. Located at the end of the New Thunderclap Temple, you'll have to defeat him twice in a drawn out battle to claim the Sage's Relic he guards.\n\n* Rewards: Cosmo Radiance, Cold Iron Leaves x3, Fine Gold Thread x2, Gold Tree Core, Refined Iron Sand x2, Mind Core, 4330 Experience, 2267 Will\n\n\nAfter resting at the Mahavira Hall Shrine at the top of the stairs, be sure to take assessment of your gear. Cultivate your best Spirits, make sure you have a lot of pills on hand an craft a bunch of extra Shock-Quelling Powder (you're going to need it).\n\nYou should also have any anti-shock gear/curios/soaks on hand as well, along with whatever else can keep you alive for awhile. This final encounter is spread out into three distinct fights, and while you'll be able to respawn and pick up where you left off for the first two sections from the Shrine, the final section won't take you back to the Shrine.\n\n* First Encounter\n* Second Encounter\n\n## Yellowbrow Boss Fight and Guide\n\nOnce all the motes coalesce into his weapon, he'll slam it into the ground to create a massive electrical storm, and soon after, a giant detonation that can usually kill you in a single hit. This attack can't be dodged (even in Pillar Stance), but it can be outrun if you flee to the far corners of the room away from him (though it still has a mighty range).\n\nIf you feel like you can't escape in time, you can also try interrupting this attack - the Wind Tamer Vessel is a great pick for this as it will stun him no matter what he's doing!",
    "img_below_text": "Finally, in his angered state he can also unleash a much longer combo attack, often while yelling about how he's going to guide the world. If you can't get enough distance from him, be ready to try deflecting or Immobilizing him, or you'll have to dodge a series of three sweeping attacks as he slides his mace along the ground, then swings it over his head four times, followed by a large windup as he pulls it around from behind his back in one large sweeping strikes.\n\nThe better understanding you have of his attacks and their range, the more ready you'll be to deal with each of them in turn, evading his lightining strikes and quelling any shock status to minimize damage. Use the downtimes from his slower attacks to hit him hard with Spirit Attacks and expending your Focus Points to stagger him onto the ground.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Yellowbrow\n            - Section Title: Yellowbrow Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Yellowbrow\n\nYellowbrow is a required Yaoguai King fight that you can encounter at the end of Chapter 3 in Black Myth Wukong. Located at the end of the New Thunderclap Temple, you'll have to defeat him twice in a drawn out battle to claim the Sage's Relic he guards.\n\n* Rewards: Cosmo Radiance, Cold Iron Leaves x3, Fine Gold Thread x2, Gold Tree Core, Refined Iron Sand x2, Mind Core, 4330 Experience, 2267 Will\n\n\nAfter resting at the Mahavira Hall Shrine at the top of the stairs, be sure to take assessment of your gear. Cultivate your best Spirits, make sure you have a lot of pills on hand an craft a bunch of extra Shock-Quelling Powder (you're going to need it).\n\nYou should also have any anti-shock gear/curios/soaks on hand as well, along with whatever else can keep you alive for awhile. This final encounter is spread out into three distinct fights, and while you'll be able to respawn and pick up where you left off for the first two sections from the Shrine, the final section won't take you back to the Shrine.\n\n* First Encounter\n* Second Encounter\n\n## Yellowbrow Boss Fight and Guide\n\nOnce all the motes coalesce into his weapon, he'll slam it into the ground to create a massive electrical storm, and soon after, a giant detonation that can usually kill you in a single hit. This attack can't be dodged (even in Pillar Stance), but it can be outrun if you flee to the far corners of the room away from him (though it still has a mighty range).\n\nIf you feel like you can't escape in time, you can also try interrupting this attack - the Wind Tamer Vessel is a great pick for this as it will stun him no matter what he's doing!\"\n            - Following Text: \"Finally, in his angered state he can also unleash a much longer combo attack, often while yelling about how he's going to guide the world. If you can't get enough distance from him, be ready to try deflecting or Immobilizing him, or you'll have to dodge a series of three sweeping attacks as he slides his mace along the ground, then swings it over his head four times, followed by a large windup as he pulls it around from behind his back in one large sweeping strikes.\n\nThe better understanding you have of his attacks and their range, the more ready you'll be to deal with each of them in turn, evading his lightining strikes and quelling any shock status to minimize damage. Use the downtimes from his slower attacks to hit him hard with Spirit Attacks and expending your Focus Points to stagger him onto the ground.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}