{
    "chunk_id": 48837401715,
    "source_file": "The_Scorpionlord.md",
    "h1_title": "The Scorpionlord",
    "h2_title": "The Scorpionlord Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5e/Wukong_PurpleCloud_19.jpg",
    "alt_text": "Wukong PurpleCloud 19.jpg",
    "position_desc": 9,
    "img_above_text": "# The Scorpionlord\n\nThe Scorpionlord is an optional Yaoguai King boss fight that you can encounter in Chapter 4 of Black Myth Wukong. The leader of a gang of insect guai that have taken over Purple Cloud Mountain, he can only be reached by entering a secret area.\n\n* Rewards: Sky-Piercing Horn, Deathstinger (Material), Stained Jade Gourd, Fine Gold Thread, Mind Core, 3410 Experience, 2595 Will\n\n\nThe Scorpionlord is an optional Yaoguai King, and potentially one of the toughest bosses you'll face in Chapter 4, even though he is not required to complete the Secret Area of Purple Cloud Mountain. However, if you do not defeat him before defeating the actual final boss of this region, he may not be available afterwards.\n\nTo reach Purple Cloud Mountain, you will have to defeat the Venom Daoist twice - both in the Upper Webbed Hollow, and in a side path outside the Temple of Yellow Flowers main area. This will unlock a mural allowing you to travel to this new area.\n\nOnce you reach the first main shrine at the Valley of Blooms, keep to the right to find a pathway leading to the Bounds of Deity's Abode Shrine, and stairs up to where the Scorpionlord lounges drinking on top of a building.\n\nTo goad him into fighting, simply break any of the pots in the area around him.\n\n## The Scorpionlord Boss Fight and Guide\n\nOnce you've dealt a fair amount of damage, he can also drive his tail deep into the ground. Poison will start welling up in multiple spots all around you, and explode with small geysers after a moment. The area is quite large, and you may want to quickly swap to the Pillar Stance to avoid the explosions and retaliate quickly with a charged hit.",
    "img_below_text": "He can also run toward you and dive into the ground, forcing you to lose your lock on as he waits below ground for a moment before busting out to attack as he erupts forth. Don't get greedy after he appears, as he will usually follow his re-entry with a quick tail swipe that can turn into a grab if it connects, and immediately inject a large dose of poison into you while also dealing massive damage.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: The Scorpionlord\n            - Section Title: The Scorpionlord Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# The Scorpionlord\n\nThe Scorpionlord is an optional Yaoguai King boss fight that you can encounter in Chapter 4 of Black Myth Wukong. The leader of a gang of insect guai that have taken over Purple Cloud Mountain, he can only be reached by entering a secret area.\n\n* Rewards: Sky-Piercing Horn, Deathstinger (Material), Stained Jade Gourd, Fine Gold Thread, Mind Core, 3410 Experience, 2595 Will\n\n\nThe Scorpionlord is an optional Yaoguai King, and potentially one of the toughest bosses you'll face in Chapter 4, even though he is not required to complete the Secret Area of Purple Cloud Mountain. However, if you do not defeat him before defeating the actual final boss of this region, he may not be available afterwards.\n\nTo reach Purple Cloud Mountain, you will have to defeat the Venom Daoist twice - both in the Upper Webbed Hollow, and in a side path outside the Temple of Yellow Flowers main area. This will unlock a mural allowing you to travel to this new area.\n\nOnce you reach the first main shrine at the Valley of Blooms, keep to the right to find a pathway leading to the Bounds of Deity's Abode Shrine, and stairs up to where the Scorpionlord lounges drinking on top of a building.\n\nTo goad him into fighting, simply break any of the pots in the area around him.\n\n## The Scorpionlord Boss Fight and Guide\n\nOnce you've dealt a fair amount of damage, he can also drive his tail deep into the ground. Poison will start welling up in multiple spots all around you, and explode with small geysers after a moment. The area is quite large, and you may want to quickly swap to the Pillar Stance to avoid the explosions and retaliate quickly with a charged hit.\"\n            - Following Text: \"He can also run toward you and dive into the ground, forcing you to lose your lock on as he waits below ground for a moment before busting out to attack as he erupts forth. Don't get greedy after he appears, as he will usually follow his re-entry with a quick tail swipe that can turn into a grab if it connects, and immediately inject a large dose of poison into you while also dealing massive damage.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}