{
    "chunk_id": 453561588893,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "h1_title": "Fright Cliff Walkthrough",
    "h2_title": "Squall Hideout",
    "h3_title": "The First Buddha’s Eyeball",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c4/Wukong_Fright_9.jpg",
    "alt_text": "Wukong Fright 9.jpg",
    "position_desc": 10,
    "img_above_text": "# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n## Squall Hideout\n\n### The First Buddha’s Eyeball\n\nIf you head left first, you’ll find a small pathway where a Bladebone will spew projectiles at you from a scaffold you can’t reach, but you can duck into and find a green Wisp to absorb in a small room.",
    "img_below_text": "Head past the ranged attacker above (note the Aged Ginseng on the left is actually a Ginsengling), and go through a doorway to spy a large cave entrance up ahead. Stick to the right to find a sloping path back, and a new stony enemy variant will burrow out of the ground.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fright Cliff Walkthrough\n            - Section Title: Squall Hideout\n            - Sub-Section Title: The First Buddha’s Eyeball\n\n            Context:\n            - Preceding Text: \"# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n## Squall Hideout\n\n### The First Buddha’s Eyeball\n\nIf you head left first, you’ll find a small pathway where a Bladebone will spew projectiles at you from a scaffold you can’t reach, but you can duck into and find a green Wisp to absorb in a small room.\"\n            - Following Text: \"Head past the ranged attacker above (note the Aged Ginseng on the left is actually a Ginsengling), and go through a doorway to spy a large cave entrance up ahead. Stick to the right to find a sloping path back, and a new stony enemy variant will burrow out of the ground.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the \"Squall Hideout\" section of the \"Fright Cliff Walkthrough,\" focusing on navigating threats and using strategic movement. It describes a scenario where players should avoid locking onto smaller enemies to prevent being attacked by a larger foe, the Pitstone, and instead use a \"Cloud Step\" maneuver for a sneak attack. It also mentions a pathway with a ranged enemy (Bladebone) and a collectible green Wisp in a small room.\n\nImage Summary:\nThe image depicts a gameplay scene from the \"Squall Hideout\" section of the walkthrough. A player character, dressed in a blue outfit, is engaged in combat with a large, hostile creature in a rocky, overgrown area. The creature appears aggressive, with glowing red indicators above its head signaling its hostility. The interface shows various gameplay elements, including health bars, abilities, and items, suggesting active combat and resource management. The environment matches the description of a rugged, cave-like area.\n\nFollowing Text Summary:\nThe following text continues the walkthrough, guiding players past the ranged attacker mentioned earlier. It notes a collectible item (Aged Ginseng, revealed to be a Ginsengling) and directs players toward a large cave entrance. Players are advised to stick to the right to find a sloping path, where a new stony enemy variant emerges from the ground, adding another layer of challenge."
}