{
    "chunk_id": 507547825080,
    "source_file": "Captain_Lotus-Vision.md",
    "h1_title": "Captain Lotus-Vision",
    "h2_title": "Where to Find Captain Lotus-Vision",
    "h3_title": "Captain Lotus-Vision Miniboss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e6/Wukong_Pagoda_41.jpg",
    "alt_text": "Wukong Pagoda 41.jpg",
    "position_desc": 11,
    "img_above_text": "# Captain Lotus-Vision\n\nCaptain Lotus-Vision is an optional miniboss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Responsible for sealing captives in the cells of the Pagoda Realm, you can find this boss in a secret chamber within the Pagoda Prison.\n\n* **Rewards:** Spirit of Captain Lotus-Vision, Frostsprout Twig, Mind Core, Cold Iron Leaves, 1847 Experience, 1198 Will\n\n## Where to Find Captain Lotus-Vision\n\nCaptain Lotus-Vision is one of the four captains you can find in Chapter 3, and is an optional Yaoguai Chief you can encounter in the Pagoda Realm.\n\nTo find him, you'll need to reach the Upper Pagoda Shrine on the third level of the prison. Just behind the shrine, there is a pit with purple light emanating below that you can drop into and find this boss.\n\n### Captain Lotus-Vision Miniboss Fight and Guide\n\nIn addition to his usual attacks, he'll also start teleporting more aggressively, sending out a new laser beam as he appears at his new location up to three times -- ending with an extended laser beam for several seconds. Several smaller projectiles can also be expelled into the air as he teleports, which will slowly trail after you to deal minor damage if they catch up.\n\nHe can also start detonating a trail of explosions that follow you along the ground, but have a bigger indicator than the randomly placed explosions so you can outpace them by sprinting around and dodging.",
    "img_below_text": "One of the more confusing attacks can happen when he floats up higher into the air, prompting the rings in each corner to send beams straight up in the air. beams will then start appearing at random angles in the ceiling to strike the floor in more and more locations, limiting your movement. Stay mobile and look for spots to safely stand as lasers fire off around you - and if you're still in range, hit the Captain with the Pillar Stance smash.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Captain Lotus-Vision\n            - Section Title: Where to Find Captain Lotus-Vision\n            - Sub-Section Title: Captain Lotus-Vision Miniboss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Captain Lotus-Vision\n\nCaptain Lotus-Vision is an optional miniboss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Responsible for sealing captives in the cells of the Pagoda Realm, you can find this boss in a secret chamber within the Pagoda Prison.\n\n* **Rewards:** Spirit of Captain Lotus-Vision, Frostsprout Twig, Mind Core, Cold Iron Leaves, 1847 Experience, 1198 Will\n\n## Where to Find Captain Lotus-Vision\n\nCaptain Lotus-Vision is one of the four captains you can find in Chapter 3, and is an optional Yaoguai Chief you can encounter in the Pagoda Realm.\n\nTo find him, you'll need to reach the Upper Pagoda Shrine on the third level of the prison. Just behind the shrine, there is a pit with purple light emanating below that you can drop into and find this boss.\n\n### Captain Lotus-Vision Miniboss Fight and Guide\n\nIn addition to his usual attacks, he'll also start teleporting more aggressively, sending out a new laser beam as he appears at his new location up to three times -- ending with an extended laser beam for several seconds. Several smaller projectiles can also be expelled into the air as he teleports, which will slowly trail after you to deal minor damage if they catch up.\n\nHe can also start detonating a trail of explosions that follow you along the ground, but have a bigger indicator than the randomly placed explosions so you can outpace them by sprinting around and dodging.\"\n            - Following Text: \"One of the more confusing attacks can happen when he floats up higher into the air, prompting the rings in each corner to send beams straight up in the air. beams will then start appearing at random angles in the ceiling to strike the floor in more and more locations, limiting your movement. Stay mobile and look for spots to safely stand as lasers fire off around you - and if you're still in range, hit the Captain with the Pillar Stance smash.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Captain Lotus-Vision as an optional miniboss in Chapter 3 of *Black Myth: Wukong*. This boss is located in a secret chamber within the Pagoda Prison and is responsible for imprisoning captives. Players can find him by dropping into a pit with purple light near the Upper Pagoda Shrine. The text also describes some of his combat mechanics, including aggressive teleportation, laser beams, and ground explosions.\n\nImage Summary:  \nThe image depicts the miniboss fight against Captain Lotus-Vision. The scene shows the boss levitating in a dark, ominous environment surrounded by purple light beams and magical effects, emphasizing his use of teleportation and laser-based attacks. The player character is positioned in the foreground, preparing to engage the boss, with the health bar for Captain Lotus-Vision visible at the bottom of the screen.\n\nFollowing Text Summary:  \nThe following text elaborates on one of Captain Lotus-Vision's more complex attacks, where he ascends into the air and activates corner rings that fire vertical beams. These beams then create angled lasers that strike the floor in random patterns, restricting movement. Players are advised to stay mobile, find safe zones, and use specific attacks like the Pillar Stance smash when within range."
}