{
    "chunk_id": 773678797016,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "h1_title": "Prologue",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9e/Wukong_Prologue_1.jpg",
    "alt_text": "Wukong Prologue 1.jpg",
    "position_desc": 1,
    "img_above_text": "# Prologue",
    "img_below_text": "Upon beginning your journey, you’ll be thrust into the role of the mythical Sun Wukong as he rebels against the Court of Heaven and its Heavenly Kings. Undaunted by their army, Sun Wukong calls them out, prompting the nephew of the Jade Emperor, Erlang Shen, to meet him in combat.\n\n## Boss Fight - Erlang, the Sacred Divinity",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Prologue\n\n            Context:\n            - Preceding Text: \"# Prologue\"\n            - Following Text: \"Upon beginning your journey, you’ll be thrust into the role of the mythical Sun Wukong as he rebels against the Court of Heaven and its Heavenly Kings. Undaunted by their army, Sun Wukong calls them out, prompting the nephew of the Jade Emperor, Erlang Shen, to meet him in combat.\n\n## Boss Fight - Erlang, the Sacred Divinity\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the \"Prologue\" section, setting the stage for the narrative. It describes the beginning of the protagonist's journey as Sun Wukong, the mythical Monkey King, who defies the Court of Heaven and its Heavenly Kings. This rebellion leads to a confrontation with their forces.\n\nImage Summary:  \nThe image depicts Sun Wukong standing defiantly in a snowy battlefield, facing three towering, heavily armored figures who appear to be Heavenly Kings. The scene conveys a sense of impending conflict and highlights the scale of the challenge Sun Wukong is up against, emphasizing his rebellion against divine forces.\n\nFollowing Text Summary:  \nThe following text transitions to a specific encounter, introducing Erlang Shen, the nephew of the Jade Emperor, as Sun Wukong's opponent in combat. This marks the beginning of a boss fight titled \"Erlang, the Sacred Divinity,\" further advancing the narrative of Sun Wukong's rebellion."
}