{
    "chunk_id": 646889891617,
    "source_file": "Earth_Wolf.md",
    "h1_title": "Earth Wolf",
    "h2_title": "Earth Wolf Miniboss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a9/Wukong_Sandgate_40.jpg",
    "alt_text": "Wukong Sandgate 40.jpg",
    "position_desc": 5,
    "img_above_text": "# Earth Wolf\n\nThe Earth Wolf is an optional Yaoguai Chief miniboss that you can encounter in Chapter 2 of Black Myth Wukong. As an optional foe, you can seek out this enemy to gain their Spirit power by defeating them inside the Sandgate Village.\n\n* Rewards: Earth Wolf Spirit\n\n\nTake the path to the right of the sealed gate, and fight past two Rat Captains while keeping the village shacks on your left. As you circle the area, you can find a pathway leading to an archway guarded by a Rat Archer and Rat Governor, and you'll find the boss inside.\n\n## Earth Wolf Miniboss Fight and Guide\n\nIt can also try to perform a short distance pounce to land on top of you, which moves much quicker than its headbutt leap. If you can evade this one, it will waste time looking around to find that it missed its grab, letting you get your hits in.\n\nHowever, if you get locked in the grab, you’ll be tossed up in the air and land right on its bony back and horns, taking major damage as it shakes you off. Watch for both of its paws to reach out to know when to dodge this move.",
    "img_below_text": "The Earth Wolf can also perform two short lunging bite attacks in fairly quick succession, moving itself forward with each bite to try and lock onto you.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Earth Wolf\n            - Section Title: Earth Wolf Miniboss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Earth Wolf\n\nThe Earth Wolf is an optional Yaoguai Chief miniboss that you can encounter in Chapter 2 of Black Myth Wukong. As an optional foe, you can seek out this enemy to gain their Spirit power by defeating them inside the Sandgate Village.\n\n* Rewards: Earth Wolf Spirit\n\n\nTake the path to the right of the sealed gate, and fight past two Rat Captains while keeping the village shacks on your left. As you circle the area, you can find a pathway leading to an archway guarded by a Rat Archer and Rat Governor, and you'll find the boss inside.\n\n## Earth Wolf Miniboss Fight and Guide\n\nIt can also try to perform a short distance pounce to land on top of you, which moves much quicker than its headbutt leap. If you can evade this one, it will waste time looking around to find that it missed its grab, letting you get your hits in.\n\nHowever, if you get locked in the grab, you’ll be tossed up in the air and land right on its bony back and horns, taking major damage as it shakes you off. Watch for both of its paws to reach out to know when to dodge this move.\"\n            - Following Text: \"The Earth Wolf can also perform two short lunging bite attacks in fairly quick succession, moving itself forward with each bite to try and lock onto you.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Earth Wolf, an optional miniboss in *Black Myth: Wukong*, encountered in Chapter 2 at Sandgate Village. Players can defeat this Yaoguai Chief to obtain the Earth Wolf Spirit reward. Directions to the boss include navigating past Rat Captains, a Rat Archer, and a Rat Governor before reaching the archway where the Earth Wolf resides.\n\nImage Summary:\nThe image depicts an active combat scene between the player character and the Earth Wolf miniboss in *Black Myth: Wukong*. The Earth Wolf is shown mid-action in a grassy, village-like environment with traditional architecture and barren trees in the background. The player's health bar and combat abilities are visible in the UI, while the Earth Wolf's name and health bar are displayed at the bottom, emphasizing the boss fight.\n\nFollowing Text Summary:\nThe following text elaborates on the Earth Wolf’s attack patterns, describing its ability to perform quick lunging bite attacks in succession. These moves allow the miniboss to advance and attempt to lock onto the player, adding to the challenge of the fight."
}