{
    "chunk_id": 83126526742,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "h1_title": "Prologue",
    "h2_title": "Boss Fight - Erlang, the Sacred Divinity",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c0/Wukong_Prologue_6.jpg",
    "alt_text": "Wukong Prologue 6.jpg",
    "position_desc": 6,
    "img_above_text": "# Prologue\n\nUpon beginning your journey, you’ll be thrust into the role of the mythical Sun Wukong as he rebels against the Court of Heaven and its Heavenly Kings. Undaunted by their army, Sun Wukong calls them out, prompting the nephew of the Jade Emperor, Erlang Shen, to meet him in combat.\n\n## Boss Fight - Erlang, the Sacred Divinity\n\nWhen Erlang falls to less than half health, another small scene will play out before the final bout, and Erlang will start invoking more of his divinity to blast you with projectiles. Since you can’t really take lasting damage, you can simply try dodging around, or hold the L2 button to deflect them.",
    "img_below_text": "When Erlang returns to the ground, it's also a good time to try out your spells early if you want, by holding R2 and then pressing one of the three button icons:\n\n* The top button is **Rock Solid** , which acts like a parry that turns you into stone to deflect an incoming attack.\n* The left button is **Immobilize** , which temporarily freezes your opponent in place allowing you to score free hits\n* The bottom button is A **Pluck of Many** , which creates illusory copies of you to assist in combat.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Prologue\n            - Section Title: Boss Fight - Erlang, the Sacred Divinity\n\n            Context:\n            - Preceding Text: \"# Prologue\n\nUpon beginning your journey, you’ll be thrust into the role of the mythical Sun Wukong as he rebels against the Court of Heaven and its Heavenly Kings. Undaunted by their army, Sun Wukong calls them out, prompting the nephew of the Jade Emperor, Erlang Shen, to meet him in combat.\n\n## Boss Fight - Erlang, the Sacred Divinity\n\nWhen Erlang falls to less than half health, another small scene will play out before the final bout, and Erlang will start invoking more of his divinity to blast you with projectiles. Since you can’t really take lasting damage, you can simply try dodging around, or hold the L2 button to deflect them.\"\n            - Following Text: \"When Erlang returns to the ground, it's also a good time to try out your spells early if you want, by holding R2 and then pressing one of the three button icons:\n\n* The top button is **Rock Solid** , which acts like a parry that turns you into stone to deflect an incoming attack.\n* The left button is **Immobilize** , which temporarily freezes your opponent in place allowing you to score free hits\n* The bottom button is A **Pluck of Many** , which creates illusory copies of you to assist in combat.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the player as Sun Wukong, who challenges the Court of Heaven and its forces. The narrative sets up a boss fight against Erlang Shen, the nephew of the Jade Emperor. The text describes how Erlang, upon reaching half health, escalates the battle by using divine projectiles, which the player can dodge or deflect.\n\nImage Summary:  \nThe image depicts an intense combat scene between Sun Wukong and Erlang Shen. Multiple illusory copies of Sun Wukong are visible, suggesting the use of a spell or ability. Bright divine energy, likely from Erlang Shen, dominates the right side of the image, emphasizing the scale and power of the fight. The health bar at the bottom identifies Erlang as the boss, and the icons on the right indicate available player abilities.\n\nFollowing Text Summary:  \nThe following text provides guidance on using Sun Wukong’s spells during the fight. It explains three abilities: \"Rock Solid\" for parrying, \"Immobilize\" to freeze the opponent, and \"A Pluck of Many\" to summon illusory copies for assistance. These abilities offer tactical options for the player to engage Erlang Shen effectively."
}