{
    "chunk_id": 596428945957,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "h1_title": "Furnace Valley Walkthrough",
    "h2_title": "Valley Entrance",
    "h3_title": "A Note on Flamlings",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/59/Furnace_Valley_Walkthrough_%2833%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(33\\).png",
    "position_desc": 14,
    "img_above_text": "# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n## Valley Entrance\n\nUltimately, you're going to go left to continue on the main path (and you may start to hear characters talk as you approach this pillar), but for now, you'll want to detour and explore the area to the right.\n\nThe first thing you'll see as you go to the right is the Flamlings that sit in the lava. These will spit fire at you, so it's best to deal with them to remove the ranged attacks while you explore.\n\n### A Note on Flamlings\n\nRight at the end of this path, you'll find a Turtle Treasure guarding a chest. This Turtle Treasure holds a Spirit for you to collect once you've beaten it. After grabbing the Turtle Treasure Spirit, open the chest to collect Kun Steel, Knot of Voidness, and Medicines.",
    "img_below_text": "Backtrack on yourself and go straight up through the path on the left between the rocks. Head for the lava stream running from the ceiling straight up ahead but stop to kill the last Flamling on the right, just behind the rock, and harvest the Fire Date from the tree on the right.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Furnace Valley Walkthrough\n            - Section Title: Valley Entrance\n            - Sub-Section Title: A Note on Flamlings\n\n            Context:\n            - Preceding Text: \"# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n## Valley Entrance\n\nUltimately, you're going to go left to continue on the main path (and you may start to hear characters talk as you approach this pillar), but for now, you'll want to detour and explore the area to the right.\n\nThe first thing you'll see as you go to the right is the Flamlings that sit in the lava. These will spit fire at you, so it's best to deal with them to remove the ranged attacks while you explore.\n\n### A Note on Flamlings\n\nRight at the end of this path, you'll find a Turtle Treasure guarding a chest. This Turtle Treasure holds a Spirit for you to collect once you've beaten it. After grabbing the Turtle Treasure Spirit, open the chest to collect Kun Steel, Knot of Voidness, and Medicines.\"\n            - Following Text: \"Backtrack on yourself and go straight up through the path on the left between the rocks. Head for the lava stream running from the ceiling straight up ahead but stop to kill the last Flamling on the right, just behind the rock, and harvest the Fire Date from the tree on the right.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the \"Valley Entrance\" section of the Furnace Valley Walkthrough. It advises players to explore the area to the right before continuing on the main path to the left. The right path features Flamlings, enemies that attack from a distance with fire, and players are encouraged to eliminate them to safely explore the area.\n\nImage Summary:  \nThe image depicts a dark, rocky environment with a glowing lava stream flowing through the foreground. A player character is visible standing in the lava, holding a weapon. The scene is illuminated by the fiery glow of the lava, and arrows indicate two potential paths forward, suggesting a choice in exploration. The image likely serves to visually guide players through this part of the walkthrough.\n\nFollowing Text Summary:  \nThe following text instructs players to backtrack after exploring the right path and proceed along the left path between the rocks. It highlights a key encounter with a Flamling near a lava stream and the opportunity to collect a Fire Date from a nearby tree."
}