{
    "chunk_id": 137372623197,
    "source_file": "Bitter_Lake_Walkthrough.md",
    "h1_title": "Bitter Lake Walkthrough",
    "h2_title": "Yaoguai Chief Miniboss Fight - Apramana Bat",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e2/Wukong_Bitter_48.jpg",
    "alt_text": "Wukong Bitter 48.jpg",
    "position_desc": 81,
    "img_above_text": "# Bitter Lake Walkthrough\n\nAs you draw close, you'll hear a voice coming from the cymbals, who is arguing with a woman refusing to let the trapped person out. With a loud gong, the trapped \"Admiral\" will use the cymbal to awaken a giant turtle whose mountainous shell you're actually standing on.\n\nAs the turtle begins to swim through the Bitter Seal, the woman will become aware of your presence, starting this new region off with a bang of a boss fight.\n\n\nAs long as your patient to wait for the right moments to get in close and attack, and make sure you're using shock-quelling medicine, you'll be able to come out on top. Even as Kang-Jin Star tries to flee in her dragon form, the Destined One will see to it that she crashes into the large cymbals, freeing the prisoner inside!\n\nThis imprisoned Pig Guai is none other than Zhu Bajie, who traveled with Sun Wukong during his adventures in Journey to the West!\n\n\nAs you start exploring the path over to the right, an echoing voice will lead you to a large open platform where dragon humanoid figure appears to be frozen in place with its fishing rod. If you interact with it while holding the Loong Scales, it will crackle to life, and begin a new secret boss fight.\n\n\nWhen he falls, you'll earn some Fine Gold Thread and another Loong Pearl, and can loot a nearby chest that appears for the Mountain-Shaking Claw material and Breath of Fire Soak for your Gourd. This new material will unlock the upgrade path for your Loongwreathe Staff into the Golden Loong Staff, but you'll need to find and defeat the last of the four Loongs to craft it.\n\nOnce you've had your fill of exploring the \"Turtle Island\", you can head to the front where the small Pig Guai stands waiting, and interact with him for the turtle to finally make its landing at the next part of the Bitter Lake.\n\n\nStart by heading along the shore and defeating various Frozen Corpses, and look for a small building in the distance by the water's edge. As you near it, you can also spot a dragon man standing alone in the shallows. Zhu Bajie seems to know him, but as you approach, you'll be pulled into another boss fight.\n\n\nAs you head close to inspect the skull of the great snake, a Yaoguai Chief will fly down to intercept you: a much bigger version of the bats you've faced recently!\n\n## Yaoguai Chief Miniboss Fight - Apramana Bat\n\nAt the top of the stone stair path, there's a small side path leading back to a spot with a Ginsengling overlooking the enclosure, and a tunnel. Take the tunnel, and you'll find a shortcut back toward the North Shore Shrine, but first you'll need to deal with a few Monk Supporters holding their heavy stones.",
    "img_below_text": "The closest one in the tunnel entrance guards a **Treasure Chest** with a Mind Cor and materials inside, but try to take them on one at a time to make things easier. Follow the tunnel path to find a green Wisp, and it will empty out right at the larger tunnel entrance leading to the next main area.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bitter Lake Walkthrough\n            - Section Title: Yaoguai Chief Miniboss Fight - Apramana Bat\n\n            Context:\n            - Preceding Text: \"# Bitter Lake Walkthrough\n\nAs you draw close, you'll hear a voice coming from the cymbals, who is arguing with a woman refusing to let the trapped person out. With a loud gong, the trapped \"Admiral\" will use the cymbal to awaken a giant turtle whose mountainous shell you're actually standing on.\n\nAs the turtle begins to swim through the Bitter Seal, the woman will become aware of your presence, starting this new region off with a bang of a boss fight.\n\n\nAs long as your patient to wait for the right moments to get in close and attack, and make sure you're using shock-quelling medicine, you'll be able to come out on top. Even as Kang-Jin Star tries to flee in her dragon form, the Destined One will see to it that she crashes into the large cymbals, freeing the prisoner inside!\n\nThis imprisoned Pig Guai is none other than Zhu Bajie, who traveled with Sun Wukong during his adventures in Journey to the West!\n\n\nAs you start exploring the path over to the right, an echoing voice will lead you to a large open platform where dragon humanoid figure appears to be frozen in place with its fishing rod. If you interact with it while holding the Loong Scales, it will crackle to life, and begin a new secret boss fight.\n\n\nWhen he falls, you'll earn some Fine Gold Thread and another Loong Pearl, and can loot a nearby chest that appears for the Mountain-Shaking Claw material and Breath of Fire Soak for your Gourd. This new material will unlock the upgrade path for your Loongwreathe Staff into the Golden Loong Staff, but you'll need to find and defeat the last of the four Loongs to craft it.\n\nOnce you've had your fill of exploring the \"Turtle Island\", you can head to the front where the small Pig Guai stands waiting, and interact with him for the turtle to finally make its landing at the next part of the Bitter Lake.\n\n\nStart by heading along the shore and defeating various Frozen Corpses, and look for a small building in the distance by the water's edge. As you near it, you can also spot a dragon man standing alone in the shallows. Zhu Bajie seems to know him, but as you approach, you'll be pulled into another boss fight.\n\n\nAs you head close to inspect the skull of the great snake, a Yaoguai Chief will fly down to intercept you: a much bigger version of the bats you've faced recently!\n\n## Yaoguai Chief Miniboss Fight - Apramana Bat\n\nAt the top of the stone stair path, there's a small side path leading back to a spot with a Ginsengling overlooking the enclosure, and a tunnel. Take the tunnel, and you'll find a shortcut back toward the North Shore Shrine, but first you'll need to deal with a few Monk Supporters holding their heavy stones.\"\n            - Following Text: \"The closest one in the tunnel entrance guards a **Treasure Chest** with a Mind Cor and materials inside, but try to take them on one at a time to make things easier. Follow the tunnel path to find a green Wisp, and it will empty out right at the larger tunnel entrance leading to the next main area.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the progression of the Bitter Lake Walkthrough, including encounters with various bosses and exploration of Turtle Island. It introduces the Yaoguai Chief miniboss fight with the Apramana Bat, which occurs near the skull of a great snake. Players are guided to a stone stair path leading to a tunnel, where Monk Supporters guard a shortcut back to the North Shore Shrine.\n\nImage Summary:\nThe image depicts a player character approaching a treasure chest guarded by a Monk Supporter inside a dimly lit cave. The environment features rocky terrain and torchlight illuminating the tunnel. The red arrow highlights the treasure chest, indicating it as an important point of interest. The player's interface shows health, abilities, and items, suggesting active gameplay.\n\nFollowing Text Summary:\nThe following text elaborates on the tunnel exploration, advising players to defeat Monk Supporters one at a time for easier progression. It mentions a treasure chest containing a Mind Cor and materials, as well as a green Wisp further along the tunnel path. The tunnel leads to a larger entrance connected to the next main area."
}