{
    "chunk_id": 493989733773,
    "source_file": "Cyan_Loong.md",
    "h1_title": "Cyan Loong",
    "h2_title": "Cyan Loong Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7f/Wukong_Turtle_29.jpg",
    "alt_text": "Wukong Turtle 29.jpg",
    "position_desc": 7,
    "img_above_text": "# Cyan Loong\n\nCyan Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 3 of Black Myth Wukong. Hiding on the far side of Turtle Island this frozen boss can't be activated until you obtain a Key Item in the previous chapter. Cyan Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* Rewards: Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n\n\nYou can enter the crack in the wall, and on the other side you’ll find a chest containing the Loong Scales. With this item, you’ll be able to unlock the boss.\n\n## Cyan Loong Boss Fight and Guide\n\nExpect him to also utilize his sword slashes in simple 1 or 2 hit attacks, or use his lightning palm attack on its own. His sword swings aren't too fast, but they can blindside you if you aren't ready to break off your attacks or use up all your stamina.",
    "img_below_text": "Another dangerous attack he can launch with little warning only comes with a small tell -- when he quickly swaps his sword to hold in a reverse grip behind his back. He'll then quickly launch himself through the air at you with a spinning slash that can take a chunk off your health, and then dive back to your position after a moment for sword slice when he reaches the ground.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Cyan Loong\n            - Section Title: Cyan Loong Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Cyan Loong\n\nCyan Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 3 of Black Myth Wukong. Hiding on the far side of Turtle Island this frozen boss can't be activated until you obtain a Key Item in the previous chapter. Cyan Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* Rewards: Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n\n\nYou can enter the crack in the wall, and on the other side you’ll find a chest containing the Loong Scales. With this item, you’ll be able to unlock the boss.\n\n## Cyan Loong Boss Fight and Guide\n\nExpect him to also utilize his sword slashes in simple 1 or 2 hit attacks, or use his lightning palm attack on its own. His sword swings aren't too fast, but they can blindside you if you aren't ready to break off your attacks or use up all your stamina.\"\n            - Following Text: \"Another dangerous attack he can launch with little warning only comes with a small tell -- when he quickly swaps his sword to hold in a reverse grip behind his back. He'll then quickly launch himself through the air at you with a spinning slash that can take a chunk off your health, and then dive back to your position after a moment for sword slice when he reaches the ground.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Cyan Loong, a secret optional boss in Chapter 3 of *Black Myth Wukong*. This Yaoguai King is located on Turtle Island and requires the Loong Scales item to unlock. Defeating Cyan Loong rewards players with valuable crafting materials and items. The text also briefly describes some of the boss's basic attacks, including sword slashes and a lightning palm attack.\n\nImage Summary:  \nThe image depicts an in-game moment from the Cyan Loong boss fight in *Black Myth Wukong*. Cyan Loong, a large, imposing figure with antler-like horns, is mid-attack, holding a sword in a reverse grip. The player character is positioned below, seemingly dodging or preparing to counter. The snowy, mountainous environment emphasizes the dramatic and challenging nature of the encounter. A red arrow highlights the boss's sword grip, likely to draw attention to a specific attack pattern.\n\nFollowing Text Summary:  \nThe following text elaborates on one of Cyan Loong's dangerous attacks. It describes how the boss switches to a reverse sword grip (as shown in the image) before launching a spinning aerial slash, followed by a ground dive attack. This move is noted for its speed and high damage potential, making it a critical moment for players to anticipate and react."
}