{
    "chunk_id": 306950926805,
    "source_file": "Curios.md",
    "h1_title": "Curios",
    "h2_title": "Black Myth: Wukong Curios Locations",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0a/Wind_Chime_.jpg",
    "alt_text": "Wind Chime .jpg",
    "position_desc": 1,
    "img_above_text": "# Curios\n\nCurios in Black Myth: Wukong act as accessories, equipment you can equip to boost your stats or unlock new buffs. Most of these can be found in boxes throughout the game's chapters. However, some are dropped by bosses or unlocked in other, more unique ways.\n\nThese buffs range from minor, small boosts to more significant upgrades that are vital to your survival and taking on the tougher bosses hidden in the game.\n\n## Black Myth: Wukong Curios Locations\n\nBelow, you can find a list of all the Curios in the game, along with their locations. You can also click the links to find detailed breakdowns of each Curios item's location. In addition to our walkthrough, you can check each Curios accessory off below as you find them.\n\nImage | Curios | Rarity | Equipped Effect | Location | Collected\n---|---|---|---|---|---",
    "img_below_text": "",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Curios\n            - Section Title: Black Myth: Wukong Curios Locations\n\n            Context:\n            - Preceding Text: \"# Curios\n\nCurios in Black Myth: Wukong act as accessories, equipment you can equip to boost your stats or unlock new buffs. Most of these can be found in boxes throughout the game's chapters. However, some are dropped by bosses or unlocked in other, more unique ways.\n\nThese buffs range from minor, small boosts to more significant upgrades that are vital to your survival and taking on the tougher bosses hidden in the game.\n\n## Black Myth: Wukong Curios Locations\n\nBelow, you can find a list of all the Curios in the game, along with their locations. You can also click the links to find detailed breakdowns of each Curios item's location. In addition to our walkthrough, you can check each Curios accessory off below as you find them.\n\nImage | Curios | Rarity | Equipped Effect | Location | Collected\n---|---|---|---|---|---\"\n            - Following Text: \"\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the concept of \"Curios\" in the game \"Black Myth: Wukong.\" These are accessories that players can equip to enhance their stats or gain new buffs. Curios can be found in various locations throughout the game, such as in boxes, dropped by bosses, or unlocked through unique methods. They provide a range of buffs, from minor boosts to significant upgrades, which are crucial for progressing in the game and defeating tougher bosses.\n\nImage Summary:\nThe image likely depicts a specific Curio from the game \"Black Myth: Wukong.\" Its purpose is to visually represent one of the accessories that players can find and equip in the game. The image serves as a visual aid to help players identify and locate this particular Curio as they progress through the game.\n\nFollowing Text Summary:\nThe following text is not provided, but it is expected to continue the list of Curios in the game, detailing their locations, effects, and possibly their rarity. This section likely serves as a guide for players to track and collect all the Curios available in \"Black Myth: Wukong.\""
}