{
    "chunk_id": 225008502594,
    "source_file": "Black_Bear_Guai.md",
    "h1_title": "Black Bear Guai",
    "h2_title": "Black Bear Guai Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d5/Wukong_BlackWind_34.jpg",
    "alt_text": "Wukong BlackWind 34.jpg",
    "position_desc": 3,
    "img_above_text": "# Black Bear Guai\n\nThe Black Bear Guai is a required Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located at the very end of Chapter 1 at the top of Black Wind Mountain, this is the second of two forms you'll fight the self-imposed King. Now in the form of a giant bear, he'll harness the power of fire to try and burn you alive.\n\n* **Rewards:** Craving Eyes Relic, Flame Ebongold, Yarn x5, Silk x2, Spirit Stone x1, Yaoguai Core x1, Mind Core x1, 1641 Experience, 990 Will\n\n\nAs a required boss, you won't be able to miss running into the Black Wind King. You can find him at the very end of the chapter by progressing through Black Wind Cave and up the mountain, past all of the wolf defenses until you reach Bodhi Peak.\n\n## Black Bear Guai Boss Fight and Guide\n\nThere’s more than a few attack combos he can launch at close range, including two-hit swipes, which are sometimes followed by a raised foot slam afterward. Later in the fight, he can extend this combo with more slashes before finally slamming his foot down.\n\nHe can also simply belly flop down, requiring you to dodge to the side rather than backwards.This move can come from the front, as well as from the sides if he collapses on his side, meaning even if you aren’t attacking from the front you won’t automatically be safe.",
    "img_below_text": "One of the more easy attacks to punish will have him gallop around to your side before leaping into the air for a big diving attack. It will take him a few moments to get up off the ground and back into his neutral stance, which is a great time to use the Wight’s Spirit Attack to headbutt him for massive damage.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Black Bear Guai\n            - Section Title: Black Bear Guai Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Black Bear Guai\n\nThe Black Bear Guai is a required Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located at the very end of Chapter 1 at the top of Black Wind Mountain, this is the second of two forms you'll fight the self-imposed King. Now in the form of a giant bear, he'll harness the power of fire to try and burn you alive.\n\n* **Rewards:** Craving Eyes Relic, Flame Ebongold, Yarn x5, Silk x2, Spirit Stone x1, Yaoguai Core x1, Mind Core x1, 1641 Experience, 990 Will\n\n\nAs a required boss, you won't be able to miss running into the Black Wind King. You can find him at the very end of the chapter by progressing through Black Wind Cave and up the mountain, past all of the wolf defenses until you reach Bodhi Peak.\n\n## Black Bear Guai Boss Fight and Guide\n\nThere’s more than a few attack combos he can launch at close range, including two-hit swipes, which are sometimes followed by a raised foot slam afterward. Later in the fight, he can extend this combo with more slashes before finally slamming his foot down.\n\nHe can also simply belly flop down, requiring you to dodge to the side rather than backwards.This move can come from the front, as well as from the sides if he collapses on his side, meaning even if you aren’t attacking from the front you won’t automatically be safe.\"\n            - Following Text: \"One of the more easy attacks to punish will have him gallop around to your side before leaping into the air for a big diving attack. It will take him a few moments to get up off the ground and back into his neutral stance, which is a great time to use the Wight’s Spirit Attack to headbutt him for massive damage.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Black Bear Guai, a required boss fight in Chapter 1 of *Black Myth: Wukong*. This boss, encountered at the top of Black Wind Mountain, is the second form of the Yaoguai King and uses fire-based attacks. The text outlines the rewards for defeating the boss and briefly describes its location and progression to the fight.\n\nImage Summary:  \nThe image depicts an intense moment during the Black Bear Guai boss fight. The player character is engaged in combat with the massive bear-like creature, which is mid-attack, emitting fiery effects. The dark, atmospheric setting, combined with the glowing red eyes of the boss and the fire on the ground, emphasizes the danger and intensity of the encounter. The on-screen interface shows the boss's name, health bar, and player status, reinforcing the image's role as part of a gameplay sequence.\n\nFollowing Text Summary:  \nThe following text provides additional guidance on the boss's attack patterns, highlighting a punishable move where the Black Bear Guai leaps into the air for a diving attack. It notes the opportunity to counterattack while the boss recovers, suggesting the use of the Wight’s Spirit Attack for significant damage."
}