{
    "chunk_id": 282564157721,
    "source_file": "Blood_of_the_Iron_Bull.md",
    "h1_title": "Blood of the Iron Bull",
    "h2_title": "Blood of the Iron Bull Locations",
    "h3_title": "Blood of the Iron Bull Location 5",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d2/Blood_of_the_Iron_Bull_-_Specific_Location_Sandgate_Village_-_1.jpg",
    "alt_text": "Blood of the Iron Bull - Specific Location Sandgate Village - 1.jpg",
    "position_desc": 6,
    "img_above_text": "# Blood of the Iron Bull\n\n\nBlood of the Iron Bull materials can be used at the Shrines to upgrade your Spirits. Higher upgrades for them require more Blood of the Iron Bull materials, so it is important to find as many as you can.\n\nIf you are keen to know which Spirits you should level up, be sure to check out our guide on the best Spirits to use in the game, and for all their locations, visit our page on the Spirit Locations.\n\n## Blood of the Iron Bull Locations\n\nBelow, you can find a guide to each Blood of the Iron Bull location within the early-game, the majority of which are in chests or found from defeating bosses.\n\n\n\n\n\n### Blood of the Iron Bull Location 5\n\nThe next Blood of the Iron Bull is in Chapter 2, Yellow Wind Ridge. From the first Shrine: Village Entrance \\- Sandgate Village, head around to the edge of the cliff on the right (away from the archers on the gate's roof). After two tough mini-boss enemies, you will see a large hill in front of you. Head up it.",
    "img_below_text": "At the very top, on your left, there will be a chest with the Blood of the Iron Bull inside.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Blood of the Iron Bull\n            - Section Title: Blood of the Iron Bull Locations\n            - Sub-Section Title: Blood of the Iron Bull Location 5\n\n            Context:\n            - Preceding Text: \"# Blood of the Iron Bull\n\n\nBlood of the Iron Bull materials can be used at the Shrines to upgrade your Spirits. Higher upgrades for them require more Blood of the Iron Bull materials, so it is important to find as many as you can.\n\nIf you are keen to know which Spirits you should level up, be sure to check out our guide on the best Spirits to use in the game, and for all their locations, visit our page on the Spirit Locations.\n\n## Blood of the Iron Bull Locations\n\nBelow, you can find a guide to each Blood of the Iron Bull location within the early-game, the majority of which are in chests or found from defeating bosses.\n\n\n\n\n\n### Blood of the Iron Bull Location 5\n\nThe next Blood of the Iron Bull is in Chapter 2, Yellow Wind Ridge. From the first Shrine: Village Entrance \\- Sandgate Village, head around to the edge of the cliff on the right (away from the archers on the gate's roof). After two tough mini-boss enemies, you will see a large hill in front of you. Head up it.\"\n            - Following Text: \"At the very top, on your left, there will be a chest with the Blood of the Iron Bull inside.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the \"Blood of the Iron Bull\" as a collectible resource used to upgrade Spirits in the game. It emphasizes the importance of gathering these materials and provides a guide to their locations, particularly focusing on early-game areas where they can be found in chests or by defeating bosses.\n\nImage Summary:  \nThe image depicts a gameplay scene set in a rugged, mountainous environment with traditional-style buildings and barren trees. A character, equipped with a weapon, stands in the foreground, seemingly exploring the area. The setting aligns with the description of \"Chapter 2, Yellow Wind Ridge,\" and appears to guide players toward the next steps in locating the \"Blood of the Iron Bull\" collectible.\n\nFollowing Text Summary:  \nThe following text provides specific instructions for finding the collectible. It directs players to ascend a large hill visible in the area, where a chest containing the \"Blood of the Iron Bull\" can be found at the top, on the left."
}