{
    "chunk_id": 558545503863,
    "source_file": "Drunken_Boar_Questline.md",
    "h1_title": "Drunken Boar Questline",
    "h2_title": "Boss Fight - Yellow-Robed Squire",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/01/Wukong_Sahali_4.jpg",
    "alt_text": "Wukong Sahali 4.jpg",
    "position_desc": 13,
    "img_above_text": "# Drunken Boar Questline\n\nThe Drunken Boar (aka Drunken Pig or his official name, the Yellow-Robed Squire) is a character you can meet and also fight in Chapter 2 of Black Myth Wukong. This character will ask you to complete a side quest for him that will unlock Chapter 2’s Secret Area: The Kingdom of Sahali.\n\n\nIn this large open field, you’ll find a friendly boar-like Guai resting on a rock. He’s apparently extremely inebriated, and needs you to help him find something to sober him up. He’ll mention “**Windrest** ” if you talk to him again, providing a clue to where you can find such an ingredient.\n\n\nOn the left side when looking at the large building, defeat a Blazebone monster, and then look to the right for a **small alcove** , where you can spot a **glowing pot**. Break the pot, and you’ll find the **Sobering Stone**.\n\n\nThis “senior brother” is the First Prince of Flowing Sands — aka the giant rat Yaoguai Chief that you can fight in the **Valley of Despair** on the road from Sandgate Village to the **Crouching Tiger Temple**. If you didn’t kill the rat king, **he’ll summon the prince to fight you**. Otherwise, you can use the **Pungent Flesh Chunk** to summon and defeat him yourself.\n\nHe’ll drop the **Arhat Gold Piece** when defeated, which is the gold the Boar needs.\n\n\nThough he doesn’t say where he’s going, the Boar will actually return to **near where you first met him** at the **Rockrest Flat** area of the Fright Cliff. However, instead of sitting on a rock, he’ll now be standing over by the stairs leading to a large door you can’t access yet.\n\nUnfortunately, he’s not too pleased that you’re in possession of the gold, and the Yellow-Robed Squire will challenge you to a duel!\n\n## Boss Fight - Yellow-Robed Squire\n\nOther times, his third attack will have him extend his clawed hand back and charge up, before performing a dashing impaling thrust attack that covers a lot of ground quickly, so be ready to react when he lunges at you.",
    "img_below_text": "Another common attack combo he will perform will be to drag his claws slowly through the ground and pull them upward to attack and spread sand — which you can easily spot and deflect to interrupt him. If you don’t, he’ll charge forward through the sand to stab with his extended claws.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Drunken Boar Questline\n            - Section Title: Boss Fight - Yellow-Robed Squire\n\n            Context:\n            - Preceding Text: \"# Drunken Boar Questline\n\nThe Drunken Boar (aka Drunken Pig or his official name, the Yellow-Robed Squire) is a character you can meet and also fight in Chapter 2 of Black Myth Wukong. This character will ask you to complete a side quest for him that will unlock Chapter 2’s Secret Area: The Kingdom of Sahali.\n\n\nIn this large open field, you’ll find a friendly boar-like Guai resting on a rock. He’s apparently extremely inebriated, and needs you to help him find something to sober him up. He’ll mention “**Windrest** ” if you talk to him again, providing a clue to where you can find such an ingredient.\n\n\nOn the left side when looking at the large building, defeat a Blazebone monster, and then look to the right for a **small alcove** , where you can spot a **glowing pot**. Break the pot, and you’ll find the **Sobering Stone**.\n\n\nThis “senior brother” is the First Prince of Flowing Sands — aka the giant rat Yaoguai Chief that you can fight in the **Valley of Despair** on the road from Sandgate Village to the **Crouching Tiger Temple**. If you didn’t kill the rat king, **he’ll summon the prince to fight you**. Otherwise, you can use the **Pungent Flesh Chunk** to summon and defeat him yourself.\n\nHe’ll drop the **Arhat Gold Piece** when defeated, which is the gold the Boar needs.\n\n\nThough he doesn’t say where he’s going, the Boar will actually return to **near where you first met him** at the **Rockrest Flat** area of the Fright Cliff. However, instead of sitting on a rock, he’ll now be standing over by the stairs leading to a large door you can’t access yet.\n\nUnfortunately, he’s not too pleased that you’re in possession of the gold, and the Yellow-Robed Squire will challenge you to a duel!\n\n## Boss Fight - Yellow-Robed Squire\n\nOther times, his third attack will have him extend his clawed hand back and charge up, before performing a dashing impaling thrust attack that covers a lot of ground quickly, so be ready to react when he lunges at you.\"\n            - Following Text: \"Another common attack combo he will perform will be to drag his claws slowly through the ground and pull them upward to attack and spread sand — which you can easily spot and deflect to interrupt him. If you don’t, he’ll charge forward through the sand to stab with his extended claws.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Yellow-Robed Squire, a boss character in the \"Drunken Boar Questline\" of *Black Myth Wukong*. The player encounters this character after completing a series of tasks involving a Sobering Stone and Arhat Gold Piece. The Squire, initially a friendly but inebriated boar-like figure, challenges the player to a duel near the Rockrest Flat area.\n\nImage Summary:  \nThe image depicts an intense boss fight between the player character and the Yellow-Robed Squire in a rugged, open environment. The player, armed with a staff-like weapon, is engaged in combat with the towering boar-like boss, who appears mid-attack. The interface displays the boss's name and health bar, as well as the player's consumable items and abilities, emphasizing the dynamic and strategic nature of the encounter.\n\nFollowing Text Summary:  \nThe following text elaborates on the Yellow-Robed Squire's attack patterns, describing a claw-based combo where he drags his claws through the ground to spread sand and attack. The player can deflect this move to interrupt him or risk being hit by a follow-up charge and stab."
}