{
    "chunk_id": 607361921177,
    "source_file": "Dark_Thunder.md",
    "h1_title": "Dark Thunder",
    "h2_title": "Black Myth: Wukong Dark Thunder Location",
    "h3_title": "Horse Guai The New West Location",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1c/Wukong_Thunderclap_43.jpg",
    "alt_text": "Wukong Thunderclap 43.jpg",
    "position_desc": 3,
    "img_above_text": "# Dark Thunder\n\nDark Thunder is one of the Transformation Spells you can find in Black Myth: Wukong. It is one of the later game Transformations, found within the Flaming Mountains.\n\nWith the Dark Thunder Transformation, you are able to turn into a horse guai and be immune to Thunder Damage, inflicting Thunder Bane on the enemy with each attack. Any Focus built up before transformation can be converted for use afterward. Dark Thunder's moveset is:\n\n* **Light Attack: Lightning Lashes - Successively lash the enemy ahead, building up Focus**. This is a slow, weak light attack that is mostly used for building up Focus instead of dealing damage.\n* **Heavy Attack: Thunderbolt Sweep - Successively lash the enemies around, building up Focus**. This is a stronger attack, focused on dealing damage and building up Focus at the same time.\n\n## Black Myth: Wukong Dark Thunder Location\n\nThe Dark Thunder Spell can be found after visiting the Horse Guai at every location he appears at in the game:\n\n* Black Wind Mountain \\- Bamboo Grove - Back Hills (inside a cave)\n* Yellow Wind Ridge \\- Sandgate Village - Village Entrance (tied to a post by the Earth Wolf boss)\n* The New West \\- New Thunderclap Temple - Temple Entrance (on the walkway in the back left of the temple grounds)\n* The Webbed Hollow \\- Webbed Hollow - Middle Hollow (in a cocoon in the area behind the Centipede Guai)\n* Flaming Mountains \\- Furnace Valley - Valley Entrance (found after killing Keeper of Flaming Mountains)\n\nUpon finding the Horse Guai for this final time, you can pull the chain in the mouth of the elemental cart next to them to obtain the Spell.\n\n\n\n### Horse Guai The New West Location\n\nAs you progress through the temple, you will eventually meet two mages with a large door behind them. Before heading ahead, take the path along the balcony on the left, to a walkway with a large statue. The Horse Guai is standing by one of these pillars on the walkway.",
    "img_below_text": "",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Dark Thunder\n            - Section Title: Black Myth: Wukong Dark Thunder Location\n            - Sub-Section Title: Horse Guai The New West Location\n\n            Context:\n            - Preceding Text: \"# Dark Thunder\n\nDark Thunder is one of the Transformation Spells you can find in Black Myth: Wukong. It is one of the later game Transformations, found within the Flaming Mountains.\n\nWith the Dark Thunder Transformation, you are able to turn into a horse guai and be immune to Thunder Damage, inflicting Thunder Bane on the enemy with each attack. Any Focus built up before transformation can be converted for use afterward. Dark Thunder's moveset is:\n\n* **Light Attack: Lightning Lashes - Successively lash the enemy ahead, building up Focus**. This is a slow, weak light attack that is mostly used for building up Focus instead of dealing damage.\n* **Heavy Attack: Thunderbolt Sweep - Successively lash the enemies around, building up Focus**. This is a stronger attack, focused on dealing damage and building up Focus at the same time.\n\n## Black Myth: Wukong Dark Thunder Location\n\nThe Dark Thunder Spell can be found after visiting the Horse Guai at every location he appears at in the game:\n\n* Black Wind Mountain \\- Bamboo Grove - Back Hills (inside a cave)\n* Yellow Wind Ridge \\- Sandgate Village - Village Entrance (tied to a post by the Earth Wolf boss)\n* The New West \\- New Thunderclap Temple - Temple Entrance (on the walkway in the back left of the temple grounds)\n* The Webbed Hollow \\- Webbed Hollow - Middle Hollow (in a cocoon in the area behind the Centipede Guai)\n* Flaming Mountains \\- Furnace Valley - Valley Entrance (found after killing Keeper of Flaming Mountains)\n\nUpon finding the Horse Guai for this final time, you can pull the chain in the mouth of the elemental cart next to them to obtain the Spell.\n\n\n\n### Horse Guai The New West Location\n\nAs you progress through the temple, you will eventually meet two mages with a large door behind them. Before heading ahead, take the path along the balcony on the left, to a walkway with a large statue. The Horse Guai is standing by one of these pillars on the walkway.\"\n            - Following Text: \"\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Dark Thunder Transformation Spell in the game Black Myth: Wukong. This spell allows players to transform into a horse guai, granting immunity to Thunder Damage and enabling them to inflict Thunder Bane on enemies. The text also details the locations where players can find the Horse Guai to obtain the spell, including The New West location at the New Thunderclap Temple.\n\nImage Summary:\nThe image depicts a scene from Black Myth: Wukong, showing a character standing on a wooden walkway within a temple setting. The character appears to be the Horse Guai, a key figure in obtaining the Dark Thunder Transformation Spell. The environment suggests a snowy backdrop, consistent with the description of The New West location at the New Thunderclap Temple.\n\nFollowing Text Summary:\nThe following text provides guidance on navigating the temple to find the Horse Guai. It describes encountering two mages and a large door, advising players to take a path along the balcony to reach the walkway where the Horse Guai is located, near a large statue."
}