{
    "chunk_id": 579644661576,
    "source_file": "Yarn.md",
    "h1_title": "Yarn",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/28/Yarn.jpg",
    "alt_text": "Yarn.jpg",
    "position_desc": 1,
    "img_above_text": "# Yarn\n\nYarn is one of the uncommon Crafting Materials in Black Myth: Wukong. It is primarily used to upgrade your Armor and Gear and unlock new sets as you make your way through the game. Compared to many of the other materials in the game, including Silk, which is also needed to upgrade your armor and gear, it is quite common.",
    "img_below_text": "Even still, below, on this page, we will go over the most common places to find Yarn throughout the game. In addition to Silk, the other main materials you will need to find while playing are some of the main boss materials which drop upon killing them. Most mandatory bosses and side bosses will drop one of these Crafting Materials which you can use to get new weapons alongside your new armor sets.\n\n## Black Myth: Wukong Yarn Locations\n\nYarn can be found and obtained in the following places and ways in Black Myth: Wukong:\n\n* Found in chests\n* Randomly Dropped from Yaoguai Chiefs, Kings, and enemies\n* Bought in the Shrine store\n* Reward for completing chapters of the game\n\nYarn can be obtained right from the start of the game in Black Wind Mountain. Unlike some of the other Crafting Materials and Medicine Ingredients, there isn't a plant that you can harvest Yarn from. So, all your Yarn will need to be obtained from enemies.\n\nThankfully, the material is so common you can farm it anywhere by resting at Shrines and respawning the enemies in the area. But, Black Wind Mountain and Yellow Wind Ridge are where you will find it most.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Yarn\n\n            Context:\n            - Preceding Text: \"# Yarn\n\nYarn is one of the uncommon Crafting Materials in Black Myth: Wukong. It is primarily used to upgrade your Armor and Gear and unlock new sets as you make your way through the game. Compared to many of the other materials in the game, including Silk, which is also needed to upgrade your armor and gear, it is quite common.\"\n            - Following Text: \"Even still, below, on this page, we will go over the most common places to find Yarn throughout the game. In addition to Silk, the other main materials you will need to find while playing are some of the main boss materials which drop upon killing them. Most mandatory bosses and side bosses will drop one of these Crafting Materials which you can use to get new weapons alongside your new armor sets.\n\n## Black Myth: Wukong Yarn Locations\n\nYarn can be found and obtained in the following places and ways in Black Myth: Wukong:\n\n* Found in chests\n* Randomly Dropped from Yaoguai Chiefs, Kings, and enemies\n* Bought in the Shrine store\n* Reward for completing chapters of the game\n\nYarn can be obtained right from the start of the game in Black Wind Mountain. Unlike some of the other Crafting Materials and Medicine Ingredients, there isn't a plant that you can harvest Yarn from. So, all your Yarn will need to be obtained from enemies.\n\nThankfully, the material is so common you can farm it anywhere by resting at Shrines and respawning the enemies in the area. But, Black Wind Mountain and Yellow Wind Ridge are where you will find it most.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}