{
    "chunk_id": 632140533853,
    "source_file": "Blood_of_the_Iron_Bull.md",
    "h1_title": "Blood of the Iron Bull",
    "h2_title": "Blood of the Iron Bull Locations",
    "h3_title": "Blood of the Iron Bull Location 8",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/8d/Blood_of_the_Iron_Bull_-_Specific_Location_Crouching_Tiger_Temple.jpg",
    "alt_text": "Blood of the Iron Bull - Specific Location Crouching Tiger Temple.jpg",
    "position_desc": 10,
    "img_above_text": "# Blood of the Iron Bull\n\n\nBlood of the Iron Bull materials can be used at the Shrines to upgrade your Spirits. Higher upgrades for them require more Blood of the Iron Bull materials, so it is important to find as many as you can.\n\nIf you are keen to know which Spirits you should level up, be sure to check out our guide on the best Spirits to use in the game, and for all their locations, visit our page on the Spirit Locations.\n\n## Blood of the Iron Bull Locations\n\nBelow, you can find a guide to each Blood of the Iron Bull location within the early-game, the majority of which are in chests or found from defeating bosses.\n\n\n\n\n\n\n\n\n### Blood of the Iron Bull Location 8\n\nThe next Blood of the Iron Bull can be found at the Crouching Tiger Temple \\- Temple Entrance Shrine in Yellow Wind Ridge. Head up the stairs, and once you are about halfway up, turn to your right, and you will see a chest. Inside this chest is the material.",
    "img_below_text": "",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Blood of the Iron Bull\n            - Section Title: Blood of the Iron Bull Locations\n            - Sub-Section Title: Blood of the Iron Bull Location 8\n\n            Context:\n            - Preceding Text: \"# Blood of the Iron Bull\n\n\nBlood of the Iron Bull materials can be used at the Shrines to upgrade your Spirits. Higher upgrades for them require more Blood of the Iron Bull materials, so it is important to find as many as you can.\n\nIf you are keen to know which Spirits you should level up, be sure to check out our guide on the best Spirits to use in the game, and for all their locations, visit our page on the Spirit Locations.\n\n## Blood of the Iron Bull Locations\n\nBelow, you can find a guide to each Blood of the Iron Bull location within the early-game, the majority of which are in chests or found from defeating bosses.\n\n\n\n\n\n\n\n\n### Blood of the Iron Bull Location 8\n\nThe next Blood of the Iron Bull can be found at the Crouching Tiger Temple \\- Temple Entrance Shrine in Yellow Wind Ridge. Head up the stairs, and once you are about halfway up, turn to your right, and you will see a chest. Inside this chest is the material.\"\n            - Following Text: \"\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the \"Blood of the Iron Bull\" materials, which are used to upgrade Spirits in the game. It emphasizes the importance of collecting these materials, as higher upgrades require more resources. The text also provides a guide to the locations of these materials, focusing on early-game areas, often found in chests or obtained from defeating bosses.\n\nImage Summary:  \nThe image depicts a player character standing in a sunlit, ancient temple-like environment. The setting features stone stairs, weathered architecture, and a shrine in the distance, which aligns with the description of the \"Crouching Tiger Temple - Temple Entrance Shrine\" in Yellow Wind Ridge. The player appears to be exploring the area, likely in search of the chest containing the \"Blood of the Iron Bull\" material.\n\nFollowing Text Summary:  \nThe following text specifies the exact location of the \"Blood of the Iron Bull\" material at the Crouching Tiger Temple. It instructs players to ascend the stairs, turn right halfway up, and open a chest to obtain the material."
}