{
    "chunk_id": 118071437791,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "h1_title": "The Forest of Wolves",
    "h2_title": "Front Hills",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/04/Wukong_Wolves_14.jpg",
    "alt_text": "Wukong Wolves 14.jpg",
    "position_desc": 22,
    "img_above_text": "# The Forest of Wolves\n\nWith both enemies dead, you should start to notice a trail of gold leading you down the main path toward a shrine in a small rocky ravine.\n\nThese Shrines are your checkpoints, and offering incense at them will allow you to rest up, refill your healing gourd, travel to other shrines, and much more (some enemies — but not all — will respawn as well). You’ll also meet the owner of the voice on the wind - the Keeper of Black Wind Mountain.\n\nThis friendly guy will be your guide and mentor for this part of the world, and will bid you to set out in search of Guanyin Temple, which burned down long ago but has since been rebuilt - but not by human hands. As the Keeper departs, he’ll bestow you with the Incense Trail Talisman, which can let you warp back to the last Shrine you rested at.\n\n## Front Hills\n\nFurther down by the stream, you can spy a curious sight - a small Rat Guai will be looking around a small stone statue head at the end of the stream, before scurrying out of sight. If you go to check out what he was interacting with, you can touch the stone head to gain the **Skandha of Form** Key Item. Its purpose isn’t known just yet, but might be worth hanging onto…\n\nHead upstream to find another Purple **Lingzhi** by a broken tree, and two Wolf Scouts off to the right of the stream guarding a **Gentian** plant.",
    "img_below_text": "Where the stream widens and is full of more statue heads, you’ll encounter a few Frog Guai called a Croaky. They will hop toward you with sword in hand, and pause in midair before slicing forward, giving you a clear moment to dodge around them and counter. Just be sure you back away after killing one, as they’ll explode on death with poison gas.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: The Forest of Wolves\n            - Section Title: Front Hills\n\n            Context:\n            - Preceding Text: \"# The Forest of Wolves\n\nWith both enemies dead, you should start to notice a trail of gold leading you down the main path toward a shrine in a small rocky ravine.\n\nThese Shrines are your checkpoints, and offering incense at them will allow you to rest up, refill your healing gourd, travel to other shrines, and much more (some enemies — but not all — will respawn as well). You’ll also meet the owner of the voice on the wind - the Keeper of Black Wind Mountain.\n\nThis friendly guy will be your guide and mentor for this part of the world, and will bid you to set out in search of Guanyin Temple, which burned down long ago but has since been rebuilt - but not by human hands. As the Keeper departs, he’ll bestow you with the Incense Trail Talisman, which can let you warp back to the last Shrine you rested at.\n\n## Front Hills\n\nFurther down by the stream, you can spy a curious sight - a small Rat Guai will be looking around a small stone statue head at the end of the stream, before scurrying out of sight. If you go to check out what he was interacting with, you can touch the stone head to gain the **Skandha of Form** Key Item. Its purpose isn’t known just yet, but might be worth hanging onto…\n\nHead upstream to find another Purple **Lingzhi** by a broken tree, and two Wolf Scouts off to the right of the stream guarding a **Gentian** plant.\"\n            - Following Text: \"Where the stream widens and is full of more statue heads, you’ll encounter a few Frog Guai called a Croaky. They will hop toward you with sword in hand, and pause in midair before slicing forward, giving you a clear moment to dodge around them and counter. Just be sure you back away after killing one, as they’ll explode on death with poison gas.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the \"Front Hills\" section of *The Forest of Wolves*. It describes a stream area where players can interact with a stone statue head to acquire the **Skandha of Form** Key Item. Nearby, a Purple **Lingzhi** and a **Gentian** plant are guarded by two Wolf Scouts, setting the stage for exploration and potential combat.\n\nImage Summary:  \nThe image depicts an action scene in a forested stream area. A player character, armed with a pole weapon, is engaged in combat with a small, humanoid creature mid-leap, likely a Rat Guai or similar enemy. The environment features moss-covered rocks, flowing water, and dense vegetation, emphasizing the natural and immersive setting. The on-screen HUD elements suggest this is gameplay footage, highlighting combat mechanics and resource management.\n\nFollowing Text Summary:  \nThe following text describes the next area where the stream widens and contains more statue heads. Players will encounter Frog Guai enemies called Croakies, which attack with a leaping sword strike. These enemies release poison gas upon death, requiring strategic movement and timing during combat."
}