{
    "chunk_id": 740209144478,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "h1_title": "Furnace Valley Walkthrough",
    "h2_title": "The Emerald Hall",
    "h3_title": "Missable Transformation Spell",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0c/Furnace_Valley_Walkthrough_%2897%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(97\\).png",
    "position_desc": 51,
    "img_above_text": "# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n\nOpen the giant door at the top of the stairs. Go straight ahead and activate the Rakshasa Palace Keeper's Shrine.\n\n\nInside here, you'll find the old man who gave you the gourd at the start of the game and an Awaken Wine Worm to the left.\n\nSpeak to the old man, and he'll tell you to find yourself a decent gourd (if you haven't already upgraded yours fully) and you can share a drink with him.\n\n\n## The Emerald Hall\n\nFrom The Emerald Hall Keeper's Shrine, go left and up the stairs. A cutscene will start to play, where you'll transform into a Cicada and fly toward the center of the hall. This is where you'll find Pingping speaking to her mother, Rakshasi, accompanied by the Keeper of the Flaming Mountains.\n\nAfter they discuss The Destined One obtaining the relics, the Keeper of the Flaming Mountains offers to care for Rakshashi, which Pingping protests. After he binds Pingping, Rakshashi is revealed to be Zhu Bajie transformed and it's time to take on the Keeper of the Flaming Mountains for yourself.\n\n\nWhen he's almost dead, he will then summon Ma Tianba for you to fight against.\n\n### Missable Transformation Spell\n\nYou'll see the Yin-Yang Fish rear itself up from the water and spray a jet at you, or flip itself up and over, to try and hit you with a tail flick. Staying close to it will stop it from being able to hit you with the jet spray, but will make it more likely to try and tail-whip you.\n\nIt will also use projectiles and throw out orbs to chase you down. These can be dodged or outrun in a similar manner to that of the Keeper of the Flaming Mountain's attacks.",
    "img_below_text": "When you've knocked its health down to almost halfway, it will begin to move quite erratically and cover a large amount of distance across the arena. Use Cloudstep to catch up to it and sneakily attack and Immobilize to temporarily halt it from darting off.\n\nThis is also when it will begin to float up in the air and throw the projectiles down. You'll need to dodge in quick succession to avoid these.\n\nOnce you've beaten the Keeper of the Flaming Mountains and the Yin-Yang Fish, you'll be returned to The Emerald Hall.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Furnace Valley Walkthrough\n            - Section Title: The Emerald Hall\n            - Sub-Section Title: Missable Transformation Spell\n\n            Context:\n            - Preceding Text: \"# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n\nOpen the giant door at the top of the stairs. Go straight ahead and activate the Rakshasa Palace Keeper's Shrine.\n\n\nInside here, you'll find the old man who gave you the gourd at the start of the game and an Awaken Wine Worm to the left.\n\nSpeak to the old man, and he'll tell you to find yourself a decent gourd (if you haven't already upgraded yours fully) and you can share a drink with him.\n\n\n## The Emerald Hall\n\nFrom The Emerald Hall Keeper's Shrine, go left and up the stairs. A cutscene will start to play, where you'll transform into a Cicada and fly toward the center of the hall. This is where you'll find Pingping speaking to her mother, Rakshasi, accompanied by the Keeper of the Flaming Mountains.\n\nAfter they discuss The Destined One obtaining the relics, the Keeper of the Flaming Mountains offers to care for Rakshashi, which Pingping protests. After he binds Pingping, Rakshashi is revealed to be Zhu Bajie transformed and it's time to take on the Keeper of the Flaming Mountains for yourself.\n\n\nWhen he's almost dead, he will then summon Ma Tianba for you to fight against.\n\n### Missable Transformation Spell\n\nYou'll see the Yin-Yang Fish rear itself up from the water and spray a jet at you, or flip itself up and over, to try and hit you with a tail flick. Staying close to it will stop it from being able to hit you with the jet spray, but will make it more likely to try and tail-whip you.\n\nIt will also use projectiles and throw out orbs to chase you down. These can be dodged or outrun in a similar manner to that of the Keeper of the Flaming Mountain's attacks.\"\n            - Following Text: \"When you've knocked its health down to almost halfway, it will begin to move quite erratically and cover a large amount of distance across the arena. Use Cloudstep to catch up to it and sneakily attack and Immobilize to temporarily halt it from darting off.\n\nThis is also when it will begin to float up in the air and throw the projectiles down. You'll need to dodge in quick succession to avoid these.\n\nOnce you've beaten the Keeper of the Flaming Mountains and the Yin-Yang Fish, you'll be returned to The Emerald Hall.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the player's progression in the walkthrough of *Furnace Valley*. After defeating two of the Five Element Carts, the player revisits key locations and characters to advance the narrative. Upon entering The Emerald Hall, a cutscene introduces significant characters, including Pingping, Rakshasi (revealed to be Zhu Bajie), and the Keeper of the Flaming Mountains, leading to a boss battle. The Yin-Yang Fish is introduced as part of this encounter, with its attacks and mechanics briefly outlined.\n\nImage Summary:\nThe image depicts the Yin-Yang Fish, a large, dark aquatic creature emerging from reflective water in a serene yet ominous setting. The background features towering structures with intricate designs, suspended in a misty, ethereal atmosphere. This visual likely represents the arena where the player battles the Yin-Yang Fish, emphasizing its imposing presence and the mystical environment.\n\nFollowing Text Summary:\nThe following text elaborates on the Yin-Yang Fish's behavior during the battle. As its health decreases, it becomes erratic, moving rapidly across the arena and floating to launch projectiles. The player must use specific abilities like Cloudstep and Immobilize to counter these movements and attacks. After defeating the Keeper of the Flaming Mountains and the Yin-Yang Fish, the player is returned to The Emerald Hall."
}