{
    "chunk_id": 615177305107,
    "source_file": "Cyan_Loong.md",
    "h1_title": "Cyan Loong",
    "h2_title": "Cyan Loong Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bf/Wukong_Turtle_32.jpg",
    "alt_text": "Wukong Turtle 32.jpg",
    "position_desc": 11,
    "img_above_text": "# Cyan Loong\n\nCyan Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 3 of Black Myth Wukong. Hiding on the far side of Turtle Island this frozen boss can't be activated until you obtain a Key Item in the previous chapter. Cyan Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* Rewards: Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n\n\nYou can enter the crack in the wall, and on the other side you’ll find a chest containing the Loong Scales. With this item, you’ll be able to unlock the boss.\n\n## Cyan Loong Boss Fight and Guide\n\nThe good news is with his form only slightly bigger than yours, the Cyan Loong is fairly susceptible to being staggered. Even a full Light Combo can send him stumbling backward, which you can mix in with a varied combo and follow up from the Smash Stance, stagger his sword swings with Rock Solid, and use a bulky Spirit attack like the Second Rat Prince to send him sprawling again and again and limit his ability to attack back.",
    "img_below_text": "However, once you manage to get his health down to around half, he'll imbue his sword with electricity in drawn out flourish, ending with him stabbing the sword into the ground to send up electric blasts all around him. You can try poking him from a distance with the Thrust Stance but be wary not to get too close.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Cyan Loong\n            - Section Title: Cyan Loong Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Cyan Loong\n\nCyan Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 3 of Black Myth Wukong. Hiding on the far side of Turtle Island this frozen boss can't be activated until you obtain a Key Item in the previous chapter. Cyan Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* Rewards: Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n\n\nYou can enter the crack in the wall, and on the other side you’ll find a chest containing the Loong Scales. With this item, you’ll be able to unlock the boss.\n\n## Cyan Loong Boss Fight and Guide\n\nThe good news is with his form only slightly bigger than yours, the Cyan Loong is fairly susceptible to being staggered. Even a full Light Combo can send him stumbling backward, which you can mix in with a varied combo and follow up from the Smash Stance, stagger his sword swings with Rock Solid, and use a bulky Spirit attack like the Second Rat Prince to send him sprawling again and again and limit his ability to attack back.\"\n            - Following Text: \"However, once you manage to get his health down to around half, he'll imbue his sword with electricity in drawn out flourish, ending with him stabbing the sword into the ground to send up electric blasts all around him. You can try poking him from a distance with the Thrust Stance but be wary not to get too close.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Cyan Loong, a secret Yaoguai King boss in *Black Myth Wukong*, encountered in Chapter 3 on Turtle Island. Players must obtain the Loong Scales from a chest to unlock the fight. Cyan Loong is one of four dragons that drop rare crafting materials and is susceptible to stagger attacks, making varied combos and bulky Spirit attacks effective strategies.\n\nImage Summary:\nThe image depicts the Cyan Loong boss fight in *Black Myth Wukong*. The player character is engaged in combat with Cyan Loong, who is unleashing a powerful energy attack, likely involving ice or electricity, as suggested by the glowing effects and frozen environment. The health bar labeled \"Cyan Loong\" indicates the ongoing battle, while the game's interface displays abilities and resources available to the player.\n\nFollowing Text Summary:\nThe following text explains that once Cyan Loong's health is reduced to half, he imbues his sword with electricity and performs a ground-stabbing attack that generates electric blasts. Players are advised to use ranged attacks like the Thrust Stance while maintaining distance to avoid damage."
}