{
    "chunk_id": 822986559538,
    "source_file": "Chen_Loong.md",
    "h1_title": "Chen Loong",
    "h2_title": "Where to Find Chen Loong",
    "h3_title": "Chen Loong Boss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2e/Wukong_Bitter_10.jpg",
    "alt_text": "Wukong Bitter 10.jpg",
    "position_desc": 10,
    "img_above_text": "# Chen Loong\n\nChen Loong is a character and possible boss fight first found in Chapter 3 of Black Myth Wukong. Though initially hostile, you can perform a task after defeating him in combat to unlock a Painted Realm where you can quickly access multiple merchants and services.\n\n* **Rewards:** TBA\n\n## Where to Find Chen Loong\n\nChen Loong is an optional opponent who has their own quest, which you can find shortly after leaving Turtle Rock for the North Shore of the Bitter Lake. From the Shrine, head left while facing it to head along the lakeshore toward a lone shack by the water.\n\nSearch the shallows near this shack, and you'll find the old dragon wandering the waters, and will become hostile as you approach.\n\n### Chen Loong Boss Fight and Guide\n\nThe dragon won't just stop at wacking you with his tail up close, either. If he proclaims \"To the deepest trench I dive!\" Be ready for him to stick his tail in the ground, only for several giant electrified tails to sprout up in a cluster nearby. You'll need to quickly break off your attack and give them a wide berth, as they'll quickly perform a single huge spin attack all at once!",
    "img_below_text": "Other times, he may only summon one smaller tail, but this one can expel its electrical energy in a projectile blast when the tail swings.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chen Loong\n            - Section Title: Where to Find Chen Loong\n            - Sub-Section Title: Chen Loong Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Chen Loong\n\nChen Loong is a character and possible boss fight first found in Chapter 3 of Black Myth Wukong. Though initially hostile, you can perform a task after defeating him in combat to unlock a Painted Realm where you can quickly access multiple merchants and services.\n\n* **Rewards:** TBA\n\n## Where to Find Chen Loong\n\nChen Loong is an optional opponent who has their own quest, which you can find shortly after leaving Turtle Rock for the North Shore of the Bitter Lake. From the Shrine, head left while facing it to head along the lakeshore toward a lone shack by the water.\n\nSearch the shallows near this shack, and you'll find the old dragon wandering the waters, and will become hostile as you approach.\n\n### Chen Loong Boss Fight and Guide\n\nThe dragon won't just stop at wacking you with his tail up close, either. If he proclaims \"To the deepest trench I dive!\" Be ready for him to stick his tail in the ground, only for several giant electrified tails to sprout up in a cluster nearby. You'll need to quickly break off your attack and give them a wide berth, as they'll quickly perform a single huge spin attack all at once!\"\n            - Following Text: \"Other times, he may only summon one smaller tail, but this one can expel its electrical energy in a projectile blast when the tail swings.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Chen Loong as a character and optional boss in *Black Myth Wukong*. Players can find him near the North Shore of the Bitter Lake after leaving Turtle Rock. The text provides guidance on locating him and warns of his hostility upon approach. It also begins to describe his combat mechanics, highlighting a specific attack where he summons electrified tails that spin in a powerful area-of-effect move.\n\nImage Summary:  \nThe image depicts an intense moment during the boss fight with Chen Loong. The scene shows the player character facing the dragon-like boss in a watery environment, with bright, electrified energy dominating the screen. This visual likely corresponds to the described attack where Chen Loong summons electrified tails to unleash a powerful spin or energy-based assault. The player’s health and ability HUD are visible, emphasizing the combat scenario.\n\nFollowing Text Summary:  \nThe following text continues detailing Chen Loong’s combat mechanics, describing another attack where he summons a smaller tail capable of releasing an electrical projectile. This elaborates on the variety of his abilities and the challenges players face during the fight."
}