{
    "chunk_id": 817194304868,
    "source_file": "Fuban.md",
    "h1_title": "Fuban",
    "h2_title": "Where to Find Fuban",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7b/Wukong_Sahali_10.jpg",
    "alt_text": "Wukong Sahali 10.jpg",
    "position_desc": 10,
    "img_above_text": "# Fuban\n\nFuban is a secret optional Yaoguai King boss fight that you can encounter in Chapter 2's secret area in Black Myth Wukong. Located in the Kingdom of Sahali locked away in the past, you'll need to help fulfill a drunken Boar's quest to access this area.\n\n* **Rewards:** Wind Tamer, Sky-Piercing Horn\n\n## Where to Find Fuban\n\nThe Boar will actually return to near where you first met him at the Rockrest Flat area of the Fright Cliff. However, instead of sitting on a rock, he’ll now be standing over by the stairs leading to a large door you can’t access yet.\n\nUnfortunately, he’s not too pleased that you’re in possession of the gold, and will challenge you to a duel. Upon defeat, he’ll relent and offer to let you join him in exploring the Realm of Gold together, before vanishing off behind the giant gate up the stairs.",
    "img_below_text": "Once you follow him through the large gate with the small crawlspace, you’ll find yourself overlooking an ancient and forgotten kingdom, and suddenly be transported into the past and into the Kingdom of Sahali.\n\nAfter besting the \"Tiger Vanguard\", you'll find none other than the Yellow Rat Sage, who needs your help defeating a giant scarab Guai in the sands below.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fuban\n            - Section Title: Where to Find Fuban\n\n            Context:\n            - Preceding Text: \"# Fuban\n\nFuban is a secret optional Yaoguai King boss fight that you can encounter in Chapter 2's secret area in Black Myth Wukong. Located in the Kingdom of Sahali locked away in the past, you'll need to help fulfill a drunken Boar's quest to access this area.\n\n* **Rewards:** Wind Tamer, Sky-Piercing Horn\n\n## Where to Find Fuban\n\nThe Boar will actually return to near where you first met him at the Rockrest Flat area of the Fright Cliff. However, instead of sitting on a rock, he’ll now be standing over by the stairs leading to a large door you can’t access yet.\n\nUnfortunately, he’s not too pleased that you’re in possession of the gold, and will challenge you to a duel. Upon defeat, he’ll relent and offer to let you join him in exploring the Realm of Gold together, before vanishing off behind the giant gate up the stairs.\"\n            - Following Text: \"Once you follow him through the large gate with the small crawlspace, you’ll find yourself overlooking an ancient and forgotten kingdom, and suddenly be transported into the past and into the Kingdom of Sahali.\n\nAfter besting the \"Tiger Vanguard\", you'll find none other than the Yellow Rat Sage, who needs your help defeating a giant scarab Guai in the sands below.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Fuban, a secret optional boss in *Black Myth: Wukong*, encountered in Chapter 2's hidden area within the Kingdom of Sahali. To access this area, players must assist a drunken Boar character with his quest. The Boar later challenges the player to a duel near the Rockrest Flat area of Fright Cliff, after which he allows access to the Realm of Gold through a large gate.\n\nImage Summary:  \nThe image depicts the Boar character standing near a large, weathered stone door, likely the gate mentioned in the preceding text. The Boar's posture and proximity to the door suggest he is preparing to grant access to the Realm of Gold after the player's duel victory.\n\nFollowing Text Summary:  \nThe following text describes the next stage of the journey after entering the large gate. Players are transported to the Kingdom of Sahali in the past, where they encounter the \"Tiger Vanguard\" and later the Yellow Rat Sage, who seeks assistance in defeating a giant scarab enemy in the sands below."
}