{
    "chunk_id": 608625160660,
    "source_file": "Enslaved_Yaksha_Spirit.md",
    "h1_title": "Enslaved Yaksha Spirit",
    "h2_title": "Enslaved Yaksha Spirit",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/55/Enslaved_yaksha.png",
    "alt_text": "Enslaved yaksha.png",
    "position_desc": 3,
    "img_above_text": "# Enslaved Yaksha Spirit\n\n\nDefeat the boss to unlock the purple seals preventing you from entering all of the jail cells in the Pagoda. The Enslaved Yaksha is locked inside one of these cells.\n\nFollow our guide on how to remove the purple seals from the Pagoda cells if you're having trouble finding the boss!\n\n\nThe Enslaved Yaksha is armed with a massive metal spike, and he's not afraid to use it. The sheer size of the spike means the Enslaved Yaksha has a lot of reach. Use Immobilize to freeze him in place so you can wail on him safely and watch out for the other enemies that lurk in the cell with him.\n\n## Enslaved Yaksha Spirit",
    "img_below_text": "* **Mutilate**\n* Equipped Effect: Grants a moderate amount of Focus when hit.\n\nThe Enslaved Yaksha's Spirit Power allows you to take his form and stab your enemy with the long spike he wields. This deals initial impact damage while also staggering the enemy so you can land another combo before they get up. The equipped effect allows you build Focus when you take damage, so getting hit doesn't sting quite so bad.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Enslaved Yaksha Spirit\n            - Section Title: Enslaved Yaksha Spirit\n\n            Context:\n            - Preceding Text: \"# Enslaved Yaksha Spirit\n\n\nDefeat the boss to unlock the purple seals preventing you from entering all of the jail cells in the Pagoda. The Enslaved Yaksha is locked inside one of these cells.\n\nFollow our guide on how to remove the purple seals from the Pagoda cells if you're having trouble finding the boss!\n\n\nThe Enslaved Yaksha is armed with a massive metal spike, and he's not afraid to use it. The sheer size of the spike means the Enslaved Yaksha has a lot of reach. Use Immobilize to freeze him in place so you can wail on him safely and watch out for the other enemies that lurk in the cell with him.\n\n## Enslaved Yaksha Spirit\"\n            - Following Text: \"* **Mutilate**\n* Equipped Effect: Grants a moderate amount of Focus when hit.\n\nThe Enslaved Yaksha's Spirit Power allows you to take his form and stab your enemy with the long spike he wields. This deals initial impact damage while also staggering the enemy so you can land another combo before they get up. The equipped effect allows you build Focus when you take damage, so getting hit doesn't sting quite so bad.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text provides guidance on defeating a boss to unlock purple seals in a pagoda, which will allow access to jail cells where the Enslaved Yaksha is imprisoned. It describes the Enslaved Yaksha as wielding a massive metal spike, emphasizing the need to immobilize him to attack safely and to be cautious of other enemies present.\n\nImage Summary:\nThe image is a game interface displaying the \"Enslaved Yaksha\" spirit in the equipment menu. It highlights the spirit's abilities, including the \"Mutilate\" skill, which allows the player to take the form of the Enslaved Yaksha and use a long blade to attack enemies, causing them to stagger. The interface also shows various stats and options related to equipping and using the spirit.\n\nFollowing Text Summary:\nThe following text elaborates on the abilities of the Enslaved Yaksha's spirit power, which allows the player to take his form and use a long spike to attack enemies, dealing damage and staggering them. It also mentions an equipped effect that grants focus when the player is hit, making damage less detrimental."
}