{
    "chunk_id": 892186714985,
    "source_file": "Commander_Beetle_Spirit.md",
    "h1_title": "Commander Beetle Spirit",
    "h2_title": "Commander Beetle Spirit",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4b/Commander_Beetle_Spirit.jpg",
    "alt_text": "Commander Beetle Spirit.jpg",
    "position_desc": 3,
    "img_above_text": "# Commander Beetle Spirit\n\n\n\nThe Commander Beetle fight is a tough one since the beetle is so strong, and he has a whole class of monks to tackle at the same time. Using a Pluck of Many to take care of a majority of the monks is a good idea to start with. That way, you can focus on the Commander Beetle alone.\n\nWhen fighting the Commander Beetle, watch out for its two sweeping swords that create a delayed shockwave in the air that slices you moments after the attack is complete. The Commander Beetle also shoots a volley of projectiles from its head that deal poison damage. Antimiasma Powder could come in handy in this fight.\n\n## Commander Beetle Spirit",
    "img_below_text": "* **Blade Flurry**\n* Equipped Effect: Moderately increases Poison Resistance.\n\nThe Commander Beetle's Spirit allows you to take the form of the Commander Beetle and slash at your foes with the two long swords it wields. This attack is very powerful initially, but also creates a whirlwind that detonates moments after the first attack, dealing area damage to your enemies. The equipped effect increases Poison Resistance, making the Commander Beetle a great Spirit to channel when exploring the Webbed Hollow.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Commander Beetle Spirit\n            - Section Title: Commander Beetle Spirit\n\n            Context:\n            - Preceding Text: \"# Commander Beetle Spirit\n\n\n\nThe Commander Beetle fight is a tough one since the beetle is so strong, and he has a whole class of monks to tackle at the same time. Using a Pluck of Many to take care of a majority of the monks is a good idea to start with. That way, you can focus on the Commander Beetle alone.\n\nWhen fighting the Commander Beetle, watch out for its two sweeping swords that create a delayed shockwave in the air that slices you moments after the attack is complete. The Commander Beetle also shoots a volley of projectiles from its head that deal poison damage. Antimiasma Powder could come in handy in this fight.\n\n## Commander Beetle Spirit\"\n            - Following Text: \"* **Blade Flurry**\n* Equipped Effect: Moderately increases Poison Resistance.\n\nThe Commander Beetle's Spirit allows you to take the form of the Commander Beetle and slash at your foes with the two long swords it wields. This attack is very powerful initially, but also creates a whirlwind that detonates moments after the first attack, dealing area damage to your enemies. The equipped effect increases Poison Resistance, making the Commander Beetle a great Spirit to channel when exploring the Webbed Hollow.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text describes the Commander Beetle as a challenging opponent due to its strength and the presence of accompanying monks. Strategies include using abilities like Pluck of Many to eliminate the monks and focusing on the Commander Beetle's unique attacks, such as sweeping sword strikes that create delayed shockwaves and poison-projectile volleys. Antimiasma Powder is recommended to counter poison effects.\n\nImage Summary:  \nThe image showcases the in-game equipment menu, specifically highlighting the \"Commander Beetle\" Spirit. The Spirit is categorized as \"Epic\" and features the \"Blade Flurry\" ability, which allows players to transform into the Commander Beetle and perform a powerful twin-blade attack that deals area damage. The Spirit also provides an equipped effect that moderately increases Poison Resistance. A demo of the ability is visible in the top-right corner of the screen, showing the Spirit in action.\n\nFollowing Text Summary:  \nThe following text elaborates on the abilities of the Commander Beetle Spirit. It emphasizes the Spirit's transformation ability, enabling players to wield twin swords for a devastating initial attack followed by an area-damaging whirlwind. The equipped effect enhances Poison Resistance, making the Spirit particularly useful in areas like the Webbed Hollow."
}