{
    "chunk_id": 354339201023,
    "source_file": "Black_Loong.md",
    "h1_title": "Black Loong",
    "h2_title": "Black Loong Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9c/Wukong_BlackLoong_12.jpg",
    "alt_text": "Wukong BlackLoong 12.jpg",
    "position_desc": 15,
    "img_above_text": "# Black Loong\n\nBlack Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Hidden beyond a waterfall of sand in the Fright Cliff, you won't be able to encounter this boss until you obtain a Key Item elswhere in this chapter, Black Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* **Rewards:** Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n\n\nWith the Loong Scales, you'll be able to interact with the sandfall and remove it as a barrier, revealing a door behind it to take you into the Black Loong's lair.\n\n## Black Loong Boss Fight and Guide\n\nHowever, the most dire of his attacks will come when he seems to emit even more electricity coming from his mouth and arcing around his body. Listen carefully to the drumbeat of the music, as he’ll start to pound the very earth in time with the drum beats, causing several rings of electric energy to expel outward.\n\nGetting hit by even a few of these will quickly deplete your healthbar, and you’ll have to stop everything to focus on evasion. While it is possible to get on top of your staff in the Pillar Stance, each electric ring will take a chunk out of your stamina, and this segment lasts far too long to wait out in this style.\n\nYou need to also be ready for his final slam, which he’ll do with both weapons, but won’t send out a ring. He’s being sneaky here to lure you into advancing on him, but will detonate his weapons after a pause to send out one final quick electric ring!",
    "img_below_text": "One method to evade reliably is to listen to the drum beats to anticipate the spacing of the rings, and then dodge parallel to Black Loong, moving from side to side as you evade, instead of toward the next ring or backward into a previous one. It will take a bit of practice, so having electric resistance augmented can help when you slip up.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Black Loong\n            - Section Title: Black Loong Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Black Loong\n\nBlack Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Hidden beyond a waterfall of sand in the Fright Cliff, you won't be able to encounter this boss until you obtain a Key Item elswhere in this chapter, Black Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* **Rewards:** Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n\n\nWith the Loong Scales, you'll be able to interact with the sandfall and remove it as a barrier, revealing a door behind it to take you into the Black Loong's lair.\n\n## Black Loong Boss Fight and Guide\n\nHowever, the most dire of his attacks will come when he seems to emit even more electricity coming from his mouth and arcing around his body. Listen carefully to the drumbeat of the music, as he’ll start to pound the very earth in time with the drum beats, causing several rings of electric energy to expel outward.\n\nGetting hit by even a few of these will quickly deplete your healthbar, and you’ll have to stop everything to focus on evasion. While it is possible to get on top of your staff in the Pillar Stance, each electric ring will take a chunk out of your stamina, and this segment lasts far too long to wait out in this style.\n\nYou need to also be ready for his final slam, which he’ll do with both weapons, but won’t send out a ring. He’s being sneaky here to lure you into advancing on him, but will detonate his weapons after a pause to send out one final quick electric ring!\"\n            - Following Text: \"One method to evade reliably is to listen to the drum beats to anticipate the spacing of the rings, and then dodge parallel to Black Loong, moving from side to side as you evade, instead of toward the next ring or backward into a previous one. It will take a bit of practice, so having electric resistance augmented can help when you slip up.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Black Loong as a secret boss in *Black Myth: Wukong*, accessible in Chapter 2 after obtaining a key item called Loong Scales. The boss is hidden behind a sandfall in Fright Cliff and defeating it rewards players with rare crafting materials and items. The text highlights the boss's electric-based attacks, particularly its ability to emit rings of electric energy synchronized with drumbeats, which pose a significant threat to the player.\n\nImage Summary:\nThe image depicts the intense boss fight against Black Loong, showcasing the electric rings emitted during its attack phase. The player character is actively evading the rings, which radiate outward across the battlefield. The visual elements, including glowing electric arcs and the player's health and stamina bars, emphasize the challenge and urgency of the encounter. The scene reinforces the narrative of the fight's difficulty and the need for precise timing and strategy.\n\nFollowing Text Summary:\nThe following text provides a strategy for evading Black Loong's electric rings. It advises players to dodge parallel to the boss, using the rhythm of the drumbeats to anticipate the spacing of the rings. The text also suggests augmenting electric resistance to mitigate damage from mistakes during the fight."
}