{
    "chunk_id": 172672182258,
    "source_file": "Chapter_1_Secret_-_Ancient_Guanyin_Temple_Walkthrough.md",
    "h1_title": "Chapter 1 Secret - Ancient Guanyin Temple Walkthrough",
    "h2_title": "How to Access the Ancient Guanyin Temple",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/ab/Wukong_Bamboo_32.jpg",
    "alt_text": "Wukong Bamboo 32.jpg",
    "position_desc": 2,
    "img_above_text": "# Chapter 1 Secret - Ancient Guanyin Temple Walkthrough\n\nThe Ancient Guanyin Temple is a Secret Area found in Chapter 1's Black Wind Mountain of Black Myth Wukong. Below you'll find a guide to accessing the temple with all three bell locations, and how to defeat the secret Yaoguai King boss, Elder Jinchi.\n\nThis Chapter 1 Secret can only be accessed by ringing three large bells found around Black Wind Mountain, and will transport you to a different location to fight the secret boss that possess a magical item that is instrumental in defeating the Black Wind King.\n\n## How to Access the Ancient Guanyin Temple\n\n* **Forest of Wolves** \\- From the Outside the Forest Shrine, you can head up the left path to a higher road leading to a rope bridge across a stream. Follow the path straight past the bridge to find an optional Yaoguai Chief named Guangzhi who drops the Red Tides Transformation Spell. At the far end of the arena, you’ll find the first bell.",
    "img_below_text": "* **Bamboo Grove** \\- At the end of the Snake Trail area before reaching the Marsh of the White Mists, you’ll face a Yaoguai Chief named Guangmou who can summon snakes to attack you. Once defeated, the path up to the next Shrine will be on the right, but if you head some some stairs to the left of the grove, you’ll find the second bell.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chapter 1 Secret - Ancient Guanyin Temple Walkthrough\n            - Section Title: How to Access the Ancient Guanyin Temple\n\n            Context:\n            - Preceding Text: \"# Chapter 1 Secret - Ancient Guanyin Temple Walkthrough\n\nThe Ancient Guanyin Temple is a Secret Area found in Chapter 1's Black Wind Mountain of Black Myth Wukong. Below you'll find a guide to accessing the temple with all three bell locations, and how to defeat the secret Yaoguai King boss, Elder Jinchi.\n\nThis Chapter 1 Secret can only be accessed by ringing three large bells found around Black Wind Mountain, and will transport you to a different location to fight the secret boss that possess a magical item that is instrumental in defeating the Black Wind King.\n\n## How to Access the Ancient Guanyin Temple\n\n* **Forest of Wolves** \\- From the Outside the Forest Shrine, you can head up the left path to a higher road leading to a rope bridge across a stream. Follow the path straight past the bridge to find an optional Yaoguai Chief named Guangzhi who drops the Red Tides Transformation Spell. At the far end of the arena, you’ll find the first bell.\"\n            - Following Text: \"* **Bamboo Grove** \\- At the end of the Snake Trail area before reaching the Marsh of the White Mists, you’ll face a Yaoguai Chief named Guangmou who can summon snakes to attack you. Once defeated, the path up to the next Shrine will be on the right, but if you head some some stairs to the left of the grove, you’ll find the second bell.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Ancient Guanyin Temple as a secret area in Chapter 1 of *Black Myth: Wukong*. Accessing the temple requires ringing three large bells scattered across Black Wind Mountain. The temple leads to a secret boss fight against Elder Jinchi, who holds a magical item crucial for defeating the Black Wind King. The first bell is located near the Forest of Wolves, accessible after defeating a Yaoguai Chief named Guangzhi.\n\nImage Summary:\nThe image depicts a player character ascending a moss-covered staircase in a dense bamboo forest, heading toward a temple-like structure partially obscured by fog. A red arrow overlays the image, guiding the player toward the temple entrance, suggesting this is the location of one of the bells required to access the Ancient Guanyin Temple.\n\nFollowing Text Summary:\nThe following text describes the second bell's location near the Bamboo Grove at the end of the Snake Trail area. After defeating another Yaoguai Chief named Guangmou, players can find the bell by taking stairs to the left of the grove instead of proceeding to the next shrine."
}