{
    "chunk_id": 296486715348,
    "source_file": "Bamboo_Grove_Walkthrough.md",
    "h1_title": "Bamboo Grove Walkthrough",
    "h2_title": "Black Wind Mountain’s Secret - Ringing the Second Bell",
    "h3_title": "Marsh of the White Mist",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/94/Wukong_Bamboo_38.jpg",
    "alt_text": "Wukong Bamboo 38.jpg",
    "position_desc": 36,
    "img_above_text": "# Bamboo Grove Walkthrough\n\nThe Bamboo Grove is the second main region of Chapter 1's Black Wind Mountain in Black Myth: Wukong. Below you'll find a guide to the progressing through the grove and learning how to cultivate Spirits, accessing a secret realm, as well as how to defeat the many bosses of this area that include Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble.\n\n* **Jump to A Section:**\n* **Back Hills**\n* **Snake Trail**\n- Yaoguai Chief - Baw-Li-Guhh-Lang\n- Yaoguai Chief - Guangmo\n* **Marsh of the White Mist**\n- Boss FIght - Whiteclad Noble\n\n\nTo advance, keep heading up the stairway to cross the high bridge over the falls, where you’ll soon see the golden trail of a nearby shrine beckoning you left. Before making that turn, be sure to look to the right to find a small wooden gazebo with a small table, and open the small gold box on top to find a variety of medicines, including 2 **Tiger Subduing Pellets** , 1 **Evil Repelling Medicament** and 1 **Amplification Pellet**.\n\n\nAnother good strategy to note is that if you’re in danger of getting close to becoming poisoned, using the Red Tides spell can help you transform out of danger. Any status effects suffered while transformed as Guangzhi will be removed when you regain your regular health bar. As an added bonus, Guangmou will even comment on your transformation.\n\nOnce you’ve learned how to evade his projectiles, the rest of the fight will just boil down to chasing him down and stunning him however you can with Immobilize, your Spirit Attack, and other heavy hits. When he falls, you’ll gain Guangmou’s Spirit to add to your collection, allowing you to summon venomous snakes of your own!\n\n## Black Wind Mountain’s Secret - Ringing the Second Bell\n\nLook for a way forward beyond a small archway to the side of the boss arena, and climb the winding stairs to follow a trail of gold leading to the next Shrine.\n\n### Marsh of the White Mist\n\nFollow the friendly Shen Monkey inside to the cave on the right, and you’ll find that he’s a merchant of gourds, drinks, and brews! Be sure to check all of his options out:\n\n* Upgrade Gourds - By using the Luojia Fragrant Vine you just found by the nearby Shrine, you upgrade the charges in your Old Gourd from 4 swings to 5, turning into a Medicine Gourd, and giving you more uses of its healing properties.\n* Upgrade Drinks - The default drink stored in your healing Gourd is Coconut Wine, which restores a third of your health for each swig. Once you find Awaken Wine Worms, return to him and you’ll be able to upgrade the amount healed with each use!\n* Brew - With your equipped Drink, you can enhance it by adding a Soak to increase additional effects beyond the heal. You can try it out now by adding the Gall Gem, which will increase your poison resistance in addition to the heal from your Gourd.\n* Store - If the Gall Gem isn’t all that enticing, be sure to check his shop, as the Shen Monkey sells **Celestial Lotus Seeds** , which can be used as an alternative Soak that continues to recover some health after the gourd’s initial heal!",
    "img_below_text": "Once you’re done chatting with the Shen Monkey, be sure to look near the wooden scaffolding ledge by a large statue, and absorb a green wisp spirit to earn a bunch of Will. You can drop down below for a shortcut down the main path along with a Snake-Head Mushroom, but there’s one more thing to grab outside first.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bamboo Grove Walkthrough\n            - Section Title: Black Wind Mountain’s Secret - Ringing the Second Bell\n            - Sub-Section Title: Marsh of the White Mist\n\n            Context:\n            - Preceding Text: \"# Bamboo Grove Walkthrough\n\nThe Bamboo Grove is the second main region of Chapter 1's Black Wind Mountain in Black Myth: Wukong. Below you'll find a guide to the progressing through the grove and learning how to cultivate Spirits, accessing a secret realm, as well as how to defeat the many bosses of this area that include Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble.\n\n* **Jump to A Section:**\n* **Back Hills**\n* **Snake Trail**\n- Yaoguai Chief - Baw-Li-Guhh-Lang\n- Yaoguai Chief - Guangmo\n* **Marsh of the White Mist**\n- Boss FIght - Whiteclad Noble\n\n\nTo advance, keep heading up the stairway to cross the high bridge over the falls, where you’ll soon see the golden trail of a nearby shrine beckoning you left. Before making that turn, be sure to look to the right to find a small wooden gazebo with a small table, and open the small gold box on top to find a variety of medicines, including 2 **Tiger Subduing Pellets** , 1 **Evil Repelling Medicament** and 1 **Amplification Pellet**.\n\n\nAnother good strategy to note is that if you’re in danger of getting close to becoming poisoned, using the Red Tides spell can help you transform out of danger. Any status effects suffered while transformed as Guangzhi will be removed when you regain your regular health bar. As an added bonus, Guangmou will even comment on your transformation.\n\nOnce you’ve learned how to evade his projectiles, the rest of the fight will just boil down to chasing him down and stunning him however you can with Immobilize, your Spirit Attack, and other heavy hits. When he falls, you’ll gain Guangmou’s Spirit to add to your collection, allowing you to summon venomous snakes of your own!\n\n## Black Wind Mountain’s Secret - Ringing the Second Bell\n\nLook for a way forward beyond a small archway to the side of the boss arena, and climb the winding stairs to follow a trail of gold leading to the next Shrine.\n\n### Marsh of the White Mist\n\nFollow the friendly Shen Monkey inside to the cave on the right, and you’ll find that he’s a merchant of gourds, drinks, and brews! Be sure to check all of his options out:\n\n* Upgrade Gourds - By using the Luojia Fragrant Vine you just found by the nearby Shrine, you upgrade the charges in your Old Gourd from 4 swings to 5, turning into a Medicine Gourd, and giving you more uses of its healing properties.\n* Upgrade Drinks - The default drink stored in your healing Gourd is Coconut Wine, which restores a third of your health for each swig. Once you find Awaken Wine Worms, return to him and you’ll be able to upgrade the amount healed with each use!\n* Brew - With your equipped Drink, you can enhance it by adding a Soak to increase additional effects beyond the heal. You can try it out now by adding the Gall Gem, which will increase your poison resistance in addition to the heal from your Gourd.\n* Store - If the Gall Gem isn’t all that enticing, be sure to check his shop, as the Shen Monkey sells **Celestial Lotus Seeds** , which can be used as an alternative Soak that continues to recover some health after the gourd’s initial heal!\"\n            - Following Text: \"Once you’re done chatting with the Shen Monkey, be sure to look near the wooden scaffolding ledge by a large statue, and absorb a green wisp spirit to earn a bunch of Will. You can drop down below for a shortcut down the main path along with a Snake-Head Mushroom, but there’s one more thing to grab outside first.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text provides guidance for progressing through the Bamboo Grove region in *Black Myth: Wukong*. It includes tips for navigating areas, collecting items, and defeating bosses such as Guangmou. The section transitions to \"Black Wind Mountain’s Secret - Ringing the Second Bell,\" where players are instructed to follow a trail of gold to the next Shrine. The Marsh of the White Mist introduces the Shen Monkey, a merchant offering upgrades for healing items and drinks, as well as brewing enhancements.\n\nImage Summary:\nThe image depicts a player character standing on a wooden scaffolding near a large statue carved into the rock face. The statue appears to be holding or interacting with glowing green wisps, which likely represent collectible spirits or energy. The setting is dark and atmospheric, suggesting a cave or secluded area within the Marsh of the White Mist. The player is holding an object, possibly related to the glowing wisps, indicating interaction or absorption.\n\nFollowing Text Summary:\nThe following text directs players to absorb a green wisp spirit near the wooden scaffolding ledge by the large statue to gain Will. It also mentions a shortcut down the main path and the opportunity to collect a Snake-Head Mushroom. Players are encouraged to explore the area further before proceeding."
}