{
    "chunk_id": 652030162046,
    "source_file": "Dark_Thunder.md",
    "h1_title": "Dark Thunder",
    "h2_title": "Black Myth: Wukong Dark Thunder Location",
    "h3_title": "Horse Guai Yellow Wind Ridge Location",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bf/Wukong_Sandgate_45.jpg",
    "alt_text": "Wukong Sandgate 45.jpg",
    "position_desc": 2,
    "img_above_text": "# Dark Thunder\n\nDark Thunder is one of the Transformation Spells you can find in Black Myth: Wukong. It is one of the later game Transformations, found within the Flaming Mountains.\n\nWith the Dark Thunder Transformation, you are able to turn into a horse guai and be immune to Thunder Damage, inflicting Thunder Bane on the enemy with each attack. Any Focus built up before transformation can be converted for use afterward. Dark Thunder's moveset is:\n\n* **Light Attack: Lightning Lashes - Successively lash the enemy ahead, building up Focus**. This is a slow, weak light attack that is mostly used for building up Focus instead of dealing damage.\n* **Heavy Attack: Thunderbolt Sweep - Successively lash the enemies around, building up Focus**. This is a stronger attack, focused on dealing damage and building up Focus at the same time.\n\n## Black Myth: Wukong Dark Thunder Location\n\nThe Dark Thunder Spell can be found after visiting the Horse Guai at every location he appears at in the game:\n\n* Black Wind Mountain \\- Bamboo Grove - Back Hills (inside a cave)\n* Yellow Wind Ridge \\- Sandgate Village - Village Entrance (tied to a post by the Earth Wolf boss)\n* The New West \\- New Thunderclap Temple - Temple Entrance (on the walkway in the back left of the temple grounds)\n* The Webbed Hollow \\- Webbed Hollow - Middle Hollow (in a cocoon in the area behind the Centipede Guai)\n* Flaming Mountains \\- Furnace Valley - Valley Entrance (found after killing Keeper of Flaming Mountains)\n\nUpon finding the Horse Guai for this final time, you can pull the chain in the mouth of the elemental cart next to them to obtain the Spell.\n\n\n### Horse Guai Yellow Wind Ridge Location\n\nWhen at Sandgate Village in Yellow Wind Ridge, loop around to the left and kill the Earth Wolf boss. Just behind it, you can find the Horse Guai tied to the post at the statue.",
    "img_below_text": "",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Dark Thunder\n            - Section Title: Black Myth: Wukong Dark Thunder Location\n            - Sub-Section Title: Horse Guai Yellow Wind Ridge Location\n\n            Context:\n            - Preceding Text: \"# Dark Thunder\n\nDark Thunder is one of the Transformation Spells you can find in Black Myth: Wukong. It is one of the later game Transformations, found within the Flaming Mountains.\n\nWith the Dark Thunder Transformation, you are able to turn into a horse guai and be immune to Thunder Damage, inflicting Thunder Bane on the enemy with each attack. Any Focus built up before transformation can be converted for use afterward. Dark Thunder's moveset is:\n\n* **Light Attack: Lightning Lashes - Successively lash the enemy ahead, building up Focus**. This is a slow, weak light attack that is mostly used for building up Focus instead of dealing damage.\n* **Heavy Attack: Thunderbolt Sweep - Successively lash the enemies around, building up Focus**. This is a stronger attack, focused on dealing damage and building up Focus at the same time.\n\n## Black Myth: Wukong Dark Thunder Location\n\nThe Dark Thunder Spell can be found after visiting the Horse Guai at every location he appears at in the game:\n\n* Black Wind Mountain \\- Bamboo Grove - Back Hills (inside a cave)\n* Yellow Wind Ridge \\- Sandgate Village - Village Entrance (tied to a post by the Earth Wolf boss)\n* The New West \\- New Thunderclap Temple - Temple Entrance (on the walkway in the back left of the temple grounds)\n* The Webbed Hollow \\- Webbed Hollow - Middle Hollow (in a cocoon in the area behind the Centipede Guai)\n* Flaming Mountains \\- Furnace Valley - Valley Entrance (found after killing Keeper of Flaming Mountains)\n\nUpon finding the Horse Guai for this final time, you can pull the chain in the mouth of the elemental cart next to them to obtain the Spell.\n\n\n### Horse Guai Yellow Wind Ridge Location\n\nWhen at Sandgate Village in Yellow Wind Ridge, loop around to the left and kill the Earth Wolf boss. Just behind it, you can find the Horse Guai tied to the post at the statue.\"\n            - Following Text: \"\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the \"Dark Thunder\" Transformation Spell in *Black Myth: Wukong*. This spell allows players to transform into a Horse Guai, granting immunity to Thunder Damage and enabling attacks that inflict Thunder Bane on enemies. The text also outlines the locations where players can find the Horse Guai across the game, culminating in obtaining the Dark Thunder Spell after interacting with the Horse Guai at all specified locations.\n\nImage Summary:\nThe image depicts a scene from *Black Myth: Wukong*, showing the player character standing near a tied-up Horse Guai at Sandgate Village in Yellow Wind Ridge. The Horse Guai is bound to a post next to a large statue, surrounded by a desolate environment with dry grass and barren trees. The player character appears ready for interaction or combat, holding a weapon, while dialogue text at the bottom reads, \"Good sirs, I just want a word with your king!\"\n\nFollowing Text Summary:\nThe following text provides specific instructions for finding the Horse Guai at Sandgate Village in Yellow Wind Ridge. Players are directed to loop around to the left, defeat the Earth Wolf boss, and locate the Horse Guai tied to a post behind the statue. This interaction is part of the sequence required to obtain the Dark Thunder Transformation Spell."
}