{
    "chunk_id": 804824353134,
    "source_file": "Black_Loong.md",
    "h1_title": "Black Loong",
    "h2_title": "Where to Find Black Loong",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/55/Wukong_Sandgate_63.jpg",
    "alt_text": "Wukong Sandgate 63.jpg",
    "position_desc": 1,
    "img_above_text": "# Black Loong\n\nBlack Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Hidden beyond a waterfall of sand in the Fright Cliff, you won't be able to encounter this boss until you obtain a Key Item elswhere in this chapter, Black Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* **Rewards:** Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n\n## Where to Find Black Loong\n\nMuch like the Red Loong Boss FIght, you will not be able to access and challenge this secret boss until obtaining a special item elswhere in Chapter 2.",
    "img_below_text": "Head through the Sandgate Village and defeat the King of Flowing Sand and his Second Rat Prince son. After defeating the pair (or only the son), head left from the boss arena and into the Valley of Despair.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Black Loong\n            - Section Title: Where to Find Black Loong\n\n            Context:\n            - Preceding Text: \"# Black Loong\n\nBlack Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Hidden beyond a waterfall of sand in the Fright Cliff, you won't be able to encounter this boss until you obtain a Key Item elswhere in this chapter, Black Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* **Rewards:** Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n\n## Where to Find Black Loong\n\nMuch like the Red Loong Boss FIght, you will not be able to access and challenge this secret boss until obtaining a special item elswhere in Chapter 2.\"\n            - Following Text: \"Head through the Sandgate Village and defeat the King of Flowing Sand and his Second Rat Prince son. After defeating the pair (or only the son), head left from the boss arena and into the Valley of Despair.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Black Loong, a secret boss in Chapter 2 of *Black Myth: Wukong*. It explains that Black Loong is hidden behind a sand waterfall in Fright Cliff and requires a special key item to access. Defeating Black Loong rewards players with valuable crafting materials and items.\n\nImage Summary:\nThe image depicts a gameplay scene from *Black Myth: Wukong*, showing a player character navigating a rocky, desolate environment with sparse vegetation and rugged cliffs. The character is armed with a staff and appears to be heading toward a glowing object or area of interest in the distance, possibly related to the quest to find Black Loong or progress in Chapter 2.\n\nFollowing Text Summary:\nThe following text provides instructions for progressing toward the Black Loong encounter. Players are directed to defeat the King of Flowing Sand and his Second Rat Prince son in Sandgate Village. Afterward, they must head left from the boss arena into the Valley of Despair, which likely leads closer to Black Loong's location."
}