{
    "chunk_id": 821809495362,
    "source_file": "Chapter_4_Secret_-_Purple_Cloud_Mountain_Walkthrough.md",
    "h1_title": "Chapter 4 Secret - Purple Cloud Mountain Walkthrough",
    "h2_title": "Valley of Blooms",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d2/Wukong_PurpleCloud_10.jpg",
    "alt_text": "Wukong PurpleCloud 10.jpg",
    "position_desc": 14,
    "img_above_text": "# Chapter 4 Secret - Purple Cloud Mountain Walkthrough\n\nThe Purple Cloud Mountain is a Secret Area found in Chapter 4's Webbed Hollow of Black Myth Wukong. Below you'll find a guide to accessing the mountain by defeating the Venom Daoist, and how to complete Hong Yi the Snake Guai's quest to defeat the Daoist Mi and Duskveil, as well as the formidable Scorpionlord.\n\n* **Jump to a Section:**\n* How to Access Purple Cloud Mountain\n* **Valley of Blooms**\n* **Bounds of Deity's Abode**\n- Yaoguai King - The Scorpionlord\n* **Petalfall Hamlet**\n- Yaoguai Chief - Daoist Mi\n* **Cloudnest Peak**\n- Yaoguai King - The Duskveil\n\nThis Chapter 4 Secret can only be accessed by finding and defeating the Venom Daoist in two different locations, and will transport you to a different location to fight a secret Yaoguai King and repair a Vessel that is instrumental in defeating the Hundred-Eyed Daoist Master.\n\n\nWhen the Venom Daoist is finally defeated, he'll point to a mural that will appear on a nearby wall, sending you to Purple Cloud Mountain.\n\n\nThe start of this region is a linear mountain path lined with a few materials to harvest, and up ahead you'll hear the sounds of someone crying. The \"someone\" is actually a snake guai (named Hong Yi). The widower was forced out of her mountaintop village by insect guais led by the Scorpionlord, rendering her unable to retrieve her late husband's keepsakes.\n\nShe'll warn you of the dangerous venom of the enemies ahead, and you can even find a **Treasure Chest** near her that holds 3 Antimiasma Powder that will be incredibly useful when taking on the Scorpionlord.\n\nHead across the bridge to the right and grab a green Wisp, and go through the archway into the next larger area.\n\n## Valley of Blooms\n\nYou'll find another Lushleaf among the bushes here by a Tree Pearl, with multiple pathways ahead. Going directly ahead leads to yet another Shrine, but be sure to look to the right first near the large pond where you first entered to find a larger empowered Lushleaf.",
    "img_below_text": "As you might expect, this one will take a lot longer to kill with its strengthened spirit, so expend your big hits and spirit attacks, making sure to stop and take out whatever minions he summons. When he finally falls, you'll get the Verdant Glow Spirit, which allows you to heal rather than invoke an attack.\n\nBe sure to also look at the normal tree near where the Lushleaf was meditating. It has a **Luojia Fragrant Vine** wrapped around it that you can claim.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chapter 4 Secret - Purple Cloud Mountain Walkthrough\n            - Section Title: Valley of Blooms\n\n            Context:\n            - Preceding Text: \"# Chapter 4 Secret - Purple Cloud Mountain Walkthrough\n\nThe Purple Cloud Mountain is a Secret Area found in Chapter 4's Webbed Hollow of Black Myth Wukong. Below you'll find a guide to accessing the mountain by defeating the Venom Daoist, and how to complete Hong Yi the Snake Guai's quest to defeat the Daoist Mi and Duskveil, as well as the formidable Scorpionlord.\n\n* **Jump to a Section:**\n* How to Access Purple Cloud Mountain\n* **Valley of Blooms**\n* **Bounds of Deity's Abode**\n- Yaoguai King - The Scorpionlord\n* **Petalfall Hamlet**\n- Yaoguai Chief - Daoist Mi\n* **Cloudnest Peak**\n- Yaoguai King - The Duskveil\n\nThis Chapter 4 Secret can only be accessed by finding and defeating the Venom Daoist in two different locations, and will transport you to a different location to fight a secret Yaoguai King and repair a Vessel that is instrumental in defeating the Hundred-Eyed Daoist Master.\n\n\nWhen the Venom Daoist is finally defeated, he'll point to a mural that will appear on a nearby wall, sending you to Purple Cloud Mountain.\n\n\nThe start of this region is a linear mountain path lined with a few materials to harvest, and up ahead you'll hear the sounds of someone crying. The \"someone\" is actually a snake guai (named Hong Yi). The widower was forced out of her mountaintop village by insect guais led by the Scorpionlord, rendering her unable to retrieve her late husband's keepsakes.\n\nShe'll warn you of the dangerous venom of the enemies ahead, and you can even find a **Treasure Chest** near her that holds 3 Antimiasma Powder that will be incredibly useful when taking on the Scorpionlord.\n\nHead across the bridge to the right and grab a green Wisp, and go through the archway into the next larger area.\n\n## Valley of Blooms\n\nYou'll find another Lushleaf among the bushes here by a Tree Pearl, with multiple pathways ahead. Going directly ahead leads to yet another Shrine, but be sure to look to the right first near the large pond where you first entered to find a larger empowered Lushleaf.\"\n            - Following Text: \"As you might expect, this one will take a lot longer to kill with its strengthened spirit, so expend your big hits and spirit attacks, making sure to stop and take out whatever minions he summons. When he finally falls, you'll get the Verdant Glow Spirit, which allows you to heal rather than invoke an attack.\n\nBe sure to also look at the normal tree near where the Lushleaf was meditating. It has a **Luojia Fragrant Vine** wrapped around it that you can claim.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Purple Cloud Mountain as a secret area in Chapter 4 of Black Myth Wukong. It details how to access this area by defeating the Venom Daoist and describes the quest involving Hong Yi the Snake Guai, who warns of venomous enemies ahead. The section titled \"Valley of Blooms\" is part of the walkthrough, guiding players through the area and highlighting key items like the Antimiasma Powder.\n\nImage Summary:\nThe image depicts a scene from the Valley of Blooms in the Purple Cloud Mountain area. It shows a player character approaching a large tree-like creature, possibly a Lushleaf, in a forested setting. The red circle highlights a specific area on the tree, indicating a point of interest or interaction. This image likely serves to illustrate the encounter with the empowered Lushleaf mentioned in the walkthrough.\n\nFollowing Text Summary:\nThe following text describes the challenge of defeating the empowered Lushleaf, emphasizing the need to use powerful attacks and manage summoned minions. Upon defeating the Lushleaf, players receive the Verdant Glow Spirit, which provides healing abilities. Additionally, players are advised to collect the Luojia Fragrant Vine from a nearby tree, enhancing their resources for the journey ahead."
}