{
    "chunk_id": 702189569843,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "h1_title": "Prologue",
    "h2_title": "Boss Fight - Erlang, the Sacred Divinity",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/ff/Wukong_Prologue_2.jpg",
    "alt_text": "Wukong Prologue 2.jpg",
    "position_desc": 2,
    "img_above_text": "# Prologue\n\nUpon beginning your journey, you’ll be thrust into the role of the mythical Sun Wukong as he rebels against the Court of Heaven and its Heavenly Kings. Undaunted by their army, Sun Wukong calls them out, prompting the nephew of the Jade Emperor, Erlang Shen, to meet him in combat.\n\n## Boss Fight - Erlang, the Sacred Divinity",
    "img_below_text": "The good news is that as a tutorial boss, you may notice there’s no health bar indicator on the UI, meaning you’re essentially invulnerable! Take this time to play around with the controls, locking onto your target and trying out both light and heavy attacks against your foe.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Prologue\n            - Section Title: Boss Fight - Erlang, the Sacred Divinity\n\n            Context:\n            - Preceding Text: \"# Prologue\n\nUpon beginning your journey, you’ll be thrust into the role of the mythical Sun Wukong as he rebels against the Court of Heaven and its Heavenly Kings. Undaunted by their army, Sun Wukong calls them out, prompting the nephew of the Jade Emperor, Erlang Shen, to meet him in combat.\n\n## Boss Fight - Erlang, the Sacred Divinity\"\n            - Following Text: \"The good news is that as a tutorial boss, you may notice there’s no health bar indicator on the UI, meaning you’re essentially invulnerable! Take this time to play around with the controls, locking onto your target and trying out both light and heavy attacks against your foe.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the player to the role of Sun Wukong, the mythical Monkey King, who challenges the Court of Heaven and its Heavenly Kings. This confrontation leads to a boss fight with Erlang Shen, the nephew of the Jade Emperor, setting the stage for an epic battle.\n\nImage Summary:  \nThe image depicts an intense combat scene between Sun Wukong and Erlang Shen, the titular \"Sacred Divinity.\" The environment is a misty, ethereal battlefield with a distant army visible in the background. On-screen prompts suggest this is part of a tutorial, with instructions to \"Roll or Dodge\" incoming attacks. The UI elements and dialogue at the bottom reinforce the tutorial nature of the fight.\n\nFollowing Text Summary:  \nThe following text explains that this boss fight serves as a tutorial, where the player is essentially invulnerable. It encourages the player to experiment with controls, such as locking onto the target and using light and heavy attacks, to familiarize themselves with the combat mechanics."
}