{
    "chunk_id": 50056095713,
    "source_file": "Buddha's_Right_Hand.md",
    "h1_title": "Buddha's Right Hand",
    "h2_title": "Buddha's Right Hand Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/79/Wukong_MiddleHollow_63.jpg",
    "alt_text": "Wukong MiddleHollow 63.jpg",
    "position_desc": 10,
    "img_above_text": "# Buddha's Right Hand\n\nThe Buddha's Right Hand is a required Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the middle section of The Webbed Hollow, this creepy long hand is more than it seems, and blocks the passage down to the Lower Hollow.\n\n* Rewards: Buddha's Right Hand (Key Item), Past-Echo, Fine Gold Thread, Cold Iron Leaves, 2274 Experience, 1933 Will\n\n\nThe Buddha's Right Hand is an main boss and non-missable encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down to the Vedure Bridge Shrine and defeating the Centipede Guai in the Bonevault, follow the linear path up to the Cliff of Oblivion.\n\nJust past the Shrine, you'll find a narrow passageway with a creepy hand holding a mirror, but this is actually the boss fight you seek!\n\n## Buddha's Right Hand Boss Fight and Guide\n\nIf you notice the monster begin to rise up to where you can't hit it with normal swings, back off and get ready, as it will likely try to punch you with its \"right hand\" slamming through under its body. The good news is the hand is also another target in addition to its head, giving you more places to swing your staff at.",
    "img_below_text": "If the body appears to rise up and lurch backwards out of reach instead of straight up, it means that the boss is preparing to lunge forward with a headbutt, but this can be deflected and countered while its head is lowered for some prime damage output.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Buddha's Right Hand\n            - Section Title: Buddha's Right Hand Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Buddha's Right Hand\n\nThe Buddha's Right Hand is a required Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the middle section of The Webbed Hollow, this creepy long hand is more than it seems, and blocks the passage down to the Lower Hollow.\n\n* Rewards: Buddha's Right Hand (Key Item), Past-Echo, Fine Gold Thread, Cold Iron Leaves, 2274 Experience, 1933 Will\n\n\nThe Buddha's Right Hand is an main boss and non-missable encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down to the Vedure Bridge Shrine and defeating the Centipede Guai in the Bonevault, follow the linear path up to the Cliff of Oblivion.\n\nJust past the Shrine, you'll find a narrow passageway with a creepy hand holding a mirror, but this is actually the boss fight you seek!\n\n## Buddha's Right Hand Boss Fight and Guide\n\nIf you notice the monster begin to rise up to where you can't hit it with normal swings, back off and get ready, as it will likely try to punch you with its \"right hand\" slamming through under its body. The good news is the hand is also another target in addition to its head, giving you more places to swing your staff at.\"\n            - Following Text: \"If the body appears to rise up and lurch backwards out of reach instead of straight up, it means that the boss is preparing to lunge forward with a headbutt, but this can be deflected and countered while its head is lowered for some prime damage output.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the \"Buddha's Right Hand\" boss fight in *Black Myth Wukong*, a mandatory encounter in Chapter 4. The boss is located in the Webbed Hollow area, blocking the path to the Lower Hollow. Players are advised to target both the hand and head during the fight, with specific strategies for when the hand rises to attack.\n\nImage Summary:  \nThe image depicts the in-game boss fight against \"Buddha's Right Hand.\" The player character, armed with a glowing staff, faces a large, spider-like creature with a menacing appearance in a dimly lit, rocky corridor. The boss's health bar is visible at the bottom, indicating the ongoing battle. The setting emphasizes the eerie and confined atmosphere of the encounter.\n\nFollowing Text Summary:  \nThe following text provides additional strategies for the boss fight, explaining how to counter a headbutt attack when the boss's body lurches backward. Players are encouraged to deflect the move and capitalize on the opportunity to deal significant damage."
}