{
    "chunk_id": 118236895475,
    "source_file": "Sobering_Stone.md",
    "h1_title": "Sobering Stone",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/55/Sobering_Stone_3.jpg",
    "alt_text": "Sobering Stone 3.jpg",
    "position_desc": 1,
    "img_above_text": "# Sobering Stone\n\nThe Sobering Stone is one of the Key Items you can find in Yellow Wind Ridge. It is vital to one of the main side quests in the Yellow Wind Ridge and accessing the Kingdom of Sahali secret area.",
    "img_below_text": "The Sobering Stone is located in a vase in the village at Yellow Wind Formation - Windrest Bridge, to the left as you enter the village. From the Crouching Tiger Temple - Temple Entrance Shrine, take down Tiger Vanguard and continue up the hill. This will take you to the Yellow Wind Formation - Windrest Bridge Shrine.\n\nFrom the shrine, head across the bridge and stick to the left. You will find a set of buildings in the back left corner of the area, before you pass the rat enemies in the middle.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Sobering Stone\n\n            Context:\n            - Preceding Text: \"# Sobering Stone\n\nThe Sobering Stone is one of the Key Items you can find in Yellow Wind Ridge. It is vital to one of the main side quests in the Yellow Wind Ridge and accessing the Kingdom of Sahali secret area.\"\n            - Following Text: \"The Sobering Stone is located in a vase in the village at Yellow Wind Formation - Windrest Bridge, to the left as you enter the village. From the Crouching Tiger Temple - Temple Entrance Shrine, take down Tiger Vanguard and continue up the hill. This will take you to the Yellow Wind Formation - Windrest Bridge Shrine.\n\nFrom the shrine, head across the bridge and stick to the left. You will find a set of buildings in the back left corner of the area, before you pass the rat enemies in the middle.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}