{
    "chunk_id": 797395022009,
    "source_file": "Fuban.md",
    "h1_title": "Fuban",
    "h2_title": "Fuban Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1e/Wukong_Sahali_40.jpg",
    "alt_text": "Wukong Sahali 40.jpg",
    "position_desc": 24,
    "img_above_text": "# Fuban\n\nFuban is a secret optional Yaoguai King boss fight that you can encounter in Chapter 2's secret area in Black Myth Wukong. Located in the Kingdom of Sahali locked away in the past, you'll need to help fulfill a drunken Boar's quest to access this area.\n\n* **Rewards:** Wind Tamer, Sky-Piercing Horn\n\n\nOnce you follow him through the large gate with the small crawlspace, you’ll find yourself overlooking an ancient and forgotten kingdom, and suddenly be transported into the past and into the Kingdom of Sahali.\n\nAfter besting the \"Tiger Vanguard\", you'll find none other than the Yellow Rat Sage, who needs your help defeating a giant scarab Guai in the sands below.\n\n## Fuban Boss Fight and Guide\n\nIn this second phase, things will get even easier thanks to the Yellow Wind Sage on your side. You’ll be able to let him to the main talking. He can deal incredible damage with his wind attacks, which you can supplement by continuing the assault on his claws.You’ll still need to be mindful of his charge attacks and claw swipes, but you’re given more room to hang back and heal while the rat takes the brunt of his aggression.",
    "img_below_text": "By dealing enough damage, the Yellow Wind Sage can also knock Fuban to the ground. Be wary when approaching at first, if you see Fuban start to thrash left and right, it’s better to hang back, and wait until the rat can follow up with another powerful attack to stun Fuban until he lies on his side.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fuban\n            - Section Title: Fuban Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Fuban\n\nFuban is a secret optional Yaoguai King boss fight that you can encounter in Chapter 2's secret area in Black Myth Wukong. Located in the Kingdom of Sahali locked away in the past, you'll need to help fulfill a drunken Boar's quest to access this area.\n\n* **Rewards:** Wind Tamer, Sky-Piercing Horn\n\n\nOnce you follow him through the large gate with the small crawlspace, you’ll find yourself overlooking an ancient and forgotten kingdom, and suddenly be transported into the past and into the Kingdom of Sahali.\n\nAfter besting the \"Tiger Vanguard\", you'll find none other than the Yellow Rat Sage, who needs your help defeating a giant scarab Guai in the sands below.\n\n## Fuban Boss Fight and Guide\n\nIn this second phase, things will get even easier thanks to the Yellow Wind Sage on your side. You’ll be able to let him to the main talking. He can deal incredible damage with his wind attacks, which you can supplement by continuing the assault on his claws.You’ll still need to be mindful of his charge attacks and claw swipes, but you’re given more room to hang back and heal while the rat takes the brunt of his aggression.\"\n            - Following Text: \"By dealing enough damage, the Yellow Wind Sage can also knock Fuban to the ground. Be wary when approaching at first, if you see Fuban start to thrash left and right, it’s better to hang back, and wait until the rat can follow up with another powerful attack to stun Fuban until he lies on his side.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Fuban as a secret optional boss in *Black Myth Wukong*. Located in the Kingdom of Sahali, players must complete a quest involving a drunken Boar to access this area. The boss fight takes place after assisting the Yellow Rat Sage in defeating a giant scarab enemy. The Yellow Wind Sage becomes a key ally during the fight, using powerful wind attacks to aid the player.\n\nImage Summary:  \nThe image depicts an intense moment during the Fuban boss fight. The player character is engaged in combat with Fuban, a large and imposing creature, in a sandy battlefield. The Yellow Wind Sage is visible in the background, seemingly mid-attack, supporting the player. The game's user interface shows the player's health, abilities, and Fuban's health bar, emphasizing the ongoing battle.\n\nFollowing Text Summary:  \nThe following text provides additional guidance for the fight, explaining that the Yellow Wind Sage can knock Fuban to the ground. Players are advised to stay cautious when Fuban thrashes and to wait for the Sage's follow-up attacks to create opportunities for further damage."
}