{
    "chunk_id": 976924427530,
    "source_file": "Crouching_Tiger_Temple_Walkthrough.md",
    "h1_title": "Crouching Tiger Temple Walkthrough",
    "h2_title": "Yaoguai King Boss Fight - Tiger Vanguard",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/33/Wukong_Tiger_9.jpg",
    "alt_text": "Wukong Tiger 9.jpg",
    "position_desc": 13,
    "img_above_text": "# Crouching Tiger Temple Walkthrough\n\nOnce you reach the top, you’ll come face to bloody face with the Tiger Vanguard, who looks like he just found his next meal.\n\n## Yaoguai King Boss Fight - Tiger Vanguard\n\nUnfortunately, after the fight goes on for a bit, he won’t wait around to fool you. Whether you strike his stone form or not, he’ll use his own version of Cloud Step to race around the arena, and try to ambush you from a random angle. Watch for the signs of the blood splashing to anticipate where he’s coming from, and either let your stamina recharge to evade, or turn the tables on him with a Cloud Step of your own when he comes out of hiding.\n\nAfter the fight has raged for a bit and you may think you have a handle on this, you must still beware the Tiger Vanguard’s sword. He may deploy it sparingly, but when unsheathed it can deal a world of hurt and easily kill you before you’re able to find a time to heal. Knowing when that blade is coming is crucial to surviving the latter half of the fight.",
    "img_below_text": "The first instance is the easiest to spot, as he’ll assume a new stance putting two fingers in front of his face while his other hand rests on the handle of his sword. After a shout, he’ll unleash a single slashing attack that hits hard enough to launch its own projectile slash. Caught unaware, and it’ll easily take off more than half your health bar! It’s also the easiest one to punish, as he’ll usually take the time to put the blade back before starting his next attack, giving you a lot of time to strike back.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Crouching Tiger Temple Walkthrough\n            - Section Title: Yaoguai King Boss Fight - Tiger Vanguard\n\n            Context:\n            - Preceding Text: \"# Crouching Tiger Temple Walkthrough\n\nOnce you reach the top, you’ll come face to bloody face with the Tiger Vanguard, who looks like he just found his next meal.\n\n## Yaoguai King Boss Fight - Tiger Vanguard\n\nUnfortunately, after the fight goes on for a bit, he won’t wait around to fool you. Whether you strike his stone form or not, he’ll use his own version of Cloud Step to race around the arena, and try to ambush you from a random angle. Watch for the signs of the blood splashing to anticipate where he’s coming from, and either let your stamina recharge to evade, or turn the tables on him with a Cloud Step of your own when he comes out of hiding.\n\nAfter the fight has raged for a bit and you may think you have a handle on this, you must still beware the Tiger Vanguard’s sword. He may deploy it sparingly, but when unsheathed it can deal a world of hurt and easily kill you before you’re able to find a time to heal. Knowing when that blade is coming is crucial to surviving the latter half of the fight.\"\n            - Following Text: \"The first instance is the easiest to spot, as he’ll assume a new stance putting two fingers in front of his face while his other hand rests on the handle of his sword. After a shout, he’ll unleash a single slashing attack that hits hard enough to launch its own projectile slash. Caught unaware, and it’ll easily take off more than half your health bar! It’s also the easiest one to punish, as he’ll usually take the time to put the blade back before starting his next attack, giving you a lot of time to strike back.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Tiger Vanguard, a formidable enemy encountered at the top of the Crouching Tiger Temple. The fight involves the Tiger Vanguard using unpredictable ambush tactics, such as racing around the arena with a \"Cloud Step\" ability. Players are advised to watch for blood splashes to anticipate his movements and manage stamina effectively to evade or counterattack.\n\nImage Summary:  \nThe image depicts the intense boss fight against the Tiger Vanguard in the Yaoguai King section of the Crouching Tiger Temple walkthrough. The scene shows the player character engaged in combat with the Tiger Vanguard in a blood-filled arena surrounded by ancient temple architecture and statues. The health bar labeled \"Tiger Vanguard\" and combat UI elements suggest the player is actively battling the boss.\n\nFollowing Text Summary:  \nThe following text explains the Tiger Vanguard's sword attack, which is a critical phase of the fight. The boss assumes a distinct stance before unleashing a powerful slashing attack that can deal significant damage, including a projectile slash. Players are warned to anticipate this attack and capitalize on the recovery period when the Tiger Vanguard sheathes his sword to strike back."
}