{
    "chunk_id": 601051635609,
    "source_file": "Chen_Loong.md",
    "h1_title": "Chen Loong",
    "h2_title": "Where to Find Chen Loong",
    "h3_title": "Chen Loong Boss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/40/Wukong_Bitter_12.jpg",
    "alt_text": "Wukong Bitter 12.jpg",
    "position_desc": 13,
    "img_above_text": "# Chen Loong\n\nChen Loong is a character and possible boss fight first found in Chapter 3 of Black Myth Wukong. Though initially hostile, you can perform a task after defeating him in combat to unlock a Painted Realm where you can quickly access multiple merchants and services.\n\n* **Rewards:** TBA\n\n## Where to Find Chen Loong\n\nChen Loong is an optional opponent who has their own quest, which you can find shortly after leaving Turtle Rock for the North Shore of the Bitter Lake. From the Shrine, head left while facing it to head along the lakeshore toward a lone shack by the water.\n\nSearch the shallows near this shack, and you'll find the old dragon wandering the waters, and will become hostile as you approach.\n\n### Chen Loong Boss Fight and Guide\n\nThe second hit can be extremely tough to dodge, but using the Pillar Stance to get off the ground can soak the blow if you have stamina to spare (though it will probably still stun you).\n\nRemember that you also have Zhu Bajie as an ally in this fight, and while he won't be able to hold his attention for too long, but he can be useful at giving you some breathing room or interrupting attacks.",
    "img_below_text": "Since Chen Loong doesn't have a whole lot of health or armor, use everything in your arsenal to keep him staggered and unable to hit back whenever possible, and you can rush him down before the fight goes on too long and you start taking double damage too often.\n\nWhen he's defeated, Chen Loong will throw a bit of a tantrum, and you'll find he's not such a bad guy. He also seems to know Xu Dog, and claims only one of his celestial resurrection pills can ease his pains.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chen Loong\n            - Section Title: Where to Find Chen Loong\n            - Sub-Section Title: Chen Loong Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Chen Loong\n\nChen Loong is a character and possible boss fight first found in Chapter 3 of Black Myth Wukong. Though initially hostile, you can perform a task after defeating him in combat to unlock a Painted Realm where you can quickly access multiple merchants and services.\n\n* **Rewards:** TBA\n\n## Where to Find Chen Loong\n\nChen Loong is an optional opponent who has their own quest, which you can find shortly after leaving Turtle Rock for the North Shore of the Bitter Lake. From the Shrine, head left while facing it to head along the lakeshore toward a lone shack by the water.\n\nSearch the shallows near this shack, and you'll find the old dragon wandering the waters, and will become hostile as you approach.\n\n### Chen Loong Boss Fight and Guide\n\nThe second hit can be extremely tough to dodge, but using the Pillar Stance to get off the ground can soak the blow if you have stamina to spare (though it will probably still stun you).\n\nRemember that you also have Zhu Bajie as an ally in this fight, and while he won't be able to hold his attention for too long, but he can be useful at giving you some breathing room or interrupting attacks.\"\n            - Following Text: \"Since Chen Loong doesn't have a whole lot of health or armor, use everything in your arsenal to keep him staggered and unable to hit back whenever possible, and you can rush him down before the fight goes on too long and you start taking double damage too often.\n\nWhen he's defeated, Chen Loong will throw a bit of a tantrum, and you'll find he's not such a bad guy. He also seems to know Xu Dog, and claims only one of his celestial resurrection pills can ease his pains.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Chen Loong as a character and optional boss in *Black Myth Wukong*, encountered in Chapter 3 near the North Shore of the Bitter Lake. Players can find him wandering the shallows near a lakeside shack, where he becomes hostile upon approach. The text also provides initial combat tips, such as using the Pillar Stance to mitigate damage and relying on Zhu Bajie as an ally for support during the fight.\n\nImage Summary:  \nThe image depicts an intense moment during the boss fight with Chen Loong. The player character, wielding a glowing staff, is mid-attack against Chen Loong, a dragon-like creature with glowing, ethereal features. The setting is a shallow, watery area, and the game's interface is visible, including health bars, ability icons, and the boss's name. The image emphasizes the dynamic and visually striking combat.\n\nFollowing Text Summary:  \nThe following text provides additional strategies for defeating Chen Loong, emphasizing the importance of keeping him staggered to prevent prolonged combat and minimize damage. It also notes that after his defeat, Chen Loong reveals a less hostile side, referencing his connection to another character, Xu Dog, and his possession of a celestial resurrection pill."
}