{
    "chunk_id": 847063141351,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "h1_title": "Furnace Valley Walkthrough",
    "h2_title": "The Emerald Hall",
    "h3_title": "Missable Transformation Spell",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/16/Furnace_Valley_Walkthrough_%2898%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(98\\).png",
    "position_desc": 50,
    "img_above_text": "# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n\nOpen the giant door at the top of the stairs. Go straight ahead and activate the Rakshasa Palace Keeper's Shrine.\n\n\nInside here, you'll find the old man who gave you the gourd at the start of the game and an Awaken Wine Worm to the left.\n\nSpeak to the old man, and he'll tell you to find yourself a decent gourd (if you haven't already upgraded yours fully) and you can share a drink with him.\n\n\n## The Emerald Hall\n\nFrom The Emerald Hall Keeper's Shrine, go left and up the stairs. A cutscene will start to play, where you'll transform into a Cicada and fly toward the center of the hall. This is where you'll find Pingping speaking to her mother, Rakshasi, accompanied by the Keeper of the Flaming Mountains.\n\nAfter they discuss The Destined One obtaining the relics, the Keeper of the Flaming Mountains offers to care for Rakshashi, which Pingping protests. After he binds Pingping, Rakshashi is revealed to be Zhu Bajie transformed and it's time to take on the Keeper of the Flaming Mountains for yourself.\n\n\nWhen he's almost dead, he will then summon Ma Tianba for you to fight against.\n\n### Missable Transformation Spell\n\nMa Tianba uses a whip and has his own health bar that resembles a normal enemy's health bar. The fight is fairly straightforward in this first phase, but as soon as you've defeated the horse guai, the Keeper of the Flaming Mountains drops the Yin-Yang Fish into the water.\n\nThe giant creature soon emerges and will begin attacking. It has a variety of moves that you'll see it perform during the fight. But the main thing is now you should make use of all your spells and transformations that you saved from the first round.",
    "img_below_text": "You'll see the Yin-Yang Fish rear itself up from the water and spray a jet at you, or flip itself up and over, to try and hit you with a tail flick. Staying close to it will stop it from being able to hit you with the jet spray, but will make it more likely to try and tail-whip you.\n\nIt will also use projectiles and throw out orbs to chase you down. These can be dodged or outrun in a similar manner to that of the Keeper of the Flaming Mountain's attacks.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Furnace Valley Walkthrough\n            - Section Title: The Emerald Hall\n            - Sub-Section Title: Missable Transformation Spell\n\n            Context:\n            - Preceding Text: \"# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n\nOpen the giant door at the top of the stairs. Go straight ahead and activate the Rakshasa Palace Keeper's Shrine.\n\n\nInside here, you'll find the old man who gave you the gourd at the start of the game and an Awaken Wine Worm to the left.\n\nSpeak to the old man, and he'll tell you to find yourself a decent gourd (if you haven't already upgraded yours fully) and you can share a drink with him.\n\n\n## The Emerald Hall\n\nFrom The Emerald Hall Keeper's Shrine, go left and up the stairs. A cutscene will start to play, where you'll transform into a Cicada and fly toward the center of the hall. This is where you'll find Pingping speaking to her mother, Rakshasi, accompanied by the Keeper of the Flaming Mountains.\n\nAfter they discuss The Destined One obtaining the relics, the Keeper of the Flaming Mountains offers to care for Rakshashi, which Pingping protests. After he binds Pingping, Rakshashi is revealed to be Zhu Bajie transformed and it's time to take on the Keeper of the Flaming Mountains for yourself.\n\n\nWhen he's almost dead, he will then summon Ma Tianba for you to fight against.\n\n### Missable Transformation Spell\n\nMa Tianba uses a whip and has his own health bar that resembles a normal enemy's health bar. The fight is fairly straightforward in this first phase, but as soon as you've defeated the horse guai, the Keeper of the Flaming Mountains drops the Yin-Yang Fish into the water.\n\nThe giant creature soon emerges and will begin attacking. It has a variety of moves that you'll see it perform during the fight. But the main thing is now you should make use of all your spells and transformations that you saved from the first round.\"\n            - Following Text: \"You'll see the Yin-Yang Fish rear itself up from the water and spray a jet at you, or flip itself up and over, to try and hit you with a tail flick. Staying close to it will stop it from being able to hit you with the jet spray, but will make it more likely to try and tail-whip you.\n\nIt will also use projectiles and throw out orbs to chase you down. These can be dodged or outrun in a similar manner to that of the Keeper of the Flaming Mountain's attacks.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the events leading up to the encounter in The Emerald Hall. After activating the Rakshasa Palace Keeper's Shrine, the player interacts with key characters and witnesses a cutscene involving Pingping, her mother Rakshasi (revealed to be Zhu Bajie), and the Keeper of the Flaming Mountains. Following this, the player battles the Keeper, who summons Ma Tianba. Once Ma Tianba is defeated, the Yin-Yang Fish is dropped into the water, triggering the appearance of a giant creature for the next phase of combat.\n\nImage Summary:\nThe image depicts the giant Yin-Yang Fish emerging from the water, with its dark, ominous form dominating the scene. The player character is actively engaged in combat, splashing through the water as they approach the creature. In the background, a towering, ornate structure looms, adding to the dramatic atmosphere of the encounter. The image visually represents the transition to the second phase of the battle, where the Yin-Yang Fish becomes the primary opponent.\n\nFollowing Text Summary:\nThe following text provides tactical advice for the battle against the Yin-Yang Fish. It describes the creature's attack patterns, including jet sprays, tail flicks, and projectile orbs. Staying close to the creature can mitigate certain attacks but increases the risk of others. The text emphasizes the importance of using spells and transformations saved from earlier phases to effectively counter the creature's moves and survive the encounter."
}