{
    "chunk_id": 146222402071,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "h1_title": "Furnace Valley Walkthrough",
    "h2_title": "Valley Entrance",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/65/Furnace_Valley_Walkthrough_%2816%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(16\\).png",
    "position_desc": 6,
    "img_above_text": "# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n## Valley Entrance\n\nStick to the path, as it curves around to the left. You'll enter a cave, with columns of ruins visible and lava all over the place.",
    "img_below_text": "Continue along the path, where it curves down to the right. Here you'll find another Earth Rakshasa patrolling. Once you've dealt with the fire-breathing Rakshasa, keep going toward the pillar.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Furnace Valley Walkthrough\n            - Section Title: Valley Entrance\n\n            Context:\n            - Preceding Text: \"# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n## Valley Entrance\n\nStick to the path, as it curves around to the left. You'll enter a cave, with columns of ruins visible and lava all over the place.\"\n            - Following Text: \"Continue along the path, where it curves down to the right. Here you'll find another Earth Rakshasa patrolling. Once you've dealt with the fire-breathing Rakshasa, keep going toward the pillar.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text describes the player's progression in the game, instructing them to revisit the Camp of Seasons Keeper's Shrine and exhaust dialogue with the Pale-Axe Stalwart. After learning about the Red Boy's connection to the Element Carts, the player is directed to continue exploration at the Valley Entrance Keeper's Shrine. The Valley Entrance features a path curving to the left, leading into a cave filled with ruins and lava.\n\nImage Summary:  \nThe image depicts a dark, cavernous environment consistent with the Valley Entrance described in the text. The terrain is rocky and desolate, with visible ruins, glowing lava flows, and a sense of danger. A humanoid character armed with a weapon stands in the foreground, facing a large, menacing creature resembling an Earth Rakshasa. The scene emphasizes exploration and combat within a hostile, lava-filled setting.\n\nFollowing Text Summary:  \nThe following text instructs the player to continue along the path as it curves downward to the right. It highlights an encounter with another Earth Rakshasa, which breathes fire, and suggests defeating the creature before proceeding toward a pillar further along the path."
}