{
    "chunk_id": 529271073791,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "h1_title": "The Forest of Wolves",
    "h2_title": "Front Hills",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9f/Wukong_Wolves_15.jpg",
    "alt_text": "Wukong Wolves 15.jpg",
    "position_desc": 23,
    "img_above_text": "# The Forest of Wolves\n\nWith both enemies dead, you should start to notice a trail of gold leading you down the main path toward a shrine in a small rocky ravine.\n\nThese Shrines are your checkpoints, and offering incense at them will allow you to rest up, refill your healing gourd, travel to other shrines, and much more (some enemies — but not all — will respawn as well). You’ll also meet the owner of the voice on the wind - the Keeper of Black Wind Mountain.\n\nThis friendly guy will be your guide and mentor for this part of the world, and will bid you to set out in search of Guanyin Temple, which burned down long ago but has since been rebuilt - but not by human hands. As the Keeper departs, he’ll bestow you with the Incense Trail Talisman, which can let you warp back to the last Shrine you rested at.\n\n## Front Hills\n\nWhere the stream widens and is full of more statue heads, you’ll encounter a few Frog Guai called a Croaky. They will hop toward you with sword in hand, and pause in midair before slicing forward, giving you a clear moment to dodge around them and counter. Just be sure you back away after killing one, as they’ll explode on death with poison gas.",
    "img_below_text": "Harvest the **Jade Lotus** in the water before moving up toward the bridge you crossed earlier. On the other side of the bridge, the top of the stream is home to a lone Crow Diviner Yaoguai. He’s a lot tougher than the wolves, and can quickly slash with his reverse blade, either in a dashing strike, or a quick two-hit combo followed by a delayed third strike. The Crow can also jump up and slash down with powerful legs swipes, so be on guard to dodge around before getting your strikes in.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: The Forest of Wolves\n            - Section Title: Front Hills\n\n            Context:\n            - Preceding Text: \"# The Forest of Wolves\n\nWith both enemies dead, you should start to notice a trail of gold leading you down the main path toward a shrine in a small rocky ravine.\n\nThese Shrines are your checkpoints, and offering incense at them will allow you to rest up, refill your healing gourd, travel to other shrines, and much more (some enemies — but not all — will respawn as well). You’ll also meet the owner of the voice on the wind - the Keeper of Black Wind Mountain.\n\nThis friendly guy will be your guide and mentor for this part of the world, and will bid you to set out in search of Guanyin Temple, which burned down long ago but has since been rebuilt - but not by human hands. As the Keeper departs, he’ll bestow you with the Incense Trail Talisman, which can let you warp back to the last Shrine you rested at.\n\n## Front Hills\n\nWhere the stream widens and is full of more statue heads, you’ll encounter a few Frog Guai called a Croaky. They will hop toward you with sword in hand, and pause in midair before slicing forward, giving you a clear moment to dodge around them and counter. Just be sure you back away after killing one, as they’ll explode on death with poison gas.\"\n            - Following Text: \"Harvest the **Jade Lotus** in the water before moving up toward the bridge you crossed earlier. On the other side of the bridge, the top of the stream is home to a lone Crow Diviner Yaoguai. He’s a lot tougher than the wolves, and can quickly slash with his reverse blade, either in a dashing strike, or a quick two-hit combo followed by a delayed third strike. The Crow can also jump up and slash down with powerful legs swipes, so be on guard to dodge around before getting your strikes in.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces gameplay mechanics in *The Forest of Wolves*, focusing on Shrines as checkpoints where players can rest, refill items, and travel. It also mentions the Keeper of Black Wind Mountain, who serves as a guide and provides the Incense Trail Talisman for teleportation. The section transitions into the \"Front Hills,\" describing encounters with Frog Guai enemies called Croaky, which attack with sword strikes and explode with poison gas upon death.\n\nImage Summary:  \nThe image depicts a combat scene in *The Forest of Wolves*, specifically in the \"Front Hills\" section. A player character is engaged in close combat with a Frog Guai enemy in a shallow stream. The enemy's health bar is visible, and the player appears to be striking with a weapon. The environment includes water and rocky terrain, consistent with the described area. HUD elements indicate health and stamina bars, reinforcing the action-oriented gameplay.\n\nFollowing Text Summary:  \nThe following text advises players to harvest a **Jade Lotus** in the water before progressing to a bridge and encountering a tougher enemy, the Crow Diviner Yaoguai. This enemy has advanced attack patterns, including dashing strikes, combos, and powerful leg swipes, requiring players to dodge and counter strategically."
}