{
    "chunk_id": 604766302287,
    "source_file": "Azure_Dust.md",
    "h1_title": "Azure Dust",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/21/Black-myth-wukong-azure-dust-1.jpg",
    "alt_text": "Black-myth-wukong-azure-dust-1.jpg",
    "position_desc": 1,
    "img_above_text": "# Azure Dust\n\nAzure Dust is one of the more hidden Transformation Spells in Black Myth: Wukong. Unlike some of the other Transformations, Azure Dust doesn't have much flexibility in how you use it. But, it has some powerful attacks even the Transformation is hard to control.\n\nThe Transformation allows you to transform into a rock guai, immune to all Four Banes. Azure Dust also builds up Might when hit. Azure Dust's moveset is as follows:\n\n* **Light Attack: Earth Shatter - Strike the enemy three times with your heavy head**. This is a powerful slam on the ground with your head that can be repeated.",
    "img_below_text": "* **Heavy Attack: Mountain Splitter - Dash forward with full force. Fully charge to dash further**. This is a slow, but heavy charged dash which can pin enemies and also get you out of danger if needed. It lacks a lot of control, however.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Azure Dust\n\n            Context:\n            - Preceding Text: \"# Azure Dust\n\nAzure Dust is one of the more hidden Transformation Spells in Black Myth: Wukong. Unlike some of the other Transformations, Azure Dust doesn't have much flexibility in how you use it. But, it has some powerful attacks even the Transformation is hard to control.\n\nThe Transformation allows you to transform into a rock guai, immune to all Four Banes. Azure Dust also builds up Might when hit. Azure Dust's moveset is as follows:\n\n* **Light Attack: Earth Shatter - Strike the enemy three times with your heavy head**. This is a powerful slam on the ground with your head that can be repeated.\"\n            - Following Text: \"* **Heavy Attack: Mountain Splitter - Dash forward with full force. Fully charge to dash further**. This is a slow, but heavy charged dash which can pin enemies and also get you out of danger if needed. It lacks a lot of control, however.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces \"Azure Dust,\" a Transformation Spell in the game \"Black Myth: Wukong.\" This spell allows players to transform into a rock guai, granting immunity to all Four Banes and building up Might when hit. The text describes one of its moves, the Light Attack \"Earth Shatter,\" which involves striking the enemy three times with a heavy head slam.\n\nImage Summary:\nThe image depicts a scene from \"Black Myth: Wukong,\" showcasing the Azure Dust transformation. The character appears as a rock-like creature in a rugged, rocky environment, seemingly executing the Light Attack \"Earth Shatter.\" The image includes on-screen prompts for the Light Attack and Heavy Attack moves, emphasizing the gameplay mechanics associated with the Azure Dust transformation.\n\nFollowing Text Summary:\nThe following text describes the Heavy Attack \"Mountain Splitter,\" another move available in the Azure Dust transformation. This attack involves a slow, but powerful charged dash forward, which can pin enemies or help the player escape danger. However, it lacks control, requiring careful use during gameplay."
}