{
    "chunk_id": 874670258959,
    "source_file": "Centipede_Guai_Spirit.md",
    "h1_title": "Centipede Guai Spirit",
    "h2_title": "Centipede Guai Location",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ec/Centipede_Guai_Location.jpg",
    "alt_text": "Centipede Guai Location.jpg",
    "position_desc": 2,
    "img_above_text": "# Centipede Guai Spirit\n\n## Centipede Guai Location\n\nThe Centipede Guai can be found in a massive pit full of skulls called the Bonevault. To reach the Bonevault, head to the Middle Hollow Keeper's Shrine in the Webbed Hollow. Drop down the wooden platform beside the Shrine and head straight forward to drop into the pit of bones.",
    "img_below_text": "",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Centipede Guai Spirit\n            - Section Title: Centipede Guai Location\n\n            Context:\n            - Preceding Text: \"# Centipede Guai Spirit\n\n## Centipede Guai Location\n\nThe Centipede Guai can be found in a massive pit full of skulls called the Bonevault. To reach the Bonevault, head to the Middle Hollow Keeper's Shrine in the Webbed Hollow. Drop down the wooden platform beside the Shrine and head straight forward to drop into the pit of bones.\"\n            - Following Text: \"\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the location of the Centipede Guai, a spirit found in a pit called the Bonevault. To access this area, players are instructed to start at the Middle Hollow Keeper's Shrine in the Webbed Hollow, drop down a wooden platform near the shrine, and proceed forward to reach the pit filled with bones.\n\nImage Summary:\nThe image depicts a dark, eerie environment with a character standing at the edge of a rocky platform overlooking a pit. The pit is littered with skeletal remains and surrounded by web-like textures, consistent with the description of the Bonevault. The character appears equipped with ornate gear and a weapon, suggesting readiness for exploration or combat. The visual elements reinforce the ominous atmosphere of the location described in the preceding text.\n\nFollowing Text Summary:\nNo following text is provided, leaving the image as the final visual representation of the described location. It serves to illustrate the Bonevault and its foreboding environment, aligning with the preceding text's instructions for reaching this area."
}