{
    "chunk_id": 505293134917,
    "source_file": "Fuban.md",
    "h1_title": "Fuban",
    "h2_title": "Fuban Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/43/Wukong_Sahali_27.jpg",
    "alt_text": "Wukong Sahali 27.jpg",
    "position_desc": 11,
    "img_above_text": "# Fuban\n\nFuban is a secret optional Yaoguai King boss fight that you can encounter in Chapter 2's secret area in Black Myth Wukong. Located in the Kingdom of Sahali locked away in the past, you'll need to help fulfill a drunken Boar's quest to access this area.\n\n* **Rewards:** Wind Tamer, Sky-Piercing Horn\n\n\nOnce you follow him through the large gate with the small crawlspace, you’ll find yourself overlooking an ancient and forgotten kingdom, and suddenly be transported into the past and into the Kingdom of Sahali.\n\nAfter besting the \"Tiger Vanguard\", you'll find none other than the Yellow Rat Sage, who needs your help defeating a giant scarab Guai in the sands below.\n\n## Fuban Boss Fight and Guide",
    "img_below_text": "Once you make your way down either of the slopes into the large sandy dunes where the giant Scarab Yaoguai called Fuban has emerged, you’ll be in for a battle against a juggernaut of a scarab beetle.\n\nDon’t let its imposing size scare you too much - this battle isn’t as hard as many others in Chapter 2 despite being a secret boss, as long as you know when and where to attack.\n\nFuban will likely begin by burrowing into the ground and vanishing, and the Yellow Wind Sage will call out to watch for the sands rumbling to tell where Fuban is approaching from.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fuban\n            - Section Title: Fuban Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Fuban\n\nFuban is a secret optional Yaoguai King boss fight that you can encounter in Chapter 2's secret area in Black Myth Wukong. Located in the Kingdom of Sahali locked away in the past, you'll need to help fulfill a drunken Boar's quest to access this area.\n\n* **Rewards:** Wind Tamer, Sky-Piercing Horn\n\n\nOnce you follow him through the large gate with the small crawlspace, you’ll find yourself overlooking an ancient and forgotten kingdom, and suddenly be transported into the past and into the Kingdom of Sahali.\n\nAfter besting the \"Tiger Vanguard\", you'll find none other than the Yellow Rat Sage, who needs your help defeating a giant scarab Guai in the sands below.\n\n## Fuban Boss Fight and Guide\"\n            - Following Text: \"Once you make your way down either of the slopes into the large sandy dunes where the giant Scarab Yaoguai called Fuban has emerged, you’ll be in for a battle against a juggernaut of a scarab beetle.\n\nDon’t let its imposing size scare you too much - this battle isn’t as hard as many others in Chapter 2 despite being a secret boss, as long as you know when and where to attack.\n\nFuban will likely begin by burrowing into the ground and vanishing, and the Yellow Wind Sage will call out to watch for the sands rumbling to tell where Fuban is approaching from.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Fuban, a secret optional boss in *Black Myth: Wukong*. Fuban is a giant scarab Yaoguai King found in Chapter 2, within the Kingdom of Sahali, a location accessed by completing a quest for a drunken Boar. Players encounter Fuban after helping the Yellow Rat Sage defeat another enemy.\n\nImage Summary:  \nThe image depicts Fuban, a massive and imposing scarab-like creature, standing in a sandy, desolate environment with ancient ruins in the background. The creature's size, sharp claws, and menacing appearance emphasize its role as a formidable boss in the game. The text overlay identifies the creature as \"Fuban,\" reinforcing its significance in the narrative.\n\nFollowing Text Summary:  \nThe following text provides guidance for the boss fight against Fuban. It describes the battle arena, located in sandy dunes, and explains Fuban's initial attack pattern, which involves burrowing underground. Players are advised to watch for rumbling sands, as the Yellow Wind Sage warns of Fuban's movements. Despite its intimidating appearance, the fight is manageable with proper strategy."
}