{
    "chunk_id": 416835161105,
    "source_file": "Gore-Eye_Daoist.md",
    "h1_title": "Gore-Eye Daoist",
    "h2_title": "Where to Find the Gore-Eye Daoist",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/be/Wukong_Yellow_39.jpg",
    "alt_text": "Wukong Yellow 39.jpg",
    "position_desc": 2,
    "img_above_text": "# Gore-Eye Daoist\n\nThe Gore-Eye Daoist is an optional Yaoguai Chief miniboss that you can encounter in Chapter 2 of Black Myth Wukong. As an optional foe, you can seek out this boss in the Yellow Wind Formation through one of three possible entrances to where the Chapter Boss resides behind sealed stone gates.\n\n* Rewards: Gore-Eye Daoist Spirit\n\n## Where to Find the Gore-Eye Daoist\n\nAs an optional boss, the Gore-Eye Daoist is easy to miss if you enter the Yellow Wind Formation through other routes. He lies on the road behind the large stone door featured where you can fight the King of Flowing Sands and Second Rat Prince.",
    "img_below_text": "However, in order to open the door, you will need both the Sterness of Stone from the Stone Vanguard Boss, and Keeness of Tiger from the Tiger Vanguard Boss. With both Key Items, you'll be able to interact with the Tally in front of the door and open it, and you'll find the boss after crossing a bridge down to the Windseal Gate.\n\n### Gore-Eye Daoist Mini-Boss Fight and Guide\n\nThe Gore-Eye Daoist is not like most bosses you’ve faced, what with the creepy fleshy thing on his back full of eyeballs. This boss has a specialty - and it’s creating blood. Lots of it. This blood can be pretty dangerous too, as he’ll be able to create pools of it all around the arena, and even poison you with it, so make sure you’re stocked on a few antimiasma pills.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Gore-Eye Daoist\n            - Section Title: Where to Find the Gore-Eye Daoist\n\n            Context:\n            - Preceding Text: \"# Gore-Eye Daoist\n\nThe Gore-Eye Daoist is an optional Yaoguai Chief miniboss that you can encounter in Chapter 2 of Black Myth Wukong. As an optional foe, you can seek out this boss in the Yellow Wind Formation through one of three possible entrances to where the Chapter Boss resides behind sealed stone gates.\n\n* Rewards: Gore-Eye Daoist Spirit\n\n## Where to Find the Gore-Eye Daoist\n\nAs an optional boss, the Gore-Eye Daoist is easy to miss if you enter the Yellow Wind Formation through other routes. He lies on the road behind the large stone door featured where you can fight the King of Flowing Sands and Second Rat Prince.\"\n            - Following Text: \"However, in order to open the door, you will need both the Sterness of Stone from the Stone Vanguard Boss, and Keeness of Tiger from the Tiger Vanguard Boss. With both Key Items, you'll be able to interact with the Tally in front of the door and open it, and you'll find the boss after crossing a bridge down to the Windseal Gate.\n\n### Gore-Eye Daoist Mini-Boss Fight and Guide\n\nThe Gore-Eye Daoist is not like most bosses you’ve faced, what with the creepy fleshy thing on his back full of eyeballs. This boss has a specialty - and it’s creating blood. Lots of it. This blood can be pretty dangerous too, as he’ll be able to create pools of it all around the arena, and even poison you with it, so make sure you’re stocked on a few antimiasma pills.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Gore-Eye Daoist, an optional miniboss in Chapter 2 of *Black Myth: Wukong*. It explains that this boss can be found in the Yellow Wind Formation, accessible through specific entrances near the sealed stone gates leading to the Chapter Boss. Defeating the Gore-Eye Daoist rewards players with the \"Gore-Eye Daoist Spirit.\"\n\nImage Summary:\nThe image depicts a combat scene from *Black Myth: Wukong*, showing the player character engaged in battle against an enemy, likely the Gore-Eye Daoist. The environment features a rocky terrain with sparse vegetation and a bridge in the background, suggesting the location near the Windseal Gate mentioned in the context. The on-screen UI displays health and ability icons, indicating active gameplay.\n\nFollowing Text Summary:\nThe following text provides instructions for accessing the Gore-Eye Daoist's location. It mentions the requirement of two key items—Sternness of Stone and Keeness of Tiger—to open the stone door near the Windseal Gate. Additionally, it describes the boss’s unique abilities, including creating dangerous blood pools and poisoning players, emphasizing the need for preparation with antimiasma pills."
}