{
    "chunk_id": 95345047016,
    "source_file": "Foothills_Walkthrough.md",
    "h1_title": "Foothills Walkthrough",
    "h2_title": "Verdant Path",
    "h3_title": "Yaoguai Chief - Supreme Inspector",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d5/Foothills_Walkthrough_%2815%29.png",
    "alt_text": "Foothills Walkthrough \\(15\\).png",
    "position_desc": 6,
    "img_above_text": "# Foothills Walkthrough\n\nThis will include Hound, Jackal, and Eagle Soldiers, as well as the tougher looker variants with shields called Captain of the Court.\n\nAs you get closer to the first Keeper's Shrine of the area, you'll see a large group of soldiers appear. Clear these out and then you can activate the shrine.\n\nBe sure to check the Shrine Shop while you're here, and revisit the Zodiac Village to see what new items everyone has to offer.\n\nMount Huaguo Shrine Shop\n| Mount Huaguo Shrine Shop            | Mount Huaguo Shrine Shop              | Mount Huaguo Shrine Shop            | Mount Huaguo Shrine Shop       |\n| ----------------------------------- | ------------------------------------- | ----------------------------------- | ------------------------------ |\n| Body-Cooling Powder (x6) - 180 Will | Shock-Quelling Powder (x6) - 180 Will | Tonifying Decoction (x3) - 360 Will |                                |\n| Mind Core (x6) - 3000 Will          | Find Gold Thread (x2) - 3000 Will     | Celestial Ribbon (x1) - 9000 Will   | Gold Tree Core (x1) - 4500 Wil |\n\n## Verdant Path\n\nContinue straight up from the Keeper's Shrine and into the clearing that's adorned by chains. Make your way into the center of the clearing, where Bajie will exclaim it's a dead end. However, you'll soon be joined by the Supreme Celestial Inspector. If you found all of the Purple Talismans in Chapter 4, then this will be a familiar face to you.\n\n### Yaoguai Chief - Supreme Inspector\n\nSecondly, you can expect The Supreme Inspector to fly up into the air quite often, where it will continue to attack you but be unreachable. When it's up in the air, it will largely use projectiles. These are typically in groups and need to be dodged to avoid them. You can throw the Plantain Fan out when it's airborne to immediately bring it back down and leave it vulnerable to attacks.",
    "img_below_text": "The Supreme Inspector is also able to turn its wings to solid gold and deflect your attacks. You can still do damage when this happens, but it'll be minimal. Bajie will explain to you that when this happens, it's best to wait until it spreads its wings again. Still, you should try to be as aggressive as you can while you have Bajie helping you in the first part of the fight. As always, try to reserve any Gourd usage while you have Bajie, as he'll often top up your health.\n\nBesides the projectiles and using its wings to attack, the Supreme Inspector also uses a sword. This is where the thunder attacks come from, and they can vary significantly.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Foothills Walkthrough\n            - Section Title: Verdant Path\n            - Sub-Section Title: Yaoguai Chief - Supreme Inspector\n\n            Context:\n            - Preceding Text: \"# Foothills Walkthrough\n\nThis will include Hound, Jackal, and Eagle Soldiers, as well as the tougher looker variants with shields called Captain of the Court.\n\nAs you get closer to the first Keeper's Shrine of the area, you'll see a large group of soldiers appear. Clear these out and then you can activate the shrine.\n\nBe sure to check the Shrine Shop while you're here, and revisit the Zodiac Village to see what new items everyone has to offer.\n\nMount Huaguo Shrine Shop\n| Mount Huaguo Shrine Shop            | Mount Huaguo Shrine Shop              | Mount Huaguo Shrine Shop            | Mount Huaguo Shrine Shop       |\n| ----------------------------------- | ------------------------------------- | ----------------------------------- | ------------------------------ |\n| Body-Cooling Powder (x6) - 180 Will | Shock-Quelling Powder (x6) - 180 Will | Tonifying Decoction (x3) - 360 Will |                                |\n| Mind Core (x6) - 3000 Will          | Find Gold Thread (x2) - 3000 Will     | Celestial Ribbon (x1) - 9000 Will   | Gold Tree Core (x1) - 4500 Wil |\n\n## Verdant Path\n\nContinue straight up from the Keeper's Shrine and into the clearing that's adorned by chains. Make your way into the center of the clearing, where Bajie will exclaim it's a dead end. However, you'll soon be joined by the Supreme Celestial Inspector. If you found all of the Purple Talismans in Chapter 4, then this will be a familiar face to you.\n\n### Yaoguai Chief - Supreme Inspector\n\nSecondly, you can expect The Supreme Inspector to fly up into the air quite often, where it will continue to attack you but be unreachable. When it's up in the air, it will largely use projectiles. These are typically in groups and need to be dodged to avoid them. You can throw the Plantain Fan out when it's airborne to immediately bring it back down and leave it vulnerable to attacks.\"\n            - Following Text: \"The Supreme Inspector is also able to turn its wings to solid gold and deflect your attacks. You can still do damage when this happens, but it'll be minimal. Bajie will explain to you that when this happens, it's best to wait until it spreads its wings again. Still, you should try to be as aggressive as you can while you have Bajie helping you in the first part of the fight. As always, try to reserve any Gourd usage while you have Bajie, as he'll often top up your health.\n\nBesides the projectiles and using its wings to attack, the Supreme Inspector also uses a sword. This is where the thunder attacks come from, and they can vary significantly.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the journey through the Verdant Path, where players encounter various enemies, including soldiers and shielded variants. It highlights the importance of clearing enemies near the Keeper's Shrine to activate it and encourages players to explore the Shrine Shop for useful items. The narrative then transitions to the Verdant Path, leading to a clearing adorned with chains, where the Supreme Celestial Inspector makes an appearance.\n\nImage Summary:\nThe image depicts the Supreme Celestial Inspector, a winged humanoid figure with dark, expansive wings and golden accents, hovering in a rocky clearing surrounded by chains. The setting is atmospheric, with rugged cliffs, scattered vegetation, and subdued lighting, emphasizing the Inspector's imposing presence. This visual aligns with the described encounter in the Verdant Path, where the Inspector engages the player in combat.\n\nFollowing Text Summary:\nThe following text elaborates on the Supreme Inspector's combat mechanics, including its ability to deflect attacks with golden wings and its use of projectiles and thunder-based sword attacks. Players are advised to exploit vulnerabilities when the Inspector spreads its wings and to conserve healing resources while receiving assistance from Bajie during the fight."
}