{
    "chunk_id": 645593452553,
    "source_file": "Bamboo_Grove_Walkthrough.md",
    "h1_title": "Bamboo Grove Walkthrough",
    "h2_title": "Snake Trail",
    "h3_title": "Yaoguai Chief Mini-Boss Fight - Guangmou",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/29/Wukong_Bamboo_25.jpg",
    "alt_text": "Wukong Bamboo 25.jpg",
    "position_desc": 26,
    "img_above_text": "# Bamboo Grove Walkthrough\n\nThe Bamboo Grove is the second main region of Chapter 1's Black Wind Mountain in Black Myth: Wukong. Below you'll find a guide to the progressing through the grove and learning how to cultivate Spirits, accessing a secret realm, as well as how to defeat the many bosses of this area that include Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble.\n\n* **Jump to A Section:**\n* **Back Hills**\n* **Snake Trail**\n- Yaoguai Chief - Baw-Li-Guhh-Lang\n- Yaoguai Chief - Guangmo\n* **Marsh of the White Mist**\n- Boss FIght - Whiteclad Noble\n\n\nTo advance, keep heading up the stairway to cross the high bridge over the falls, where you’ll soon see the golden trail of a nearby shrine beckoning you left. Before making that turn, be sure to look to the right to find a small wooden gazebo with a small table, and open the small gold box on top to find a variety of medicines, including 2 **Tiger Subduing Pellets** , 1 **Evil Repelling Medicament** and 1 **Amplification Pellet**.\n\n## Snake Trail\n\nThis path leads to a marshy swamp area full of tall white reed flowers. Several Croaky enemies hide within them, so use your lock-on to identify them so you aren’t ambushed. However, as you make your way through the marsh toward a large stone mural in the cliffs, an optional mini-boss will leap out to fight you.\n\n\nTo proceed, look for a small dirt path lined by a few fires through the bamboo grove to a set of statues on either side of a small opening in the walls. On the other side, another large bamboo grove is home to a humble yet deadly Yaoguai Chief.\n\n### Yaoguai Chief Mini-Boss Fight - Guangmou\n\nHis other main projectile attack comes out much faster, as he levitates off the ground for a moment before shooting out a line of the spells in front of him. They don’t track you like the others, but they will shoot rapidly downward and into the ground in front of him.",
    "img_below_text": "When he’s got some range on you, listen up for some of his call-outs. If he yells “Storm forth!” he’ll soon create a gusty orb surrounded by leaves that will slowly float toward you. This one can’t be deflected since it won’t do damage on its own. Once it reaches your position, the gust will issue forth and in a moment become a small violent tornado that will knock you down!",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bamboo Grove Walkthrough\n            - Section Title: Snake Trail\n            - Sub-Section Title: Yaoguai Chief Mini-Boss Fight - Guangmou\n\n            Context:\n            - Preceding Text: \"# Bamboo Grove Walkthrough\n\nThe Bamboo Grove is the second main region of Chapter 1's Black Wind Mountain in Black Myth: Wukong. Below you'll find a guide to the progressing through the grove and learning how to cultivate Spirits, accessing a secret realm, as well as how to defeat the many bosses of this area that include Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble.\n\n* **Jump to A Section:**\n* **Back Hills**\n* **Snake Trail**\n- Yaoguai Chief - Baw-Li-Guhh-Lang\n- Yaoguai Chief - Guangmo\n* **Marsh of the White Mist**\n- Boss FIght - Whiteclad Noble\n\n\nTo advance, keep heading up the stairway to cross the high bridge over the falls, where you’ll soon see the golden trail of a nearby shrine beckoning you left. Before making that turn, be sure to look to the right to find a small wooden gazebo with a small table, and open the small gold box on top to find a variety of medicines, including 2 **Tiger Subduing Pellets** , 1 **Evil Repelling Medicament** and 1 **Amplification Pellet**.\n\n## Snake Trail\n\nThis path leads to a marshy swamp area full of tall white reed flowers. Several Croaky enemies hide within them, so use your lock-on to identify them so you aren’t ambushed. However, as you make your way through the marsh toward a large stone mural in the cliffs, an optional mini-boss will leap out to fight you.\n\n\nTo proceed, look for a small dirt path lined by a few fires through the bamboo grove to a set of statues on either side of a small opening in the walls. On the other side, another large bamboo grove is home to a humble yet deadly Yaoguai Chief.\n\n### Yaoguai Chief Mini-Boss Fight - Guangmou\n\nHis other main projectile attack comes out much faster, as he levitates off the ground for a moment before shooting out a line of the spells in front of him. They don’t track you like the others, but they will shoot rapidly downward and into the ground in front of him.\"\n            - Following Text: \"When he’s got some range on you, listen up for some of his call-outs. If he yells “Storm forth!” he’ll soon create a gusty orb surrounded by leaves that will slowly float toward you. This one can’t be deflected since it won’t do damage on its own. Once it reaches your position, the gust will issue forth and in a moment become a small violent tornado that will knock you down!\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the Snake Trail, a path in the Bamboo Grove region of *Black Myth: Wukong*. It leads to a swampy area filled with enemies and culminates in an optional mini-boss encounter with Guangmou, a Yaoguai Chief. Players are guided to navigate through bamboo groves and statues to reach this challenging fight.\n\nImage Summary:\nThe image depicts the mini-boss fight against Guangmou in the Bamboo Grove's Snake Trail area. The player character is positioned in a bamboo forest, facing Guangmou, who is visible near a rocky outcrop. The game's interface shows health bars, abilities, and items, emphasizing the combat scenario. The environment features dense greenery, moss-covered rocks, and bamboo trees, reinforcing the setting's natural and atmospheric tone.\n\nFollowing Text Summary:\nThe following text provides combat tips for facing Guangmou. It explains one of his ranged attacks, where he summons a gusty orb surrounded by leaves that transforms into a small tornado. Players are warned that this attack cannot be deflected and will knock them down if caught in its area of effect."
}