{
    "chunk_id": 398994897177,
    "source_file": "Yellow_Wind_Sage.md",
    "h1_title": "Yellow Wind Sage",
    "h2_title": "Yellow Wind Sage Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fd/Wukong_Yellow_54.jpg",
    "alt_text": "Wukong Yellow 54.jpg",
    "position_desc": 5,
    "img_above_text": "# Yellow Wind Sage\n\nThe Yellow Wind Sage is a required Yaoguai King and the final boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Located at the center of the large black tornado in the Yellow Wind Formation in the center of the region, you'll need two Key Items to open a path to him.\n\n* **Rewards:** Samahdi Wind Agate, Cold Iron Leaves x2, Refined Iron Sand x1, Silk x5, Yaoguai Core x2, Mind Core x1, 2583 Experience, 1944 Will\n\n\nWith both pieces, you can open the door where you defeated the King of Flowing Sands, or open up the temple cellar in the Crouching Tiger Temple, or slide down past the Rock Crash Platform to the Windseal Gate.\n\n## Yellow Wind Sage Boss Fight and Guide\n\nOne of his bigger attacks with a slow startup involves him performing a backhanded swing where he spins around first. Watch his movements, and you’ll be able to go Rock Solid to parry this move and stagger him, opening up to a large counter attack!",
    "img_below_text": "However, attacking from the front can often prove dangerous, as you don’t want to drain all your stamina and run out of juice for dodging. He can often lure you in, and then stab his imbued weapon down right in front of him. Don’t dodge backward but instead flee to the sides, as the impact will create a line of smaller spears from the sand itself that erupt in a straight line from the point of impact.\n\nYou can get in a few strikes after dodging this stab, but save your heavy attack, as the Yellow Wind Sage will usually follow this up by a jumping stomp attack to create a shockwave around him. This will leave him open for a strong heavy hit and follow up attacks.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Yellow Wind Sage\n            - Section Title: Yellow Wind Sage Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Yellow Wind Sage\n\nThe Yellow Wind Sage is a required Yaoguai King and the final boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Located at the center of the large black tornado in the Yellow Wind Formation in the center of the region, you'll need two Key Items to open a path to him.\n\n* **Rewards:** Samahdi Wind Agate, Cold Iron Leaves x2, Refined Iron Sand x1, Silk x5, Yaoguai Core x2, Mind Core x1, 2583 Experience, 1944 Will\n\n\nWith both pieces, you can open the door where you defeated the King of Flowing Sands, or open up the temple cellar in the Crouching Tiger Temple, or slide down past the Rock Crash Platform to the Windseal Gate.\n\n## Yellow Wind Sage Boss Fight and Guide\n\nOne of his bigger attacks with a slow startup involves him performing a backhanded swing where he spins around first. Watch his movements, and you’ll be able to go Rock Solid to parry this move and stagger him, opening up to a large counter attack!\"\n            - Following Text: \"However, attacking from the front can often prove dangerous, as you don’t want to drain all your stamina and run out of juice for dodging. He can often lure you in, and then stab his imbued weapon down right in front of him. Don’t dodge backward but instead flee to the sides, as the impact will create a line of smaller spears from the sand itself that erupt in a straight line from the point of impact.\n\nYou can get in a few strikes after dodging this stab, but save your heavy attack, as the Yellow Wind Sage will usually follow this up by a jumping stomp attack to create a shockwave around him. This will leave him open for a strong heavy hit and follow up attacks.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}