{
    "chunk_id": 364924779153,
    "source_file": "Captain_Wise-Voice.md",
    "h1_title": "Captain Wise-Voice",
    "h2_title": "Where to Find Captain Wise-Voice",
    "h3_title": "Captain Wise-Voice Boss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bb/Wukong_Pagoda_88.jpg",
    "alt_text": "Wukong Pagoda 88.jpg",
    "position_desc": 11,
    "img_above_text": "# Captain Wise-Voice\n\nCaptain Wise-Voice is a required Yaoguai King boss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Responsible for the \"beguiling chant\" that curses you in the Pagoda Realm, you can find this boss inside the Mani Wheel at the top of the prison.\n\n* **Rewards:** Spirit of Captain Wise-Voice, Mind Core\n\n## Where to Find Captain Wise-Voice\n\nCaptain Wise-Voice is one of the four captains you can find in Chapter 3, and is a required boss to escape the prison of the Pagoda Realm. You can reach him by escaping up through the four levels of the Pagoda Prison and past the Outside the Wheel Shrine.\n\n### Captain Wise-Voice Boss Fight and Guide\n\nThis is your best chance to get in some real damage, but it's worth noting that a big charged heavy strike can sometimes knock it completely out of its dazed state. Instead, build up some more focus with one or two light combos, and then expend all your focus points on a bit charged hit to end its daze, taking off a huge amount of health in the process.\n\nRepeat the process of damaging its leg, or look for any opportunities to strike at its head -- particularly when it triggers the beguiling chant again to take off a chunk of your maximum HP.\n\nHowever, you'll also need to be ready to deal with its one major attack, which usually comes after you've assaulted its sphere at least once.\n\nAt a certain point, the construct will step into a corner of the room while the sphere lifts up and float high up toward the center, spinning wildly. It will send out beams of electricity in all direction as it twirls around, and the music swells.",
    "img_below_text": "Keep strafing, and wait for lasers to start hitting the ground near you to trigger incoming lightning strikes on your position. This is a great time to use Cloud Step to give it the slip, allowing you to conserve stamina for the final act.\n\nEventually, you'll see the entire floor light up with criss-crossing lines over almost every inch of the surface. Keep dodging the lightning strikes, and as soon as the floor glows red, hop onto your Pillar Stance to extend off the ground (the more stamina you have built up, the better).",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Captain Wise-Voice\n            - Section Title: Where to Find Captain Wise-Voice\n            - Sub-Section Title: Captain Wise-Voice Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Captain Wise-Voice\n\nCaptain Wise-Voice is a required Yaoguai King boss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Responsible for the \"beguiling chant\" that curses you in the Pagoda Realm, you can find this boss inside the Mani Wheel at the top of the prison.\n\n* **Rewards:** Spirit of Captain Wise-Voice, Mind Core\n\n## Where to Find Captain Wise-Voice\n\nCaptain Wise-Voice is one of the four captains you can find in Chapter 3, and is a required boss to escape the prison of the Pagoda Realm. You can reach him by escaping up through the four levels of the Pagoda Prison and past the Outside the Wheel Shrine.\n\n### Captain Wise-Voice Boss Fight and Guide\n\nThis is your best chance to get in some real damage, but it's worth noting that a big charged heavy strike can sometimes knock it completely out of its dazed state. Instead, build up some more focus with one or two light combos, and then expend all your focus points on a bit charged hit to end its daze, taking off a huge amount of health in the process.\n\nRepeat the process of damaging its leg, or look for any opportunities to strike at its head -- particularly when it triggers the beguiling chant again to take off a chunk of your maximum HP.\n\nHowever, you'll also need to be ready to deal with its one major attack, which usually comes after you've assaulted its sphere at least once.\n\nAt a certain point, the construct will step into a corner of the room while the sphere lifts up and float high up toward the center, spinning wildly. It will send out beams of electricity in all direction as it twirls around, and the music swells.\"\n            - Following Text: \"Keep strafing, and wait for lasers to start hitting the ground near you to trigger incoming lightning strikes on your position. This is a great time to use Cloud Step to give it the slip, allowing you to conserve stamina for the final act.\n\nEventually, you'll see the entire floor light up with criss-crossing lines over almost every inch of the surface. Keep dodging the lightning strikes, and as soon as the floor glows red, hop onto your Pillar Stance to extend off the ground (the more stamina you have built up, the better).\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Captain Wise-Voice as a required boss fight in Chapter 3 of the game \"Black Myth Wukong.\" Captain Wise-Voice is responsible for a curse in the Pagoda Realm and can be found inside the Mani Wheel at the top of the prison. The text provides a strategy for the boss fight, emphasizing the importance of using light combos to build focus before delivering a charged hit to deal significant damage.\n\nImage Summary:\nThe image depicts a scene from the boss fight with Captain Wise-Voice in \"Black Myth Wukong.\" It shows a dark, atmospheric setting with beams of light emanating from a central point, likely representing the sphere mentioned in the text. The player's character is visible, preparing to engage in combat, with various game interface elements displayed, including health bars and action icons. The image captures the intensity and challenge of the boss fight.\n\nFollowing Text Summary:\nThe following text continues to describe the boss fight with Captain Wise-Voice, focusing on the strategy to avoid the boss's major attack. It advises players to strafe and use the Cloud Step ability to dodge incoming lightning strikes. The text also warns of a phase where the floor lights up with criss-crossing lines, suggesting players use the Pillar Stance to avoid damage and conserve stamina for the final phase of the fight."
}