{
    "chunk_id": 420567650236,
    "source_file": "Chapter_2_Secret_-_Kingdom_of_Sahali_Walkthrough.md",
    "h1_title": "Chapter 2 Secret - Kingdom of Sahali Walkthrough",
    "h2_title": "How to Access the Kingdom of Sahali",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7e/Wukong_Fright_39.jpg",
    "alt_text": "Wukong Fright 39.jpg",
    "position_desc": 1,
    "img_above_text": "# Chapter 2 Secret - Kingdom of Sahali Walkthrough\n\nThe Kingdom of Sahali is a Secret Area found in Chapter 2's Yellow Wind Ridge of Black Myth Wukong. Below you'll find a guide to accessing the kingdom of the past by undertaking the Drunk Boar's Questline to find a Sobering Stone, and how to defeat the Tiger Vanguard and secret Yaoguai King Boss, Fuban.\n\n* Jump to a Section:\n* **How to Access the Kingdom of Sahali**\n- Yaoguai Chief - \"Tiger Vanguard\"\n* **Sandgate Bound**\n- Yaoguai King - Fuban\n\nThis Chapter 2 Secret can only be accessed by meeting the Yellow-Robed Square in Fright Cliff (aka the Drunken Boar), and helping him in his search for the \"Realm of Gold\" which requires a few steps (and for you to best him in combat).\n\n## How to Access the Kingdom of Sahali",
    "img_below_text": "In order to unlock this secret area, you need to find the Drunk Boar (the Yellow-Robed Squire) who can be found in the Rockrest Flat part of the Fright Cliff region in Chapter 2. Head straight to the back of the area from the shrine to find a small breakable wooden fence protected by a Spearbone enemy.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chapter 2 Secret - Kingdom of Sahali Walkthrough\n            - Section Title: How to Access the Kingdom of Sahali\n\n            Context:\n            - Preceding Text: \"# Chapter 2 Secret - Kingdom of Sahali Walkthrough\n\nThe Kingdom of Sahali is a Secret Area found in Chapter 2's Yellow Wind Ridge of Black Myth Wukong. Below you'll find a guide to accessing the kingdom of the past by undertaking the Drunk Boar's Questline to find a Sobering Stone, and how to defeat the Tiger Vanguard and secret Yaoguai King Boss, Fuban.\n\n* Jump to a Section:\n* **How to Access the Kingdom of Sahali**\n- Yaoguai Chief - \"Tiger Vanguard\"\n* **Sandgate Bound**\n- Yaoguai King - Fuban\n\nThis Chapter 2 Secret can only be accessed by meeting the Yellow-Robed Square in Fright Cliff (aka the Drunken Boar), and helping him in his search for the \"Realm of Gold\" which requires a few steps (and for you to best him in combat).\n\n## How to Access the Kingdom of Sahali\"\n            - Following Text: \"In order to unlock this secret area, you need to find the Drunk Boar (the Yellow-Robed Squire) who can be found in the Rockrest Flat part of the Fright Cliff region in Chapter 2. Head straight to the back of the area from the shrine to find a small breakable wooden fence protected by a Spearbone enemy.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Kingdom of Sahali as a secret area in Chapter 2 of *Black Myth: Wukong*. It explains that players need to complete the Drunk Boar's questline, which involves finding a Sobering Stone, defeating the Tiger Vanguard, and ultimately facing the secret boss, Fuban. The section titled \"How to Access the Kingdom of Sahali\" begins by outlining the steps needed to unlock this area.\n\nImage Summary:\nThe image depicts a gameplay scene from *Black Myth: Wukong*, showing the player character approaching a Spearbone enemy in a rocky, grassy environment. The enemy stands near a small wooden fence, which aligns with the description of the area in the Fright Cliff region where players must locate the Drunk Boar and progress toward unlocking the Kingdom of Sahali.\n\nFollowing Text Summary:\nThe following text provides instructions for unlocking the secret area. It directs players to find the Drunk Boar in the Rockrest Flat section of Fright Cliff. To proceed, players must head to the back of the area from the shrine and locate a breakable wooden fence guarded by a Spearbone enemy, as shown in the image."
}