{
    "chunk_id": 728630664554,
    "source_file": "Bamboo_Grove_Walkthrough.md",
    "h1_title": "Bamboo Grove Walkthrough",
    "h2_title": "Snake Trail",
    "h3_title": "Yaoguai Chief Mini-Boss Fight - Baw-Li-Guhh-Lang",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b5/Wukong_Bamboo_16.jpg",
    "alt_text": "Wukong Bamboo 16.jpg",
    "position_desc": 14,
    "img_above_text": "# Bamboo Grove Walkthrough\n\nThe Bamboo Grove is the second main region of Chapter 1's Black Wind Mountain in Black Myth: Wukong. Below you'll find a guide to the progressing through the grove and learning how to cultivate Spirits, accessing a secret realm, as well as how to defeat the many bosses of this area that include Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble.\n\n* **Jump to A Section:**\n* **Back Hills**\n* **Snake Trail**\n- Yaoguai Chief - Baw-Li-Guhh-Lang\n- Yaoguai Chief - Guangmo\n* **Marsh of the White Mist**\n- Boss FIght - Whiteclad Noble\n\n\nTo advance, keep heading up the stairway to cross the high bridge over the falls, where you’ll soon see the golden trail of a nearby shrine beckoning you left. Before making that turn, be sure to look to the right to find a small wooden gazebo with a small table, and open the small gold box on top to find a variety of medicines, including 2 **Tiger Subduing Pellets** , 1 **Evil Repelling Medicament** and 1 **Amplification Pellet**.\n\n## Snake Trail\n\nThis path leads to a marshy swamp area full of tall white reed flowers. Several Croaky enemies hide within them, so use your lock-on to identify them so you aren’t ambushed. However, as you make your way through the marsh toward a large stone mural in the cliffs, an optional mini-boss will leap out to fight you.\n\n### Yaoguai Chief Mini-Boss Fight - Baw-Li-Guhh-Lang\n\nA gargantuan Yaoguai Toad, Baw-Li-Guhh-Lang will waste no time leaping into battle with a powerful slam attack from the air. While he doesn’t have many moves, they can often land extremely quickly, which means you’ll need to be ready to dodge at any moment.",
    "img_below_text": "His most standard attack includes a series of swipes with both arms that sends him forward, ending in a small leaping splash attack that allows him to reposition. By dodging the first swipe to the side, you can wait for him to leap back towards you and then use Immobilize to keep in place while you attack. He can also use any of these swipes and slams independently as well as in a three-hit combo, so look for a follow-up attack before deciding to commit to countering with your own attacks.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bamboo Grove Walkthrough\n            - Section Title: Snake Trail\n            - Sub-Section Title: Yaoguai Chief Mini-Boss Fight - Baw-Li-Guhh-Lang\n\n            Context:\n            - Preceding Text: \"# Bamboo Grove Walkthrough\n\nThe Bamboo Grove is the second main region of Chapter 1's Black Wind Mountain in Black Myth: Wukong. Below you'll find a guide to the progressing through the grove and learning how to cultivate Spirits, accessing a secret realm, as well as how to defeat the many bosses of this area that include Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble.\n\n* **Jump to A Section:**\n* **Back Hills**\n* **Snake Trail**\n- Yaoguai Chief - Baw-Li-Guhh-Lang\n- Yaoguai Chief - Guangmo\n* **Marsh of the White Mist**\n- Boss FIght - Whiteclad Noble\n\n\nTo advance, keep heading up the stairway to cross the high bridge over the falls, where you’ll soon see the golden trail of a nearby shrine beckoning you left. Before making that turn, be sure to look to the right to find a small wooden gazebo with a small table, and open the small gold box on top to find a variety of medicines, including 2 **Tiger Subduing Pellets** , 1 **Evil Repelling Medicament** and 1 **Amplification Pellet**.\n\n## Snake Trail\n\nThis path leads to a marshy swamp area full of tall white reed flowers. Several Croaky enemies hide within them, so use your lock-on to identify them so you aren’t ambushed. However, as you make your way through the marsh toward a large stone mural in the cliffs, an optional mini-boss will leap out to fight you.\n\n### Yaoguai Chief Mini-Boss Fight - Baw-Li-Guhh-Lang\n\nA gargantuan Yaoguai Toad, Baw-Li-Guhh-Lang will waste no time leaping into battle with a powerful slam attack from the air. While he doesn’t have many moves, they can often land extremely quickly, which means you’ll need to be ready to dodge at any moment.\"\n            - Following Text: \"His most standard attack includes a series of swipes with both arms that sends him forward, ending in a small leaping splash attack that allows him to reposition. By dodging the first swipe to the side, you can wait for him to leap back towards you and then use Immobilize to keep in place while you attack. He can also use any of these swipes and slams independently as well as in a three-hit combo, so look for a follow-up attack before deciding to commit to countering with your own attacks.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Bamboo Grove region in *Black Myth: Wukong*, detailing its progression and notable encounters. It describes the Snake Trail as a marshy area filled with hidden enemies and mentions an optional mini-boss fight with Baw-Li-Guhh-Lang, a powerful Yaoguai Toad that initiates combat with a slam attack.\n\nImage Summary:  \nThe image depicts the mini-boss fight against Baw-Li-Guhh-Lang, a large Yaoguai Toad, in the Snake Trail area. The toad is mid-action, leaping toward the player amidst a swampy environment with tall reeds and rocky cliffs. The game's interface shows health bars, abilities, and items, emphasizing the combat scenario.\n\nFollowing Text Summary:  \nThe following text elaborates on Baw-Li-Guhh-Lang's attack patterns, including arm swipes, leaping splash attacks, and combos. It provides tactical advice, such as dodging and using Immobilize to counter the toad's moves effectively during the fight."
}