{
    "chunk_id": 841222104422,
    "source_file": "Cyan_Loong.md",
    "h1_title": "Cyan Loong",
    "h2_title": "Where to Find Cyan Loong",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/55/Wukong_Sandgate_63.jpg",
    "alt_text": "Wukong Sandgate 63.jpg",
    "position_desc": 1,
    "img_above_text": "# Cyan Loong\n\nCyan Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 3 of Black Myth Wukong. Hiding on the far side of Turtle Island this frozen boss can't be activated until you obtain a Key Item in the previous chapter. Cyan Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* Rewards: Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n\n## Where to Find Cyan Loong\n\nAs an optional secret boss, Cyan Loong can be found once you reach Turtle Island on the Bitter Lake. You can find his frozen body apparently fishing off the side of the \"island\" by heading right from the Turtle Island Shrine.\n\nHowever, in order to activate this secret boss, you'll need to obtain the Loong Scales from the Yellow Wind Ridge in Chapter 2.",
    "img_below_text": "Head through the Sandgate Village and defeat the King of Flowing Sand and his Second Rat Prince son. After defeating the pair (or only the son), head left from the boss arena and into the Valley of Despair.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Cyan Loong\n            - Section Title: Where to Find Cyan Loong\n\n            Context:\n            - Preceding Text: \"# Cyan Loong\n\nCyan Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 3 of Black Myth Wukong. Hiding on the far side of Turtle Island this frozen boss can't be activated until you obtain a Key Item in the previous chapter. Cyan Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* Rewards: Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n\n## Where to Find Cyan Loong\n\nAs an optional secret boss, Cyan Loong can be found once you reach Turtle Island on the Bitter Lake. You can find his frozen body apparently fishing off the side of the \"island\" by heading right from the Turtle Island Shrine.\n\nHowever, in order to activate this secret boss, you'll need to obtain the Loong Scales from the Yellow Wind Ridge in Chapter 2.\"\n            - Following Text: \"Head through the Sandgate Village and defeat the King of Flowing Sand and his Second Rat Prince son. After defeating the pair (or only the son), head left from the boss arena and into the Valley of Despair.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Cyan Loong, an optional secret boss in *Black Myth: Wukong*. Cyan Loong is a frozen Yaoguai King located on Turtle Island in Chapter 3. To activate this boss fight, players must first acquire the Loong Scales from Yellow Wind Ridge in Chapter 2. Defeating Cyan Loong rewards players with powerful crafting materials and items.\n\nImage Summary:\nThe image depicts a gameplay scene from *Black Myth: Wukong*, showing the player character navigating a rocky, arid environment with sparse vegetation. The character wields a staff and is approaching a glowing object or area of interest near a rock formation. The interface displays health, abilities, and item icons, suggesting exploration or preparation for combat.\n\nFollowing Text Summary:\nThe following text provides directions for progressing in the game after activating Cyan Loong. Players are instructed to traverse Sandgate Village, defeat the King of Flowing Sand and his Second Rat Prince son, and then proceed left into the Valley of Despair for further exploration or encounters."
}