{
    "chunk_id": 896747928624,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "h1_title": "Furnace Valley Walkthrough",
    "h2_title": "Valley Entrance",
    "h3_title": "A Note on Flamlings",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/cc/Furnace_Valley_Walkthrough_%2827%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(27\\).png",
    "position_desc": 11,
    "img_above_text": "# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n## Valley Entrance\n\nUltimately, you're going to go left to continue on the main path (and you may start to hear characters talk as you approach this pillar), but for now, you'll want to detour and explore the area to the right.\n\nThe first thing you'll see as you go to the right is the Flamlings that sit in the lava. These will spit fire at you, so it's best to deal with them to remove the ranged attacks while you explore.\n\n### A Note on Flamlings\n\nContinue up the stream of lava to find another Flamling and a tree to harvest for a Fire Date. Now go right, where you should see a cart just to the left. There is a green Wisp to collect right by its arm, and a chest opposite it that won't necessarily be visible to you yet. But what will be, is the Tenner guarding it.\n\nApproach carefully and deal with the Tenner and the Flamlings that will appear as soon as you're close to the cart.",
    "img_below_text": "When the area is clear, collect the green Wisps and open the chest to collect Fine Gold Thread and Blood of the Iron Bull.Now approach the cart. This is one of the Five Element Carts, but it's already been dealt with. Get close to its mouth and pull the string when prompted. When you do, you'll hear the voice of Ma Tianba (the horse guai from previous chapters) coming from inside. Keep pulling the string until you've exhausted all dialogue, and then move on. There's nothing more you can do here for now, but we'll return later.\n\nFace away from the cart and back in the direction you came from. There's more to explore at the moment, before you continue up to the archway you can see in the distance.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Furnace Valley Walkthrough\n            - Section Title: Valley Entrance\n            - Sub-Section Title: A Note on Flamlings\n\n            Context:\n            - Preceding Text: \"# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n## Valley Entrance\n\nUltimately, you're going to go left to continue on the main path (and you may start to hear characters talk as you approach this pillar), but for now, you'll want to detour and explore the area to the right.\n\nThe first thing you'll see as you go to the right is the Flamlings that sit in the lava. These will spit fire at you, so it's best to deal with them to remove the ranged attacks while you explore.\n\n### A Note on Flamlings\n\nContinue up the stream of lava to find another Flamling and a tree to harvest for a Fire Date. Now go right, where you should see a cart just to the left. There is a green Wisp to collect right by its arm, and a chest opposite it that won't necessarily be visible to you yet. But what will be, is the Tenner guarding it.\n\nApproach carefully and deal with the Tenner and the Flamlings that will appear as soon as you're close to the cart.\"\n            - Following Text: \"When the area is clear, collect the green Wisps and open the chest to collect Fine Gold Thread and Blood of the Iron Bull.Now approach the cart. This is one of the Five Element Carts, but it's already been dealt with. Get close to its mouth and pull the string when prompted. When you do, you'll hear the voice of Ma Tianba (the horse guai from previous chapters) coming from inside. Keep pulling the string until you've exhausted all dialogue, and then move on. There's nothing more you can do here for now, but we'll return later.\n\nFace away from the cart and back in the direction you came from. There's more to explore at the moment, before you continue up to the archway you can see in the distance.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text describes the exploration of the Valley Entrance in the \"Furnace Valley Walkthrough.\" Players are advised to detour to the right to deal with Flamlings, which are fire-spitting enemies in the lava, and to explore the area for items and encounters. The text also mentions the presence of a Flamling near a tree that can be harvested for a Fire Date, as well as a cart and a chest guarded by a Tenner and additional Flamlings.\n\nImage Summary:  \nThe image depicts a dark, lava-lit environment with a player character standing in the foreground, armed with a weapon. Key points of interest are highlighted with red dashed circles, including a chest on the left, a green Wisp on the right, and a large, imposing creature resembling a Tenner near the center-right. The scene emphasizes the need for exploration and combat in this area, as well as the collection of items.\n\nFollowing Text Summary:  \nThe following text explains the next steps after clearing the area. Players are instructed to collect the green Wisp and open the chest to obtain Fine Gold Thread and Blood of the Iron Bull. They are then directed to interact with the cart, which is one of the Five Element Carts, and pull its string to trigger dialogue with Ma Tianba. After exhausting the dialogue, players are advised to explore further before proceeding to the archway in the distance."
}