{
    "chunk_id": 510188200213,
    "source_file": "Mount_Lingtai_Seedlings.md",
    "h1_title": "Mount Lingtai Seedlings",
    "h2_title": "Black Myth: Wukong Mount Lingtai Seedlings Location",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/90/Black-myth-wukong-woods-of-ember-seeds.jpg",
    "alt_text": "Black-myth-wukong-woods-of-ember-seeds.jpg",
    "position_desc": 1,
    "img_above_text": "# Mount Lingtai Seedlings\n\nThe Mount Lingtai Seedlings is one of the Epic Soaks for your Gourds in Black Myth: Wukong. The Soak's ability is specalized and built around the A Pluck of Many Spell.\n\nWith the Mount Lingtai Seedlings equipped, using the gourd moderately extends the duration of Duplicates for the next A Pluck of Many cast for a short duration.\n\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor.\n\n## Black Myth: Wukong Mount Lingtai Seedlings Location\n\nThe Mount Lingtai Seedlings can be found in Woods of Ember at the Camp of Seasons Shrine in the Flaming Mountains. From the Shrine, cross the bridge and follow the path to the left. Along the next bridge and past the large tree, you can find the Soak sitting in the gazebo at the top of the hill.",
    "img_below_text": "Soaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Mount Lingtai Seedlings\n            - Section Title: Black Myth: Wukong Mount Lingtai Seedlings Location\n\n            Context:\n            - Preceding Text: \"# Mount Lingtai Seedlings\n\nThe Mount Lingtai Seedlings is one of the Epic Soaks for your Gourds in Black Myth: Wukong. The Soak's ability is specalized and built around the A Pluck of Many Spell.\n\nWith the Mount Lingtai Seedlings equipped, using the gourd moderately extends the duration of Duplicates for the next A Pluck of Many cast for a short duration.\n\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor.\n\n## Black Myth: Wukong Mount Lingtai Seedlings Location\n\nThe Mount Lingtai Seedlings can be found in Woods of Ember at the Camp of Seasons Shrine in the Flaming Mountains. From the Shrine, cross the bridge and follow the path to the left. Along the next bridge and past the large tree, you can find the Soak sitting in the gazebo at the top of the hill.\"\n            - Following Text: \"Soaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}