{
    "chunk_id": 529777302666,
    "source_file": "Bitter_Lake_Walkthrough.md",
    "h1_title": "Bitter Lake Walkthrough",
    "h2_title": "Yoaguai King Boss Fight - Kang-Jin Star",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e9/Wukong_Turtle_7.jpg",
    "alt_text": "Wukong Turtle 7.jpg",
    "position_desc": 7,
    "img_above_text": "# Bitter Lake Walkthrough\n\nAs you draw close, you'll hear a voice coming from the cymbals, who is arguing with a woman refusing to let the trapped person out. With a loud gong, the trapped \"Admiral\" will use the cymbal to awaken a giant turtle whose mountainous shell you're actually standing on.\n\nAs the turtle begins to swim through the Bitter Seal, the woman will become aware of your presence, starting this new region off with a bang of a boss fight.\n\n## Yoaguai King Boss Fight - Kang-Jin Star\n\nAfter taking a bit of damage, she can teleport away to appear high up in the air. Often times, this will start by turning into a larger electrical dragon resembling Kang-Jin Loong.\n\nWhen she's far away, she'll roar to create a lightning storm of sorts, causing large spear-like projectiles to hit the ground with an electric explosion, and only a moment's warning for where they'll strike.",
    "img_below_text": "Later on, Kang-Jin Star will appear much closer above you in her dragon form, and use a familiar tail slam to explode the ground around you. Luckily, not only can you dodge or deflect this, but you can then strafe to the right to attack the dragon's head before she transforms back.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bitter Lake Walkthrough\n            - Section Title: Yoaguai King Boss Fight - Kang-Jin Star\n\n            Context:\n            - Preceding Text: \"# Bitter Lake Walkthrough\n\nAs you draw close, you'll hear a voice coming from the cymbals, who is arguing with a woman refusing to let the trapped person out. With a loud gong, the trapped \"Admiral\" will use the cymbal to awaken a giant turtle whose mountainous shell you're actually standing on.\n\nAs the turtle begins to swim through the Bitter Seal, the woman will become aware of your presence, starting this new region off with a bang of a boss fight.\n\n## Yoaguai King Boss Fight - Kang-Jin Star\n\nAfter taking a bit of damage, she can teleport away to appear high up in the air. Often times, this will start by turning into a larger electrical dragon resembling Kang-Jin Loong.\n\nWhen she's far away, she'll roar to create a lightning storm of sorts, causing large spear-like projectiles to hit the ground with an electric explosion, and only a moment's warning for where they'll strike.\"\n            - Following Text: \"Later on, Kang-Jin Star will appear much closer above you in her dragon form, and use a familiar tail slam to explode the ground around you. Luckily, not only can you dodge or deflect this, but you can then strafe to the right to attack the dragon's head before she transforms back.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the beginning of the Bitter Lake region in the game, where the protagonist encounters a dramatic sequence involving a trapped \"Admiral\" and a giant turtle awakening. This leads to a confrontation with Kang-Jin Star, a boss who transforms into an electrical dragon and creates a lightning storm with spear-like projectiles.\n\nImage Summary:\nThe image depicts a snowy battlefield with a character mid-action, wielding a staff-like weapon surrounded by glowing, electrical energy. The environment includes rocky cliffs and lightning effects, suggesting an intense combat scenario. The health bar at the bottom indicates the boss, \"Kang-Jin Star,\" is actively engaged in the fight, aligning with the described boss battle.\n\nFollowing Text Summary:\nThe following text elaborates on Kang-Jin Star's dragon form, where she performs a tail slam attack to explode the ground. Players are advised to dodge or deflect the attack and then counter by strafing to the right to strike the dragon's head before she reverts to her original form."
}