{
    "chunk_id": 264098496097,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "h1_title": "Furnace Valley Walkthrough",
    "h2_title": "Rakshasa Palace",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0d/Furnace_Valley_Walkthrough_%2878%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(78\\).png",
    "position_desc": 39,
    "img_above_text": "# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n\nOpen the giant door at the top of the stairs. Go straight ahead and activate the Rakshasa Palace Keeper's Shrine.\n\n## Rakshasa Palace\n\nThen, go left and deal with the Stalwart and open the treasure chest it guards to collect Fine Gold Thread and Blood of the Iron Bull.",
    "img_below_text": "Head in the opposite direction and go underneath the bridge to loop back around to the right, and the first set of stairs now. Deal with the guard there, before proceeding up them.\n\nKeep following the staircases, turning right after the next set to cross the bridge toward the bull guard with the two staffs and the two Flame Rhino Masters.\n\nCross the bridge and up the small set of stairs, towards the giants. On the right, you'll encounter a Bull Governor. Though it's best to deal with the creature now, don't go to the right just yet.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Furnace Valley Walkthrough\n            - Section Title: Rakshasa Palace\n\n            Context:\n            - Preceding Text: \"# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n\nOpen the giant door at the top of the stairs. Go straight ahead and activate the Rakshasa Palace Keeper's Shrine.\n\n## Rakshasa Palace\n\nThen, go left and deal with the Stalwart and open the treasure chest it guards to collect Fine Gold Thread and Blood of the Iron Bull.\"\n            - Following Text: \"Head in the opposite direction and go underneath the bridge to loop back around to the right, and the first set of stairs now. Deal with the guard there, before proceeding up them.\n\nKeep following the staircases, turning right after the next set to cross the bridge toward the bull guard with the two staffs and the two Flame Rhino Masters.\n\nCross the bridge and up the small set of stairs, towards the giants. On the right, you'll encounter a Bull Governor. Though it's best to deal with the creature now, don't go to the right just yet.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text describes the player's progression in the \"Furnace Valley Walkthrough\" within the \"Rakshasa Palace\" section. It instructs the player to activate the Rakshasa Palace Keeper's Shrine, then proceed left to defeat a Stalwart enemy and collect items from a treasure chest, including Fine Gold Thread and Blood of the Iron Bull.\n\nImage Summary:  \nThe image depicts a fiery, lava-filled environment with a stone bridge in the background and a humanoid, beast-like enemy in the foreground. The red arrow overlaid on the image suggests a directional cue, guiding the player to move toward or under the bridge as part of the exploration in the Rakshasa Palace area.\n\nFollowing Text Summary:  \nThe following text provides further instructions for navigating the area. It directs the player to head in the opposite direction, go underneath the bridge, and loop around to the right. The player is then advised to deal with a guard near the first set of stairs and continue ascending staircases, eventually encountering additional enemies, including a Bull Governor and Flame Rhino Masters."
}