{
    "chunk_id": 182373957568,
    "source_file": "Celestial_Jade_Lotus_Pill_Locations.md",
    "h1_title": "Celestial Jade Lotus Pill Locations",
    "h2_title": "Black Wind Mountain Celestial Jade Lotus Pill",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/ac/Jade_Lotus_Pill_Location.jpg",
    "alt_text": "Jade Lotus Pill Location.jpg",
    "position_desc": 1,
    "img_above_text": "# Celestial Jade Lotus Pill Locations\n\n**Celestial Jade Lotus Pills** are items that you can collect in Black Myth: Wukong to increase your maximum HP. Every hit counts in Black Myth: Wukong, and having less health to burn through can easily be the difference between life and death. Here, we will cover the locations of all Celestial Jade Lotus Pills so you can have as much HP as possible.\n\n* Black Wind Mountain Celestial Jade Lotus Pill\n* Yellow Wind Ridge Celestial Jade Lotus Pills\n* Xu-Dog Celestial Jade Lotus Pills\n* The New West Celestial Jade Lotus Pill\n* The Webbed Hollow Celestial Jade Lotus Pill\n* Flaming Mountains Celestial Jade Lotus Pill\n\n## Black Wind Mountain Celestial Jade Lotus Pill",
    "img_below_text": "You can find the first Celestial Jade Lotus Pill after defeating Lingxuzi at Guanyin Temple. Once you've defeated Lingxuzi, head straight through the temple on the opposite side of the arena and turn left. There, you will find the Celestial Jade Lotus Pill in a small golden chest sitting on a table.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Celestial Jade Lotus Pill Locations\n            - Section Title: Black Wind Mountain Celestial Jade Lotus Pill\n\n            Context:\n            - Preceding Text: \"# Celestial Jade Lotus Pill Locations\n\n**Celestial Jade Lotus Pills** are items that you can collect in Black Myth: Wukong to increase your maximum HP. Every hit counts in Black Myth: Wukong, and having less health to burn through can easily be the difference between life and death. Here, we will cover the locations of all Celestial Jade Lotus Pills so you can have as much HP as possible.\n\n* Black Wind Mountain Celestial Jade Lotus Pill\n* Yellow Wind Ridge Celestial Jade Lotus Pills\n* Xu-Dog Celestial Jade Lotus Pills\n* The New West Celestial Jade Lotus Pill\n* The Webbed Hollow Celestial Jade Lotus Pill\n* Flaming Mountains Celestial Jade Lotus Pill\n\n## Black Wind Mountain Celestial Jade Lotus Pill\"\n            - Following Text: \"You can find the first Celestial Jade Lotus Pill after defeating Lingxuzi at Guanyin Temple. Once you've defeated Lingxuzi, head straight through the temple on the opposite side of the arena and turn left. There, you will find the Celestial Jade Lotus Pill in a small golden chest sitting on a table.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the \"Celestial Jade Lotus Pills\" in *Black Myth: Wukong*, explaining their significance in increasing maximum HP, which is crucial for survival in the game. It lists various locations where these pills can be found, starting with Black Wind Mountain.\n\nImage Summary:\nThe image depicts an in-game scene from *Black Myth: Wukong*, showing a character standing in front of a table with a glowing golden chest. The setting appears to be a dimly lit temple adorned with intricate carvings, statues, and candles, suggesting a sacred or significant location tied to the collection of the Celestial Jade Lotus Pill.\n\nFollowing Text Summary:\nThe following text provides instructions for obtaining the Celestial Jade Lotus Pill at Black Wind Mountain. It states that the pill is located in a small golden chest on a table inside Guanyin Temple, accessible after defeating Lingxuzi and proceeding through the temple to the left."
}