{
    "chunk_id": 110942596092,
    "source_file": "Ginseng_Cape.md",
    "h1_title": "Ginseng Cape",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2a/Wukong_Karma_11.jpg",
    "alt_text": "Wukong Karma 11.jpg",
    "position_desc": 1,
    "img_above_text": "# Ginseng Cape\n\nThe Ginseng Cape is a Epic unique piece of Armor and Gear in Black Myth: Wukong. It comes with decent defense, and a unique ability that no other piece of armor has.\n\nIt has 48 Defense and the following Unique Effect:\n\n* For a short duration after using the gourd, moderately increases Maximum Stamina\n\nThe Ginseng Cape is obtained upon defeating Old Ginseng Guai in the Towers of Karma area in Valley of Ecstasy in Chapter 3 - The New West.",
    "img_below_text": "Armor can be upgraded, with Silk once you reach Chen Loong and open the Zodiac Realm in The New West in Chapter 3.\n\nFor even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Weapons locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Ginseng Cape\n\n            Context:\n            - Preceding Text: \"# Ginseng Cape\n\nThe Ginseng Cape is a Epic unique piece of Armor and Gear in Black Myth: Wukong. It comes with decent defense, and a unique ability that no other piece of armor has.\n\nIt has 48 Defense and the following Unique Effect:\n\n* For a short duration after using the gourd, moderately increases Maximum Stamina\n\nThe Ginseng Cape is obtained upon defeating Old Ginseng Guai in the Towers of Karma area in Valley of Ecstasy in Chapter 3 - The New West.\"\n            - Following Text: \"Armor can be upgraded, with Silk once you reach Chen Loong and open the Zodiac Realm in The New West in Chapter 3.\n\nFor even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Weapons locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Ginseng Cape, an epic and unique piece of armor in *Black Myth: Wukong*. It highlights the cape's stats, including 48 Defense and a unique effect that temporarily increases maximum stamina after using the gourd. The item is obtained by defeating Old Ginseng Guai in the Towers of Karma area during Chapter 3 - The New West.\n\nImage Summary:  \nThe image depicts a combat scene from *Black Myth: Wukong*, showing the player character engaged in battle with Old Ginseng Guai, the boss enemy associated with obtaining the Ginseng Cape. The snowy environment and dynamic action suggest the intensity of the encounter, with visible health bars and combat abilities displayed on the screen.\n\nFollowing Text Summary:  \nThe following text explains that armor in the game can be upgraded using Silk after reaching Chen Loong and accessing the Zodiac Realm in Chapter 3. It also provides guidance on finding other items in the game, including weapons, gourds, curios, vessels, transformation spells, medicine ingredients, and consumables."
}