{
    "chunk_id": 975199911261,
    "source_file": "Drunken_Boar_Questline.md",
    "h1_title": "Drunken Boar Questline",
    "h2_title": "Where to Get the Sobering Stone",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/75/Wukong_Yellow_1.jpg",
    "alt_text": "Wukong Yellow 1.jpg",
    "position_desc": 4,
    "img_above_text": "# Drunken Boar Questline\n\nThe Drunken Boar (aka Drunken Pig or his official name, the Yellow-Robed Squire) is a character you can meet and also fight in Chapter 2 of Black Myth Wukong. This character will ask you to complete a side quest for him that will unlock Chapter 2’s Secret Area: The Kingdom of Sahali.\n\n\nIn this large open field, you’ll find a friendly boar-like Guai resting on a rock. He’s apparently extremely inebriated, and needs you to help him find something to sober him up. He’ll mention “**Windrest** ” if you talk to him again, providing a clue to where you can find such an ingredient.\n\n## Where to Get the Sobering Stone\n\nThere are two ways to get the item required, one of which will cost you, and the other through exploring. If you complete the **Man-in-Stone’s questline**, you’ll find that the **Man-in-Stone** sells a **Sobering Stone** if you don’t want to explore. Since it costs a hefty 6,480 Will, you’re better off finding one yourself.",
    "img_below_text": "To locate the stone itself, you’ll need to head through the Yellow Wind Formation to the **Windrest Hamlet** , which is across the **Windrest Bridge** up the road past the Crouching Tiger Temple. Once you enter the hamlet, take a left to find a large building guarded by a Rat Soldier and Rat Imperial Guard.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Drunken Boar Questline\n            - Section Title: Where to Get the Sobering Stone\n\n            Context:\n            - Preceding Text: \"# Drunken Boar Questline\n\nThe Drunken Boar (aka Drunken Pig or his official name, the Yellow-Robed Squire) is a character you can meet and also fight in Chapter 2 of Black Myth Wukong. This character will ask you to complete a side quest for him that will unlock Chapter 2’s Secret Area: The Kingdom of Sahali.\n\n\nIn this large open field, you’ll find a friendly boar-like Guai resting on a rock. He’s apparently extremely inebriated, and needs you to help him find something to sober him up. He’ll mention “**Windrest** ” if you talk to him again, providing a clue to where you can find such an ingredient.\n\n## Where to Get the Sobering Stone\n\nThere are two ways to get the item required, one of which will cost you, and the other through exploring. If you complete the **Man-in-Stone’s questline**, you’ll find that the **Man-in-Stone** sells a **Sobering Stone** if you don’t want to explore. Since it costs a hefty 6,480 Will, you’re better off finding one yourself.\"\n            - Following Text: \"To locate the stone itself, you’ll need to head through the Yellow Wind Formation to the **Windrest Hamlet** , which is across the **Windrest Bridge** up the road past the Crouching Tiger Temple. Once you enter the hamlet, take a left to find a large building guarded by a Rat Soldier and Rat Imperial Guard.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Drunken Boar Questline in *Black Myth: Wukong*, where players encounter the Yellow-Robed Squire, a boar-like character in Chapter 2. He requests help finding an item to sober him up, hinting at \"Windrest\" as a potential location for the required ingredient, the Sobering Stone. Players can either purchase the stone from the Man-in-Stone for a high cost or explore to find it themselves.\n\nImage Summary:\nThe image depicts a player-character standing on a rooftop overlooking a rugged, open landscape with stone structures and a winding path. The setting appears to be an ancient, desolate area with architectural elements resembling temples or hamlets. The visual suggests exploration and traversal, aligning with the quest's narrative of locating the Sobering Stone in the Windrest Hamlet.\n\nFollowing Text Summary:\nThe following text provides directions to locate the Sobering Stone. Players must traverse the Yellow Wind Formation to reach Windrest Hamlet, crossing the Windrest Bridge and passing the Crouching Tiger Temple. Upon entering the hamlet, players should turn left to find a guarded building where the stone is likely located."
}