{
    "chunk_id": 211058689239,
    "source_file": "Pagoda_Realm_Walkthrough.md",
    "h1_title": "The Beguiling Chant of the Pagoda Realm",
    "h2_title": "Lower Pagoda (Level 1)",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/6c/Wukong_Pagoda_10.jpg",
    "alt_text": "Wukong Pagoda 10.jpg",
    "position_desc": 11,
    "img_above_text": "# The Beguiling Chant of the Pagoda Realm\n\nIf you see them perform a hand gesture, expect them to disappear, only to reappear from a different angle to try and kick you without warning.\n\n## Lower Pagoda (Level 1)\n\nPast the Shrine, the path will lead into the cells, and a long tunnel through the dark. Up ahead, be wary of a Yaksha Archer who will try and bait you into charging him, only for a Cyan Bat above him to divebomb you from behind with its ice attack.",
    "img_below_text": "Just past the duo, you'll find an open gate leading back to the outer ring, while the interior passageway also continues. If you dip out for a moment, you can look right back the way you came to find two enemies guarding a green Wisp by a pile of rubble with another Yaksha Archer at the top.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: The Beguiling Chant of the Pagoda Realm\n            - Section Title: Lower Pagoda (Level 1)\n\n            Context:\n            - Preceding Text: \"# The Beguiling Chant of the Pagoda Realm\n\nIf you see them perform a hand gesture, expect them to disappear, only to reappear from a different angle to try and kick you without warning.\n\n## Lower Pagoda (Level 1)\n\nPast the Shrine, the path will lead into the cells, and a long tunnel through the dark. Up ahead, be wary of a Yaksha Archer who will try and bait you into charging him, only for a Cyan Bat above him to divebomb you from behind with its ice attack.\"\n            - Following Text: \"Just past the duo, you'll find an open gate leading back to the outer ring, while the interior passageway also continues. If you dip out for a moment, you can look right back the way you came to find two enemies guarding a green Wisp by a pile of rubble with another Yaksha Archer at the top.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}