{
    "chunk_id": 94061823439,
    "source_file": "Black_Wind_Cave_Walkthrough.md",
    "h1_title": "Black Wind Cave Walkthrough",
    "h2_title": "Yaoguai King Boss Fight - Black Wind King",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bb/Wukong_BlackWind_20.jpg",
    "alt_text": "Wukong BlackWind 20.jpg",
    "position_desc": 19,
    "img_above_text": "# Black Wind Cave Walkthrough\n\nThe Black Wind Cave is the final region of Chapter 2's Black Wind Mountain in Black Myth: Wukong. Though it is a short area, it will prove to be a challenging one as you go up against the greedy King of the Mountain. Below you'll find a guide to the progressing through the cave to the mountaintop, as well as how to defeat the boss of this area in his two forms, the Black Wind King and the Black Bear Guai.\n\n* **Jump to A Section:**\n* **Cave Interior**\n- Black Wind King\n* **Outside the Cave**\n* **Bodhi Peak**\n- Black Bear Guai\n\n\nReturn to the path and take the stairs up to fight against another Wolf Assassin as the cave grows dark, and draw them into the light if needed.\n\nAs you reach an open part of the cave, you’ll have to face one more assassin along the darkened path, and you may notice they’ll go out of their way to destroy the torches along the path to further envelop them in darkness. If you have trouble facing them, always try to bring them to a brighter spot.\n\nNote that if you went ahead and defeated the Secret Boss by ringing the three bells, you should also have access to craft an additional Bronze Set that improves your abilities using the Immobilize Spell!\n\nCraft and upgrade whatever you can afford at the moment, because a boss is waiting inside the temple to test your might, and he’s no pushover.\n\n## Yaoguai King Boss Fight - Black Wind King\n\nYou should also look to the right of where the Black Wind King was standing next to the holder for his spear at the start of the battle, where you can find a small wooden table next to two bells with a box. Open it to find an **Agate Jar** — a Curio you can equip.",
    "img_below_text": "Check the sides of the cave to find some Jade Lotus and Aged Ginseng, then head to the far end to sidle through an exit. This disguised loading screen will turn the day into dusk as you find yourself closer to the top of the mountain.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Black Wind Cave Walkthrough\n            - Section Title: Yaoguai King Boss Fight - Black Wind King\n\n            Context:\n            - Preceding Text: \"# Black Wind Cave Walkthrough\n\nThe Black Wind Cave is the final region of Chapter 2's Black Wind Mountain in Black Myth: Wukong. Though it is a short area, it will prove to be a challenging one as you go up against the greedy King of the Mountain. Below you'll find a guide to the progressing through the cave to the mountaintop, as well as how to defeat the boss of this area in his two forms, the Black Wind King and the Black Bear Guai.\n\n* **Jump to A Section:**\n* **Cave Interior**\n- Black Wind King\n* **Outside the Cave**\n* **Bodhi Peak**\n- Black Bear Guai\n\n\nReturn to the path and take the stairs up to fight against another Wolf Assassin as the cave grows dark, and draw them into the light if needed.\n\nAs you reach an open part of the cave, you’ll have to face one more assassin along the darkened path, and you may notice they’ll go out of their way to destroy the torches along the path to further envelop them in darkness. If you have trouble facing them, always try to bring them to a brighter spot.\n\nNote that if you went ahead and defeated the Secret Boss by ringing the three bells, you should also have access to craft an additional Bronze Set that improves your abilities using the Immobilize Spell!\n\nCraft and upgrade whatever you can afford at the moment, because a boss is waiting inside the temple to test your might, and he’s no pushover.\n\n## Yaoguai King Boss Fight - Black Wind King\n\nYou should also look to the right of where the Black Wind King was standing next to the holder for his spear at the start of the battle, where you can find a small wooden table next to two bells with a box. Open it to find an **Agate Jar** — a Curio you can equip.\"\n            - Following Text: \"Check the sides of the cave to find some Jade Lotus and Aged Ginseng, then head to the far end to sidle through an exit. This disguised loading screen will turn the day into dusk as you find yourself closer to the top of the mountain.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text describes the Black Wind Cave, a challenging area in *Black Myth: Wukong*, where players face enemies such as Wolf Assassins and a boss known as the Black Wind King. Players are advised to use light strategically against enemies who destroy torches to create darkness. Before the boss fight, players can craft and upgrade gear, including a Bronze Set if they defeated a secret boss earlier. The Black Wind King awaits inside the temple, and players can find an Agate Jar near his spear holder.\n\nImage Summary:  \nThe image depicts a dark, overgrown area near the entrance of a wooden structure illuminated by two small fires. A character holding a staff is approaching the structure, suggesting progression toward a significant location, likely the temple where the Black Wind King boss fight occurs. The dim lighting and atmospheric design emphasize the cave's ominous and challenging nature.\n\nFollowing Text Summary:  \nThe following text instructs players to explore the cave's sides for items like Jade Lotus and Aged Ginseng before exiting through a narrow passage. This transition serves as a disguised loading screen, changing the time of day to dusk and bringing players closer to the mountain's summit."
}