{
    "chunk_id": 475740303531,
    "source_file": "Green-Capped_Martialist.md",
    "h1_title": "Green-Capped Martialist",
    "h2_title": "Where to Find the Green-Capped Martialist",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/df/Wukong_Karma_6.jpg",
    "alt_text": "Wukong Karma 6.jpg",
    "position_desc": 3,
    "img_above_text": "# Green-Capped Martialist\n\nThe Green-Capped Martialist is an optional and secret Character Boss fight that you can encounter in Chapter 3 of Black Myth Wukong. This boss can only be fought by undertaking a Treasure Hunter's Quest that begins along the Bitter Lake and leads to the Valley of Ecstasy, where you'll have to uncover a secret Melon Field.\n\n* Rewards: Spell-Binder Spell, Cold Iron Leaves, Random Materials, 1847 Experience, 1190 Will\n\n## Where to Find the Green-Capped Martialist\n\nOnce you reach the shore, take a left when facing the Shrine and head past the area where Chen Loong is and through a gate to find a human being harassed by small Apramana Bats. Defeat them and talk to him to learn of his quest to find a treasure.",
    "img_below_text": "Once you reach the Valley of Ecstasy region, head along the main path through the Forest of Felicity and take a left down a slope to enter the Towers of Karma area. Search along the back of this sub-region to find the same Treasure Hunter freezing from the cold sitting in a large gnarled tree, left of the main Shrine in this area.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Green-Capped Martialist\n            - Section Title: Where to Find the Green-Capped Martialist\n\n            Context:\n            - Preceding Text: \"# Green-Capped Martialist\n\nThe Green-Capped Martialist is an optional and secret Character Boss fight that you can encounter in Chapter 3 of Black Myth Wukong. This boss can only be fought by undertaking a Treasure Hunter's Quest that begins along the Bitter Lake and leads to the Valley of Ecstasy, where you'll have to uncover a secret Melon Field.\n\n* Rewards: Spell-Binder Spell, Cold Iron Leaves, Random Materials, 1847 Experience, 1190 Will\n\n## Where to Find the Green-Capped Martialist\n\nOnce you reach the shore, take a left when facing the Shrine and head past the area where Chen Loong is and through a gate to find a human being harassed by small Apramana Bats. Defeat them and talk to him to learn of his quest to find a treasure.\"\n            - Following Text: \"Once you reach the Valley of Ecstasy region, head along the main path through the Forest of Felicity and take a left down a slope to enter the Towers of Karma area. Search along the back of this sub-region to find the same Treasure Hunter freezing from the cold sitting in a large gnarled tree, left of the main Shrine in this area.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Green-Capped Martialist, a secret boss in *Black Myth Wukong*. To encounter this boss, players must undertake a Treasure Hunter's Quest starting at Bitter Lake and progressing to the Valley of Ecstasy. The quest involves uncovering a secret Melon Field and defeating enemies along the way. Rewards for defeating the boss include valuable items, materials, and experience points.\n\n---\n\nImage Summary:\nThe image depicts a snowy landscape with a player character approaching a large, gnarled tree where a figure is sitting. The environment includes decorative stone pillars and sparse vegetation, suggesting the setting is part of the Valley of Ecstasy region. The text overlay, \"Fire. I need fire...\" implies the figure in the tree is struggling with cold, aligning with the narrative of the Treasure Hunter's plight described in the context.\n\n---\n\nFollowing Text Summary:\nThe following text provides directions to locate the Treasure Hunter in the Valley of Ecstasy. Players must follow the main path through the Forest of Felicity, descend a slope to the Towers of Karma area, and search near the Shrine to find the Treasure Hunter sitting in a large gnarled tree, suffering from the cold. This interaction progresses the quest tied to the Green-Capped Martialist."
}