{
    "chunk_id": 239551176616,
    "source_file": "Gold_Spikeplate.md",
    "h1_title": "Gold Spikeplate",
    "h2_title": "Black Myth: Wukong Gold Spikeplate Location",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b2/Wukong_Longevity_2.jpg",
    "alt_text": "Wukong Longevity 2.jpg",
    "position_desc": 1,
    "img_above_text": "# Gold Spikeplate\n\nThe Gold Spikeplate is one of the many Curios items you can find in Black Myth: Wukong. Like the rest of these items, once found, it can be equipped from the Equipment menu.\n\nWith the Gold Spikeplate equipped your defense is considerably increased. Additionally, when taking hits, you deal damage to enemies surrounding enemies.\n\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, the item will stay at its current power throughout the game. If you want a better buff or something else to fit your build, you will need to switch it out.\n\n## Black Myth: Wukong Gold Spikeplate Location\n\nThe Gold Spikeplate can be found in The New West, specifically within the Valley of Ecstasy, Longevity Road Shrine area. Follow the road along until you reach the Dark-faced Overlord in the back of the area. Defeat it to get the Curios item.",
    "img_below_text": "For even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Gold Spikeplate\n            - Section Title: Black Myth: Wukong Gold Spikeplate Location\n\n            Context:\n            - Preceding Text: \"# Gold Spikeplate\n\nThe Gold Spikeplate is one of the many Curios items you can find in Black Myth: Wukong. Like the rest of these items, once found, it can be equipped from the Equipment menu.\n\nWith the Gold Spikeplate equipped your defense is considerably increased. Additionally, when taking hits, you deal damage to enemies surrounding enemies.\n\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, the item will stay at its current power throughout the game. If you want a better buff or something else to fit your build, you will need to switch it out.\n\n## Black Myth: Wukong Gold Spikeplate Location\n\nThe Gold Spikeplate can be found in The New West, specifically within the Valley of Ecstasy, Longevity Road Shrine area. Follow the road along until you reach the Dark-faced Overlord in the back of the area. Defeat it to get the Curios item.\"\n            - Following Text: \"For even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe Gold Spikeplate is a Curios item in *Black Myth: Wukong* that enhances defense and deals damage to nearby enemies when the player takes hits. It cannot be upgraded, so players may need to switch it out for other items depending on their build. The item is located in the Valley of Ecstasy, Longevity Road Shrine area, and can be obtained by defeating the Dark-faced Overlord.\n\nImage Summary:  \nThe image depicts a gameplay scene from *Black Myth: Wukong*, showing a battle between the player character and a large enemy, likely the Dark-faced Overlord mentioned in the context. The snowy environment and the enemy's imposing size emphasize the challenge of the encounter. The interface displays the player's health, abilities, and other gameplay elements, suggesting this is a key moment in acquiring the Gold Spikeplate.\n\nFollowing Text Summary:  \nThe following text encourages players to explore additional guides for locating other items in *Black Myth: Wukong*, including Drinks, Soaks, Weapons, Armor, and Gear sets."
}