{
    "chunk_id": 552967100235,
    "source_file": "The_Duskveil.md",
    "h1_title": "The Duskveil",
    "h2_title": "The Duskveil Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9a/Wukong_PurpleCloud_61.jpg",
    "alt_text": "Wukong PurpleCloud 61.jpg",
    "position_desc": 6,
    "img_above_text": "# The Duskveil\n\nThe Duskveil is an optional Yaoguai King boss fight that you can encounter in Chapter 4 of Black Myth Wukong. The cursed and undead remains of a celestial rooster guai, you can find this monster at the peak of the Purple Cloud Mountain, a secret area of the Webbed Hollow.\n\n* Rewards: Weaver's Needle Vessel, Duskveil's Horn, Kun Steel, Double-Combed Rooster Blood, Gold Tree Core, Mind Core, 3410 Experience, 2595 Will\n\n\nThe Duskveil is an optional Yaoguai King, though required to complete the region and return to the Temple of Yellow Flowers. It is highly recommended that you defeat both The Scorpionlord and Daoist Mi before taking on The Duskveil, as defeating it may cause them to disappear.\n\nTo reach Purple Cloud Mountain, you will have to defeat the Venom Daoist twice - both in the Upper Webbed Hollow, and in a side path outside the Temple of Yellow Flowers main area. This will unlock a mural allowing you to travel to this new area.\n\nOnce you reach the first main shrine at the Valley of Blooms, stick to the left side to find a path up to the Petalfall Village, and continue along either path up to reach the peak, where the main boss lies.\n\n## The Duskveil Boss Fight and Guide\n\nOne quick nasty attack to watch out for is if you spot The Duskveil pivot to hide its left arm behind its body, it will launch a very quick jab with that arm, but the good news is that it won't follow up this attack with any others.",
    "img_below_text": "In addition to its various sweeping arm attacks, it can also take to the air for a different kind of attack, twisting its body into a spinning strike that hits multiple times (but only needs to be dodged once). It will stay in the air and flap up, holding its position for a long moment before slamming down with a single hoof for one final strike. The timing can take some getting used to, but with practice you can avoid it regularly and then retaliate as it pauses for a moment.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: The Duskveil\n            - Section Title: The Duskveil Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# The Duskveil\n\nThe Duskveil is an optional Yaoguai King boss fight that you can encounter in Chapter 4 of Black Myth Wukong. The cursed and undead remains of a celestial rooster guai, you can find this monster at the peak of the Purple Cloud Mountain, a secret area of the Webbed Hollow.\n\n* Rewards: Weaver's Needle Vessel, Duskveil's Horn, Kun Steel, Double-Combed Rooster Blood, Gold Tree Core, Mind Core, 3410 Experience, 2595 Will\n\n\nThe Duskveil is an optional Yaoguai King, though required to complete the region and return to the Temple of Yellow Flowers. It is highly recommended that you defeat both The Scorpionlord and Daoist Mi before taking on The Duskveil, as defeating it may cause them to disappear.\n\nTo reach Purple Cloud Mountain, you will have to defeat the Venom Daoist twice - both in the Upper Webbed Hollow, and in a side path outside the Temple of Yellow Flowers main area. This will unlock a mural allowing you to travel to this new area.\n\nOnce you reach the first main shrine at the Valley of Blooms, stick to the left side to find a path up to the Petalfall Village, and continue along either path up to reach the peak, where the main boss lies.\n\n## The Duskveil Boss Fight and Guide\n\nOne quick nasty attack to watch out for is if you spot The Duskveil pivot to hide its left arm behind its body, it will launch a very quick jab with that arm, but the good news is that it won't follow up this attack with any others.\"\n            - Following Text: \"In addition to its various sweeping arm attacks, it can also take to the air for a different kind of attack, twisting its body into a spinning strike that hits multiple times (but only needs to be dodged once). It will stay in the air and flap up, holding its position for a long moment before slamming down with a single hoof for one final strike. The timing can take some getting used to, but with practice you can avoid it regularly and then retaliate as it pauses for a moment.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}