{
    "chunk_id": 288829277078,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "h1_title": "Fright Cliff Walkthrough",
    "h2_title": "Rockrest Flat",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e7/Wukong_Fright_40.jpg",
    "alt_text": "Wukong Fright 40.jpg",
    "position_desc": 39,
    "img_above_text": "# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n\nRealizing the error of his ways, the Man-in-Stone will promptly burrow right back in the ground and plead for mercy. You’ll then be able to re-harvest the Stone Essence from him, which will turn into the **Azure Dust Transformation Spell**! Finally, the slow yet sturdy power of the Rock Guai is yours to command in battle!\n\nUnlike the Red Waves wolf transformation, you’ll be extremely slow, unable to dodge, and overall be a pretty big target. On the plus side, you’ll be immune to all status effects while transformed, and deal incredible damage that staggers most enemies. Instead of Might building on attack, you’ll build it while taking damage, allowing you to soak blows and unleash a powerful jump attack spell in return!\n\nAs an added bonus, if you keep hassling the Man-in-Stone, he’ll promise to prepare wares to sell the next time you visit. Be sure to take him up on this offer, as he’ll have a decent selection of (very high-priced) goods!\n\nMan-in-Stone's Shop\n| Man-in-Stone's Shop                | Man-in-Stone's Shop           |\n| ---------------------------------- | ----------------------------- |\n| Blood of the Iron Bull - 3280 Will | Gold Ridge Beast - 12800 Will |\n| Iron Pellet - 6480 Will            |                               |\n| Goldflora Hairpin - 12800 Will     |                               |\n| Sobering Stone - 6480 Will         |                               |\n\n## Rockrest Flat\n\nTo the right when facing the shrine, you can spot stairs leading up past a wooden platform where a Blazebone will attack from its vantage point.",
    "img_below_text": "Up the stairs, a Spearbone with shield guards a spot with a large waterfall of sand. The Spearbone is tougher than average, because defeating him will allow you to claim the Spearbone Spirit to add to your arsenal of transformation attacks! Just beware of his roar that preludes a frenzied combo of spear swings and slams, and use your Immobilize or Cloud Step to skirt around his defenses and attack him instead of his shield.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fright Cliff Walkthrough\n            - Section Title: Rockrest Flat\n\n            Context:\n            - Preceding Text: \"# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n\nRealizing the error of his ways, the Man-in-Stone will promptly burrow right back in the ground and plead for mercy. You’ll then be able to re-harvest the Stone Essence from him, which will turn into the **Azure Dust Transformation Spell**! Finally, the slow yet sturdy power of the Rock Guai is yours to command in battle!\n\nUnlike the Red Waves wolf transformation, you’ll be extremely slow, unable to dodge, and overall be a pretty big target. On the plus side, you’ll be immune to all status effects while transformed, and deal incredible damage that staggers most enemies. Instead of Might building on attack, you’ll build it while taking damage, allowing you to soak blows and unleash a powerful jump attack spell in return!\n\nAs an added bonus, if you keep hassling the Man-in-Stone, he’ll promise to prepare wares to sell the next time you visit. Be sure to take him up on this offer, as he’ll have a decent selection of (very high-priced) goods!\n\nMan-in-Stone's Shop\n| Man-in-Stone's Shop                | Man-in-Stone's Shop           |\n| ---------------------------------- | ----------------------------- |\n| Blood of the Iron Bull - 3280 Will | Gold Ridge Beast - 12800 Will |\n| Iron Pellet - 6480 Will            |                               |\n| Goldflora Hairpin - 12800 Will     |                               |\n| Sobering Stone - 6480 Will         |                               |\n\n## Rockrest Flat\n\nTo the right when facing the shrine, you can spot stairs leading up past a wooden platform where a Blazebone will attack from its vantage point.\"\n            - Following Text: \"Up the stairs, a Spearbone with shield guards a spot with a large waterfall of sand. The Spearbone is tougher than average, because defeating him will allow you to claim the Spearbone Spirit to add to your arsenal of transformation attacks! Just beware of his roar that preludes a frenzied combo of spear swings and slams, and use your Immobilize or Cloud Step to skirt around his defenses and attack him instead of his shield.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes gameplay mechanics and interactions with the Man-in-Stone character in the \"Fright Cliff Walkthrough.\" Players can harvest the **Stone Essence** to unlock the **Azure Dust Transformation Spell**, granting a slow but powerful transformation immune to status effects. Additionally, the Man-in-Stone can be persuaded to open a shop offering high-priced items. The section transitions to **Rockrest Flat**, introducing stairs near a shrine where enemies, such as Blazebone, attack from elevated positions.\n\nImage Summary:\nThe image depicts an intense combat scene in **Rockrest Flat**, showcasing a player character engaging a glowing, tree-like enemy wielding a shield and spear. The enemy appears to be the **Spearbone**, a tougher-than-average foe mentioned in the context. The environment features rocky terrain, dry grass, and a rugged, desolate backdrop consistent with the walkthrough's description of the area near the shrine.\n\nFollowing Text Summary:\nThe following text elaborates on the **Spearbone** enemy guarding a sand waterfall. It highlights the challenge posed by the Spearbone's frenzied spear attacks and defensive shield, encouraging players to use abilities like **Immobilize** or **Cloud Step** to bypass its defenses. Defeating the Spearbone rewards players with the **Spearbone Spirit**, a transformation attack to enhance their arsenal."
}