{
    "chunk_id": 521727185341,
    "source_file": "Fuban.md",
    "h1_title": "Fuban",
    "h2_title": "Fuban Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/92/Wukong_Sahali_39.jpg",
    "alt_text": "Wukong Sahali 39.jpg",
    "position_desc": 23,
    "img_above_text": "# Fuban\n\nFuban is a secret optional Yaoguai King boss fight that you can encounter in Chapter 2's secret area in Black Myth Wukong. Located in the Kingdom of Sahali locked away in the past, you'll need to help fulfill a drunken Boar's quest to access this area.\n\n* **Rewards:** Wind Tamer, Sky-Piercing Horn\n\n\nOnce you follow him through the large gate with the small crawlspace, you’ll find yourself overlooking an ancient and forgotten kingdom, and suddenly be transported into the past and into the Kingdom of Sahali.\n\nAfter besting the \"Tiger Vanguard\", you'll find none other than the Yellow Rat Sage, who needs your help defeating a giant scarab Guai in the sands below.\n\n## Fuban Boss Fight and Guide\n\nAt this point, the battle will be paused and Fuban stunned, allowing you to climb up via its head to reach the large statue on its back. Jump onto the statue head, and look for a glowing eye to examine. You’ll then retrieve the Vessel that gives Fuban much of its power to fend off the yellow rat, who can now join you for the rest of the battle!",
    "img_below_text": "In this second phase, things will get even easier thanks to the Yellow Wind Sage on your side. You’ll be able to let him to the main talking. He can deal incredible damage with his wind attacks, which you can supplement by continuing the assault on his claws.You’ll still need to be mindful of his charge attacks and claw swipes, but you’re given more room to hang back and heal while the rat takes the brunt of his aggression.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fuban\n            - Section Title: Fuban Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Fuban\n\nFuban is a secret optional Yaoguai King boss fight that you can encounter in Chapter 2's secret area in Black Myth Wukong. Located in the Kingdom of Sahali locked away in the past, you'll need to help fulfill a drunken Boar's quest to access this area.\n\n* **Rewards:** Wind Tamer, Sky-Piercing Horn\n\n\nOnce you follow him through the large gate with the small crawlspace, you’ll find yourself overlooking an ancient and forgotten kingdom, and suddenly be transported into the past and into the Kingdom of Sahali.\n\nAfter besting the \"Tiger Vanguard\", you'll find none other than the Yellow Rat Sage, who needs your help defeating a giant scarab Guai in the sands below.\n\n## Fuban Boss Fight and Guide\n\nAt this point, the battle will be paused and Fuban stunned, allowing you to climb up via its head to reach the large statue on its back. Jump onto the statue head, and look for a glowing eye to examine. You’ll then retrieve the Vessel that gives Fuban much of its power to fend off the yellow rat, who can now join you for the rest of the battle!\"\n            - Following Text: \"In this second phase, things will get even easier thanks to the Yellow Wind Sage on your side. You’ll be able to let him to the main talking. He can deal incredible damage with his wind attacks, which you can supplement by continuing the assault on his claws.You’ll still need to be mindful of his charge attacks and claw swipes, but you’re given more room to hang back and heal while the rat takes the brunt of his aggression.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Fuban as a secret optional boss in *Black Myth Wukong*, encountered in Chapter 2 within the Kingdom of Sahali. Players must complete a quest involving a drunken Boar to access this area. The narrative describes the journey to the boss fight, including defeating the \"Tiger Vanguard\" and assisting the Yellow Rat Sage in battling a giant scarab Guai.\n\nImage Summary:  \nThe image depicts an intense moment during the Fuban boss fight in a vast desert setting. The player character is engaged in combat with Fuban, a large and imposing creature, while the Yellow Rat Sage appears as an ally in the background. The HUD displays the boss's health bar, player abilities, and other combat-related elements, emphasizing the active gameplay and the scale of the battle.\n\nFollowing Text Summary:  \nThe following text explains the second phase of the Fuban boss fight, where the Yellow Rat Sage becomes a significant ally. His wind-based attacks deal substantial damage, allowing the player to focus on attacking Fuban's claws while avoiding its charge and swipe attacks. This phase provides opportunities for the player to heal and adopt a more supportive role."
}