{
    "chunk_id": 152304117957,
    "source_file": "Sandgate_Village_Walkthrough.md",
    "h1_title": "Sandgate Village Walkthrough",
    "h2_title": "Yaoguai Chief Mini-Boss Fight - King of Flowing Sands and Second Rat Prince",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/15/Wukong_Sandgate_52.jpg",
    "alt_text": "Wukong Sandgate 52.jpg",
    "position_desc": 49,
    "img_above_text": "# Sandgate Village Walkthrough\n\nIn Black Myth Wukong’s second chapter, you’ll leave behind the forests of Black Wind Mountain for the dry sands of the Yellow Wind Ridge. An energetic (yet headless) man playing a Chinese lute (known as a sanxian) will set the stage for this realm, and helpfully revive our Destined One from becoming a pincushion full of arrows.\n\n\nKeep following it along some wooden scaffolding above a ravine leading back to the pit, and you’ll see a settlement up ahead, plus the first of the Keeper’s Shrines guarded by another Rat Soldier.\n\n\nNow it’s time to finally open that door the Rat Captains were guarding. In the next scene, you’ll spot the next major boss fight: a tiny Rat King and his oversized son.\n\n## Yaoguai Chief Mini-Boss Fight - King of Flowing Sands and Second Rat Prince\n\nThat said, if you keep the Prince between you and his dad, there’s a very good chance he’ll lob a rock at his son’s own head — thank goodness for friendly fire!",
    "img_below_text": "The easiest way to get the King to come down again is to simply lure the Second Prince over to one of the pillars. Let him strike at you wildly, and he’ll destroy the pillar and send the King toppling down to be hit. He doesn’t have much health, and has a hard time getting away, especially if you catch him some distance away from his son who can sometimes take his time closing the distance.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Sandgate Village Walkthrough\n            - Section Title: Yaoguai Chief Mini-Boss Fight - King of Flowing Sands and Second Rat Prince\n\n            Context:\n            - Preceding Text: \"# Sandgate Village Walkthrough\n\nIn Black Myth Wukong’s second chapter, you’ll leave behind the forests of Black Wind Mountain for the dry sands of the Yellow Wind Ridge. An energetic (yet headless) man playing a Chinese lute (known as a sanxian) will set the stage for this realm, and helpfully revive our Destined One from becoming a pincushion full of arrows.\n\n\nKeep following it along some wooden scaffolding above a ravine leading back to the pit, and you’ll see a settlement up ahead, plus the first of the Keeper’s Shrines guarded by another Rat Soldier.\n\n\nNow it’s time to finally open that door the Rat Captains were guarding. In the next scene, you’ll spot the next major boss fight: a tiny Rat King and his oversized son.\n\n## Yaoguai Chief Mini-Boss Fight - King of Flowing Sands and Second Rat Prince\n\nThat said, if you keep the Prince between you and his dad, there’s a very good chance he’ll lob a rock at his son’s own head — thank goodness for friendly fire!\"\n            - Following Text: \"The easiest way to get the King to come down again is to simply lure the Second Prince over to one of the pillars. Let him strike at you wildly, and he’ll destroy the pillar and send the King toppling down to be hit. He doesn’t have much health, and has a hard time getting away, especially if you catch him some distance away from his son who can sometimes take his time closing the distance.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}