{
    "chunk_id": 622939383203,
    "source_file": "Foothills_Walkthrough.md",
    "h1_title": "Foothills Walkthrough",
    "h2_title": "Rhino Watch Slope",
    "h3_title": "Yaoguai Chief - Gold Armored Rhino",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/18/Foothills_Walkthrough_%2844%29.png",
    "alt_text": "Foothills Walkthrough \\(44\\).png",
    "position_desc": 39,
    "img_above_text": "# Foothills Walkthrough\n\nThis will include Hound, Jackal, and Eagle Soldiers, as well as the tougher looker variants with shields called Captain of the Court.\n\nAs you get closer to the first Keeper's Shrine of the area, you'll see a large group of soldiers appear. Clear these out and then you can activate the shrine.\n\nBe sure to check the Shrine Shop while you're here, and revisit the Zodiac Village to see what new items everyone has to offer.\n\nMount Huaguo Shrine Shop\n| Mount Huaguo Shrine Shop            | Mount Huaguo Shrine Shop              | Mount Huaguo Shrine Shop            | Mount Huaguo Shrine Shop       |\n| ----------------------------------- | ------------------------------------- | ----------------------------------- | ------------------------------ |\n| Body-Cooling Powder (x6) - 180 Will | Shock-Quelling Powder (x6) - 180 Will | Tonifying Decoction (x3) - 360 Will |                                |\n| Mind Core (x6) - 3000 Will          | Find Gold Thread (x2) - 3000 Will     | Celestial Ribbon (x1) - 9000 Will   | Gold Tree Core (x1) - 4500 Wil |\n\n\nNow drop down from the Feng-Tail General and activate the nearby Keeper's Shrine. You'll see a field straight in front of you that's strewn with soldiers and fire. Before you head here, let's go find the second optional Poison Chief miniboss that's nearby.\n\n## Rhino Watch Slope\n\nIn the midst of the trees, there's a small patch of ground with no grass. The Poison Chief can be found here.\n\n\nThankfully, each of the Poison Chief fights is pretty much the same. You can expect the same moveset and should prepare for them in the same way.\n\nWhen the second Poison Chief is down, return to the Rhino Watch Slope and then head into the area with the flames on the ground. A cutscene will play out as you get there, and the Gold Armored Rhino will appear.\n\n### Yaoguai Chief - Gold Armored Rhino\n\nUnfortunately, it won't be very long until lots of lightning starts to appear around the Rhino. When this happens, it will rear up and more lightning will start to strike the ground all around the field. This means that the horn is about to regrow, and you'll need to prepare to break it again.",
    "img_below_text": "Beyond this, expect attacks where it will charge at you. There are rocks you can use in the arena to hide behind for a little while. However, once these are destroyed, you'll need to dodge out of the way. When it's close to you, it will also try to swipe at you by pulling its head back, then swinging it to the side to catch you with its horn. These are great moves to dodge and build up focus if you've unlocked the ability to do so in the skills tab.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Foothills Walkthrough\n            - Section Title: Rhino Watch Slope\n            - Sub-Section Title: Yaoguai Chief - Gold Armored Rhino\n\n            Context:\n            - Preceding Text: \"# Foothills Walkthrough\n\nThis will include Hound, Jackal, and Eagle Soldiers, as well as the tougher looker variants with shields called Captain of the Court.\n\nAs you get closer to the first Keeper's Shrine of the area, you'll see a large group of soldiers appear. Clear these out and then you can activate the shrine.\n\nBe sure to check the Shrine Shop while you're here, and revisit the Zodiac Village to see what new items everyone has to offer.\n\nMount Huaguo Shrine Shop\n| Mount Huaguo Shrine Shop            | Mount Huaguo Shrine Shop              | Mount Huaguo Shrine Shop            | Mount Huaguo Shrine Shop       |\n| ----------------------------------- | ------------------------------------- | ----------------------------------- | ------------------------------ |\n| Body-Cooling Powder (x6) - 180 Will | Shock-Quelling Powder (x6) - 180 Will | Tonifying Decoction (x3) - 360 Will |                                |\n| Mind Core (x6) - 3000 Will          | Find Gold Thread (x2) - 3000 Will     | Celestial Ribbon (x1) - 9000 Will   | Gold Tree Core (x1) - 4500 Wil |\n\n\nNow drop down from the Feng-Tail General and activate the nearby Keeper's Shrine. You'll see a field straight in front of you that's strewn with soldiers and fire. Before you head here, let's go find the second optional Poison Chief miniboss that's nearby.\n\n## Rhino Watch Slope\n\nIn the midst of the trees, there's a small patch of ground with no grass. The Poison Chief can be found here.\n\n\nThankfully, each of the Poison Chief fights is pretty much the same. You can expect the same moveset and should prepare for them in the same way.\n\nWhen the second Poison Chief is down, return to the Rhino Watch Slope and then head into the area with the flames on the ground. A cutscene will play out as you get there, and the Gold Armored Rhino will appear.\n\n### Yaoguai Chief - Gold Armored Rhino\n\nUnfortunately, it won't be very long until lots of lightning starts to appear around the Rhino. When this happens, it will rear up and more lightning will start to strike the ground all around the field. This means that the horn is about to regrow, and you'll need to prepare to break it again.\"\n            - Following Text: \"Beyond this, expect attacks where it will charge at you. There are rocks you can use in the arena to hide behind for a little while. However, once these are destroyed, you'll need to dodge out of the way. When it's close to you, it will also try to swipe at you by pulling its head back, then swinging it to the side to catch you with its horn. These are great moves to dodge and build up focus if you've unlocked the ability to do so in the skills tab.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the progression through the Foothills area, including encounters with soldiers and minibosses such as the Poison Chief. After defeating the Poison Chief near Rhino Watch Slope, players are directed toward an area with flames on the ground, where a cutscene introduces the Gold Armored Rhino, a Yaoguai Chief. The text highlights the Rhino's lightning-based attacks and the need to break its regrowing horn during the fight.\n\nImage Summary:\nThe image depicts a dramatic encounter with the Gold Armored Rhino, a large, glowing creature with a lightning-infused horn, set in a rocky, forested arena. The foreground shows a player character wielding a weapon, preparing to engage the Rhino amidst scorched ground and scattered debris. The environment reflects the narrative's description of a battlefield strewn with flames and destruction.\n\nFollowing Text Summary:\nThe following text elaborates on the Gold Armored Rhino's attack patterns, including charging and horn swipes, and suggests using rocks in the arena for temporary cover. It emphasizes the importance of dodging and building focus during close-range attacks, particularly if players have unlocked relevant skills."
}