{
    "chunk_id": 584896560964,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "h1_title": "Fright Cliff Walkthrough",
    "h2_title": "Squall Hideout",
    "h3_title": "The Fourth Buddha’s Eyeball",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/21/Wukong_Fright_22.jpg",
    "alt_text": "Wukong Fright 22.jpg",
    "position_desc": 23,
    "img_above_text": "# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n## Squall Hideout\n\n\nThe large cave entrance has a few paths, with the outer one on the right leading past another Pitstone to a wooden coffin chest holding 3 **Silk** and some **Will**.\n\n\nStart by luring the shieldless Spearbone out of range of the Blazebones above, then climb the stairs to rush down the projectile throwers. Be sure to look at the ruined home at the first landing below the first Blazebone for a yellow chest that has 2 **Yaoguai Core** and 3 **Tiny Piece of Gold**.\n\n\nAt the end of the crevice, you’ll find an unusual looking stone. He’s actually a Man-in-Stone, and claims to have been trapped within the rock form. He’s betting on one of the rock guai in the large cave nearby to hold the secrets to reversing his fate, and asks you to seek it out.\n\n### The Fourth Buddha’s Eyeball\nAs you leave the crevice with the Man-in-Stone, stick to the left wall going up to find several paths leading toward the large cave. Halfway up this sloping path just above where the Man-in-Stone is in the crevice below, you’ll find another of the large stone heads chanting, and can claim it’s Buddha’s Eyeball.",
    "img_below_text": "Now take one of the side paths to return to the large cave entrance, and look for a tunnel with some torches and a faint green light. The dark cave tunnel holds a green Wisp you can absorb to refill a bit of your Gourd, but beware, as the place is the perfect ambush spot.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fright Cliff Walkthrough\n            - Section Title: Squall Hideout\n            - Sub-Section Title: The Fourth Buddha’s Eyeball\n\n            Context:\n            - Preceding Text: \"# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n## Squall Hideout\n\n\nThe large cave entrance has a few paths, with the outer one on the right leading past another Pitstone to a wooden coffin chest holding 3 **Silk** and some **Will**.\n\n\nStart by luring the shieldless Spearbone out of range of the Blazebones above, then climb the stairs to rush down the projectile throwers. Be sure to look at the ruined home at the first landing below the first Blazebone for a yellow chest that has 2 **Yaoguai Core** and 3 **Tiny Piece of Gold**.\n\n\nAt the end of the crevice, you’ll find an unusual looking stone. He’s actually a Man-in-Stone, and claims to have been trapped within the rock form. He’s betting on one of the rock guai in the large cave nearby to hold the secrets to reversing his fate, and asks you to seek it out.\n\n### The Fourth Buddha’s Eyeball\nAs you leave the crevice with the Man-in-Stone, stick to the left wall going up to find several paths leading toward the large cave. Halfway up this sloping path just above where the Man-in-Stone is in the crevice below, you’ll find another of the large stone heads chanting, and can claim it’s Buddha’s Eyeball.\"\n            - Following Text: \"Now take one of the side paths to return to the large cave entrance, and look for a tunnel with some torches and a faint green light. The dark cave tunnel holds a green Wisp you can absorb to refill a bit of your Gourd, but beware, as the place is the perfect ambush spot.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the exploration of the Squall Hideout area, including strategies to defeat enemies and locate treasures. It introduces the Man-in-Stone, who asks for help reversing his rock form by investigating a nearby cave. The section concludes with directions to find \"The Fourth Buddha’s Eyeball\" along a sloping path near the crevice.\n\nImage Summary:\nThe image depicts a character standing near a rocky cave entrance, holding a staff-like weapon. The environment includes grass-covered terrain, stone walls, and wooden scaffolding illuminated by torches. Green glowing objects are visible in the distance, suggesting interactable elements or collectibles. The image aligns with the narrative of exploring the Squall Hideout and locating key items like Buddha’s Eyeball.\n\nFollowing Text Summary:\nThe following text provides instructions to return to the large cave entrance and locate a tunnel marked by torches and a faint green light. It warns of potential ambushes and mentions a green Wisp that can be absorbed to replenish the Gourd, emphasizing caution while navigating the area."
}