{
    "chunk_id": 910398462935,
    "source_file": "Bamboo_Grove_Walkthrough.md",
    "h1_title": "Bamboo Grove Walkthrough",
    "h2_title": "Back Hills",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4e/Wukong_Bamboo_4.jpg",
    "alt_text": "Wukong Bamboo 4.jpg",
    "position_desc": 4,
    "img_above_text": "# Bamboo Grove Walkthrough\n\nThe Bamboo Grove is the second main region of Chapter 1's Black Wind Mountain in Black Myth: Wukong. Below you'll find a guide to the progressing through the grove and learning how to cultivate Spirits, accessing a secret realm, as well as how to defeat the many bosses of this area that include Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble.\n\n* **Jump to A Section:**\n* **Back Hills**\n* **Snake Trail**\n- Yaoguai Chief - Baw-Li-Guhh-Lang\n- Yaoguai Chief - Guangmo\n* **Marsh of the White Mist**\n- Boss FIght - Whiteclad Noble\n\n## Back Hills\n\nLook for some broken fencing path the plants on the right and you’ll find a new type of Wolf, the Wolf Sentinel, who uses a small halberd for quick slicing attacks. Dodge around them and his final jump attack before unleashing a charged attack of your own, and then loot the large wooden chest he was guarding to grab 270 **Will** and 2 **Stone Spirit**.\n\nContinue along the main narrow path and down some stairs until you see a large slab with a mural on it. Just to the right is a small alcove that holds a Snake-Head Mushroom you can harvest.",
    "img_below_text": "Ahead of you is the base of some small falls where a few Croaky frog Guai are waiting among some Jade Lotus, and a green wisp with a few Will to grab at. Another wisp can be found below the opposite falls, by starting to head up the stone stairs on the side and looking left for a small canyon.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bamboo Grove Walkthrough\n            - Section Title: Back Hills\n\n            Context:\n            - Preceding Text: \"# Bamboo Grove Walkthrough\n\nThe Bamboo Grove is the second main region of Chapter 1's Black Wind Mountain in Black Myth: Wukong. Below you'll find a guide to the progressing through the grove and learning how to cultivate Spirits, accessing a secret realm, as well as how to defeat the many bosses of this area that include Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble.\n\n* **Jump to A Section:**\n* **Back Hills**\n* **Snake Trail**\n- Yaoguai Chief - Baw-Li-Guhh-Lang\n- Yaoguai Chief - Guangmo\n* **Marsh of the White Mist**\n- Boss FIght - Whiteclad Noble\n\n## Back Hills\n\nLook for some broken fencing path the plants on the right and you’ll find a new type of Wolf, the Wolf Sentinel, who uses a small halberd for quick slicing attacks. Dodge around them and his final jump attack before unleashing a charged attack of your own, and then loot the large wooden chest he was guarding to grab 270 **Will** and 2 **Stone Spirit**.\n\nContinue along the main narrow path and down some stairs until you see a large slab with a mural on it. Just to the right is a small alcove that holds a Snake-Head Mushroom you can harvest.\"\n            - Following Text: \"Ahead of you is the base of some small falls where a few Croaky frog Guai are waiting among some Jade Lotus, and a green wisp with a few Will to grab at. Another wisp can be found below the opposite falls, by starting to head up the stone stairs on the side and looking left for a small canyon.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the \"Back Hills\" section of the Bamboo Grove Walkthrough in *Black Myth: Wukong*. It describes encountering a Wolf Sentinel enemy guarding a chest containing **Will** and **Stone Spirit**, and mentions a mural slab and a Snake-Head Mushroom in a nearby alcove.\n\nImage Summary:  \nThe image shows a character holding a glowing staff, standing in a lush, mossy environment near a rocky area. A red arrow points toward a dark, narrow path, suggesting a hidden or less obvious route. The image likely serves to guide players toward a specific location or secret area in the \"Back Hills\" section.\n\nFollowing Text Summary:  \nThe following text describes the next area, which includes a small waterfall base with Croaky frog enemies, Jade Lotus items, and collectible wisps containing **Will**. It also hints at another wisp located in a canyon near stone stairs."
}