{
    "chunk_id": 848187999964,
    "source_file": "Black_Bear_Guai.md",
    "h1_title": "Black Bear Guai",
    "h2_title": "Black Bear Guai Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/57/Wukong_BlackWind_40.jpg",
    "alt_text": "Wukong BlackWind 40.jpg",
    "position_desc": 10,
    "img_above_text": "# Black Bear Guai\n\nThe Black Bear Guai is a required Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located at the very end of Chapter 1 at the top of Black Wind Mountain, this is the second of two forms you'll fight the self-imposed King. Now in the form of a giant bear, he'll harness the power of fire to try and burn you alive.\n\n* **Rewards:** Craving Eyes Relic, Flame Ebongold, Yarn x5, Silk x2, Spirit Stone x1, Yaoguai Core x1, Mind Core x1, 1641 Experience, 990 Will\n\n\nAs a required boss, you won't be able to miss running into the Black Wind King. You can find him at the very end of the chapter by progressing through Black Wind Cave and up the mountain, past all of the wolf defenses until you reach Bodhi Peak.\n\n## Black Bear Guai Boss Fight and Guide\n\nRemember that you can also quickly evade his explosive slams by using the Cloud Step to teleport a short distance away, then race back into him for a Revealing Strike to deal a good amount of damage. Combo these with well-timed Immobilize to disrupt his combo attacks, and you can often knock him off balance with sustained heavy hits.\n\nEven with his fire damage buff, he’s not exactly immune to taking fire damage himself. If you’re in danger of being engulfed in flames and don’t have any more cooling powder, you can also use the Red Waves spell to transform, resetting your fire meter and building might to hit him with pogo jumps after dodging his attacks.",
    "img_below_text": "This fight will last awhile, so be sure to be mindful of your stamina and back off when you need to recover, or reposition yourself if you find yourself too close to any fire pits he’s created. It’s much better to wait and find a better avenue of attack than getting too reckless and being burned as a result.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Black Bear Guai\n            - Section Title: Black Bear Guai Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Black Bear Guai\n\nThe Black Bear Guai is a required Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located at the very end of Chapter 1 at the top of Black Wind Mountain, this is the second of two forms you'll fight the self-imposed King. Now in the form of a giant bear, he'll harness the power of fire to try and burn you alive.\n\n* **Rewards:** Craving Eyes Relic, Flame Ebongold, Yarn x5, Silk x2, Spirit Stone x1, Yaoguai Core x1, Mind Core x1, 1641 Experience, 990 Will\n\n\nAs a required boss, you won't be able to miss running into the Black Wind King. You can find him at the very end of the chapter by progressing through Black Wind Cave and up the mountain, past all of the wolf defenses until you reach Bodhi Peak.\n\n## Black Bear Guai Boss Fight and Guide\n\nRemember that you can also quickly evade his explosive slams by using the Cloud Step to teleport a short distance away, then race back into him for a Revealing Strike to deal a good amount of damage. Combo these with well-timed Immobilize to disrupt his combo attacks, and you can often knock him off balance with sustained heavy hits.\n\nEven with his fire damage buff, he’s not exactly immune to taking fire damage himself. If you’re in danger of being engulfed in flames and don’t have any more cooling powder, you can also use the Red Waves spell to transform, resetting your fire meter and building might to hit him with pogo jumps after dodging his attacks.\"\n            - Following Text: \"This fight will last awhile, so be sure to be mindful of your stamina and back off when you need to recover, or reposition yourself if you find yourself too close to any fire pits he’s created. It’s much better to wait and find a better avenue of attack than getting too reckless and being burned as a result.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Black Bear Guai, a boss in Chapter 1 of *Black Myth: Wukong*. This formidable foe is the second form of the Yaoguai King and uses fire-based attacks to challenge players. The text provides details on the rewards for defeating the boss and offers initial combat strategies, such as using the Cloud Step ability to evade and counterattack effectively.\n\nImage Summary:  \nThe image depicts an intense moment during the Black Bear Guai boss fight. The player character is shown mid-combat, dodging a massive attack from the giant bear amidst a fiery battlefield. The environment is ablaze, emphasizing the boss's fire-based abilities, while the on-screen interface displays the boss's health bar and player abilities, reinforcing the high-stakes nature of the encounter.\n\nFollowing Text Summary:  \nThe following text advises players to manage their stamina carefully and avoid reckless attacks during the prolonged fight. It emphasizes the importance of repositioning to avoid fire hazards and waiting for safer opportunities to strike, highlighting the strategic aspect of the battle."
}