{
    "chunk_id": 604897624330,
    "source_file": "Mad_Tiger.md",
    "h1_title": "Mad Tiger",
    "h2_title": "Mad Tiger Mini-Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e3/Wukong_MadTiger_12.jpg",
    "alt_text": "Wukong MadTiger 12.jpg",
    "position_desc": 11,
    "img_above_text": "# Mad Tiger\n\nThe Mad Tiger is an optional secret Yaoguai Chief miniboss that you can encounter deep in a well in Chapter 2 of Black Myth Wukong. Not to be confused with his brother, the Tiger Vanguard of the Crouching Tiger Temple, you can only reach this boss by following the trail of a ghostly boy using the Old Rattle-Drum Key Item.\n\n* Rewards: Mad Tiger Spirit, Blood of the Iron Bull, Yaoguai Core x1, Stone Spirit x1, 1102 Experience, 1023 Will, Plaguebane Gourd (in chest)\n\n\nUsing the Rattle-Drum here one final time will cause the spirit of the boy to appear before you, and invite you to hop down the well to meet a “friend”. Unfortunately, if the dull echoing roars coming from somewhere below are any indication, you’re not going to meet a friendly face down there.\n\n## Mad Tiger Mini-Boss Fight and Guide\n\nHe also has a different combo strike that often begins with a downward fist punch, followed by two large horizontal claw swipes that spin his body, and ends with him ripping his fist out of the ground in a rising swipe as he leaps backward with the momentum. Immobilize him before he can retreat if you want to retaliate.",
    "img_below_text": "Many of his attacks can then transition into two quick claw swipes with each hand where his arms will remain across his body, and after a moment, will violently lash out with both arms and an outward cross slash you can try to Immobilize to stop. Rock Solid can also help, but it’s unlikely to stagger him out of the move.\n\nJust be wary, as he’ll often follow up the two arm slash by leaping straight up into the air before crashing down in a slamming attack.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Mad Tiger\n            - Section Title: Mad Tiger Mini-Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Mad Tiger\n\nThe Mad Tiger is an optional secret Yaoguai Chief miniboss that you can encounter deep in a well in Chapter 2 of Black Myth Wukong. Not to be confused with his brother, the Tiger Vanguard of the Crouching Tiger Temple, you can only reach this boss by following the trail of a ghostly boy using the Old Rattle-Drum Key Item.\n\n* Rewards: Mad Tiger Spirit, Blood of the Iron Bull, Yaoguai Core x1, Stone Spirit x1, 1102 Experience, 1023 Will, Plaguebane Gourd (in chest)\n\n\nUsing the Rattle-Drum here one final time will cause the spirit of the boy to appear before you, and invite you to hop down the well to meet a “friend”. Unfortunately, if the dull echoing roars coming from somewhere below are any indication, you’re not going to meet a friendly face down there.\n\n## Mad Tiger Mini-Boss Fight and Guide\n\nHe also has a different combo strike that often begins with a downward fist punch, followed by two large horizontal claw swipes that spin his body, and ends with him ripping his fist out of the ground in a rising swipe as he leaps backward with the momentum. Immobilize him before he can retreat if you want to retaliate.\"\n            - Following Text: \"Many of his attacks can then transition into two quick claw swipes with each hand where his arms will remain across his body, and after a moment, will violently lash out with both arms and an outward cross slash you can try to Immobilize to stop. Rock Solid can also help, but it’s unlikely to stagger him out of the move.\n\nJust be wary, as he’ll often follow up the two arm slash by leaping straight up into the air before crashing down in a slamming attack.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}