{
    "chunk_id": 622991896863,
    "source_file": "Daoist_Mi.md",
    "h1_title": "Daoist Mi",
    "h2_title": "Daoist Mi Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5e/Wukong_PurpleCloud_52.jpg",
    "alt_text": "Wukong PurpleCloud 52.jpg",
    "position_desc": 10,
    "img_above_text": "# Daoist Mi\n\nThe Daoist Mi is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the secret area of the Purple Cloud Mountain, the Daoist Mi will have a quest for you before you can face him in battle.\n\n* Rewards: Violet Hail Transformation Spell, Refined Iron Sand, 1562 Experience, 1451 Will\n\n\nHowever, once you return it to him, he'll reveal that he want the egg's power all to himself, and is willing to kill for it.\n\n## Daoist Mi Boss Fight and Guide\n\nThe one big new move that Daoist Mi can use in this form is spewing a lot more poison across the arena. In particular, if they arch backwards for a long moment before getting up, they'll run towards you while spewing poison in every possible direction. Knowing this in advance, simply keep your distance or prepare a charged thrust attack to repel them.",
    "img_below_text": "With Antimiasma powder on hand, the Daoist Mi won't last long against your superior skills. When you finally defeat him, the snake woman will appear and take the egg back from the fallen Daoist, before giving it to you, in the hopes you can make true use of its power. You'll gain the **Violet Hail Transformation Spell** , allowing you to temporarily turn into a Worm Practitioner yourself and become immune to poison!",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Daoist Mi\n            - Section Title: Daoist Mi Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Daoist Mi\n\nThe Daoist Mi is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the secret area of the Purple Cloud Mountain, the Daoist Mi will have a quest for you before you can face him in battle.\n\n* Rewards: Violet Hail Transformation Spell, Refined Iron Sand, 1562 Experience, 1451 Will\n\n\nHowever, once you return it to him, he'll reveal that he want the egg's power all to himself, and is willing to kill for it.\n\n## Daoist Mi Boss Fight and Guide\n\nThe one big new move that Daoist Mi can use in this form is spewing a lot more poison across the arena. In particular, if they arch backwards for a long moment before getting up, they'll run towards you while spewing poison in every possible direction. Knowing this in advance, simply keep your distance or prepare a charged thrust attack to repel them.\"\n            - Following Text: \"With Antimiasma powder on hand, the Daoist Mi won't last long against your superior skills. When you finally defeat him, the snake woman will appear and take the egg back from the fallen Daoist, before giving it to you, in the hopes you can make true use of its power. You'll gain the **Violet Hail Transformation Spell** , allowing you to temporarily turn into a Worm Practitioner yourself and become immune to poison!\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Daoist Mi as an optional boss fight in Chapter 4 of Black Myth Wukong. Located in a secret area, Daoist Mi initially presents a quest but later reveals his intentions to keep the egg's power for himself, leading to a battle. The fight involves avoiding poison attacks and requires strategic planning.\n\nImage Summary:\nThe image likely depicts a scene from the game Black Myth Wukong, possibly showing the encounter with Daoist Mi. The setting appears to be an outdoor environment with rocky terrain and autumn foliage, suggesting a moment of confrontation or interaction related to the narrative of the boss fight.\n\nFollowing Text Summary:\nThe following text describes the aftermath of defeating Daoist Mi, where the player uses Antimiasma powder to overcome him. After his defeat, a snake woman retrieves the egg and gives it to the player, granting them the Violet Hail Transformation Spell, which allows temporary transformation into a Worm Practitioner and immunity to poison."
}