{
    "chunk_id": 772000697112,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "h1_title": "Fright Cliff Walkthrough",
    "h2_title": "Squall Hideout",
    "h3_title": "The Fourth Buddha’s Eyeball",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/68/Wukong_Fright_23.jpg",
    "alt_text": "Wukong Fright 23.jpg",
    "position_desc": 24,
    "img_above_text": "# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n## Squall Hideout\n\n\nThe large cave entrance has a few paths, with the outer one on the right leading past another Pitstone to a wooden coffin chest holding 3 **Silk** and some **Will**.\n\n\nStart by luring the shieldless Spearbone out of range of the Blazebones above, then climb the stairs to rush down the projectile throwers. Be sure to look at the ruined home at the first landing below the first Blazebone for a yellow chest that has 2 **Yaoguai Core** and 3 **Tiny Piece of Gold**.\n\n\nAt the end of the crevice, you’ll find an unusual looking stone. He’s actually a Man-in-Stone, and claims to have been trapped within the rock form. He’s betting on one of the rock guai in the large cave nearby to hold the secrets to reversing his fate, and asks you to seek it out.\n\n### The Fourth Buddha’s Eyeball\n\nNow take one of the side paths to return to the large cave entrance, and look for a tunnel with some torches and a faint green light. The dark cave tunnel holds a green Wisp you can absorb to refill a bit of your Gourd, but beware, as the place is the perfect ambush spot.",
    "img_below_text": "Advance cautiously to spy a Poisestone and two Bladebones on some scaffolding awaiting your arrival. Use Cloudstep to ambush the weaker enemies first, then slam into the Poisestone with a charged hit to put it down.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fright Cliff Walkthrough\n            - Section Title: Squall Hideout\n            - Sub-Section Title: The Fourth Buddha’s Eyeball\n\n            Context:\n            - Preceding Text: \"# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n## Squall Hideout\n\n\nThe large cave entrance has a few paths, with the outer one on the right leading past another Pitstone to a wooden coffin chest holding 3 **Silk** and some **Will**.\n\n\nStart by luring the shieldless Spearbone out of range of the Blazebones above, then climb the stairs to rush down the projectile throwers. Be sure to look at the ruined home at the first landing below the first Blazebone for a yellow chest that has 2 **Yaoguai Core** and 3 **Tiny Piece of Gold**.\n\n\nAt the end of the crevice, you’ll find an unusual looking stone. He’s actually a Man-in-Stone, and claims to have been trapped within the rock form. He’s betting on one of the rock guai in the large cave nearby to hold the secrets to reversing his fate, and asks you to seek it out.\n\n### The Fourth Buddha’s Eyeball\n\nNow take one of the side paths to return to the large cave entrance, and look for a tunnel with some torches and a faint green light. The dark cave tunnel holds a green Wisp you can absorb to refill a bit of your Gourd, but beware, as the place is the perfect ambush spot.\"\n            - Following Text: \"Advance cautiously to spy a Poisestone and two Bladebones on some scaffolding awaiting your arrival. Use Cloudstep to ambush the weaker enemies first, then slam into the Poisestone with a charged hit to put it down.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text describes the exploration of the Squall Hideout, focusing on navigating paths, defeating enemies, and interacting with a trapped character called the Man-in-Stone. Players are instructed to return to the large cave entrance and locate a tunnel with torches and green light, where they can absorb a green Wisp to restore health while being cautious of ambushes.\n\nImage Summary:  \nThe image shows a player character approaching a wooden scaffolding structure in a rocky, desert-like environment. Two enemies are visible: one positioned on the scaffolding and another in the background. The player appears to be preparing for combat, with visible HUD elements indicating health, abilities, and items. The setting aligns with the described ambush scenario in the dark cave tunnel.\n\nFollowing Text Summary:  \nThe following text advises players to proceed cautiously to confront a Poisestone and two Bladebones positioned on scaffolding. It suggests using the Cloudstep ability to prioritize weaker enemies before delivering a charged attack to defeat the Poisestone."
}