{
    "chunk_id": 274942127920,
    "source_file": "Bull_Governor_Spirit.md",
    "h1_title": "Bull Governor Spirit",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/87/Bull_Governor.jpg",
    "alt_text": "Bull Governor.jpg",
    "position_desc": 1,
    "img_above_text": "# Bull Governor Spirit\n\nThe **Bull Governor** is a foe that you will face off against in Black Myth: Wukong. Once defeated, the Bull Governor offers up his Spirit for you to absorb, allowing you to use some of his powers for a short time. On this page, we will go over everything you need to know about the Bull Governor, including where to find him, how to defeat him, and what power his Spirit gives you.\n\n* Bull Governor Location\n* Bull Governor Fight\n* Bull Governor Spirit",
    "img_below_text": "## Bull Governor Location\n\nThe Bull Governor can be found in Bushui Cave, which is the secret area in the Flaming Mountains. Unlocking the secret area and gaining access to Bushui Cave is a long process. Follow these instructions to get there:\n\n* Defeat the Pale-Axe Stalwart at the beginning of Chapter 5. Exhaust all dialogue with him.\n* Defeat the Gray-Bronze Cart.\n* Defeat the Crimson-Silver Cart.\n* Speak to the Pale-Axe Stalwart again at the Crimson-Silver Cart location. Exhaust all dialogue with him.\n* Complete the Iron Ball challenge to remove all barriers on the hill.\n* Head back down the hill and take the new pathway on the left.\n* Run towards the large gate to the right of the Cooling Slope Keeper's Shrine and defeat the Rusty-Gold Cart.\n* Speak to the Pale-Axe Stalwart once again to open the gate to Bushui Cave.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bull Governor Spirit\n\n            Context:\n            - Preceding Text: \"# Bull Governor Spirit\n\nThe **Bull Governor** is a foe that you will face off against in Black Myth: Wukong. Once defeated, the Bull Governor offers up his Spirit for you to absorb, allowing you to use some of his powers for a short time. On this page, we will go over everything you need to know about the Bull Governor, including where to find him, how to defeat him, and what power his Spirit gives you.\n\n* Bull Governor Location\n* Bull Governor Fight\n* Bull Governor Spirit\"\n            - Following Text: \"## Bull Governor Location\n\nThe Bull Governor can be found in Bushui Cave, which is the secret area in the Flaming Mountains. Unlocking the secret area and gaining access to Bushui Cave is a long process. Follow these instructions to get there:\n\n* Defeat the Pale-Axe Stalwart at the beginning of Chapter 5. Exhaust all dialogue with him.\n* Defeat the Gray-Bronze Cart.\n* Defeat the Crimson-Silver Cart.\n* Speak to the Pale-Axe Stalwart again at the Crimson-Silver Cart location. Exhaust all dialogue with him.\n* Complete the Iron Ball challenge to remove all barriers on the hill.\n* Head back down the hill and take the new pathway on the left.\n* Run towards the large gate to the right of the Cooling Slope Keeper's Shrine and defeat the Rusty-Gold Cart.\n* Speak to the Pale-Axe Stalwart once again to open the gate to Bushui Cave.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Bull Governor, a formidable enemy in the game Black Myth: Wukong. Upon defeating him, players can absorb his Spirit, granting them temporary access to his powers. The section outlines the topics to be covered, such as the Bull Governor's location, the fight against him, and the abilities provided by his Spirit.\n\nImage Summary:\nThe image depicts a battle scene from Black Myth: Wukong, featuring the Bull Governor, a large and intimidating creature with fiery horns and a weapon. The image likely illustrates the encounter between the player character and the Bull Governor, emphasizing the action and intensity of the fight. The visual elements, such as health bars and ability icons, suggest a gameplay scenario where players engage in combat with this enemy.\n\nFollowing Text Summary:\nThe following text provides detailed instructions on locating the Bull Governor within the game. It describes the steps required to access Bushui Cave, a secret area in the Flaming Mountains, where the Bull Governor resides. The process involves defeating several enemies and completing challenges, highlighting the complexity and effort needed to reach the Bull Governor's location."
}