{
    "chunk_id": 445354480816,
    "source_file": "Father_of_Stones.md",
    "h1_title": "Father of Stones",
    "h2_title": "Father of Stones Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/36/Woods_Ember_Walkthrough_%2856%29.png",
    "alt_text": "Woods Ember Walkthrough \\(56\\).png",
    "position_desc": 3,
    "img_above_text": "# Father of Stones\n\nFather of Stones is a Yaoguai Chief you'll fight soon after you reach the Heights of Ember in Chapter 5 of Black Myth: Wukong.\n\n\nFrom the Heights of Ember Keeper's Shrine, continue toward the open space on the left. When you reach a certain point, the Father of Stones miniboss will jump over the wall near the door on the right.\n\n## Father of Stones Boss Fight and Guide\n\nJust like fights against other stone bosses, it's best to skip elemental damage and go for pure attack power in this fight. You want your attacks to be heavy and hit hard, and for your defense to be up as much as possible.",
    "img_below_text": "Father of Stones will use a variety of attacks in this fight, however, he's limited by the fact that he's holding a skeleton in one arm. This means he'll only ever try to hit you with one arm, giving you more opportunity to evade attacks or dodge them.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Father of Stones\n            - Section Title: Father of Stones Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Father of Stones\n\nFather of Stones is a Yaoguai Chief you'll fight soon after you reach the Heights of Ember in Chapter 5 of Black Myth: Wukong.\n\n\nFrom the Heights of Ember Keeper's Shrine, continue toward the open space on the left. When you reach a certain point, the Father of Stones miniboss will jump over the wall near the door on the right.\n\n## Father of Stones Boss Fight and Guide\n\nJust like fights against other stone bosses, it's best to skip elemental damage and go for pure attack power in this fight. You want your attacks to be heavy and hit hard, and for your defense to be up as much as possible.\"\n            - Following Text: \"Father of Stones will use a variety of attacks in this fight, however, he's limited by the fact that he's holding a skeleton in one arm. This means he'll only ever try to hit you with one arm, giving you more opportunity to evade attacks or dodge them.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the \"Father of Stones,\" a miniboss encountered in Chapter 5 of *Black Myth: Wukong*. Players face this Yaoguai Chief shortly after reaching the Heights of Ember. The miniboss appears near a door after jumping over a wall, and the guide advises focusing on heavy attack power and strong defense during the fight.\n\nImage Summary:\nThe image depicts the \"Father of Stones\" miniboss in a dark, atmospheric outdoor setting, facing off against the player character. The miniboss is a large, hulking creature, while the player character is armed and prepared for combat. The environment features stone walls, barren trees, and scattered debris, emphasizing the ominous and tense nature of the encounter.\n\nFollowing Text Summary:\nThe following text elaborates on the miniboss's attack patterns, noting that the \"Father of Stones\" is limited to using one arm due to holding a skeleton in the other. This provides players with more opportunities to evade or dodge his attacks during the fight."
}