{
    "chunk_id": 663049228541,
    "source_file": "Ebon_Flow.md",
    "h1_title": "Ebon Flow",
    "h2_title": "**Black Myth: Wukong Ebon Flow Location**",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/09/Wukong_Bitter_3.jpg",
    "alt_text": "Wukong Bitter 3.jpg",
    "position_desc": 4,
    "img_above_text": "# Ebon Flow\n\nEbon Flow is one of the Transformation Spells you can find in Black Myth: Wukong. Focused on dodging and deflecting attacks to then follow those actions up with powerful attacks, Ebon Flow can easily be missed within The New West as it is a part of a long quest chain.\n\nThe spell allows you to transform into the Yin Tiger to ward off incoming blows by holding the sword horizontally, or dashing forward like a gale to close in on foes. Focus is then built up before transformation can be converted for use afterward. Ebon Flow's moveset is as follows:\n\n* **Light attack: Onslaught Blade - Raise the Great Iron Blade to strike the target, building up focus with each hit.** As Focus increases, enemies are more easily staggered with this series of attacks that raises your Great Iron Blade.\n* **Heavy attack: Rift Cleaver - Hold Heavy Attack to unleash a powerful cleave, deling massive damage.** The more Focus built up, the more devastating the damage becomes with this attack, which is a slow, powerful slam.\n* **Deflection: Blacksmith - Raise the blade to deflect assaults, build up Focus with each deflection, or dodge to switch to other moves.** This is one of the only defensive moves a Transformation Spell has, building Focus with each hit and allowing you to mitigate damage.\n\n## **Black Myth: Wukong Ebon Flow Location**\n\nWith this area accessed, now you need to play through the majority of Chapter 3 - The New West, until you step off Turtle Island within Bitter Lake. Once off the island and at the North Shore Shrine, head to your left, along the coastline to find Chen Loong.",
    "img_below_text": "Defeat him using our Chen Loong boss guide. Once defeated, he will become friendly and you will be able to talk to him. He will ask you for some medicine to help him. This can be obtained from Xu Dog by just talking with him back at the Cellar Shrine in the Crouching Tiger Temple. With it, you can then return to Chen Loong, who will give you Ruyi Scroll, teleporting you to the Zodiac Village.\n\nIn the Zodiac Village, you can talk to Yin Tiger, who is a blacksmith sitting amongst the other merchants.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Ebon Flow\n            - Section Title: **Black Myth: Wukong Ebon Flow Location**\n\n            Context:\n            - Preceding Text: \"# Ebon Flow\n\nEbon Flow is one of the Transformation Spells you can find in Black Myth: Wukong. Focused on dodging and deflecting attacks to then follow those actions up with powerful attacks, Ebon Flow can easily be missed within The New West as it is a part of a long quest chain.\n\nThe spell allows you to transform into the Yin Tiger to ward off incoming blows by holding the sword horizontally, or dashing forward like a gale to close in on foes. Focus is then built up before transformation can be converted for use afterward. Ebon Flow's moveset is as follows:\n\n* **Light attack: Onslaught Blade - Raise the Great Iron Blade to strike the target, building up focus with each hit.** As Focus increases, enemies are more easily staggered with this series of attacks that raises your Great Iron Blade.\n* **Heavy attack: Rift Cleaver - Hold Heavy Attack to unleash a powerful cleave, deling massive damage.** The more Focus built up, the more devastating the damage becomes with this attack, which is a slow, powerful slam.\n* **Deflection: Blacksmith - Raise the blade to deflect assaults, build up Focus with each deflection, or dodge to switch to other moves.** This is one of the only defensive moves a Transformation Spell has, building Focus with each hit and allowing you to mitigate damage.\n\n## **Black Myth: Wukong Ebon Flow Location**\n\nWith this area accessed, now you need to play through the majority of Chapter 3 - The New West, until you step off Turtle Island within Bitter Lake. Once off the island and at the North Shore Shrine, head to your left, along the coastline to find Chen Loong.\"\n            - Following Text: \"Defeat him using our Chen Loong boss guide. Once defeated, he will become friendly and you will be able to talk to him. He will ask you for some medicine to help him. This can be obtained from Xu Dog by just talking with him back at the Cellar Shrine in the Crouching Tiger Temple. With it, you can then return to Chen Loong, who will give you Ruyi Scroll, teleporting you to the Zodiac Village.\n\nIn the Zodiac Village, you can talk to Yin Tiger, who is a blacksmith sitting amongst the other merchants.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Ebon Flow Transformation Spell in *Black Myth: Wukong*, describing its mechanics and moveset. The spell enables players to transform into the Yin Tiger for defensive and offensive maneuvers, focusing on dodging, deflecting, and building Focus to execute powerful attacks. It also provides details on how the spell can be obtained during a quest chain in Chapter 3 - The New West.\n\n---\n\nImage Summary:\nThe image depicts the player character standing on a snowy, rocky coastline near the North Shore Shrine in *Black Myth: Wukong*. A red arrow points toward a distant location along the shoreline, indicating the direction the player must travel to progress in the quest. The environment features rugged terrain, a shrine structure, and a cold, wintry atmosphere, aligning with the quest's narrative setting.\n\n---\n\nFollowing Text Summary:\nThe following text explains the next steps after reaching the indicated location. The player must defeat the NPC Chen Loong, who later becomes friendly and requests medicine. The medicine can be obtained from Xu Dog at the Cellar Shrine in the Crouching Tiger Temple. Upon returning to Chen Loong, he provides the Ruyi Scroll, which teleports the player to the Zodiac Village, where Yin Tiger, a blacksmith, can be found among other merchants."
}