{
    "chunk_id": 228172859957,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "h1_title": "Prologue",
    "h2_title": "Boss Fight - Erlang, the Sacred Divinity",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/81/Wukong_Prologue_4.jpg",
    "alt_text": "Wukong Prologue 4.jpg",
    "position_desc": 4,
    "img_above_text": "# Prologue\n\nUpon beginning your journey, you’ll be thrust into the role of the mythical Sun Wukong as he rebels against the Court of Heaven and its Heavenly Kings. Undaunted by their army, Sun Wukong calls them out, prompting the nephew of the Jade Emperor, Erlang Shen, to meet him in combat.\n\n## Boss Fight - Erlang, the Sacred Divinity\n\nErlang fights in a very standard fashion with sweeps and thrusts of his spear, often slowing down and allowing you to test out your dodging skills. There’s no real block button to speak of in Wukong, so dodging — especially at the last second — is key to surviving combat encounters.",
    "img_below_text": "Once you’ve removed a fourth of his health bar, Erlang will vanish before trying to ambush from above. When the fight resumes, he’ll get a little faster, and start blocking attacks, which is when you should try throwing more heavy attacks into the mix.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Prologue\n            - Section Title: Boss Fight - Erlang, the Sacred Divinity\n\n            Context:\n            - Preceding Text: \"# Prologue\n\nUpon beginning your journey, you’ll be thrust into the role of the mythical Sun Wukong as he rebels against the Court of Heaven and its Heavenly Kings. Undaunted by their army, Sun Wukong calls them out, prompting the nephew of the Jade Emperor, Erlang Shen, to meet him in combat.\n\n## Boss Fight - Erlang, the Sacred Divinity\n\nErlang fights in a very standard fashion with sweeps and thrusts of his spear, often slowing down and allowing you to test out your dodging skills. There’s no real block button to speak of in Wukong, so dodging — especially at the last second — is key to surviving combat encounters.\"\n            - Following Text: \"Once you’ve removed a fourth of his health bar, Erlang will vanish before trying to ambush from above. When the fight resumes, he’ll get a little faster, and start blocking attacks, which is when you should try throwing more heavy attacks into the mix.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the player as Sun Wukong, a mythical figure rebelling against the Court of Heaven. It sets the stage for a boss fight against Erlang Shen, a divine warrior armed with a spear. The fight emphasizes dodging mechanics, particularly last-second dodges, as a key to survival.\n\nImage Summary:  \nThe image depicts an intense moment during the boss fight with Erlang Shen, titled \"Erlang, the Sacred Divinity.\" Sun Wukong is engaged in combat, striking Erlang with a heavy attack as indicated by the on-screen prompt. The health bar at the bottom shows Erlang has taken significant damage, while the cloudy background suggests the battle takes place in a heavenly or ethereal setting.\n\nFollowing Text Summary:  \nThe following text describes how the fight evolves after Erlang loses a portion of his health. He begins using ambush tactics and becomes faster, incorporating blocking into his defense. Players are advised to adapt by using heavier attacks to counter his new strategy."
}