{
    "chunk_id": 284626382675,
    "source_file": "Crouching_Tiger_Temple_Walkthrough.md",
    "h1_title": "Crouching Tiger Temple Walkthrough",
    "h2_title": "Temple Cellar",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/31/Wukong_Tiger_29.jpg",
    "alt_text": "Wukong Tiger 29.jpg",
    "position_desc": 30,
    "img_above_text": "# Crouching Tiger Temple Walkthrough\n\nOnce you reach the top, you’ll come face to bloody face with the Tiger Vanguard, who looks like he just found his next meal.\n\n\nUsing the Keeness of Tiger and Sterness of Stone, head up the steps to the large headless statue in the middle of the temple’s blood-soaked plaza. By activating this two-headed tally, you’ll drain the bloody pool, and reveal a large lion mouth that serves as a pit into the cellar below.\n\n## Temple Cellar\n\nWhen you finally find your way outside, look to the right to find a sloping sandy path leading down. There’s actually a ledge ahead in the ruined building with a chest, but getting it to can be the most aggravating experience unless you use a trick.",
    "img_below_text": "Ordinarily you’ll slip and slide on past, unable to do much or jump off to the sides. However, if you jump right before reaching the ledge, perform a heavy attack in mid-air, and you’ll do a small double jump before crashing down. Done correctly, you’ll get enough height to land right by the small turtle chest, which holds a **Tiger Relic** Soak for your Gourd!",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Crouching Tiger Temple Walkthrough\n            - Section Title: Temple Cellar\n\n            Context:\n            - Preceding Text: \"# Crouching Tiger Temple Walkthrough\n\nOnce you reach the top, you’ll come face to bloody face with the Tiger Vanguard, who looks like he just found his next meal.\n\n\nUsing the Keeness of Tiger and Sterness of Stone, head up the steps to the large headless statue in the middle of the temple’s blood-soaked plaza. By activating this two-headed tally, you’ll drain the bloody pool, and reveal a large lion mouth that serves as a pit into the cellar below.\n\n## Temple Cellar\n\nWhen you finally find your way outside, look to the right to find a sloping sandy path leading down. There’s actually a ledge ahead in the ruined building with a chest, but getting it to can be the most aggravating experience unless you use a trick.\"\n            - Following Text: \"Ordinarily you’ll slip and slide on past, unable to do much or jump off to the sides. However, if you jump right before reaching the ledge, perform a heavy attack in mid-air, and you’ll do a small double jump before crashing down. Done correctly, you’ll get enough height to land right by the small turtle chest, which holds a **Tiger Relic** Soak for your Gourd!\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text describes the player's progression through the Crouching Tiger Temple, including a pivotal moment where activating a statue drains a bloody pool and reveals a lion-shaped entrance to the cellar. This sets the stage for exploration in the Temple Cellar, where challenges and treasures await.\n\nImage Summary:  \nThe image depicts a gameplay moment in the Temple Cellar section of the walkthrough. A character is mid-air, seemingly attempting a jump or maneuver toward a ledge in a dimly lit, ruinous environment filled with scattered pottery and debris. A red arrow highlights the intended trajectory, suggesting a specific movement or trick required to reach the ledge, which likely contains a reward or treasure.\n\nFollowing Text Summary:  \nThe following text explains a technique for successfully landing on the ledge shown in the image. By timing a jump and performing a heavy attack mid-air, players can execute a small double jump to reach the ledge and access the chest containing the **Tiger Relic** Soak, an item for enhancing the player's Gourd."
}