{
    "chunk_id": 937332096756,
    "source_file": "Earth_Wolf_Spirit.md",
    "h1_title": "Earth Wolf Spirit",
    "h2_title": "Earth Wolf Spirit",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f5/Earth_wolf_power.jpg",
    "alt_text": "Earth wolf power.jpg",
    "position_desc": 2,
    "img_above_text": "# Earth Wolf Spirit\n\n\nThe Earth Wolf is in Sandgate Village in Yellow Wind Ridge. Follow the path from the Sandgate Village Keeper's Shrine and work your way around to the left, taking out the archers and other enemies as you go. You will eventually circle around to the Earth Wolf's arena, where you can fight for his Spirit.\n\n\nThe Earth Wolf fight is a challenging one. The Wolf is large, and it hits hard, not to mention it catches fire at some points throughout the battle. Here are the attacks you can expect to see when tussling with the Earth Wolf:\n\n* Bite\n* Swipe\n* Charge\n* Hind Leg Swipe\n* At points throughout the battle the Earth Wolf will start glowing like it's filled with fire.\n\nThe Earth Wolf hits very hard, but winds up a lot of its moves, giving you a chance to dodge out of the way before they hit.\n\n## Earth Wolf Spirit",
    "img_below_text": "* **Wild Rapture**\n* Equipped Effect: Grants a small amount of additional Focus on hit.\n\nThe Earth Wolf's Spirit allows you to use the wolf's charge ability to ram and stagger enemies. Even big bosses go down after this move, allowing you to get another combo in before they get up. It's an excellent Spirit and one of the best in the game. You can also use the ability to smash the wall in the First Prince of Flowing Sands arena if the boss doesn't destroy it and reveal the secret area itself.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Earth Wolf Spirit\n            - Section Title: Earth Wolf Spirit\n\n            Context:\n            - Preceding Text: \"# Earth Wolf Spirit\n\n\nThe Earth Wolf is in Sandgate Village in Yellow Wind Ridge. Follow the path from the Sandgate Village Keeper's Shrine and work your way around to the left, taking out the archers and other enemies as you go. You will eventually circle around to the Earth Wolf's arena, where you can fight for his Spirit.\n\n\nThe Earth Wolf fight is a challenging one. The Wolf is large, and it hits hard, not to mention it catches fire at some points throughout the battle. Here are the attacks you can expect to see when tussling with the Earth Wolf:\n\n* Bite\n* Swipe\n* Charge\n* Hind Leg Swipe\n* At points throughout the battle the Earth Wolf will start glowing like it's filled with fire.\n\nThe Earth Wolf hits very hard, but winds up a lot of its moves, giving you a chance to dodge out of the way before they hit.\n\n## Earth Wolf Spirit\"\n            - Following Text: \"* **Wild Rapture**\n* Equipped Effect: Grants a small amount of additional Focus on hit.\n\nThe Earth Wolf's Spirit allows you to use the wolf's charge ability to ram and stagger enemies. Even big bosses go down after this move, allowing you to get another combo in before they get up. It's an excellent Spirit and one of the best in the game. You can also use the ability to smash the wall in the First Prince of Flowing Sands arena if the boss doesn't destroy it and reveal the secret area itself.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text describes the Earth Wolf, a challenging enemy located in Sandgate Village within Yellow Wind Ridge. Players must navigate through enemies to reach the Earth Wolf's arena. The Earth Wolf has powerful attacks, including bite, swipe, charge, and hind leg swipe, and it glows with fire during certain phases of the battle. Its attacks are strong but telegraphed, allowing players to dodge effectively.\n\nImage Summary:  \nThe image showcases the in-game equipment menu, specifically highlighting the \"Earth Wolf Spirit,\" an epic Spirit item. The Spirit grants the ability \"Wild Rapture,\" allowing players to take the form of the Earth Wolf and charge at enemies to make them stumble. The equipped effect provides a small amount of additional Focus on hit. The menu also displays stats, Spirit options, and a demo preview of the ability in action.\n\nFollowing Text Summary:  \nThe following text elaborates on the Earth Wolf Spirit's utility, emphasizing its effectiveness in combat. The Spirit's charge ability can stagger enemies, including bosses, creating opportunities for follow-up attacks. It is described as one of the best Spirits in the game, with additional functionality to break walls in specific boss arenas to reveal secret areas."
}