{
    "chunk_id": 419584919074,
    "source_file": "Captain_Lotus-Vision.md",
    "h1_title": "Captain Lotus-Vision",
    "h2_title": "Where to Find Captain Lotus-Vision",
    "h3_title": "Captain Lotus-Vision Miniboss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/96/Wukong_Pagoda_30X.jpg",
    "alt_text": "Wukong Pagoda 30X.jpg",
    "position_desc": 1,
    "img_above_text": "# Captain Lotus-Vision\n\nCaptain Lotus-Vision is an optional miniboss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Responsible for sealing captives in the cells of the Pagoda Realm, you can find this boss in a secret chamber within the Pagoda Prison.\n\n* **Rewards:** Spirit of Captain Lotus-Vision, Frostsprout Twig, Mind Core, Cold Iron Leaves, 1847 Experience, 1198 Will\n\n## Where to Find Captain Lotus-Vision\n\nCaptain Lotus-Vision is one of the four captains you can find in Chapter 3, and is an optional Yaoguai Chief you can encounter in the Pagoda Realm.\n\nTo find him, you'll need to reach the Upper Pagoda Shrine on the third level of the prison. Just behind the shrine, there is a pit with purple light emanating below that you can drop into and find this boss.\n\n### Captain Lotus-Vision Miniboss Fight and Guide",
    "img_below_text": "One of four Captains of the Pagoda Realm, Captain Lotus-Vision is responsible for sealing many of the prison cells, and must be defeated before you can unlock them. He is a strange Yaoguai Chief, and doesn't really have any melee attacks to speak of, instead opting for a series of projectiles and lasers to attack you with. With that in mind, it's highly recommended that you equip the Cloud Step Spell over Rock Solid for help evading some of his attacks.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Captain Lotus-Vision\n            - Section Title: Where to Find Captain Lotus-Vision\n            - Sub-Section Title: Captain Lotus-Vision Miniboss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Captain Lotus-Vision\n\nCaptain Lotus-Vision is an optional miniboss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Responsible for sealing captives in the cells of the Pagoda Realm, you can find this boss in a secret chamber within the Pagoda Prison.\n\n* **Rewards:** Spirit of Captain Lotus-Vision, Frostsprout Twig, Mind Core, Cold Iron Leaves, 1847 Experience, 1198 Will\n\n## Where to Find Captain Lotus-Vision\n\nCaptain Lotus-Vision is one of the four captains you can find in Chapter 3, and is an optional Yaoguai Chief you can encounter in the Pagoda Realm.\n\nTo find him, you'll need to reach the Upper Pagoda Shrine on the third level of the prison. Just behind the shrine, there is a pit with purple light emanating below that you can drop into and find this boss.\n\n### Captain Lotus-Vision Miniboss Fight and Guide\"\n            - Following Text: \"One of four Captains of the Pagoda Realm, Captain Lotus-Vision is responsible for sealing many of the prison cells, and must be defeated before you can unlock them. He is a strange Yaoguai Chief, and doesn't really have any melee attacks to speak of, instead opting for a series of projectiles and lasers to attack you with. With that in mind, it's highly recommended that you equip the Cloud Step Spell over Rock Solid for help evading some of his attacks.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Captain Lotus-Vision as an optional miniboss in Chapter 3 of Black Myth Wukong. He is one of the four captains in the Pagoda Realm and is responsible for sealing captives in the Pagoda Prison. Players can find him in a secret chamber within the Pagoda Prison, and defeating him yields various rewards.\n\nImage Summary:\nThe image depicts a scene from the game Black Myth Wukong, showing a character standing on a rocky ledge near a pit with a glowing purple light below. An arrow points towards the pit, suggesting it is the entrance to the secret chamber where players can find and fight Captain Lotus-Vision, as described in the context.\n\nFollowing Text Summary:\nThe following text provides details about the miniboss fight with Captain Lotus-Vision. It describes him as a Yaoguai Chief who uses projectiles and lasers instead of melee attacks. To effectively evade his attacks, players are advised to equip the Cloud Step Spell. Defeating him is necessary to unlock the prison cells he has sealed."
}