{
    "chunk_id": 901625909880,
    "source_file": "Black_Loong.md",
    "h1_title": "Black Loong",
    "h2_title": "Black Loong Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1a/Wukong_BlackLoong_5.jpg",
    "alt_text": "Wukong BlackLoong 5.jpg",
    "position_desc": 13,
    "img_above_text": "# Black Loong\n\nBlack Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Hidden beyond a waterfall of sand in the Fright Cliff, you won't be able to encounter this boss until you obtain a Key Item elswhere in this chapter, Black Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* **Rewards:** Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n\n\nWith the Loong Scales, you'll be able to interact with the sandfall and remove it as a barrier, revealing a door behind it to take you into the Black Loong's lair.\n\n## Black Loong Boss Fight and Guide\n\nAnother lengthy combo that can be hard to get away from will be when Black Loong starts to repeatedly pound the ground with alternate weapon slams, expelling electric blasts from each one. This can go on for up to nine slams, with the final attack being the one that causes the biggest explosion. If you try to interrupt him with Immobilize, be sure to follow up with a strong attack that can stagger, or he’ll simply keep the combo going.",
    "img_below_text": "If you spot the Black Loong raising his weapons high in a slow manner while they crackle to life, it’s a sign he’s going to bang them together slowly three times, causing explosions in the air that gradually increase in range. This is a good time to sprint to safety and use your medicines while you wait for the attack to end.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Black Loong\n            - Section Title: Black Loong Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Black Loong\n\nBlack Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Hidden beyond a waterfall of sand in the Fright Cliff, you won't be able to encounter this boss until you obtain a Key Item elswhere in this chapter, Black Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* **Rewards:** Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n\n\nWith the Loong Scales, you'll be able to interact with the sandfall and remove it as a barrier, revealing a door behind it to take you into the Black Loong's lair.\n\n## Black Loong Boss Fight and Guide\n\nAnother lengthy combo that can be hard to get away from will be when Black Loong starts to repeatedly pound the ground with alternate weapon slams, expelling electric blasts from each one. This can go on for up to nine slams, with the final attack being the one that causes the biggest explosion. If you try to interrupt him with Immobilize, be sure to follow up with a strong attack that can stagger, or he’ll simply keep the combo going.\"\n            - Following Text: \"If you spot the Black Loong raising his weapons high in a slow manner while they crackle to life, it’s a sign he’s going to bang them together slowly three times, causing explosions in the air that gradually increase in range. This is a good time to sprint to safety and use your medicines while you wait for the attack to end.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Black Loong, a secret optional boss in *Black Myth: Wukong*, encountered in Chapter 2. To access the boss, players must acquire a key item, the Loong Scales, to remove a sandfall barrier. Black Loong is one of four dragon bosses that reward players with valuable crafting materials upon defeat. The text also describes one of Black Loong's attack patterns, a lengthy combo involving repeated ground slams and electric blasts.\n\nImage Summary:\nThe image depicts the Black Loong boss fight, showcasing a dramatic moment where the boss unleashes a powerful electric attack. Bright lightning effects dominate the scene, emphasizing the intensity of the battle. The player's character is visible in the foreground, with health and ability icons displayed, indicating active gameplay. The boss's name and health bar are also shown, reinforcing the image's role as part of the guide to the fight.\n\nFollowing Text Summary:\nThe following text provides additional details about Black Loong's attack patterns, specifically a sequence where the boss raises its weapons slowly and creates airborne explosions that increase in range. Players are advised to sprint to safety and use healing items during this attack."
}