{
    "chunk_id": 776732867100,
    "source_file": "Bullguard.md",
    "h1_title": "Bullguard",
    "h2_title": "Where to Find the Bullguard",
    "h3_title": "Bullguard Miniboss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/eb/Wukong_Wolves_20.jpg",
    "alt_text": "Wukong Wolves 20.jpg",
    "position_desc": 5,
    "img_above_text": "# Bullguard\n\nThe Bullguard is an required Yaoguai Chief, and the first miniboss fight that you can encounter in Chapter 1 of Black Myth Wukong. As a tutorial boss, the Bullguard is designed to test your abilities in dealing with a strong foe, but you'll be helped along the way learning an important spell from the Keeper of Black Mountain.\n\n* **Rewards:** Immobilize Spell, Yarn x2, 482 Experience, 390 Will\n\n## Where to Find the Bullguard\n\nSince the Bullguard is a required miniboss, he can't be missed on your journey through the opening areas of Chapter 1. You'll find him in the Forest of Wolves, not far from the Front Hills Shrine just along the main path across a bridge, keeping to the right. The Bullguard blocks a large gate area leading to the next main region of Black Wind Mountain.\n\n### Bullguard Miniboss Fight and Guide\n\nOnce you carve out about half of the Bullguard’s health bar, he’ll parry your next strike and move in for the killing blow — until the Keeper intervenes. Using an immobilization spell to lock him in place, the Keeper will pass on the magic spell to the Destined One, giving you your first spell - **Immobilize**!\n\nImmobilize allows you to bind an enemy in place for a small duration, at which point you’re able to make use of the pause to unload with attacks until the effect breaks. Stronger enemies like this Yaoguai Chief will break out a lot sooner than regular foes, and certain bosses can even resist it entirely, so be wary!",
    "img_below_text": "Once the Bullguard breaks free and the Keeper vanishes, it will be up to you to finish the fight. Utilize your new Immobilize Spell to bind him when it suits you best — either to ward off an incoming attack, catch your breath so you can heal, or use the moment to hit him from the side, and launch a heavy attack to send him sprawling.\n\nDon’t get too reckless, as the Immobilize Spell has a moderate cooldown, and uses a bit of your magic meter each time. Unlike your health or stamina, you can’t regenerate magic except by resting at a Shrine.\n\nWhen the beast finally falls, you’ll likely get a ton of experience, which you can invest in more skill trees that include a new one for your spells like Immobilize. The path forward is now clear to tread, but it’s still a little ways to the next Shrine. If you’re low on health, you can always head back to the Shrine and rest, as enemies like the Bullguard won’t respawn.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bullguard\n            - Section Title: Where to Find the Bullguard\n            - Sub-Section Title: Bullguard Miniboss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Bullguard\n\nThe Bullguard is an required Yaoguai Chief, and the first miniboss fight that you can encounter in Chapter 1 of Black Myth Wukong. As a tutorial boss, the Bullguard is designed to test your abilities in dealing with a strong foe, but you'll be helped along the way learning an important spell from the Keeper of Black Mountain.\n\n* **Rewards:** Immobilize Spell, Yarn x2, 482 Experience, 390 Will\n\n## Where to Find the Bullguard\n\nSince the Bullguard is a required miniboss, he can't be missed on your journey through the opening areas of Chapter 1. You'll find him in the Forest of Wolves, not far from the Front Hills Shrine just along the main path across a bridge, keeping to the right. The Bullguard blocks a large gate area leading to the next main region of Black Wind Mountain.\n\n### Bullguard Miniboss Fight and Guide\n\nOnce you carve out about half of the Bullguard’s health bar, he’ll parry your next strike and move in for the killing blow — until the Keeper intervenes. Using an immobilization spell to lock him in place, the Keeper will pass on the magic spell to the Destined One, giving you your first spell - **Immobilize**!\n\nImmobilize allows you to bind an enemy in place for a small duration, at which point you’re able to make use of the pause to unload with attacks until the effect breaks. Stronger enemies like this Yaoguai Chief will break out a lot sooner than regular foes, and certain bosses can even resist it entirely, so be wary!\"\n            - Following Text: \"Once the Bullguard breaks free and the Keeper vanishes, it will be up to you to finish the fight. Utilize your new Immobilize Spell to bind him when it suits you best — either to ward off an incoming attack, catch your breath so you can heal, or use the moment to hit him from the side, and launch a heavy attack to send him sprawling.\n\nDon’t get too reckless, as the Immobilize Spell has a moderate cooldown, and uses a bit of your magic meter each time. Unlike your health or stamina, you can’t regenerate magic except by resting at a Shrine.\n\nWhen the beast finally falls, you’ll likely get a ton of experience, which you can invest in more skill trees that include a new one for your spells like Immobilize. The path forward is now clear to tread, but it’s still a little ways to the next Shrine. If you’re low on health, you can always head back to the Shrine and rest, as enemies like the Bullguard won’t respawn.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Bullguard as a required miniboss in Chapter 1 of \"Black Myth Wukong.\" It is a tutorial boss designed to test the player's abilities. The Bullguard is located in the Forest of Wolves, blocking a gate to the next region. Players will learn the Immobilize Spell during this encounter, which temporarily binds enemies.\n\nImage Summary:\nThe image likely depicts the Bullguard miniboss fight in \"Black Myth Wukong.\" It shows a dynamic combat scene where the player character is engaged in battle with the Bullguard. The visual effects suggest the use of a spell or special ability, possibly the Immobilize Spell mentioned in the text, as the Bullguard is surrounded by glowing energy.\n\nFollowing Text Summary:\nThe following text explains that after the Keeper's intervention, players must finish the fight using the Immobilize Spell strategically. The spell has a cooldown and uses magic, which can only be replenished at a Shrine. Defeating the Bullguard grants experience and access to new skill trees, including one for spells like Immobilize. The path forward is open, but players should manage their resources carefully."
}