{
    "chunk_id": 716637603731,
    "source_file": "Earth_Spirit_Cap.md",
    "h1_title": "Earth Spirit Cap",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4a/Field_Fire_Walkthrough_%282%29.png",
    "alt_text": "Field Fire Walkthrough \\(2\\).png",
    "position_desc": 1,
    "img_above_text": "# Earth Spirit Cap\n\nThe Earth Spirit Cap is a unique piece of Armor and Gear in Black Myth: Wukong. It comes with some basic defense, high Poison Resistance, and a unique ability that no other piece of armor has.\n\nIt has 26 Defense, 15% Poison Resistance, and the following Unique Effect:\n\n* Slowly loses health, but massively increases health recovery when using Gourd\n\nThe Earth Spirit Cap is obtained upon defeating Nine-Capped Lingzhi Guai in Field of Fire in Chapter 5 - Flaming Mountains.",
    "img_below_text": "Armor can be upgraded, with Silk once you reach Chen Loong and open the Zodiac Realm in The New West in Chapter 3.\n\nFor even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Weapons locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Earth Spirit Cap\n\n            Context:\n            - Preceding Text: \"# Earth Spirit Cap\n\nThe Earth Spirit Cap is a unique piece of Armor and Gear in Black Myth: Wukong. It comes with some basic defense, high Poison Resistance, and a unique ability that no other piece of armor has.\n\nIt has 26 Defense, 15% Poison Resistance, and the following Unique Effect:\n\n* Slowly loses health, but massively increases health recovery when using Gourd\n\nThe Earth Spirit Cap is obtained upon defeating Nine-Capped Lingzhi Guai in Field of Fire in Chapter 5 - Flaming Mountains.\"\n            - Following Text: \"Armor can be upgraded, with Silk once you reach Chen Loong and open the Zodiac Realm in The New West in Chapter 3.\n\nFor even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Weapons locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe Earth Spirit Cap is a special piece of armor in the game *Black Myth: Wukong*. It offers basic defense, high poison resistance, and a unique effect that gradually depletes health but significantly boosts health recovery when using a Gourd. This item is acquired by defeating the Nine-Capped Lingzhi Guai boss in the Field of Fire during Chapter 5 - Flaming Mountains.\n\nImage Summary:  \nThe image depicts an intense battle scene from *Black Myth: Wukong*, showing the player character engaging in combat with the Nine-Capped Lingzhi Guai boss. The boss is a humanoid creature with a large red mushroom-like cap and wields a weapon, set in a rocky, desolate environment that aligns with the \"Field of Fire\" location described in the context.\n\nFollowing Text Summary:  \nArmor in *Black Myth: Wukong* can be upgraded using Silk after reaching Chen Loong and unlocking the Zodiac Realm in Chapter 3. Additional guides are available for locating weapons, Gourds, Curios, Vessels, transformation spells, and consumable items in the game."
}