{
    "chunk_id": 414282410833,
    "source_file": "Father_of_Stones.md",
    "h1_title": "Father of Stones",
    "h2_title": "Father of Stones Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e8/Woods_Ember_Walkthrough_%2857%29.png",
    "alt_text": "Woods Ember Walkthrough \\(57\\).png",
    "position_desc": 5,
    "img_above_text": "# Father of Stones\n\nFather of Stones is a Yaoguai Chief you'll fight soon after you reach the Heights of Ember in Chapter 5 of Black Myth: Wukong.\n\n\nFrom the Heights of Ember Keeper's Shrine, continue toward the open space on the left. When you reach a certain point, the Father of Stones miniboss will jump over the wall near the door on the right.\n\n## Father of Stones Boss Fight and Guide\n\nThe first thing to watch out for is him swinging his arms in a combination move. He will lazily swing an arm at you a few times. But these can be dodged or missed entirely if you step back far enough. Alternatively, he will reach out to try and hit you, and often falls down straight away after performing the attack. As it takes a little while for him to recover, you can get your own combo of attacks in here.\n\nHe will sometimes leap in the air and try to land on you. Again, these can be dodged and ignored by stepping back. This is actually the case for most of his attacks, so bait him out to hit you and then take advantage of the slow recovery. If you stand behind him too long though, he'll sit down and quickly push himself toward you, rolling over and over to try and catch you.",
    "img_below_text": "The most dangerous of his attacks are the kicks that spark and send out a line of fire in your direction and when he roars. As soon as he opens his mouth, jump or step back to avoid the immediate area around him, where his roars will hit. Otherwise, this will knock you back and damage you.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Father of Stones\n            - Section Title: Father of Stones Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Father of Stones\n\nFather of Stones is a Yaoguai Chief you'll fight soon after you reach the Heights of Ember in Chapter 5 of Black Myth: Wukong.\n\n\nFrom the Heights of Ember Keeper's Shrine, continue toward the open space on the left. When you reach a certain point, the Father of Stones miniboss will jump over the wall near the door on the right.\n\n## Father of Stones Boss Fight and Guide\n\nThe first thing to watch out for is him swinging his arms in a combination move. He will lazily swing an arm at you a few times. But these can be dodged or missed entirely if you step back far enough. Alternatively, he will reach out to try and hit you, and often falls down straight away after performing the attack. As it takes a little while for him to recover, you can get your own combo of attacks in here.\n\nHe will sometimes leap in the air and try to land on you. Again, these can be dodged and ignored by stepping back. This is actually the case for most of his attacks, so bait him out to hit you and then take advantage of the slow recovery. If you stand behind him too long though, he'll sit down and quickly push himself toward you, rolling over and over to try and catch you.\"\n            - Following Text: \"The most dangerous of his attacks are the kicks that spark and send out a line of fire in your direction and when he roars. As soon as he opens his mouth, jump or step back to avoid the immediate area around him, where his roars will hit. Otherwise, this will knock you back and damage you.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Father of Stones, a Yaoguai Chief miniboss encountered in Chapter 5 of *Black Myth: Wukong*. Players face him after reaching the Heights of Ember, where he jumps over a wall to initiate the fight. The text provides initial strategies, emphasizing dodging his slow arm swings, baiting his attacks, and exploiting his recovery time for counterattacks.\n\nImage Summary:\nThe image depicts the Father of Stones miniboss in an intense combat scene from *Black Myth: Wukong*. The towering, monstrous figure looms over the player character, who is actively engaged in battle, wielding a weapon. The environment is dark and eerie, featuring barren trees, rocky terrain, and ancient structures, reinforcing the ominous atmosphere of the encounter.\n\nFollowing Text Summary:\nThe following text elaborates on the Father of Stones' more dangerous attacks, including fire-sparking kicks and a roar that damages and knocks back players. It advises avoiding the immediate area when he roars and emphasizes timing and positioning to mitigate damage during these attacks."
}