{
    "chunk_id": 717997044748,
    "source_file": "Bee_Mountain_Stone.md",
    "h1_title": "Bee Mountain Stone",
    "h2_title": "Black Myth: Wukong Bee Mountain Stone Location",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/87/Wukong_YellowFlower_5.jpg",
    "alt_text": "Wukong YellowFlower 5.jpg",
    "position_desc": 1,
    "img_above_text": "# Bee Mountain Stone\n\nThe Bee Mountain Stone Soak is one of the Rare Soaks for your Gourds in Black Myth: Wukong.\n\nWith the Bee Mountain Stone Soak equipped, using the gourd grants a considerable chance to take a sip without consuming a gourd use. This works great with the Supreme Gourd or the Qing-Tian Gourd\n\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor.\n\n## Black Myth: Wukong Bee Mountain Stone Location\n\nThe Bee Mountain Stone can be obtained from the Temple of Yellow Flowers at the Mountain Trail Shrine in The Webbed Hollow. From the Shrine, continue forward up a short flight of stairs. Once you reach another short flight of steps, loop around to your left to find the Soak in a container on a bench.",
    "img_below_text": "Soaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bee Mountain Stone\n            - Section Title: Black Myth: Wukong Bee Mountain Stone Location\n\n            Context:\n            - Preceding Text: \"# Bee Mountain Stone\n\nThe Bee Mountain Stone Soak is one of the Rare Soaks for your Gourds in Black Myth: Wukong.\n\nWith the Bee Mountain Stone Soak equipped, using the gourd grants a considerable chance to take a sip without consuming a gourd use. This works great with the Supreme Gourd or the Qing-Tian Gourd\n\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor.\n\n## Black Myth: Wukong Bee Mountain Stone Location\n\nThe Bee Mountain Stone can be obtained from the Temple of Yellow Flowers at the Mountain Trail Shrine in The Webbed Hollow. From the Shrine, continue forward up a short flight of stairs. Once you reach another short flight of steps, loop around to your left to find the Soak in a container on a bench.\"\n            - Following Text: \"Soaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Bee Mountain Stone Soak, a rare item in *Black Myth: Wukong* that enhances the functionality of the player's gourd by providing a chance to use it without consuming its charges. It explains that Soaks cannot be upgraded and provides instructions for switching Soaks via the Shen Monkey vendor. Additionally, it describes the location of the Bee Mountain Stone at the Temple of Yellow Flowers in The Webbed Hollow, offering specific steps to find it.\n\nImage Summary:\nThe image depicts the in-game location of the Bee Mountain Stone at the Temple of Yellow Flowers in *Black Myth: Wukong*. The highlighted container on the bench, marked with a red circle, indicates the exact spot where the Bee Mountain Stone can be found. The surrounding area includes stone pathways, vegetation, and an NPC or enemy figure in the background, suggesting a potential encounter near the item.\n\nFollowing Text Summary:\nThe following text emphasizes the abundance of Soaks compared to drinks for gourds in the game, noting their widespread availability across chapters. It encourages players to explore guides for additional locations and mentions other collectible items, such as Awaken Wine Worms and Luoija Fragrant Vines, which are essential for upgrading healing abilities and gourds."
}