{
    "chunk_id": 308514739052,
    "source_file": "Ebon_Flow.md",
    "h1_title": "Ebon Flow",
    "h2_title": "**Black Myth: Wukong Ebon Flow Location**",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2a/Wukong_Sandgate_12.jpg",
    "alt_text": "Wukong Sandgate 12.jpg",
    "position_desc": 1,
    "img_above_text": "# Ebon Flow\n\nEbon Flow is one of the Transformation Spells you can find in Black Myth: Wukong. Focused on dodging and deflecting attacks to then follow those actions up with powerful attacks, Ebon Flow can easily be missed within The New West as it is a part of a long quest chain.\n\nThe spell allows you to transform into the Yin Tiger to ward off incoming blows by holding the sword horizontally, or dashing forward like a gale to close in on foes. Focus is then built up before transformation can be converted for use afterward. Ebon Flow's moveset is as follows:\n\n* **Light attack: Onslaught Blade - Raise the Great Iron Blade to strike the target, building up focus with each hit.** As Focus increases, enemies are more easily staggered with this series of attacks that raises your Great Iron Blade.\n* **Heavy attack: Rift Cleaver - Hold Heavy Attack to unleash a powerful cleave, deling massive damage.** The more Focus built up, the more devastating the damage becomes with this attack, which is a slow, powerful slam.\n* **Deflection: Blacksmith - Raise the blade to deflect assaults, build up Focus with each deflection, or dodge to switch to other moves.** This is one of the only defensive moves a Transformation Spell has, building Focus with each hit and allowing you to mitigate damage.\n\n## **Black Myth: Wukong Ebon Flow Location**\n\nAs mentioned, finding Ebon Flow is long-winded, consisting of multiple steps across locations. To find the Ebon Flow Transformation in Black Myth: Wukong, you will need to:\n\n* Save Xu Dog from Lang-Li-Guhh-Baw in Sandgate Village in Yellow Wind Ridge and unlock the Cellar Shrine in Crouching Tiger Temple\n* Continue through Yellow Wind Ridge and into The New West until you step off Turtle Island at Bitter Lake\n* Defeat Chen Loong to the left of the North Shore Shrine in The New West\n* Upon defeating him, obtain the pill he asks for from Xu Dog in the Cellar of the Crouching Tiger Tiger in Yellow Wind Ridge\n* Return to Chen Loong and enter the Zodiac Village upon obtaining the Ruyi Scroll from him\n* Talk with Yin Tiger in the Zodiac Realm and challenge him to a duel. Succeed to obtain Ebon Flow\n\nTo save Xu Dog, you will need to head through the cave, just next to the Village Entrance Shrine in Sandgate Village in Yellow Wind Ridge.",
    "img_below_text": "Beneath Xu Dog you can find a small pond with Lang-Li-Guhh-Baw, whom you will need to defeat.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Ebon Flow\n            - Section Title: **Black Myth: Wukong Ebon Flow Location**\n\n            Context:\n            - Preceding Text: \"# Ebon Flow\n\nEbon Flow is one of the Transformation Spells you can find in Black Myth: Wukong. Focused on dodging and deflecting attacks to then follow those actions up with powerful attacks, Ebon Flow can easily be missed within The New West as it is a part of a long quest chain.\n\nThe spell allows you to transform into the Yin Tiger to ward off incoming blows by holding the sword horizontally, or dashing forward like a gale to close in on foes. Focus is then built up before transformation can be converted for use afterward. Ebon Flow's moveset is as follows:\n\n* **Light attack: Onslaught Blade - Raise the Great Iron Blade to strike the target, building up focus with each hit.** As Focus increases, enemies are more easily staggered with this series of attacks that raises your Great Iron Blade.\n* **Heavy attack: Rift Cleaver - Hold Heavy Attack to unleash a powerful cleave, deling massive damage.** The more Focus built up, the more devastating the damage becomes with this attack, which is a slow, powerful slam.\n* **Deflection: Blacksmith - Raise the blade to deflect assaults, build up Focus with each deflection, or dodge to switch to other moves.** This is one of the only defensive moves a Transformation Spell has, building Focus with each hit and allowing you to mitigate damage.\n\n## **Black Myth: Wukong Ebon Flow Location**\n\nAs mentioned, finding Ebon Flow is long-winded, consisting of multiple steps across locations. To find the Ebon Flow Transformation in Black Myth: Wukong, you will need to:\n\n* Save Xu Dog from Lang-Li-Guhh-Baw in Sandgate Village in Yellow Wind Ridge and unlock the Cellar Shrine in Crouching Tiger Temple\n* Continue through Yellow Wind Ridge and into The New West until you step off Turtle Island at Bitter Lake\n* Defeat Chen Loong to the left of the North Shore Shrine in The New West\n* Upon defeating him, obtain the pill he asks for from Xu Dog in the Cellar of the Crouching Tiger Tiger in Yellow Wind Ridge\n* Return to Chen Loong and enter the Zodiac Village upon obtaining the Ruyi Scroll from him\n* Talk with Yin Tiger in the Zodiac Realm and challenge him to a duel. Succeed to obtain Ebon Flow\n\nTo save Xu Dog, you will need to head through the cave, just next to the Village Entrance Shrine in Sandgate Village in Yellow Wind Ridge.\"\n            - Following Text: \"Beneath Xu Dog you can find a small pond with Lang-Li-Guhh-Baw, whom you will need to defeat.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces \"Ebon Flow,\" a Transformation Spell in *Black Myth: Wukong*. It highlights the spell's mechanics, including its focus on dodging, deflecting, and delivering powerful attacks, as well as its ability to transform into the Yin Tiger. The text also outlines the quest chain required to obtain the spell, which involves saving Xu Dog, defeating Chen Loong, and interacting with Yin Tiger in the Zodiac Realm.\n\nImage Summary:  \nThe image depicts a location in *Black Myth: Wukong*, specifically near the Village Entrance Shrine in Sandgate Village, Yellow Wind Ridge. A red arrow points toward a cave entrance, suggesting this is the path players must take to save Xu Dog as part of the quest to obtain the Ebon Flow Transformation Spell. The environment features rocky terrain, a lit brazier, and a statue, emphasizing the game's detailed setting.\n\nFollowing Text Summary:  \nThe following text provides additional instructions for the quest, stating that beneath Xu Dog is a small pond where players must defeat Lang-Li-Guhh-Baw. This step is crucial to progressing in the quest chain to unlock the Ebon Flow spell."
}