{
    "chunk_id": 357978199754,
    "source_file": "Cyan_Loong.md",
    "h1_title": "Cyan Loong",
    "h2_title": "Cyan Loong Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9d/Wukong_Turtle_35.jpg",
    "alt_text": "Wukong Turtle 35.jpg",
    "position_desc": 13,
    "img_above_text": "# Cyan Loong\n\nCyan Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 3 of Black Myth Wukong. Hiding on the far side of Turtle Island this frozen boss can't be activated until you obtain a Key Item in the previous chapter. Cyan Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* Rewards: Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n\n\nYou can enter the crack in the wall, and on the other side you’ll find a chest containing the Loong Scales. With this item, you’ll be able to unlock the boss.\n\n## Cyan Loong Boss Fight and Guide\n\nWith his freshly empowered sword, Cyan Loong will deal more damage than ever before. A single sword swing can cleave your health apart, and if you already have the shock status effect, you can easily die in a single hit if you aren't careful. Be sure to counter this new phase with Evil Repelling Medicament to increase your defense, and have Shock-Quelling Powder on hand for any moment you do get the status effect.",
    "img_below_text": "Several of his moves have also been improved. His electric palm strike for instance now causes several lightning strikes in front of him, up from just a single blast, requiring you to dodge around to his sides instead of backward.\n\nIf he begins to hold his sword back while pointing at you, the air will crackle around him preventing you from getting close, and his two-handed sword swing will also unleash an electric projectile slash you'll need to evade.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Cyan Loong\n            - Section Title: Cyan Loong Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Cyan Loong\n\nCyan Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 3 of Black Myth Wukong. Hiding on the far side of Turtle Island this frozen boss can't be activated until you obtain a Key Item in the previous chapter. Cyan Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* Rewards: Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n\n\nYou can enter the crack in the wall, and on the other side you’ll find a chest containing the Loong Scales. With this item, you’ll be able to unlock the boss.\n\n## Cyan Loong Boss Fight and Guide\n\nWith his freshly empowered sword, Cyan Loong will deal more damage than ever before. A single sword swing can cleave your health apart, and if you already have the shock status effect, you can easily die in a single hit if you aren't careful. Be sure to counter this new phase with Evil Repelling Medicament to increase your defense, and have Shock-Quelling Powder on hand for any moment you do get the status effect.\"\n            - Following Text: \"Several of his moves have also been improved. His electric palm strike for instance now causes several lightning strikes in front of him, up from just a single blast, requiring you to dodge around to his sides instead of backward.\n\nIf he begins to hold his sword back while pointing at you, the air will crackle around him preventing you from getting close, and his two-handed sword swing will also unleash an electric projectile slash you'll need to evade.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Cyan Loong, a secret boss in *Black Myth: Wukong*, encountered in Chapter 3. This Yaoguai King is one of four Loong Dragons, offering valuable rewards upon defeat. Accessing the fight requires obtaining the Loong Scales item from a chest in the previous chapter. Cyan Loong's attacks are powerful, especially in his enhanced phase, necessitating defensive items like Evil Repelling Medicament and Shock-Quelling Powder to mitigate damage and status effects.\n\nImage Summary:\nThe image depicts the Cyan Loong boss fight in *Black Myth: Wukong*. The player character is engaged in combat with the dragon-like boss in a snowy, stormy environment filled with lightning effects. The boss's health bar is visible at the bottom, and the player's interface shows consumables and abilities. The scene emphasizes the intense atmosphere and the electric-themed attacks of Cyan Loong.\n\nFollowing Text Summary:\nThe following text details Cyan Loong's improved moves in his enhanced phase. His electric palm strike now generates multiple lightning blasts, requiring strategic dodging. Additionally, his charged sword attack creates an electric barrier and unleashes a projectile slash, further emphasizing the need for precise evasion and positioning during the fight."
}