{
    "chunk_id": 194249275526,
    "source_file": "Chapter_5_Secret_-_Bishui_Cave_Walkthrough.md",
    "h1_title": "Chapter 5 Secret - Bishui Cave Walkthrough",
    "h2_title": "Yaoguai Chief - Top Takes Bottom, Bottom Takes Top",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/cf/Bishui_Cave_Walkthrough_%2815%29.png",
    "alt_text": "Bishui Cave Walkthrough \\(15\\).png",
    "position_desc": 4,
    "img_above_text": "# Chapter 5 Secret - Bishui Cave Walkthrough\n\nTo your left, immediately as you enter the room, you'll find the Purge Pit Keeper's Shrine.\n\n\nAfter activating the first of the Keeper's Shrines, face away from it and head to the right. Go down the stairs and to the end of the path to find a Meditation Spot.\n\nReturn to the Keeper's Shrine and continue past it, following the path to the right. Head down to the slope, collecting the green Wisp on the left and into the center of the room. As you reach the middle, you'll be met by the first of the bosses in this secret area.\n\n## Yaoguai Chief - Top Takes Bottom, Bottom Takes Top",
    "img_below_text": "It turns out that the spiked gold ball is hiding a secret inside, which is two minibosses for you to take on. They will both use a portion of the ball as a shield and have a sword to complement it.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chapter 5 Secret - Bishui Cave Walkthrough\n            - Section Title: Yaoguai Chief - Top Takes Bottom, Bottom Takes Top\n\n            Context:\n            - Preceding Text: \"# Chapter 5 Secret - Bishui Cave Walkthrough\n\nTo your left, immediately as you enter the room, you'll find the Purge Pit Keeper's Shrine.\n\n\nAfter activating the first of the Keeper's Shrines, face away from it and head to the right. Go down the stairs and to the end of the path to find a Meditation Spot.\n\nReturn to the Keeper's Shrine and continue past it, following the path to the right. Head down to the slope, collecting the green Wisp on the left and into the center of the room. As you reach the middle, you'll be met by the first of the bosses in this secret area.\n\n## Yaoguai Chief - Top Takes Bottom, Bottom Takes Top\"\n            - Following Text: \"It turns out that the spiked gold ball is hiding a secret inside, which is two minibosses for you to take on. They will both use a portion of the ball as a shield and have a sword to complement it.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the player's journey through a secret area in Bishui Cave, where they encounter a boss after activating a shrine and collecting a green Wisp. The player is guided to the center of a room where the Yaoguai Chief boss awaits.\n\nImage Summary:\nThe image shows a spiked, ornate gold ball with intricate designs, likely representing the spiked gold ball mentioned in the context. This ball appears to be a significant element in the secret area, possibly related to the boss encounter described in the text.\n\nFollowing Text Summary:\nThe following text reveals that the spiked gold ball conceals two minibosses inside. These minibosses use parts of the ball as shields and are equipped with swords, indicating a challenging battle for the player."
}