{
    "chunk_id": 576061582519,
    "source_file": "Bitter_Lake_Walkthrough.md",
    "h1_title": "Bitter Lake Walkthrough",
    "h2_title": "Turtle Island",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f5/Wukong_Turtle_19X.jpg",
    "alt_text": "Wukong Turtle 19X.jpg",
    "position_desc": 19,
    "img_above_text": "# Bitter Lake Walkthrough\n\nAs you draw close, you'll hear a voice coming from the cymbals, who is arguing with a woman refusing to let the trapped person out. With a loud gong, the trapped \"Admiral\" will use the cymbal to awaken a giant turtle whose mountainous shell you're actually standing on.\n\nAs the turtle begins to swim through the Bitter Seal, the woman will become aware of your presence, starting this new region off with a bang of a boss fight.\n\n\nAs long as your patient to wait for the right moments to get in close and attack, and make sure you're using shock-quelling medicine, you'll be able to come out on top. Even as Kang-Jin Star tries to flee in her dragon form, the Destined One will see to it that she crashes into the large cymbals, freeing the prisoner inside!\n\nThis imprisoned Pig Guai is none other than Zhu Bajie, who traveled with Sun Wukong during his adventures in Journey to the West!\n\n## Turtle Island\n\nNow free of the cymbals that once trapped Sun Wukong himself, Zhu Bajie may appear grumpy, but he's willing to help the Destined One on his journey. He'll run off to the front of the Turtle Island where the giant beast's head is, and you can follow him to get the main story moving to the rest of the Bitter Lake area, but there's a few things worth checking out here first.\n\nBack at the Turtle Island Shrine below where you faced Kang-Jin Star, be sure to explore the left side of the \"island\" (when facing up toward the turtle's head).",
    "img_below_text": "There's many ledges along this ridge you can explore. Many of them have a couple of Frozen Corpses lying in wait, but be on the lookout for a small altar with a gold pot on display. You can open it and find another **Celestial Jade Lotus Pill** to increase your maximum health.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bitter Lake Walkthrough\n            - Section Title: Turtle Island\n\n            Context:\n            - Preceding Text: \"# Bitter Lake Walkthrough\n\nAs you draw close, you'll hear a voice coming from the cymbals, who is arguing with a woman refusing to let the trapped person out. With a loud gong, the trapped \"Admiral\" will use the cymbal to awaken a giant turtle whose mountainous shell you're actually standing on.\n\nAs the turtle begins to swim through the Bitter Seal, the woman will become aware of your presence, starting this new region off with a bang of a boss fight.\n\n\nAs long as your patient to wait for the right moments to get in close and attack, and make sure you're using shock-quelling medicine, you'll be able to come out on top. Even as Kang-Jin Star tries to flee in her dragon form, the Destined One will see to it that she crashes into the large cymbals, freeing the prisoner inside!\n\nThis imprisoned Pig Guai is none other than Zhu Bajie, who traveled with Sun Wukong during his adventures in Journey to the West!\n\n## Turtle Island\n\nNow free of the cymbals that once trapped Sun Wukong himself, Zhu Bajie may appear grumpy, but he's willing to help the Destined One on his journey. He'll run off to the front of the Turtle Island where the giant beast's head is, and you can follow him to get the main story moving to the rest of the Bitter Lake area, but there's a few things worth checking out here first.\n\nBack at the Turtle Island Shrine below where you faced Kang-Jin Star, be sure to explore the left side of the \"island\" (when facing up toward the turtle's head).\"\n            - Following Text: \"There's many ledges along this ridge you can explore. Many of them have a couple of Frozen Corpses lying in wait, but be on the lookout for a small altar with a gold pot on display. You can open it and find another **Celestial Jade Lotus Pill** to increase your maximum health.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes a dramatic encounter on Turtle Island, where the protagonist faces a boss fight against Kang-Jin Star. The battle involves freeing Zhu Bajie, a character from the Journey to the West, who was imprisoned in cymbals. Zhu Bajie, now free, is willing to assist the protagonist in their journey across the Bitter Lake area.\n\nImage Summary:\nThe image depicts a snowy landscape on Turtle Island, featuring a character standing on a ledge with a staff, facing a path leading further up the ridge. The environment suggests exploration, with the character seemingly preparing to navigate the terrain. The presence of a red-circled object in the distance indicates a point of interest or an item to be collected, aligning with the exploration theme described in the context.\n\nFollowing Text Summary:\nThe following text advises exploring the ledges along the ridge on Turtle Island, where players can encounter Frozen Corpses and discover a small altar with a gold pot. Opening the pot reveals a Celestial Jade Lotus Pill, which increases the player's maximum health, emphasizing the importance of exploration and item collection in this area."
}