{
    "chunk_id": 313501718608,
    "source_file": "Black_Loong.md",
    "h1_title": "Black Loong",
    "h2_title": "Where to Find Black Loong",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a1/Wukong_Fright_41.jpg",
    "alt_text": "Wukong Fright 41.jpg",
    "position_desc": 6,
    "img_above_text": "# Black Loong\n\nBlack Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Hidden beyond a waterfall of sand in the Fright Cliff, you won't be able to encounter this boss until you obtain a Key Item elswhere in this chapter, Black Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* **Rewards:** Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n\n## Where to Find Black Loong\n\nHead to the Fright Cliff on the opposite side of the Yellow Wind Ridge from the Valley of Despair, and travel through it to reach an area with the Rockrest Flat Shrine.",
    "img_below_text": "Directly to the right of this shrine, you can spot a stairway leading up to a large waterfall of sand that's otherwise impassible, and guarded by a tough Spearbone enemy that drops a Spirit.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Black Loong\n            - Section Title: Where to Find Black Loong\n\n            Context:\n            - Preceding Text: \"# Black Loong\n\nBlack Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Hidden beyond a waterfall of sand in the Fright Cliff, you won't be able to encounter this boss until you obtain a Key Item elswhere in this chapter, Black Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* **Rewards:** Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n\n## Where to Find Black Loong\n\nHead to the Fright Cliff on the opposite side of the Yellow Wind Ridge from the Valley of Despair, and travel through it to reach an area with the Rockrest Flat Shrine.\"\n            - Following Text: \"Directly to the right of this shrine, you can spot a stairway leading up to a large waterfall of sand that's otherwise impassible, and guarded by a tough Spearbone enemy that drops a Spirit.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Black Loong, a secret boss in *Black Myth Wukong*, located in Chapter 2. It explains that Black Loong is hidden behind a sand waterfall in the Fright Cliff area, accessible only after obtaining a specific key item. Defeating Black Loong rewards players with valuable crafting materials and items.\n\nImage Summary:\nThe image depicts a rugged, rocky environment with a prominent sand waterfall cascading down a cliff, surrounded by sparse vegetation and wooden structures. This visually represents the described location in the Fright Cliff area, where players can find the sand waterfall blocking access to Black Loong. The presence of game interface elements suggests this is an in-game screenshot, providing visual context for navigation and exploration.\n\nFollowing Text Summary:\nThe following text provides further instructions for locating the sand waterfall. It mentions that the waterfall is near the Rockrest Flat Shrine and highlights a stairway guarded by a tough Spearbone enemy. Players must defeat this enemy to proceed and obtain a Spirit."
}