{
    "chunk_id": 524176605307,
    "source_file": "Chapter_3_Secret_-_Mount_Mei_Walkthrough.md",
    "h1_title": "Chapter 3 Secret - Mount Mei Walkthrough",
    "h2_title": "Mei-Jian Peak",
    "h3_title": "The Four Heavenly Kings",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2b/Mount_Mei_Walkthrough_%2814%29.png",
    "alt_text": "Mount Mei Walkthrough \\(14\\).png",
    "position_desc": 12,
    "img_above_text": "# Chapter 3 Secret - Mount Mei Walkthrough\n\nMount Mei is the secret area in Chapter 3 - White Snow, Ice Cold of Black Myth: Wukong. However, you'll only be able to access it in Chapter 5 after completing all the secret areas in the game. We'd recommend waiting until you've finished Chapter 6 of the game and beat it before you visit Mount Mei, due to it being a vital place to see for the secret ending of the game.\n\n* **Jump to a Section:**\n* **How to Unlock Mount Mei**\n* **How to Enter Mount Mei from The Great Pagoda**\n* **Mount Mei**\n- Erlang, The Sacred Divinity\n- The Four Heavenly Kings\n- Erlang Shen\n\n\nThere are several steps you need to take to unlock Mount Mei. You can find a detailed breakdown on our dedicated page: How to Unlock the Secret Ending (True Ending). But here's a quick rundown of everything you'll need to do by Chapter 6 to reach it.\n\n1. Complete the Chapter 1 secret area of the Ancient Guanyin Temple\n2. Complete the Chapter 2 secret area of the Kingdom of Sahali\n3. Complete the Green-Capped Martialist/Treasure Hunter quest in Chapter 3\n4. Complete the Chapter 4 secret area of the Purple Cloud Mountain\n5. Complete the Chapter 5 secret area of Bishui Cave\n6. Return to **The Great Pagoda in Chapter 3**. You can find it on the Snow-Veiled Trail in the Pagoda Realm.\n\n\nWhen you’re in The Great Pagoda, you’ll see tapestries around the room. One tapestry, at the very top of the room, will be red. Head for this, and a cutscene will begin where the small Buddha from Chapter 3 will be waiting for you. He'll open the tapestry and let you into Mount Mei.\n\n\nWhen you're through the tapestry, head up the stairs and follow the path. About halfway up you'll need to shimmy across a ledge on the left to reach the other side, then you'll continue up to the Mei-Jian Peak Keeper's Shrine.\n\n## Mei-Jian Peak\n\nHere is where you'll need to get your gear together before you go up to the tip of the mountain, where you'll be entering a boss battle against a familiar face.\n\n\nAfter crash landing back on Mount Mei, two giants will emerge. This is the Destined One's Stone Monkey form and Erlang Shen. When Erlang is thrown off into the distance, you'll be thrown into a fight against the Four Heavenly Kings.\n\n### The Four Heavenly Kings\n\nThankfully after a huge battle against Erlang, The Sacred Divinity, the fight against the Four Heavenly Kings is much more straightforward. They share one health bar between them, and in your Stone Monkey transformation, you can use Primal Punch as your light attack, Earthshatter Slam as your heavy attack (this attack also heals), and Rock Solid to deflect their hits.\n\nUse Rock Solid when it's available and when one of the four giants will launch themselves at you. Other than that, you'll just want to keep using Primal Punch to build up Focus. When you've built your points, use Earthshatter Slam.",
    "img_below_text": "About halfway through the fight, you'll also be able to start using Ice Bath. When you use the Ice Bath Spell, the Stone Monkey's arms will be covered in frost, and when you punch, you'll inflict frost damage.\n\nWhen the Four Heavenly Kings have been taken down, there's just one more giant to deal with, which is Erlang Shen.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chapter 3 Secret - Mount Mei Walkthrough\n            - Section Title: Mei-Jian Peak\n            - Sub-Section Title: The Four Heavenly Kings\n\n            Context:\n            - Preceding Text: \"# Chapter 3 Secret - Mount Mei Walkthrough\n\nMount Mei is the secret area in Chapter 3 - White Snow, Ice Cold of Black Myth: Wukong. However, you'll only be able to access it in Chapter 5 after completing all the secret areas in the game. We'd recommend waiting until you've finished Chapter 6 of the game and beat it before you visit Mount Mei, due to it being a vital place to see for the secret ending of the game.\n\n* **Jump to a Section:**\n* **How to Unlock Mount Mei**\n* **How to Enter Mount Mei from The Great Pagoda**\n* **Mount Mei**\n- Erlang, The Sacred Divinity\n- The Four Heavenly Kings\n- Erlang Shen\n\n\nThere are several steps you need to take to unlock Mount Mei. You can find a detailed breakdown on our dedicated page: How to Unlock the Secret Ending (True Ending). But here's a quick rundown of everything you'll need to do by Chapter 6 to reach it.\n\n1. Complete the Chapter 1 secret area of the Ancient Guanyin Temple\n2. Complete the Chapter 2 secret area of the Kingdom of Sahali\n3. Complete the Green-Capped Martialist/Treasure Hunter quest in Chapter 3\n4. Complete the Chapter 4 secret area of the Purple Cloud Mountain\n5. Complete the Chapter 5 secret area of Bishui Cave\n6. Return to **The Great Pagoda in Chapter 3**. You can find it on the Snow-Veiled Trail in the Pagoda Realm.\n\n\nWhen you’re in The Great Pagoda, you’ll see tapestries around the room. One tapestry, at the very top of the room, will be red. Head for this, and a cutscene will begin where the small Buddha from Chapter 3 will be waiting for you. He'll open the tapestry and let you into Mount Mei.\n\n\nWhen you're through the tapestry, head up the stairs and follow the path. About halfway up you'll need to shimmy across a ledge on the left to reach the other side, then you'll continue up to the Mei-Jian Peak Keeper's Shrine.\n\n## Mei-Jian Peak\n\nHere is where you'll need to get your gear together before you go up to the tip of the mountain, where you'll be entering a boss battle against a familiar face.\n\n\nAfter crash landing back on Mount Mei, two giants will emerge. This is the Destined One's Stone Monkey form and Erlang Shen. When Erlang is thrown off into the distance, you'll be thrown into a fight against the Four Heavenly Kings.\n\n### The Four Heavenly Kings\n\nThankfully after a huge battle against Erlang, The Sacred Divinity, the fight against the Four Heavenly Kings is much more straightforward. They share one health bar between them, and in your Stone Monkey transformation, you can use Primal Punch as your light attack, Earthshatter Slam as your heavy attack (this attack also heals), and Rock Solid to deflect their hits.\n\nUse Rock Solid when it's available and when one of the four giants will launch themselves at you. Other than that, you'll just want to keep using Primal Punch to build up Focus. When you've built your points, use Earthshatter Slam.\"\n            - Following Text: \"About halfway through the fight, you'll also be able to start using Ice Bath. When you use the Ice Bath Spell, the Stone Monkey's arms will be covered in frost, and when you punch, you'll inflict frost damage.\n\nWhen the Four Heavenly Kings have been taken down, there's just one more giant to deal with, which is Erlang Shen.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text describes the progression of the game \"Black Myth: Wukong,\" focusing on the secret area of Mount Mei, accessible in Chapter 5 after completing all prior secret areas. Players are guided to the Mei-Jian Peak, where they prepare for a boss battle. The text introduces the Four Heavenly Kings, a group of enemies encountered after a fight with Erlang Shen, and provides strategies for defeating them using the protagonist's Stone Monkey transformation and specific abilities.\n\nImage Summary:  \nThe image depicts an intense battle scene from the fight against the Four Heavenly Kings at Mei-Jian Peak. It shows the Stone Monkey, the protagonist in their transformed state, engaged in combat with two of the Four Heavenly Kings. The environment is filled with dynamic effects, including frost and glowing particles, emphasizing the use of frost-based abilities and the high-energy nature of the encounter.\n\nFollowing Text Summary:  \nThe following text elaborates on the fight against the Four Heavenly Kings, introducing the Ice Bath ability, which enhances the Stone Monkey's attacks with frost damage. It explains that once the Four Heavenly Kings are defeated, the player will face a final challenge against Erlang Shen, marking the next stage of the battle."
}