{
    "chunk_id": 352578746821,
    "source_file": "Baw-Li-Guhh-Lang.md",
    "h1_title": "Baw-Li-Guhh-Lang",
    "h2_title": "Where to Find Baw-Li-Guhh-Lang",
    "h3_title": "Yaoguai Chief Mini-Boss Fight - Baw-Li-Guhh-Lang",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3b/Wukong_Bamboo_18.jpg",
    "alt_text": "Wukong Bamboo 18.jpg",
    "position_desc": 5,
    "img_above_text": "# Baw-Li-Guhh-Lang\n\nBaw-Li-Guhh-Lang is an optional Yaoguai Chief miniboss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located in an optional area of the Bamboo Grove, this Toad Guai will ambush you as you explore a marsh, and can use its long tongue as a formidable weapon.\n\n* **Rewards:** Baw-Li-Guhh-Lang Spirit, Stone Spirit x1, 482 Experience, 385 Will\n\n## Where to Find Baw-Li-Guhh-Lang\n\nFollow the stream upriver near the ramp and stick to the left to find a marshy area full of white reed flowers, and the boss will leap out of its lair to attack.\n\n### Yaoguai Chief Mini-Boss Fight - Baw-Li-Guhh-Lang\n\nBe wary when dodging around to his back, or when you see him reposition himself by hopping and turning his body. Instead of landing from the hop, he’ll spring out his legs with surprising reach to perform a frog leg kick with massive power, and can use it twice in a row!",
    "img_below_text": "Finally, he can unleash a tongue attack that sweeps back and forth with a large reach several times, and will require you to dodge back and forth out of its path — or use your Immobilize to stop him in the act. Using your Red Tide spell to transform can also help out during these attacks as he’ll be vulnerable to getting hit from the side.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Baw-Li-Guhh-Lang\n            - Section Title: Where to Find Baw-Li-Guhh-Lang\n            - Sub-Section Title: Yaoguai Chief Mini-Boss Fight - Baw-Li-Guhh-Lang\n\n            Context:\n            - Preceding Text: \"# Baw-Li-Guhh-Lang\n\nBaw-Li-Guhh-Lang is an optional Yaoguai Chief miniboss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located in an optional area of the Bamboo Grove, this Toad Guai will ambush you as you explore a marsh, and can use its long tongue as a formidable weapon.\n\n* **Rewards:** Baw-Li-Guhh-Lang Spirit, Stone Spirit x1, 482 Experience, 385 Will\n\n## Where to Find Baw-Li-Guhh-Lang\n\nFollow the stream upriver near the ramp and stick to the left to find a marshy area full of white reed flowers, and the boss will leap out of its lair to attack.\n\n### Yaoguai Chief Mini-Boss Fight - Baw-Li-Guhh-Lang\n\nBe wary when dodging around to his back, or when you see him reposition himself by hopping and turning his body. Instead of landing from the hop, he’ll spring out his legs with surprising reach to perform a frog leg kick with massive power, and can use it twice in a row!\"\n            - Following Text: \"Finally, he can unleash a tongue attack that sweeps back and forth with a large reach several times, and will require you to dodge back and forth out of its path — or use your Immobilize to stop him in the act. Using your Red Tide spell to transform can also help out during these attacks as he’ll be vulnerable to getting hit from the side.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Baw-Li-Guhh-Lang, an optional Yaoguai Chief miniboss encountered in Chapter 1 of *Black Myth: Wukong*. This boss resides in a marshy area of the Bamboo Grove and uses a long tongue as a weapon. Players are rewarded with items, experience, and Will upon defeating it. The text also provides directions to locate the boss and warns about its frog leg kick attack, which has significant reach and power.\n\nImage Summary:\nThe image depicts an in-game battle against Baw-Li-Guhh-Lang, showcasing its tongue attack in action. The environment features a marshy area with dense vegetation, consistent with the described Bamboo Grove setting. The on-screen prompts provide gameplay instructions for combat, including light and heavy attack options (\"Moon Dance\" and \"Moon Chase\") and a dodge-followed-by-heavy-attack move. The boss's health bar is visible, emphasizing its role as a challenging enemy.\n\nFollowing Text Summary:\nThe following text elaborates on Baw-Li-Guhh-Lang's tongue attack, which sweeps across a wide area multiple times, requiring precise dodging or the use of abilities like Immobilize to interrupt the attack. It also suggests using the Red Tide spell to transform and exploit the boss's vulnerability during these attacks, providing strategic tips for players to overcome the miniboss."
}