{
    "chunk_id": 953587888018,
    "source_file": "Fuban.md",
    "h1_title": "Fuban",
    "h2_title": "Where to Find Fuban",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/94/Wukong_Sandgate_71.jpg",
    "alt_text": "Wukong Sandgate 71.jpg",
    "position_desc": 8,
    "img_above_text": "# Fuban\n\nFuban is a secret optional Yaoguai King boss fight that you can encounter in Chapter 2's secret area in Black Myth Wukong. Located in the Kingdom of Sahali locked away in the past, you'll need to help fulfill a drunken Boar's quest to access this area.\n\n* **Rewards:** Wind Tamer, Sky-Piercing Horn\n\n## Where to Find Fuban\n\nWhen you give the Boar the Jade Lotus, he’ll relay some interesting information about a “Realm of Gold” that he’s seeking, and will leave the temple.",
    "img_below_text": "This “senior brother” is the First Prince of Flowing Sand — aka the giant rat Yaoguai Chief that you can fight in the Valley of Despair on the road from Sandgate Village to the Crouching Tiger Temple. If you didn’t kill the rat king, he’ll summon the prince to fight you. Otherwise, you can use the Pungent Flesh Chunk to summon and defeat him yourself. He’ll drop the Arhat Gold Piece when defeated, which is the gold the Boar needs.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fuban\n            - Section Title: Where to Find Fuban\n\n            Context:\n            - Preceding Text: \"# Fuban\n\nFuban is a secret optional Yaoguai King boss fight that you can encounter in Chapter 2's secret area in Black Myth Wukong. Located in the Kingdom of Sahali locked away in the past, you'll need to help fulfill a drunken Boar's quest to access this area.\n\n* **Rewards:** Wind Tamer, Sky-Piercing Horn\n\n## Where to Find Fuban\n\nWhen you give the Boar the Jade Lotus, he’ll relay some interesting information about a “Realm of Gold” that he’s seeking, and will leave the temple.\"\n            - Following Text: \"This “senior brother” is the First Prince of Flowing Sand — aka the giant rat Yaoguai Chief that you can fight in the Valley of Despair on the road from Sandgate Village to the Crouching Tiger Temple. If you didn’t kill the rat king, he’ll summon the prince to fight you. Otherwise, you can use the Pungent Flesh Chunk to summon and defeat him yourself. He’ll drop the Arhat Gold Piece when defeated, which is the gold the Boar needs.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Fuban, a secret optional boss in *Black Myth: Wukong*, encountered in Chapter 2 within a hidden area of the Kingdom of Sahali. Accessing this area requires completing a quest for a drunken Boar, who seeks a \"Realm of Gold.\" Rewards for defeating Fuban include the Wind Tamer and Sky-Piercing Horn.\n\nImage Summary:  \nThe image depicts a large, muscular creature resembling a Yaoguai (demonic beast) in a dimly lit environment, likely representing Fuban, the secret boss mentioned in the text. The creature’s imposing stance and detailed features suggest its role as a significant adversary in the game.\n\nFollowing Text Summary:  \nThe following text elaborates on the Boar’s quest, explaining that the player must defeat the First Prince of Flowing Sand, a giant rat Yaoguai Chief, to obtain the Arhat Gold Piece. This gold is crucial for fulfilling the Boar’s quest and accessing the secret area where Fuban resides."
}