{
    "chunk_id": 163687080864,
    "source_file": "Erlang,_The_Sacred_Divinity.md",
    "h1_title": "Erlang, The Sacred Divinity",
    "h2_title": "Erlang, The Sacred Divinity Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f6/Mount_Mei_Walkthrough_%287%29.png",
    "alt_text": "Mount Mei Walkthrough \\(7\\).png",
    "position_desc": 5,
    "img_above_text": "# Erlang, The Sacred Divinity\n\nErlang, The Sacred Divinity is an optional secret boss you can find by entering Chapter 3's Secret Area of Mount Mei in Black Myth: Wukong. You'll need to complete all chapters' secret areas and an elusive side quest before you can find this tough boss.\n\n\nThere are several steps you need to take to unlock Mount Mei. You can find a detailed breakdown on our dedicated page: How to Unlock the Secret Ending (True Ending). But here's a quick rundown of everything you'll need to do by Chapter 6 to reach it.\n\n1. Complete the Chapter 1 secret area of the Ancient Guanyin Temple\n2. Complete the Chapter 2 secret area of the Kingdom of Sahali\n3. Complete the Green-Capped Martialist/Treasure Hunter quest in Chapter 3\n4. Complete the Chapter 4 secret area of the Purple Cloud Mountain\n5. Complete the Chapter 5 secret area of Bishui Cave\n6. Return to **The Great Pagoda in Chapter 3**. You can find it on the Snow-Veiled Trail in the Pagoda Realm.\n\n\nWhen you’re in The Great Pagoda, you’ll see tapestries around the room. One tapestry, at the very top of the room, will be red. Head for this, and a cutscene will begin where the small Buddha from Chapter 3 will be waiting for you. He'll open the tapestry and let you into Mount Mei.\n\nWhen you're through the tapestry, head up the stairs and follow the path. About halfway up you'll need to shimmy across a ledge on the left to reach the other side, then you'll continue up to the Mei-Jian Peak Keeper's Shrine. At the top of the peak is where you'll find Erlang, The Sacred Divinity.\n\n## Erlang, The Sacred Divinity Boss Fight and Guide\n\nThere are four stages to this fight. You can knock his health down by 25% quickly, by using the Plantain Fan as soon as you enter the fight. Either use Immobilize immediately here if you're going for Spells or throw out Spellbinder.\n\nYou'll want to run about halfway across the field before you throw out the Plantain Fan, but if he goes to perform his attack, it's best to dodge this and then use the fan. Once you've knocked the first shield down, use Spellbinder and go in for the attack.",
    "img_below_text": "When the second stage begins, he'll fly up in the air and a giant axe will appear. This will swing and eventually crash down but can be dodged quite easily. The attack doesn't end here, however, as Erlang quickly follows up with his own attack to try and catch you off guard. This will send out a ripple that looks like ice, that you'll need to roll over or jump to avoid.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Erlang, The Sacred Divinity\n            - Section Title: Erlang, The Sacred Divinity Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Erlang, The Sacred Divinity\n\nErlang, The Sacred Divinity is an optional secret boss you can find by entering Chapter 3's Secret Area of Mount Mei in Black Myth: Wukong. You'll need to complete all chapters' secret areas and an elusive side quest before you can find this tough boss.\n\n\nThere are several steps you need to take to unlock Mount Mei. You can find a detailed breakdown on our dedicated page: How to Unlock the Secret Ending (True Ending). But here's a quick rundown of everything you'll need to do by Chapter 6 to reach it.\n\n1. Complete the Chapter 1 secret area of the Ancient Guanyin Temple\n2. Complete the Chapter 2 secret area of the Kingdom of Sahali\n3. Complete the Green-Capped Martialist/Treasure Hunter quest in Chapter 3\n4. Complete the Chapter 4 secret area of the Purple Cloud Mountain\n5. Complete the Chapter 5 secret area of Bishui Cave\n6. Return to **The Great Pagoda in Chapter 3**. You can find it on the Snow-Veiled Trail in the Pagoda Realm.\n\n\nWhen you’re in The Great Pagoda, you’ll see tapestries around the room. One tapestry, at the very top of the room, will be red. Head for this, and a cutscene will begin where the small Buddha from Chapter 3 will be waiting for you. He'll open the tapestry and let you into Mount Mei.\n\nWhen you're through the tapestry, head up the stairs and follow the path. About halfway up you'll need to shimmy across a ledge on the left to reach the other side, then you'll continue up to the Mei-Jian Peak Keeper's Shrine. At the top of the peak is where you'll find Erlang, The Sacred Divinity.\n\n## Erlang, The Sacred Divinity Boss Fight and Guide\n\nThere are four stages to this fight. You can knock his health down by 25% quickly, by using the Plantain Fan as soon as you enter the fight. Either use Immobilize immediately here if you're going for Spells or throw out Spellbinder.\n\nYou'll want to run about halfway across the field before you throw out the Plantain Fan, but if he goes to perform his attack, it's best to dodge this and then use the fan. Once you've knocked the first shield down, use Spellbinder and go in for the attack.\"\n            - Following Text: \"When the second stage begins, he'll fly up in the air and a giant axe will appear. This will swing and eventually crash down but can be dodged quite easily. The attack doesn't end here, however, as Erlang quickly follows up with his own attack to try and catch you off guard. This will send out a ripple that looks like ice, that you'll need to roll over or jump to avoid.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the setup for encountering Erlang, The Sacred Divinity, an optional secret boss in the game Black Myth: Wukong. To find this boss, players must complete several secret areas and a side quest across different chapters. The final steps involve entering The Great Pagoda and accessing Mount Mei, where the boss is located.\n\nImage Summary:\nThe image likely depicts a scene from the boss fight with Erlang, The Sacred Divinity. It shows a dramatic and snowy mountainous landscape, which aligns with the description of Mount Mei. The presence of a character in mid-air suggests an action sequence, possibly illustrating the dynamic nature of the boss fight.\n\nFollowing Text Summary:\nThe following text continues to describe the boss fight with Erlang, The Sacred Divinity, detailing the second stage of the battle. In this stage, Erlang flies into the air, and a giant axe appears, swinging and crashing down. Players must dodge this attack and subsequent ice-like ripples to avoid damage."
}