{
    "chunk_id": 984358451921,
    "source_file": "Centipede_Guai.md",
    "h1_title": "Centipede Guai",
    "h2_title": "Centipede Guai Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a9/Wukong_MiddleHollow_44.jpg",
    "alt_text": "Wukong MiddleHollow 44.jpg",
    "position_desc": 9,
    "img_above_text": "# Centipede Guai\n\nThe Centipede Guai is a required Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the middle section of The Webbed Hollow, this imposing insect guards the Bonevault leading down to the lower parts of the hollow.\n\n* Rewards: Centipede Guai Spirit, Gold Tree Core, Knot of Voidness, 2274 Experience, 1968 Will\n\n\nThe Centipede Guai is an main boss and non-missable encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down to the Vedure Bridge Shrine, you'll find two paths divering when you head right to find a group of buildings in the underground hollow.\n\nBoth will take you on a path to the Centipede Guai's lair, either by way of the Middle Hollow Shrine and dropping down a ledge guarded by Skeletal Snakes, or taking the other lower path to the Bonevault Shrine that leads to his domain.\n\n## Centipede Guai Boss Fight and Guide\n\nDozens of smaller centipedes will roll over the nearby ledge and into the arena to chase you on multiple fronts, and explode on impact.",
    "img_below_text": "The best thing you can do is let them chase you by sprinting in the opposite direction, and then swerve to the side to make them all collide with each other and explode. Just be sure not to take too long, or the Centipede Guai will soon join the fray and ram you at much faster speeds.\n\nAside from that, there's not too many other moves the Centipede Guai is capable of, so focus on dodging its backward slam, and saving your deflections for when it tries to roll into you, and you'll have no problem finding plenty of time to get your big hits in.\n\nWhen the Centipede Guai falls, you'll be able to gain its Centipede Guai Spirit along with a Knot of Voidness and Gold Tree Core.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Centipede Guai\n            - Section Title: Centipede Guai Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Centipede Guai\n\nThe Centipede Guai is a required Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the middle section of The Webbed Hollow, this imposing insect guards the Bonevault leading down to the lower parts of the hollow.\n\n* Rewards: Centipede Guai Spirit, Gold Tree Core, Knot of Voidness, 2274 Experience, 1968 Will\n\n\nThe Centipede Guai is an main boss and non-missable encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down to the Vedure Bridge Shrine, you'll find two paths divering when you head right to find a group of buildings in the underground hollow.\n\nBoth will take you on a path to the Centipede Guai's lair, either by way of the Middle Hollow Shrine and dropping down a ledge guarded by Skeletal Snakes, or taking the other lower path to the Bonevault Shrine that leads to his domain.\n\n## Centipede Guai Boss Fight and Guide\n\nDozens of smaller centipedes will roll over the nearby ledge and into the arena to chase you on multiple fronts, and explode on impact.\"\n            - Following Text: \"The best thing you can do is let them chase you by sprinting in the opposite direction, and then swerve to the side to make them all collide with each other and explode. Just be sure not to take too long, or the Centipede Guai will soon join the fray and ram you at much faster speeds.\n\nAside from that, there's not too many other moves the Centipede Guai is capable of, so focus on dodging its backward slam, and saving your deflections for when it tries to roll into you, and you'll have no problem finding plenty of time to get your big hits in.\n\nWhen the Centipede Guai falls, you'll be able to gain its Centipede Guai Spirit along with a Knot of Voidness and Gold Tree Core.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Centipede Guai, a mandatory boss fight in Chapter 4 of *Black Myth: Wukong*. Located in The Webbed Hollow, this Yaoguai Chief guards access to the Bonevault. Players can reach the boss through two paths and must prepare for a challenging encounter involving smaller centipedes and the main boss. Rewards for defeating the Centipede Guai include valuable items and experience points.\n\nImage Summary:  \nThe image depicts an in-game moment from the Centipede Guai boss fight in *Black Myth: Wukong*. The player character is shown in a dark, web-filled arena, dodging rolling, glowing centipede-like enemies. The HUD displays the boss's health bar labeled \"Centipede Guai,\" along with player abilities and health indicators. The scene emphasizes the chaotic and dangerous nature of the fight, with smaller centipedes swarming the arena.\n\nFollowing Text Summary:  \nThe following text provides strategies for the fight, advising players to sprint to lure the smaller centipedes into colliding and exploding. It highlights the importance of dodging the Centipede Guai's attacks, such as its backward slam and rolling charge, while finding opportunities to land significant hits. Successfully defeating the boss rewards players with valuable items, including the Centipede Guai Spirit."
}