{
    "chunk_id": 866215281029,
    "source_file": "Chapter_2_Secret_-_Kingdom_of_Sahali_Walkthrough.md",
    "h1_title": "Chapter 2 Secret - Kingdom of Sahali Walkthrough",
    "h2_title": "How to Access the Kingdom of Sahali",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7b/Wukong_Yellow_35.jpg",
    "alt_text": "Wukong Yellow 35.jpg",
    "position_desc": 7,
    "img_above_text": "# Chapter 2 Secret - Kingdom of Sahali Walkthrough\n\nThe Kingdom of Sahali is a Secret Area found in Chapter 2's Yellow Wind Ridge of Black Myth Wukong. Below you'll find a guide to accessing the kingdom of the past by undertaking the Drunk Boar's Questline to find a Sobering Stone, and how to defeat the Tiger Vanguard and secret Yaoguai King Boss, Fuban.\n\n* Jump to a Section:\n* **How to Access the Kingdom of Sahali**\n- Yaoguai Chief - \"Tiger Vanguard\"\n* **Sandgate Bound**\n- Yaoguai King - Fuban\n\nThis Chapter 2 Secret can only be accessed by meeting the Yellow-Robed Square in Fright Cliff (aka the Drunken Boar), and helping him in his search for the \"Realm of Gold\" which requires a few steps (and for you to best him in combat).\n\n## How to Access the Kingdom of Sahali\n\nAt the temple entrance, start to head up the stairs, and then turn right before the top — opposite where the Meditation Spot is. You’ll find the Boar resting against a far wall under one of the giant tiger sculptures.He’ll complain of the poor meat quality, and instead ask that you bring him a **Jade Lotus**. If you don’t already have plenty gathered, you’ll find Jade Lotus to harvest in most ponds and bodies of water, like the one right at the start of the chapter.",
    "img_below_text": "When you give the Boar the Jade Lotus, he’ll relay some interesting information about a “Realm of Gold” that he’s seeking. Apparently he spoke to one of the rats, who said “our senior brother gave me a piece of gold. I’ll need it here when the time’s right.” He’ll then proclaim that the time is right, and will leave the temple.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chapter 2 Secret - Kingdom of Sahali Walkthrough\n            - Section Title: How to Access the Kingdom of Sahali\n\n            Context:\n            - Preceding Text: \"# Chapter 2 Secret - Kingdom of Sahali Walkthrough\n\nThe Kingdom of Sahali is a Secret Area found in Chapter 2's Yellow Wind Ridge of Black Myth Wukong. Below you'll find a guide to accessing the kingdom of the past by undertaking the Drunk Boar's Questline to find a Sobering Stone, and how to defeat the Tiger Vanguard and secret Yaoguai King Boss, Fuban.\n\n* Jump to a Section:\n* **How to Access the Kingdom of Sahali**\n- Yaoguai Chief - \"Tiger Vanguard\"\n* **Sandgate Bound**\n- Yaoguai King - Fuban\n\nThis Chapter 2 Secret can only be accessed by meeting the Yellow-Robed Square in Fright Cliff (aka the Drunken Boar), and helping him in his search for the \"Realm of Gold\" which requires a few steps (and for you to best him in combat).\n\n## How to Access the Kingdom of Sahali\n\nAt the temple entrance, start to head up the stairs, and then turn right before the top — opposite where the Meditation Spot is. You’ll find the Boar resting against a far wall under one of the giant tiger sculptures.He’ll complain of the poor meat quality, and instead ask that you bring him a **Jade Lotus**. If you don’t already have plenty gathered, you’ll find Jade Lotus to harvest in most ponds and bodies of water, like the one right at the start of the chapter.\"\n            - Following Text: \"When you give the Boar the Jade Lotus, he’ll relay some interesting information about a “Realm of Gold” that he’s seeking. Apparently he spoke to one of the rats, who said “our senior brother gave me a piece of gold. I’ll need it here when the time’s right.” He’ll then proclaim that the time is right, and will leave the temple.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Kingdom of Sahali, a secret area in Chapter 2 of *Black Myth Wukong*. It explains that players must undertake the Drunk Boar's Questline to access this area, which involves finding a Sobering Stone and defeating key enemies. The quest begins by meeting the Yellow-Robed Square, also known as the Drunken Boar, at the temple entrance near a tiger sculpture, where he requests a Jade Lotus.\n\nImage Summary:  \nThe image shows the Drunken Boar character resting against a wall near a large tiger statue at the temple entrance. A player character, dressed in ornate armor and holding a staff, stands nearby, seemingly interacting with the Boar. The dialogue at the bottom of the image reads, \"It's the right time now. I'm taking it to the right place to give it a try,\" indicating progression in the questline.\n\nFollowing Text Summary:  \nThe following text describes the next step in the questline. After giving the Jade Lotus to the Drunken Boar, he shares information about a \"Realm of Gold\" and mentions a rat who received a piece of gold from their senior brother. The Boar declares that the time is right and leaves the temple, signaling the continuation of the quest."
}