{
    "chunk_id": 177943197312,
    "source_file": "Black_Wind_Cave_Walkthrough.md",
    "h1_title": "Black Wind Cave Walkthrough",
    "h2_title": "Outside the Cave",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/53/Wukong_BlackWind_29.jpg",
    "alt_text": "Wukong BlackWind 29.jpg",
    "position_desc": 26,
    "img_above_text": "# Black Wind Cave Walkthrough\n\nThe Black Wind Cave is the final region of Chapter 2's Black Wind Mountain in Black Myth: Wukong. Though it is a short area, it will prove to be a challenging one as you go up against the greedy King of the Mountain. Below you'll find a guide to the progressing through the cave to the mountaintop, as well as how to defeat the boss of this area in his two forms, the Black Wind King and the Black Bear Guai.\n\n* **Jump to A Section:**\n* **Cave Interior**\n- Black Wind King\n* **Outside the Cave**\n* **Bodhi Peak**\n- Black Bear Guai\n\n\nReturn to the path and take the stairs up to fight against another Wolf Assassin as the cave grows dark, and draw them into the light if needed.\n\nAs you reach an open part of the cave, you’ll have to face one more assassin along the darkened path, and you may notice they’ll go out of their way to destroy the torches along the path to further envelop them in darkness. If you have trouble facing them, always try to bring them to a brighter spot.\n\nNote that if you went ahead and defeated the Secret Boss by ringing the three bells, you should also have access to craft an additional Bronze Set that improves your abilities using the Immobilize Spell!\n\nCraft and upgrade whatever you can afford at the moment, because a boss is waiting inside the temple to test your might, and he’s no pushover.\n\n\nCheck the sides of the cave to find some Jade Lotus and Aged Ginseng, then head to the far end to sidle through an exit. This disguised loading screen will turn the day into dusk as you find yourself closer to the top of the mountain.\n\n## Outside the Cave\n\nWith the ranged support out of the way, you can safely engage the Bullguard. Since this one isn’t a mini-boss, he’ll go down a lot faster when you Immobilize and punish him during his lengthy swing attacks.\n\nHead along the far wooden platforms past where the Bullguard was stationed to find one last Wolf Sentinel and Archer, and Cloud Step past the melee attacker to slam into the archer first before finishing off his friend.",
    "img_below_text": "Before engaging with more Wolf Guai, pause at a small altar along the cliffs. Here you’ll find one last golden pot to open, containing a **Celestial Nonary Pill** , which will greatly increase your maximum stamina — the third and final pill to find in Chapter 1!",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Black Wind Cave Walkthrough\n            - Section Title: Outside the Cave\n\n            Context:\n            - Preceding Text: \"# Black Wind Cave Walkthrough\n\nThe Black Wind Cave is the final region of Chapter 2's Black Wind Mountain in Black Myth: Wukong. Though it is a short area, it will prove to be a challenging one as you go up against the greedy King of the Mountain. Below you'll find a guide to the progressing through the cave to the mountaintop, as well as how to defeat the boss of this area in his two forms, the Black Wind King and the Black Bear Guai.\n\n* **Jump to A Section:**\n* **Cave Interior**\n- Black Wind King\n* **Outside the Cave**\n* **Bodhi Peak**\n- Black Bear Guai\n\n\nReturn to the path and take the stairs up to fight against another Wolf Assassin as the cave grows dark, and draw them into the light if needed.\n\nAs you reach an open part of the cave, you’ll have to face one more assassin along the darkened path, and you may notice they’ll go out of their way to destroy the torches along the path to further envelop them in darkness. If you have trouble facing them, always try to bring them to a brighter spot.\n\nNote that if you went ahead and defeated the Secret Boss by ringing the three bells, you should also have access to craft an additional Bronze Set that improves your abilities using the Immobilize Spell!\n\nCraft and upgrade whatever you can afford at the moment, because a boss is waiting inside the temple to test your might, and he’s no pushover.\n\n\nCheck the sides of the cave to find some Jade Lotus and Aged Ginseng, then head to the far end to sidle through an exit. This disguised loading screen will turn the day into dusk as you find yourself closer to the top of the mountain.\n\n## Outside the Cave\n\nWith the ranged support out of the way, you can safely engage the Bullguard. Since this one isn’t a mini-boss, he’ll go down a lot faster when you Immobilize and punish him during his lengthy swing attacks.\n\nHead along the far wooden platforms past where the Bullguard was stationed to find one last Wolf Sentinel and Archer, and Cloud Step past the melee attacker to slam into the archer first before finishing off his friend.\"\n            - Following Text: \"Before engaging with more Wolf Guai, pause at a small altar along the cliffs. Here you’ll find one last golden pot to open, containing a **Celestial Nonary Pill** , which will greatly increase your maximum stamina — the third and final pill to find in Chapter 1!\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text provides a walkthrough for the \"Black Wind Cave\" section of *Black Myth: Wukong*. It describes the challenges faced inside the cave, including battles with Wolf Assassins and strategies to counter their attacks in dark areas. Players are advised to collect items like Jade Lotus and Aged Ginseng before exiting the cave, which transitions to an outdoor area near the mountaintop.\n\nImage Summary:  \nThe image depicts the \"Outside the Cave\" section of the walkthrough, showing the player character navigating a wooden platform at dusk. The player is approaching a highlighted golden pot near a small altar, which is likely an interactive object containing a valuable item. The serene outdoor environment contrasts with the earlier dark cave, and the interface displays the player's stats and abilities.\n\nFollowing Text Summary:  \nThe following text advises players to pause at the small altar shown in the image to open the golden pot, which contains a **Celestial Nonary Pill**. This item significantly increases maximum stamina and is the final stamina-boosting pill available in Chapter 1."
}