{
    "chunk_id": 538073528767,
    "source_file": "Captain_Wise-Voice.md",
    "h1_title": "Captain Wise-Voice",
    "h2_title": "Where to Find Captain Wise-Voice",
    "h3_title": "Captain Wise-Voice Boss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/ba/Wukong_Pagoda_78.jpg",
    "alt_text": "Wukong Pagoda 78.jpg",
    "position_desc": 1,
    "img_above_text": "# Captain Wise-Voice\n\nCaptain Wise-Voice is a required Yaoguai King boss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Responsible for the \"beguiling chant\" that curses you in the Pagoda Realm, you can find this boss inside the Mani Wheel at the top of the prison.\n\n* **Rewards:** Spirit of Captain Wise-Voice, Mind Core\n\n## Where to Find Captain Wise-Voice\n\nCaptain Wise-Voice is one of the four captains you can find in Chapter 3, and is a required boss to escape the prison of the Pagoda Realm. You can reach him by escaping up through the four levels of the Pagoda Prison and past the Outside the Wheel Shrine.\n\n### Captain Wise-Voice Boss Fight and Guide",
    "img_below_text": "Much like Captain Lotus-Vision, the second Captain of the Pagoda Realm is a creepy one, with a strange construct-like shape with four legs, housing an golden sphere adorned with dragons that serves as its central core. The rest of the construct is highly resistant to damage, meaning you'll need to stun it so that you can take a shot at its most vulnerable part.\n\nOnly one of its legs is susceptible to attack, where you can see an orange glow emanating from its front right leg, so try to focus your attacks there whenever possible to try and stagger it.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Captain Wise-Voice\n            - Section Title: Where to Find Captain Wise-Voice\n            - Sub-Section Title: Captain Wise-Voice Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Captain Wise-Voice\n\nCaptain Wise-Voice is a required Yaoguai King boss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Responsible for the \"beguiling chant\" that curses you in the Pagoda Realm, you can find this boss inside the Mani Wheel at the top of the prison.\n\n* **Rewards:** Spirit of Captain Wise-Voice, Mind Core\n\n## Where to Find Captain Wise-Voice\n\nCaptain Wise-Voice is one of the four captains you can find in Chapter 3, and is a required boss to escape the prison of the Pagoda Realm. You can reach him by escaping up through the four levels of the Pagoda Prison and past the Outside the Wheel Shrine.\n\n### Captain Wise-Voice Boss Fight and Guide\"\n            - Following Text: \"Much like Captain Lotus-Vision, the second Captain of the Pagoda Realm is a creepy one, with a strange construct-like shape with four legs, housing an golden sphere adorned with dragons that serves as its central core. The rest of the construct is highly resistant to damage, meaning you'll need to stun it so that you can take a shot at its most vulnerable part.\n\nOnly one of its legs is susceptible to attack, where you can see an orange glow emanating from its front right leg, so try to focus your attacks there whenever possible to try and stagger it.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Captain Wise-Voice as a required boss fight in Chapter 3 of *Black Myth Wukong*. This Yaoguai King is responsible for a \"beguiling chant\" curse in the Pagoda Realm and is located inside the Mani Wheel at the top of the prison. Defeating this boss rewards players with the Spirit of Captain Wise-Voice and the Mind Core.\n\nImage Summary:\nThe image depicts Captain Wise-Voice, a dark, ominous construct-like entity with four legs and a golden sphere adorned with dragon motifs at its core. The environment is dimly lit, with intricate designs on the walls and a glowing orange light visible on one of the legs, hinting at its vulnerability. The image visually represents the boss fight, emphasizing its eerie and imposing design.\n\nFollowing Text Summary:\nThe following text provides a guide to fighting Captain Wise-Voice, explaining that the construct is highly resistant to damage except for its front right leg, which glows orange. Players are advised to focus their attacks on this vulnerable spot to stagger the boss and expose its central core for further damage."
}