{
    "chunk_id": 808630219368,
    "source_file": "Captain_Wise-Voice.md",
    "h1_title": "Captain Wise-Voice",
    "h2_title": "Where to Find Captain Wise-Voice",
    "h3_title": "Captain Wise-Voice Boss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/67/Wukong_Pagoda_86.jpg",
    "alt_text": "Wukong Pagoda 86.jpg",
    "position_desc": 9,
    "img_above_text": "# Captain Wise-Voice\n\nCaptain Wise-Voice is a required Yaoguai King boss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Responsible for the \"beguiling chant\" that curses you in the Pagoda Realm, you can find this boss inside the Mani Wheel at the top of the prison.\n\n* **Rewards:** Spirit of Captain Wise-Voice, Mind Core\n\n## Where to Find Captain Wise-Voice\n\nCaptain Wise-Voice is one of the four captains you can find in Chapter 3, and is a required boss to escape the prison of the Pagoda Realm. You can reach him by escaping up through the four levels of the Pagoda Prison and past the Outside the Wheel Shrine.\n\n### Captain Wise-Voice Boss Fight and Guide\n\nAfter taking a bit of damage, the boss will charge up to emit its \"beguiling chant\", blurring your vision somewhat, and performing an effect similar to when you were ascending the prison. Thankfully this will only lower your maximum health by around a fourth, and still give you a damage boost in return. The effect doesn't last forever -- only for around a full minute -- so make the most of it!",
    "img_below_text": "Once enough damage has been sustained to its leg, you'll see its leg start to explode with light, meaning your attacks have successfully staggered the boss. He'll fall to the ground in a heap, with its sphere-like core right in front of you.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Captain Wise-Voice\n            - Section Title: Where to Find Captain Wise-Voice\n            - Sub-Section Title: Captain Wise-Voice Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Captain Wise-Voice\n\nCaptain Wise-Voice is a required Yaoguai King boss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Responsible for the \"beguiling chant\" that curses you in the Pagoda Realm, you can find this boss inside the Mani Wheel at the top of the prison.\n\n* **Rewards:** Spirit of Captain Wise-Voice, Mind Core\n\n## Where to Find Captain Wise-Voice\n\nCaptain Wise-Voice is one of the four captains you can find in Chapter 3, and is a required boss to escape the prison of the Pagoda Realm. You can reach him by escaping up through the four levels of the Pagoda Prison and past the Outside the Wheel Shrine.\n\n### Captain Wise-Voice Boss Fight and Guide\n\nAfter taking a bit of damage, the boss will charge up to emit its \"beguiling chant\", blurring your vision somewhat, and performing an effect similar to when you were ascending the prison. Thankfully this will only lower your maximum health by around a fourth, and still give you a damage boost in return. The effect doesn't last forever -- only for around a full minute -- so make the most of it!\"\n            - Following Text: \"Once enough damage has been sustained to its leg, you'll see its leg start to explode with light, meaning your attacks have successfully staggered the boss. He'll fall to the ground in a heap, with its sphere-like core right in front of you.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Captain Wise-Voice, a required boss fight in Chapter 3 of *Black Myth Wukong*. This boss is responsible for a \"beguiling chant\" that curses players in the Pagoda Realm and can be found inside the Mani Wheel at the top of the prison. The fight involves unique mechanics, such as a chant that temporarily lowers maximum health while granting a damage boost.\n\nImage Summary:  \nThe image depicts the boss fight against Captain Wise-Voice in *Black Myth Wukong*. The glowing sphere-like core of the boss is shown prominently, surrounded by twisted, root-like structures. The player's character is positioned near the core, preparing to attack. The health bar labeled \"Captain Wise-Voice\" is visible at the bottom, indicating the ongoing battle. The visual elements suggest a climactic moment in the fight, likely after the boss has been staggered.\n\nFollowing Text Summary:  \nThe following text explains that after sustaining enough damage, Captain Wise-Voice's leg will emit light, signaling that the boss has been staggered. This causes the boss to collapse, exposing its sphere-like core for further attacks. This marks a critical phase in the fight, allowing players to deal significant damage."
}