{
    "chunk_id": 313120747324,
    "source_file": "Guangmou.md",
    "h1_title": "Guangmou",
    "h2_title": "Where to Find Guangmou",
    "h3_title": "Guangmou Mini-Boss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d3/Wukong_Bamboo_24.jpg",
    "alt_text": "Wukong Bamboo 24.jpg",
    "position_desc": 4,
    "img_above_text": "# Guangmou\n\nGuangmou is a required Yaoguai Chief miniboss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located along the main path through the Bamboo Grove, this boss is a ranged fighter who moves quickly to evade you while filling you with poison strikes.\n\n* **Rewards:** Guangmou Spirit, Materials, 700 Experience, 520 Will\n\n## Where to Find Guangmou\n\nFollow the main path across the bridge from the Shrine and down to a stream, and follow it into a large bamboo forest patrolled by snakes. On the opposite side of the circular forest, you can spot two small statues forming an entrance into the grove where Guagnmou lurks.\n\n### Guangmou Mini-Boss Fight and Guide\n\nHowever, Guangmou will usually create these as a distraction, and teleport up close to you while you’re busy trying to dodge his projectiles. Once he’s up close, beware of his poison spitting attack where he sprays in a large area in front of him.",
    "img_below_text": "His other main projectile attack comes out much faster, as he levitates off the ground for a moment before shooting out a line of the spells in front of him. They don’t track you like the others, but they will shoot rapidly downward and into the ground in front of him.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Guangmou\n            - Section Title: Where to Find Guangmou\n            - Sub-Section Title: Guangmou Mini-Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Guangmou\n\nGuangmou is a required Yaoguai Chief miniboss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located along the main path through the Bamboo Grove, this boss is a ranged fighter who moves quickly to evade you while filling you with poison strikes.\n\n* **Rewards:** Guangmou Spirit, Materials, 700 Experience, 520 Will\n\n## Where to Find Guangmou\n\nFollow the main path across the bridge from the Shrine and down to a stream, and follow it into a large bamboo forest patrolled by snakes. On the opposite side of the circular forest, you can spot two small statues forming an entrance into the grove where Guagnmou lurks.\n\n### Guangmou Mini-Boss Fight and Guide\n\nHowever, Guangmou will usually create these as a distraction, and teleport up close to you while you’re busy trying to dodge his projectiles. Once he’s up close, beware of his poison spitting attack where he sprays in a large area in front of him.\"\n            - Following Text: \"His other main projectile attack comes out much faster, as he levitates off the ground for a moment before shooting out a line of the spells in front of him. They don’t track you like the others, but they will shoot rapidly downward and into the ground in front of him.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Guangmou, a required miniboss fight in Chapter 1 of *Black Myth: Wukong*. Guangmou is a fast-moving ranged fighter who uses poison-based attacks and evasion tactics. Players can find him in the Bamboo Grove after crossing a bridge and navigating through a snake-patrolled forest. The fight rewards include Guangmou Spirit, materials, experience points, and Will.\n\nImage Summary:\nThe image depicts an active combat scene from *Black Myth: Wukong*, showing the player character engaged in the miniboss fight against Guangmou. Guangmou is unleashing a projectile attack, with glowing energy streaks visible in the foreground. The environment features dense bamboo forest and rocky terrain, consistent with the described Bamboo Grove. The health bar labeled \"Guangmou\" and UI elements indicate an ongoing boss battle.\n\nFollowing Text Summary:\nThe following text elaborates on Guangmou's projectile attacks, describing one where he levitates briefly before firing a rapid line of spells downward. These projectiles do not track the player but are fast and targeted at the ground in front of Guangmou, adding to the challenge of the fight."
}