{
    "chunk_id": 653854488218,
    "source_file": "Chapter_5_Secret_-_Bishui_Cave_Walkthrough.md",
    "h1_title": "Chapter 5 Secret - Bishui Cave Walkthrough",
    "h2_title": "Cave Depths",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fd/Bishui_Cave_Walkthrough_%2826%29.png",
    "alt_text": "Bishui Cave Walkthrough \\(26\\).png",
    "position_desc": 13,
    "img_above_text": "# Chapter 5 Secret - Bishui Cave Walkthrough\n\nTo your left, immediately as you enter the room, you'll find the Purge Pit Keeper's Shrine.\n\n\nAfter activating the first of the Keeper's Shrines, face away from it and head to the right. Go down the stairs and to the end of the path to find a Meditation Spot.\n\nReturn to the Keeper's Shrine and continue past it, following the path to the right. Head down to the slope, collecting the green Wisp on the left and into the center of the room. As you reach the middle, you'll be met by the first of the bosses in this secret area.\n\n\nGet back to the path and go past the next two bull guards to find the Cave Depths Keeper's Shrine.\n\n## Cave Depths\n\nGo left from the Keeper's Shrine and down into the corridor where you'll find several bull guards and a Bull Governor guarding the door.",
    "img_below_text": "As soon as you get to the bottom of the stairs, look to the right to find a green Wisp to collect. Carry on down the corridor, then look to the left to find a treasure chest.\n\nIt's best to clear the room out first and return to this chest to collect The Bull King's Iron Horn, Celestial Ribbon, and Knot of Voidness from it.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chapter 5 Secret - Bishui Cave Walkthrough\n            - Section Title: Cave Depths\n\n            Context:\n            - Preceding Text: \"# Chapter 5 Secret - Bishui Cave Walkthrough\n\nTo your left, immediately as you enter the room, you'll find the Purge Pit Keeper's Shrine.\n\n\nAfter activating the first of the Keeper's Shrines, face away from it and head to the right. Go down the stairs and to the end of the path to find a Meditation Spot.\n\nReturn to the Keeper's Shrine and continue past it, following the path to the right. Head down to the slope, collecting the green Wisp on the left and into the center of the room. As you reach the middle, you'll be met by the first of the bosses in this secret area.\n\n\nGet back to the path and go past the next two bull guards to find the Cave Depths Keeper's Shrine.\n\n## Cave Depths\n\nGo left from the Keeper's Shrine and down into the corridor where you'll find several bull guards and a Bull Governor guarding the door.\"\n            - Following Text: \"As soon as you get to the bottom of the stairs, look to the right to find a green Wisp to collect. Carry on down the corridor, then look to the left to find a treasure chest.\n\nIt's best to clear the room out first and return to this chest to collect The Bull King's Iron Horn, Celestial Ribbon, and Knot of Voidness from it.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes a walkthrough for Chapter 5 Secret - Bishui Cave, specifically focusing on navigating through the cave. It mentions finding and activating the Keeper's Shrines, encountering bosses, and dealing with bull guards as part of the journey through the cave depths.\n\nImage Summary:\nThe image depicts a dark, cavernous corridor within the Bishui Cave, consistent with the Cave Depths section of the walkthrough. It shows a group of bull guards patrolling the area, with a highlighted treasure chest on the left side, suggesting a point of interest or objective for players to interact with as part of the walkthrough.\n\nFollowing Text Summary:\nThe following text advises players to collect a green Wisp upon reaching the bottom of the stairs and to clear the room of enemies before returning to the highlighted treasure chest. The chest contains valuable items such as The Bull King's Iron Horn, Celestial Ribbon, and Knot of Voidness, which are rewards for progressing through this section of the cave."
}