{
    "chunk_id": 358124009267,
    "source_file": "Daoist_Mi.md",
    "h1_title": "Daoist Mi",
    "h2_title": "Daoist Mi Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a1/Wukong_PurpleCloud_49.jpg",
    "alt_text": "Wukong PurpleCloud 49.jpg",
    "position_desc": 7,
    "img_above_text": "# Daoist Mi\n\nThe Daoist Mi is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the secret area of the Purple Cloud Mountain, the Daoist Mi will have a quest for you before you can face him in battle.\n\n* Rewards: Violet Hail Transformation Spell, Refined Iron Sand, 1562 Experience, 1451 Will\n\n\nHowever, once you return it to him, he'll reveal that he want the egg's power all to himself, and is willing to kill for it.\n\n## Daoist Mi Boss Fight and Guide\n\nWhile most of their basic attacks are simple two-hit strikes, they can also start a combo with an upward slice creating a projectile wave, dash forward into a lunging strike, before spinning to perform a horizontal sweep with one last projectile wave.\n\nThe good news all of their attacks can be deflected with Rock Solid, and pretty much any spell you have will be effective or stagger them greatly. Just treat them as you would any other Sword Daoist, keeping in mind that their greatly expanded health pool should dissuade you from pressing your attack too long so that you can back off to evade their next moves and regain your stamina.",
    "img_below_text": "Somewhat surprisingly, Daoist Mi can also employ the move used by the Red-Haired Yaksha of Chapter 3, performing two quick fist strikes, and then turning around to perform a reverse bicycle kick that can hit especially hard -- but its still nothing as dangerous as the Scorpionlord.\n\nOnce you deplete their health bar, the Daoist Mi will invoke the power of the worm's egg, transforming into a Worm Practitioner for the second phase of this fight. Like before, much of their attack patterns will follow the basic enemy, so there won't be too much of a surprise in store.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Daoist Mi\n            - Section Title: Daoist Mi Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Daoist Mi\n\nThe Daoist Mi is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the secret area of the Purple Cloud Mountain, the Daoist Mi will have a quest for you before you can face him in battle.\n\n* Rewards: Violet Hail Transformation Spell, Refined Iron Sand, 1562 Experience, 1451 Will\n\n\nHowever, once you return it to him, he'll reveal that he want the egg's power all to himself, and is willing to kill for it.\n\n## Daoist Mi Boss Fight and Guide\n\nWhile most of their basic attacks are simple two-hit strikes, they can also start a combo with an upward slice creating a projectile wave, dash forward into a lunging strike, before spinning to perform a horizontal sweep with one last projectile wave.\n\nThe good news all of their attacks can be deflected with Rock Solid, and pretty much any spell you have will be effective or stagger them greatly. Just treat them as you would any other Sword Daoist, keeping in mind that their greatly expanded health pool should dissuade you from pressing your attack too long so that you can back off to evade their next moves and regain your stamina.\"\n            - Following Text: \"Somewhat surprisingly, Daoist Mi can also employ the move used by the Red-Haired Yaksha of Chapter 3, performing two quick fist strikes, and then turning around to perform a reverse bicycle kick that can hit especially hard -- but its still nothing as dangerous as the Scorpionlord.\n\nOnce you deplete their health bar, the Daoist Mi will invoke the power of the worm's egg, transforming into a Worm Practitioner for the second phase of this fight. Like before, much of their attack patterns will follow the basic enemy, so there won't be too much of a surprise in store.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Daoist Mi as an optional boss in *Black Myth: Wukong*, encountered in Chapter 4 at Purple Cloud Mountain. Before the fight, Daoist Mi assigns a quest involving a worm's egg but later reveals his intent to claim its power, leading to a confrontation. The text outlines his attack patterns, emphasizing their deflectability and the importance of stamina management during the fight.\n\nImage Summary:\nThe image depicts an active combat scene from the Daoist Mi boss fight in *Black Myth: Wukong*. Daoist Mi is mid-air, performing a reverse bicycle kick, a move described in the following text. The player character is shown on the ground, seemingly evading or recovering from the attack. The environment features a rocky, autumnal setting with traditional architecture in the background, reinforcing the game's thematic elements. The UI displays health, stamina, and abilities, while Daoist Mi's health bar is partially depleted.\n\nFollowing Text Summary:\nThe following text elaborates on Daoist Mi's combat abilities, noting his use of moves borrowed from the Red-Haired Yaksha, including a reverse bicycle kick. After his health is depleted, he transforms into a Worm Practitioner for the second phase of the fight, with attack patterns resembling basic enemies, offering fewer surprises."
}