{
    "chunk_id": 105959703154,
    "source_file": "Baw-Li-Guhh-Lang.md",
    "h1_title": "Baw-Li-Guhh-Lang",
    "h2_title": "Where to Find Baw-Li-Guhh-Lang",
    "h3_title": "Yaoguai Chief Mini-Boss Fight - Baw-Li-Guhh-Lang",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a3/Wukong_Bamboo_17.jpg",
    "alt_text": "Wukong Bamboo 17.jpg",
    "position_desc": 4,
    "img_above_text": "# Baw-Li-Guhh-Lang\n\nBaw-Li-Guhh-Lang is an optional Yaoguai Chief miniboss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located in an optional area of the Bamboo Grove, this Toad Guai will ambush you as you explore a marsh, and can use its long tongue as a formidable weapon.\n\n* **Rewards:** Baw-Li-Guhh-Lang Spirit, Stone Spirit x1, 482 Experience, 385 Will\n\n## Where to Find Baw-Li-Guhh-Lang\n\nFollow the stream upriver near the ramp and stick to the left to find a marshy area full of white reed flowers, and the boss will leap out of its lair to attack.\n\n### Yaoguai Chief Mini-Boss Fight - Baw-Li-Guhh-Lang\n\nThere are two extremely fast and damaging attacks you’ll need to beware of. The first comes when he’s directly facing you, and the toad will pause momentarily lowering his arms across his chest. He’ll then lunge at you belly first in an extremely quick dash, and you’ll have to dodge the body slam quickly to the side before striking back.",
    "img_below_text": "Be wary when dodging around to his back, or when you see him reposition himself by hopping and turning his body. Instead of landing from the hop, he’ll spring out his legs with surprising reach to perform a frog leg kick with massive power, and can use it twice in a row!",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Baw-Li-Guhh-Lang\n            - Section Title: Where to Find Baw-Li-Guhh-Lang\n            - Sub-Section Title: Yaoguai Chief Mini-Boss Fight - Baw-Li-Guhh-Lang\n\n            Context:\n            - Preceding Text: \"# Baw-Li-Guhh-Lang\n\nBaw-Li-Guhh-Lang is an optional Yaoguai Chief miniboss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located in an optional area of the Bamboo Grove, this Toad Guai will ambush you as you explore a marsh, and can use its long tongue as a formidable weapon.\n\n* **Rewards:** Baw-Li-Guhh-Lang Spirit, Stone Spirit x1, 482 Experience, 385 Will\n\n## Where to Find Baw-Li-Guhh-Lang\n\nFollow the stream upriver near the ramp and stick to the left to find a marshy area full of white reed flowers, and the boss will leap out of its lair to attack.\n\n### Yaoguai Chief Mini-Boss Fight - Baw-Li-Guhh-Lang\n\nThere are two extremely fast and damaging attacks you’ll need to beware of. The first comes when he’s directly facing you, and the toad will pause momentarily lowering his arms across his chest. He’ll then lunge at you belly first in an extremely quick dash, and you’ll have to dodge the body slam quickly to the side before striking back.\"\n            - Following Text: \"Be wary when dodging around to his back, or when you see him reposition himself by hopping and turning his body. Instead of landing from the hop, he’ll spring out his legs with surprising reach to perform a frog leg kick with massive power, and can use it twice in a row!\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Baw-Li-Guhh-Lang as an optional miniboss fight in Chapter 1 of Black Myth Wukong. This Yaoguai Chief, resembling a toad, ambushes players in a marsh located in the Bamboo Grove. It uses its long tongue as a weapon and rewards players with various items and experience points upon defeat.\n\nImage Summary:\nThe image depicts a scene from the game Black Myth Wukong, showing the player character engaged in combat with Baw-Li-Guhh-Lang, the Yaoguai Chief miniboss. The setting is a marshy area with white reed flowers, consistent with the described location. The boss is seen in mid-action, likely performing one of its fast and damaging attacks, emphasizing the dynamic and challenging nature of the encounter.\n\nFollowing Text Summary:\nThe following text provides additional details on the miniboss's attack patterns. It warns players to be cautious when dodging around Baw-Li-Guhh-Lang's back, as it can perform a powerful frog leg kick with significant reach. This attack can occur twice in succession, requiring players to remain vigilant and strategic in their movements."
}