{
    "chunk_id": 538762092574,
    "source_file": "Boshan_Censer.md",
    "h1_title": "Boshan Censer",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5a/Boshan_Censer_2.jpg",
    "alt_text": "Boshan Censer 2.jpg",
    "position_desc": 1,
    "img_above_text": "# Boshan Censer\n\nThe Boshan Censer is a rare Curios item you can find in Black Myth: Wukong. While it has a specific use, the Boshan Censer's buff is rather strong, making it quite useful for those who like to play aggressive when they are out of healing.\n\nWith the Boshan Censer equipped, it grants considerable damage reduction when Gourd use is depleted. So, if you are someone who hasn't upgraded their Gourd or is running a Gourd with a low amount of uses, this can be incredibly powerful, granting you enhanced survivability for an extended period. Dodge masters and those using Cloud Step and Rock Solid can really benefit from this Curios item.",
    "img_below_text": "Curios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or boost the effect of them. Therefore, you will want to switch to other Curios items to better fit your build as you play if needed. This can be done easily from the game's Equipment menu.\n\n## Black Myth: Wukong Boshan Censer Location\n\nThe Boshan Censer can be found upon defeating Red Loong in the Forest of Wolves \\- Outside the Forest area in Black Wind Mountain. Red Loong is located behind the waterfall in Black Wind Mountain, and you will need to obtain the Loong Scales in Yellow Wind Ridge first to enter this secret area.\n\nThe Loong Scales are a rather well hidden item in Yellow Wind Ridge, requiring you to have the First Prince of Flowing Sands boss destroy a wall with its attack. You can also destroy it with the powerful Transformation Spells. Our guide below on how to get behind the waterfall will take you through the steps, alongside the links above to the individual places.\n\nOnce you have defeated Red Loong, you can open the chest to finish everything in the area, obtaining the Boshan Censer in the process.\n\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Boshan Censer\n\n            Context:\n            - Preceding Text: \"# Boshan Censer\n\nThe Boshan Censer is a rare Curios item you can find in Black Myth: Wukong. While it has a specific use, the Boshan Censer's buff is rather strong, making it quite useful for those who like to play aggressive when they are out of healing.\n\nWith the Boshan Censer equipped, it grants considerable damage reduction when Gourd use is depleted. So, if you are someone who hasn't upgraded their Gourd or is running a Gourd with a low amount of uses, this can be incredibly powerful, granting you enhanced survivability for an extended period. Dodge masters and those using Cloud Step and Rock Solid can really benefit from this Curios item.\"\n            - Following Text: \"Curios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or boost the effect of them. Therefore, you will want to switch to other Curios items to better fit your build as you play if needed. This can be done easily from the game's Equipment menu.\n\n## Black Myth: Wukong Boshan Censer Location\n\nThe Boshan Censer can be found upon defeating Red Loong in the Forest of Wolves \\- Outside the Forest area in Black Wind Mountain. Red Loong is located behind the waterfall in Black Wind Mountain, and you will need to obtain the Loong Scales in Yellow Wind Ridge first to enter this secret area.\n\nThe Loong Scales are a rather well hidden item in Yellow Wind Ridge, requiring you to have the First Prince of Flowing Sands boss destroy a wall with its attack. You can also destroy it with the powerful Transformation Spells. Our guide below on how to get behind the waterfall will take you through the steps, alongside the links above to the individual places.\n\nOnce you have defeated Red Loong, you can open the chest to finish everything in the area, obtaining the Boshan Censer in the process.\n\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Boshan Censer as a rare Curios item in *Black Myth: Wukong*. It highlights its utility in granting considerable damage reduction when Gourd uses are depleted, making it especially beneficial for players who rely on aggressive gameplay or have limited healing resources. The item is particularly advantageous for players skilled in dodging and using abilities like Cloud Step and Rock Solid.\n\nImage Summary:\nThe image showcases the Boshan Censer within the Equipment menu of *Black Myth: Wukong*. It is categorized as a rare Curios item and described as providing significant damage reduction when Gourd use is depleted. The item's visual design features an ornate censer with intricate detailing, accompanied by a poetic description: \"Incense's sweet aroma, prayers ascend, Longevity's blessing, suffering's end.\" The menu also displays other Curios items and relevant stats, emphasizing its role in gameplay strategy.\n\nFollowing Text Summary:\nThe following text explains that Curios items, including the Boshan Censer, cannot be upgraded, meaning their effects remain static throughout the game. Players are encouraged to switch between Curios items to suit their evolving builds and strategies. Additionally, it provides detailed instructions on locating the Boshan Censer, which involves defeating Red Loong in Black Wind Mountain after obtaining the hidden Loong Scales in Yellow Wind Ridge. The text also promotes other guides for finding items like Drinks, Weapons, Armor, and Gear sets."
}