{
    "chunk_id": 164597654618,
    "source_file": "Flame_Ebongold.md",
    "h1_title": "Flame Ebongold",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b8/Flame_Ebongold.jpg",
    "alt_text": "Flame Ebongold.jpg",
    "position_desc": 1,
    "img_above_text": "# Flame Ebongold\n\nFlame Ebongold is one of the unique materials in Black Myth: Wukong. It is used for weapon and armor crafting to craft unique gear unlocked upon defeating a boss.\n\nThe Flame Ebongold can be used to craft the Wind Bear Staff from the Shrine.",
    "img_below_text": "To obtain the Flame Ebongold, you need to defeat Black Bear Guai in Black Wind Cave in Black Wind Mountain.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Flame Ebongold\n\n            Context:\n            - Preceding Text: \"# Flame Ebongold\n\nFlame Ebongold is one of the unique materials in Black Myth: Wukong. It is used for weapon and armor crafting to craft unique gear unlocked upon defeating a boss.\n\nThe Flame Ebongold can be used to craft the Wind Bear Staff from the Shrine.\"\n            - Following Text: \"To obtain the Flame Ebongold, you need to defeat Black Bear Guai in Black Wind Cave in Black Wind Mountain.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces \"Flame Ebongold,\" a rare crafting material in *Black Myth: Wukong*. It is used to create unique weapons and armor, such as the Wind Bear Staff, which becomes available after defeating a boss.\n\nImage Summary:  \nThe image displays the in-game inventory screen, highlighting the \"Flame Ebongold\" item. It is categorized as a rare special crafting material, with a description emphasizing its value and use for crafting weapons. The item's detailed appearance, including a golden statue-like design, is shown alongside its inventory details.\n\nFollowing Text Summary:  \nThe following text explains that the \"Flame Ebongold\" can be obtained by defeating the Black Bear Guai boss in Black Wind Cave, located in Black Wind Mountain."
}