{
    "chunk_id": 798693694584,
    "source_file": "Chapter_5_Secret_-_Bishui_Cave_Walkthrough.md",
    "h1_title": "Chapter 5 Secret - Bishui Cave Walkthrough",
    "h2_title": "Yaoguai King - Bishui Golden-Eyed Beast",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/60/Bishui_Cave_Walkthrough_%2847%29.png",
    "alt_text": "Bishui Cave Walkthrough \\(47\\).png",
    "position_desc": 27,
    "img_above_text": "# Chapter 5 Secret - Bishui Cave Walkthrough\n\nTo your left, immediately as you enter the room, you'll find the Purge Pit Keeper's Shrine.\n\n\nAfter activating the first of the Keeper's Shrines, face away from it and head to the right. Go down the stairs and to the end of the path to find a Meditation Spot.\n\nReturn to the Keeper's Shrine and continue past it, following the path to the right. Head down to the slope, collecting the green Wisp on the left and into the center of the room. As you reach the middle, you'll be met by the first of the bosses in this secret area.\n\n\nGet back to the path and go past the next two bull guards to find the Cave Depths Keeper's Shrine.\n\n\nDrop down toward the lava and go left into the ice-covered portion of the room. Open the chest on the right to collect Celestial Ribbon and a Mind Core.\n\nHead down to the left, and slide all the way down the slope. Here you'll reach the final Keeper's Shrine of the hidden area, called the Corridor of Fire and Ice.\n\n\nHead right from the Keeper's Shrine and go down the stairs. A cutscene will play as you drop down, and the Bishui Golden-Eyed Beast will appear.\n\n## Yaoguai King - Bishui Golden-Eyed Beast\n\nThe best will appear again, and this time use freezing variations of the previous attacks. For this, you'll want Body-Warming Powder instead. There is another arena you can reach, and to do so, bait the beast to use a freeze attack on the door blocked by fire, so you can proceed. Go up the stairs and into the next section of the cave, where you'll slide down a frozen path and into the arena.",
    "img_below_text": "He'll be back to his fire attacks here but they'll be much more amped up, so you'll want to knock as much of his health down in the first two rounds as you can.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chapter 5 Secret - Bishui Cave Walkthrough\n            - Section Title: Yaoguai King - Bishui Golden-Eyed Beast\n\n            Context:\n            - Preceding Text: \"# Chapter 5 Secret - Bishui Cave Walkthrough\n\nTo your left, immediately as you enter the room, you'll find the Purge Pit Keeper's Shrine.\n\n\nAfter activating the first of the Keeper's Shrines, face away from it and head to the right. Go down the stairs and to the end of the path to find a Meditation Spot.\n\nReturn to the Keeper's Shrine and continue past it, following the path to the right. Head down to the slope, collecting the green Wisp on the left and into the center of the room. As you reach the middle, you'll be met by the first of the bosses in this secret area.\n\n\nGet back to the path and go past the next two bull guards to find the Cave Depths Keeper's Shrine.\n\n\nDrop down toward the lava and go left into the ice-covered portion of the room. Open the chest on the right to collect Celestial Ribbon and a Mind Core.\n\nHead down to the left, and slide all the way down the slope. Here you'll reach the final Keeper's Shrine of the hidden area, called the Corridor of Fire and Ice.\n\n\nHead right from the Keeper's Shrine and go down the stairs. A cutscene will play as you drop down, and the Bishui Golden-Eyed Beast will appear.\n\n## Yaoguai King - Bishui Golden-Eyed Beast\n\nThe best will appear again, and this time use freezing variations of the previous attacks. For this, you'll want Body-Warming Powder instead. There is another arena you can reach, and to do so, bait the beast to use a freeze attack on the door blocked by fire, so you can proceed. Go up the stairs and into the next section of the cave, where you'll slide down a frozen path and into the arena.\"\n            - Following Text: \"He'll be back to his fire attacks here but they'll be much more amped up, so you'll want to knock as much of his health down in the first two rounds as you can.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the progression through Bishui Cave, detailing the activation of Keeper's Shrines and the collection of items like Celestial Ribbon and Mind Core. It leads up to a cutscene where the Bishui Golden-Eyed Beast appears, introducing the player to its freezing attacks and a strategy involving baiting the beast to unlock a fire-blocked door.\n\nImage Summary:\nThe image depicts a dark, fiery arena with molten lava patterns across the ground and a menacing creature at the center, likely the Bishui Golden-Eyed Beast. The setting suggests a high-stakes boss battle, emphasizing the beast's fiery nature and the dangerous environment surrounding it.\n\nFollowing Text Summary:\nThe following text explains that the Bishui Golden-Eyed Beast will revert to using amplified fire-based attacks in the next phase of the battle. Players are advised to deal significant damage in earlier rounds to prepare for the more intense attacks in this stage of the fight."
}