{
    "chunk_id": 167033091884,
    "source_file": "Laurel_Buds.md",
    "h1_title": "Laurel Buds",
    "h2_title": "Black Myth: Wukong Laurel Buds Location",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/52/Laurel_Buds.jpg",
    "alt_text": "Laurel Buds.jpg",
    "position_desc": 2,
    "img_above_text": "# Laurel Buds\n\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd itself, so you are stuck with the length of this damage reduction. It can't be increased, so, if you want to switch to a different Soak, be sure to head back to the Shen Monkey Vendor.\n\n## Black Myth: Wukong Laurel Buds Location\n\nThe Laurel Buds can be found past the Lang-Li-Guhh-Baw boss to the left of the Sandgate Village - Village Entrance Shrine in Yellow Wind Ridge. Head towards where you will fight the King of Flowing Sand and Second Rat Prince. Just before that boss arena, you will see a statue.\n\nBy this statue, you can pick up the Laurel Buds.",
    "img_below_text": "Soaks are far more plentiful than the Drinks for your Gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Laurel Buds\n            - Section Title: Black Myth: Wukong Laurel Buds Location\n\n            Context:\n            - Preceding Text: \"# Laurel Buds\n\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd itself, so you are stuck with the length of this damage reduction. It can't be increased, so, if you want to switch to a different Soak, be sure to head back to the Shen Monkey Vendor.\n\n## Black Myth: Wukong Laurel Buds Location\n\nThe Laurel Buds can be found past the Lang-Li-Guhh-Baw boss to the left of the Sandgate Village - Village Entrance Shrine in Yellow Wind Ridge. Head towards where you will fight the King of Flowing Sand and Second Rat Prince. Just before that boss arena, you will see a statue.\n\nBy this statue, you can pick up the Laurel Buds.\"\n            - Following Text: \"Soaks are far more plentiful than the Drinks for your Gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}