{
    "chunk_id": 889044697634,
    "source_file": "Yellow_Sand_Formation_Walkthrough.md",
    "h1_title": "Yellow Sand Formation Walkthrough",
    "h2_title": "Windrest Bridge",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5a/Wukong_Yellow_4.jpg",
    "alt_text": "Wukong Yellow 4.jpg",
    "position_desc": 4,
    "img_above_text": "# Yellow Sand Formation Walkthrough\n\nFurther up, you’ll find a Rat Soldier and Rat Archer guarding a large statue embedded in the rock wall with a small turtle chest at its altar. Clear out the foes, and then open it to find a **Copper Pill** Soak for your Gourd. This one in particular has an impressive effect to negate the cost of Rock Solid when used soon after using the gourd.\n\n## Windrest Bridge\n\nTake out any stray Withered Corpses as you head to the top of the path, and you’ll find the Windrest Bridge Shrine.",
    "img_below_text": "Beyond it, the large stone bridge leading to the Windrest Hamlet is well guarded by a shield-bearing Spearbone, and two Blazebone ranged attackers supporting him. Bait out the fighter and lure him out of range, or alternatively, you can dodge around him (or use Cloud Step) to ambush the Blazebones first, and then focus on overpowering the defenses of the Spearbone with careful timing.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Yellow Sand Formation Walkthrough\n            - Section Title: Windrest Bridge\n\n            Context:\n            - Preceding Text: \"# Yellow Sand Formation Walkthrough\n\nFurther up, you’ll find a Rat Soldier and Rat Archer guarding a large statue embedded in the rock wall with a small turtle chest at its altar. Clear out the foes, and then open it to find a **Copper Pill** Soak for your Gourd. This one in particular has an impressive effect to negate the cost of Rock Solid when used soon after using the gourd.\n\n## Windrest Bridge\n\nTake out any stray Withered Corpses as you head to the top of the path, and you’ll find the Windrest Bridge Shrine.\"\n            - Following Text: \"Beyond it, the large stone bridge leading to the Windrest Hamlet is well guarded by a shield-bearing Spearbone, and two Blazebone ranged attackers supporting him. Bait out the fighter and lure him out of range, or alternatively, you can dodge around him (or use Cloud Step) to ambush the Blazebones first, and then focus on overpowering the defenses of the Spearbone with careful timing.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}