{
    "chunk_id": 797134731935,
    "source_file": "Giant_Shigandang.md",
    "h1_title": "Giant Shigandang",
    "h2_title": "Giant Shigandang Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/00/Five_Skandhas_%2826%29.png",
    "alt_text": "Five Skandhas \\(26\\).png",
    "position_desc": 3,
    "img_above_text": "# Giant Shigandang\n\nGiant Shigandangis one of the optional Yaoguai Kings you can fight in Chapter 6 of Black Myth: Wukong. It's the only Yaoguai King that will be recorded in your Journal in Chapter 6. Unlocking it will require collecting Skandhas across the 5 previous chapters.\n\n\nAs you emerge in the wide open space, a Giant Shigandang will appear.\n\n## Giant Shigandang Boss Fight and Guide",
    "img_below_text": "Unfortunately, despite its size, you will need to be on foot during the fight. The key to defeating this enormous rocky monster is to head for its fits and attack the blue crystals you can on them.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Giant Shigandang\n            - Section Title: Giant Shigandang Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Giant Shigandang\n\nGiant Shigandangis one of the optional Yaoguai Kings you can fight in Chapter 6 of Black Myth: Wukong. It's the only Yaoguai King that will be recorded in your Journal in Chapter 6. Unlocking it will require collecting Skandhas across the 5 previous chapters.\n\n\nAs you emerge in the wide open space, a Giant Shigandang will appear.\n\n## Giant Shigandang Boss Fight and Guide\"\n            - Following Text: \"Unfortunately, despite its size, you will need to be on foot during the fight. The key to defeating this enormous rocky monster is to head for its fits and attack the blue crystals you can on them.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Giant Shigandang as an optional Yaoguai King boss in Chapter 6 of *Black Myth: Wukong*. It notes that this boss is unique in being recorded in the Journal for this chapter and requires collecting Skandhas from earlier chapters to unlock. The encounter begins in a wide open space where the Giant Shigandang appears.\n\nImage Summary:  \nThe image depicts the Giant Shigandang, a massive, rocky creature resembling a living mountain, towering over the player character in a vast, open environment. The scene emphasizes the creature's immense size and the ominous atmosphere of the impending boss fight.\n\nFollowing Text Summary:  \nThe following text explains that the fight against the Giant Shigandang must be conducted on foot. The key strategy involves targeting the blue crystals on the creature’s fists to weaken it."
}