{
    "chunk_id": 936541299688,
    "source_file": "Black_Wind_Cave_Walkthrough.md",
    "h1_title": "Black Wind Cave Walkthrough",
    "h2_title": "Yaoguai King Boss Fight - Black Wind King",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/19/Wukong_BlackWind_18.jpg",
    "alt_text": "Wukong BlackWind 18.jpg",
    "position_desc": 17,
    "img_above_text": "# Black Wind Cave Walkthrough\n\nThe Black Wind Cave is the final region of Chapter 2's Black Wind Mountain in Black Myth: Wukong. Though it is a short area, it will prove to be a challenging one as you go up against the greedy King of the Mountain. Below you'll find a guide to the progressing through the cave to the mountaintop, as well as how to defeat the boss of this area in his two forms, the Black Wind King and the Black Bear Guai.\n\n* **Jump to A Section:**\n* **Cave Interior**\n- Black Wind King\n* **Outside the Cave**\n* **Bodhi Peak**\n- Black Bear Guai\n\n\nReturn to the path and take the stairs up to fight against another Wolf Assassin as the cave grows dark, and draw them into the light if needed.\n\nAs you reach an open part of the cave, you’ll have to face one more assassin along the darkened path, and you may notice they’ll go out of their way to destroy the torches along the path to further envelop them in darkness. If you have trouble facing them, always try to bring them to a brighter spot.\n\nNote that if you went ahead and defeated the Secret Boss by ringing the three bells, you should also have access to craft an additional Bronze Set that improves your abilities using the Immobilize Spell!\n\nCraft and upgrade whatever you can afford at the moment, because a boss is waiting inside the temple to test your might, and he’s no pushover.\n\n## Yaoguai King Boss Fight - Black Wind King\n\nCounter each of his teleports when his attacks complete, and you’ll soon defeat the Yaoguai King, forcing him to retreat as he yells for you to face his true form at the top of the mountain. However, in his retreat, he’ll leave behind some of his Black Wind, which the Keeper of the Mountain will harness and pass onto you, giving you a brand new spell: **Cloud Step**.\n\nThis spell will allow you to vanish while dashing forward, creating a copy of yourself that enemies will target. While in this mist-like form, you’ll be invisible for a short duration, and attacking will execute an Unveiling Strike for increased damage while catching foes off guard!",
    "img_below_text": "Be sure to thoroughly explore this cavern temple after the boss retreats, as there’s plenty of loot to find. Start by checking the far corners to the right when looking back at the entrance you came in through. Look for a group of large pots for one with a golden glow, and break it open to find an **Awaken Wine Worm**. These upgrades can be given to the Shen Monkey back at the Marsh of the White Mist to increase the amount of healing each charge of your Medicine Gourd’s drink will recover!",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Black Wind Cave Walkthrough\n            - Section Title: Yaoguai King Boss Fight - Black Wind King\n\n            Context:\n            - Preceding Text: \"# Black Wind Cave Walkthrough\n\nThe Black Wind Cave is the final region of Chapter 2's Black Wind Mountain in Black Myth: Wukong. Though it is a short area, it will prove to be a challenging one as you go up against the greedy King of the Mountain. Below you'll find a guide to the progressing through the cave to the mountaintop, as well as how to defeat the boss of this area in his two forms, the Black Wind King and the Black Bear Guai.\n\n* **Jump to A Section:**\n* **Cave Interior**\n- Black Wind King\n* **Outside the Cave**\n* **Bodhi Peak**\n- Black Bear Guai\n\n\nReturn to the path and take the stairs up to fight against another Wolf Assassin as the cave grows dark, and draw them into the light if needed.\n\nAs you reach an open part of the cave, you’ll have to face one more assassin along the darkened path, and you may notice they’ll go out of their way to destroy the torches along the path to further envelop them in darkness. If you have trouble facing them, always try to bring them to a brighter spot.\n\nNote that if you went ahead and defeated the Secret Boss by ringing the three bells, you should also have access to craft an additional Bronze Set that improves your abilities using the Immobilize Spell!\n\nCraft and upgrade whatever you can afford at the moment, because a boss is waiting inside the temple to test your might, and he’s no pushover.\n\n## Yaoguai King Boss Fight - Black Wind King\n\nCounter each of his teleports when his attacks complete, and you’ll soon defeat the Yaoguai King, forcing him to retreat as he yells for you to face his true form at the top of the mountain. However, in his retreat, he’ll leave behind some of his Black Wind, which the Keeper of the Mountain will harness and pass onto you, giving you a brand new spell: **Cloud Step**.\n\nThis spell will allow you to vanish while dashing forward, creating a copy of yourself that enemies will target. While in this mist-like form, you’ll be invisible for a short duration, and attacking will execute an Unveiling Strike for increased damage while catching foes off guard!\"\n            - Following Text: \"Be sure to thoroughly explore this cavern temple after the boss retreats, as there’s plenty of loot to find. Start by checking the far corners to the right when looking back at the entrance you came in through. Look for a group of large pots for one with a golden glow, and break it open to find an **Awaken Wine Worm**. These upgrades can be given to the Shen Monkey back at the Marsh of the White Mist to increase the amount of healing each charge of your Medicine Gourd’s drink will recover!\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text provides context for the Black Wind Cave area in *Black Myth: Wukong*, detailing the challenges players face as they progress through the cave and prepare for the Yaoguai King boss fight. It introduces the mechanics of the boss encounter, including his teleportation attacks and the reward for defeating him, the **Cloud Step** spell. Players are advised to craft upgrades and prepare thoroughly before facing the boss.\n\n---\n\nImage Summary:\nThe image depicts the player character approaching a glowing pot within the cavern temple of Black Wind Cave. The pot, highlighted with a red circle, suggests it contains loot or an important item. The surroundings are dark and overgrown, emphasizing exploration and discovery in this post-boss area. The game's interface is visible, showing abilities and health bars, reinforcing the active gameplay context.\n\n---\n\nFollowing Text Summary:\nThe following text advises players to explore the cavern temple thoroughly after the Yaoguai King retreats, highlighting the presence of valuable loot. Specifically, players are directed to break open a glowing pot to obtain an **Awaken Wine Worm**, which can be used to enhance healing capabilities by upgrading the Medicine Gourd through the Shen Monkey NPC at the Marsh of the White Mist."
}