{
    "chunk_id": 134462662640,
    "source_file": "Bishui_Golden-Eyed_Beast.md",
    "h1_title": "Bishui Golden-Eyed Beast",
    "h2_title": "Bishui Golden-Eyed Beast Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bd/Bishui_Cave_Walkthrough_%2845%29.png",
    "alt_text": "Bishui Cave Walkthrough \\(45\\).png",
    "position_desc": 9,
    "img_above_text": "# Bishui Golden-Eyed Beast\n\nBishui Golden-Eyed Beast is a secret Yaoguai King boss hidden in Chapter 5 of Chapter 5 in Black Myth: Wukong. You can find this ferocious beast at the end of the hidden area, with its two types of elemental attacks making it a difficult fight.\n\n\nHead right from the Keeper's Shrine and go down the stairs. A cutscene will play as you drop down, and the Bishui Golden-Eyed Beast will appear.\n\n## Bishui Golden-Eyed Beast Boss Fight and Guide\n\nContinue up the stairs, and you'll see the beast leaping around the rooftops. Go along the corridor, where you'll come to a frozen room with a doorway that has fire blocking it.",
    "img_below_text": "The best will appear again, and this time use freezing variations of the previous attacks. For this, you'll want Body-Warming Powder instead. There is another arena you can reach, and to do so, bait the beast to use a freeze attack on the door blocked by fire, so you can proceed. Go up the stairs and into the next section of the cave, where you'll slide down a frozen path and into the arena.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bishui Golden-Eyed Beast\n            - Section Title: Bishui Golden-Eyed Beast Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Bishui Golden-Eyed Beast\n\nBishui Golden-Eyed Beast is a secret Yaoguai King boss hidden in Chapter 5 of Chapter 5 in Black Myth: Wukong. You can find this ferocious beast at the end of the hidden area, with its two types of elemental attacks making it a difficult fight.\n\n\nHead right from the Keeper's Shrine and go down the stairs. A cutscene will play as you drop down, and the Bishui Golden-Eyed Beast will appear.\n\n## Bishui Golden-Eyed Beast Boss Fight and Guide\n\nContinue up the stairs, and you'll see the beast leaping around the rooftops. Go along the corridor, where you'll come to a frozen room with a doorway that has fire blocking it.\"\n            - Following Text: \"The best will appear again, and this time use freezing variations of the previous attacks. For this, you'll want Body-Warming Powder instead. There is another arena you can reach, and to do so, bait the beast to use a freeze attack on the door blocked by fire, so you can proceed. Go up the stairs and into the next section of the cave, where you'll slide down a frozen path and into the arena.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe Bishui Golden-Eyed Beast is a secret boss in *Black Myth: Wukong*, located in a hidden area of Chapter 5. It uses two types of elemental attacks, making it a challenging opponent. Players encounter the beast after descending stairs from the Keeper's Shrine, where its appearance is marked by a cutscene.\n\nImage Summary:\nThe image depicts the Bishui Golden-Eyed Beast in a dark, icy environment, crouched aggressively with frost and shards of ice surrounding it. The setting suggests a tense moment during the boss fight, emphasizing the beast's intimidating presence and its use of freezing attacks. The dim lighting and frozen terrain reinforce the dangerous and atmospheric nature of the encounter.\n\nFollowing Text Summary:\nThe Bishui Golden-Eyed Beast introduces freezing variations of its attacks in the next phase of the fight. Players are advised to use Body-Warming Powder to counter the freezing effects. To progress, they must bait the beast into using its freeze attack to extinguish the fire blocking a doorway, leading to another arena via a frozen path."
}