{
    "chunk_id": 190559725997,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "h1_title": "Furnace Valley Walkthrough",
    "h2_title": "Valley Entrance",
    "h3_title": "A Note on Flamlings",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/6a/Furnace_Valley_Walkthrough_%2828%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(28\\).png",
    "position_desc": 12,
    "img_above_text": "# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n## Valley Entrance\n\nUltimately, you're going to go left to continue on the main path (and you may start to hear characters talk as you approach this pillar), but for now, you'll want to detour and explore the area to the right.\n\nThe first thing you'll see as you go to the right is the Flamlings that sit in the lava. These will spit fire at you, so it's best to deal with them to remove the ranged attacks while you explore.\n\n### A Note on Flamlings\n\nWhen the area is clear, collect the green Wisps and open the chest to collect Fine Gold Thread and Blood of the Iron Bull.Now approach the cart. This is one of the Five Element Carts, but it's already been dealt with. Get close to its mouth and pull the string when prompted. When you do, you'll hear the voice of Ma Tianba (the horse guai from previous chapters) coming from inside. Keep pulling the string until you've exhausted all dialogue, and then move on. There's nothing more you can do here for now, but we'll return later.\n\nFace away from the cart and back in the direction you came from. There's more to explore at the moment, before you continue up to the archway you can see in the distance.",
    "img_below_text": "Go left, at the first lava stream you can see running from the ceiling. Take another left, so you're heading back on yourself (just on the lower level) toward where you started Furnace Valley.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Furnace Valley Walkthrough\n            - Section Title: Valley Entrance\n            - Sub-Section Title: A Note on Flamlings\n\n            Context:\n            - Preceding Text: \"# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n## Valley Entrance\n\nUltimately, you're going to go left to continue on the main path (and you may start to hear characters talk as you approach this pillar), but for now, you'll want to detour and explore the area to the right.\n\nThe first thing you'll see as you go to the right is the Flamlings that sit in the lava. These will spit fire at you, so it's best to deal with them to remove the ranged attacks while you explore.\n\n### A Note on Flamlings\n\nWhen the area is clear, collect the green Wisps and open the chest to collect Fine Gold Thread and Blood of the Iron Bull.Now approach the cart. This is one of the Five Element Carts, but it's already been dealt with. Get close to its mouth and pull the string when prompted. When you do, you'll hear the voice of Ma Tianba (the horse guai from previous chapters) coming from inside. Keep pulling the string until you've exhausted all dialogue, and then move on. There's nothing more you can do here for now, but we'll return later.\n\nFace away from the cart and back in the direction you came from. There's more to explore at the moment, before you continue up to the archway you can see in the distance.\"\n            - Following Text: \"Go left, at the first lava stream you can see running from the ceiling. Take another left, so you're heading back on yourself (just on the lower level) toward where you started Furnace Valley.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text provides context for exploring the Valley Entrance area in the Furnace Valley Walkthrough. Players are instructed to detour to the right to deal with Flamlings, which are enemies that spit fire from the lava. Clearing the area allows players to collect items such as green Wisps, Fine Gold Thread, and Blood of the Iron Bull. Additionally, players interact with a dealt-with Element Cart to exhaust dialogue and gather narrative clues before continuing exploration.\n\nImage Summary:\nThe image depicts a dark, cavernous area within Furnace Valley, illuminated by streams of glowing lava flowing from the ceiling and ground. A prominent archway structure is visible in the distance, suggesting a key landmark or destination. The red arrow in the foreground indicates a direction to follow, guiding players toward exploration or progression in the walkthrough.\n\nFollowing Text Summary:\nThe following text directs players to proceed left at the first visible lava stream and then take another left to backtrack on a lower level toward the starting point of Furnace Valley. This suggests further exploration of the area before advancing to the archway seen in the distance."
}