{
    "chunk_id": 491510676358,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "h1_title": "Fright Cliff Walkthrough",
    "h2_title": "Squall Hideout",
    "h3_title": "The Second Buddha’s Eyeball",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bd/Wukong_Fright_14.jpg",
    "alt_text": "Wukong Fright 14.jpg",
    "position_desc": 15,
    "img_above_text": "# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n## Squall Hideout\n\n\nThe large cave entrance has a few paths, with the outer one on the right leading past another Pitstone to a wooden coffin chest holding 3 **Silk** and some **Will**.\n\n### The Second Buddha’s Eyeball\nIgnore the middle path leading into the main cave entrance for the moment, and head toward the large open cave area to the left by following some braziers. They’ll lead toward a large ominous statue in the dark. More Palestones will try to ambush you here, and they guard another stone statue head at the foot of the larger statue’s altar. Examine it to gain another Buddha’s Eyeball.",
    "img_below_text": "Head back to the Squall Hideout Shrine, and this time stay out in the sun to explore the other half of this area. The far right side has several enemies patrolling around, including a shield-bearing Spearbone that has a lot more defense than the Rat Soldier. You’ll want to chip away at the shield with charged heavy strikes until he’s defenseless before Immobilizing him, and dodging the shield charges and bashes.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fright Cliff Walkthrough\n            - Section Title: Squall Hideout\n            - Sub-Section Title: The Second Buddha’s Eyeball\n\n            Context:\n            - Preceding Text: \"# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n## Squall Hideout\n\n\nThe large cave entrance has a few paths, with the outer one on the right leading past another Pitstone to a wooden coffin chest holding 3 **Silk** and some **Will**.\n\n### The Second Buddha’s Eyeball\nIgnore the middle path leading into the main cave entrance for the moment, and head toward the large open cave area to the left by following some braziers. They’ll lead toward a large ominous statue in the dark. More Palestones will try to ambush you here, and they guard another stone statue head at the foot of the larger statue’s altar. Examine it to gain another Buddha’s Eyeball.\"\n            - Following Text: \"Head back to the Squall Hideout Shrine, and this time stay out in the sun to explore the other half of this area. The far right side has several enemies patrolling around, including a shield-bearing Spearbone that has a lot more defense than the Rat Soldier. You’ll want to chip away at the shield with charged heavy strikes until he’s defenseless before Immobilizing him, and dodging the shield charges and bashes.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes a section of the \"Fright Cliff Walkthrough,\" focusing on navigating the Squall Hideout area. Players are advised to avoid direct confrontation with smaller threats and use strategic movement, such as the Cloud Step, to bypass obstacles like Pitstones. It introduces the \"Second Buddha’s Eyeball\" sub-section, where players explore a large cave area guarded by Palestones and interact with a stone statue to obtain the Buddha’s Eyeball.\n\nImage Summary:\nThe image depicts a combat scenario within the Squall Hideout area. A shield-bearing enemy, likely the Spearbone mentioned in the following text, is engaging the player character. The enemy is visually distinct with a large shield, spear, and intricate design elements, such as antler-like features. The environment is an outdoor area with dry grass and rocky terrain, consistent with the walkthrough's description. The interface displays health and action icons, suggesting active gameplay.\n\nFollowing Text Summary:\nThe following text provides guidance on exploring the Squall Hideout further, emphasizing combat strategies for dealing with enemies like the shield-bearing Spearbone. Players are advised to use charged heavy strikes to weaken the shield before immobilizing the enemy while avoiding its shield-based attacks. The text also highlights the presence of patrolling enemies in the sunlit area on the far right side of the hideout."
}