{
    "chunk_id": 391849669705,
    "source_file": "Fuban.md",
    "h1_title": "Fuban",
    "h2_title": "Fuban Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e6/Wukong_Sahali_34.jpg",
    "alt_text": "Wukong Sahali 34.jpg",
    "position_desc": 18,
    "img_above_text": "# Fuban\n\nFuban is a secret optional Yaoguai King boss fight that you can encounter in Chapter 2's secret area in Black Myth Wukong. Located in the Kingdom of Sahali locked away in the past, you'll need to help fulfill a drunken Boar's quest to access this area.\n\n* **Rewards:** Wind Tamer, Sky-Piercing Horn\n\n\nOnce you follow him through the large gate with the small crawlspace, you’ll find yourself overlooking an ancient and forgotten kingdom, and suddenly be transported into the past and into the Kingdom of Sahali.\n\nAfter besting the \"Tiger Vanguard\", you'll find none other than the Yellow Rat Sage, who needs your help defeating a giant scarab Guai in the sands below.\n\n## Fuban Boss Fight and Guide\n\nBe wary if you see Fuban start to pivot and turn away from you. It will duck down and show you the giant vessel attached to its carapace — a huge stone head — and then promptly ram it into you. This is a tough attack to dodge neatly if you aren’t expecting it, and will deal a ton of damage if it lands.",
    "img_below_text": "Once you’ve taken off around a third of its health, Fuban will back up and burrow back into the ground. Once again, it will start to swim through the sand at you, which your lock on will thankfully stick to.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fuban\n            - Section Title: Fuban Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Fuban\n\nFuban is a secret optional Yaoguai King boss fight that you can encounter in Chapter 2's secret area in Black Myth Wukong. Located in the Kingdom of Sahali locked away in the past, you'll need to help fulfill a drunken Boar's quest to access this area.\n\n* **Rewards:** Wind Tamer, Sky-Piercing Horn\n\n\nOnce you follow him through the large gate with the small crawlspace, you’ll find yourself overlooking an ancient and forgotten kingdom, and suddenly be transported into the past and into the Kingdom of Sahali.\n\nAfter besting the \"Tiger Vanguard\", you'll find none other than the Yellow Rat Sage, who needs your help defeating a giant scarab Guai in the sands below.\n\n## Fuban Boss Fight and Guide\n\nBe wary if you see Fuban start to pivot and turn away from you. It will duck down and show you the giant vessel attached to its carapace — a huge stone head — and then promptly ram it into you. This is a tough attack to dodge neatly if you aren’t expecting it, and will deal a ton of damage if it lands.\"\n            - Following Text: \"Once you’ve taken off around a third of its health, Fuban will back up and burrow back into the ground. Once again, it will start to swim through the sand at you, which your lock on will thankfully stick to.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Fuban, a secret optional boss in *Black Myth: Wukong*, encountered in Chapter 2's secret area within the Kingdom of Sahali. Players must assist a drunken Boar to access this area. Fuban is described as a challenging Yaoguai King with a powerful ramming attack involving a giant stone head attached to its carapace, which deals significant damage if not dodged.\n\nImage Summary:\nThe image depicts an intense moment during the Fuban boss fight in *Black Myth: Wukong*. Fuban, a massive creature resembling a scarab, is mid-attack, creating a cloud of sand as it charges toward the player character in a desert environment. The player is seen evading the attack, with visible health bars and action icons indicating active gameplay mechanics. The scene emphasizes the scale and ferocity of the boss and the dynamic combat system.\n\nFollowing Text Summary:\nThe following text explains that once Fuban's health is reduced by about one-third, it retreats and burrows into the ground. It then resumes attacking by swimming through the sand, with the game's lock-on feature aiding players in tracking its movements."
}