{
    "chunk_id": 305479131533,
    "source_file": "Celestial_Registry_Tablet.md",
    "h1_title": "Celestial Registry Tablet",
    "h2_title": "Black Myth: Wukong Celestial Registry Tablet Location",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/85/Wukong_PurpleCloud_30.jpg",
    "alt_text": "Wukong PurpleCloud 30.jpg",
    "position_desc": 1,
    "img_above_text": "# Celestial Registry Tablet\n\nThe Celestial Registry Tablet is one of the many Curios items you can find in Black Myth: Wukong. Like the rest of these items, once found, it can be equipped from the Equipment menu.\n\nWith the Celestial Registry Tablet equipped the experience points you earn from defeating enemies is slightly increased.\n\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, the item will stay at its current power throughout the game. If you want a better buff or something else to fit your build, you will need to switch it out.\n\n## Black Myth: Wukong Celestial Registry Tablet Location\n\nThe Celestial Reistry Tablet is found in the secret Purple Cloud Mountain area of The Webbed Hollow. It is in a small gazebo in the initial area of the secret location.",
    "img_below_text": "A full guide on how to access Purple Cloud Mountain can be found in the video below:\n\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Celestial Registry Tablet\n            - Section Title: Black Myth: Wukong Celestial Registry Tablet Location\n\n            Context:\n            - Preceding Text: \"# Celestial Registry Tablet\n\nThe Celestial Registry Tablet is one of the many Curios items you can find in Black Myth: Wukong. Like the rest of these items, once found, it can be equipped from the Equipment menu.\n\nWith the Celestial Registry Tablet equipped the experience points you earn from defeating enemies is slightly increased.\n\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, the item will stay at its current power throughout the game. If you want a better buff or something else to fit your build, you will need to switch it out.\n\n## Black Myth: Wukong Celestial Registry Tablet Location\n\nThe Celestial Reistry Tablet is found in the secret Purple Cloud Mountain area of The Webbed Hollow. It is in a small gazebo in the initial area of the secret location.\"\n            - Following Text: \"A full guide on how to access Purple Cloud Mountain can be found in the video below:\n\nFor even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe Celestial Registry Tablet is a Curios item in *Black Myth: Wukong* that slightly increases experience points earned from defeating enemies. It cannot be upgraded, so its power remains constant throughout the game. Players can find the tablet in the secret Purple Cloud Mountain area of The Webbed Hollow, specifically in a small gazebo in the initial area.\n\nImage Summary:  \nThe image shows the in-game location where players can find the Celestial Registry Tablet in *Black Myth: Wukong*. A character is approaching a small gazebo in a forested area with autumnal foliage. The tablet's location is highlighted with a red circle within the gazebo, indicating where players can collect the item.\n\nFollowing Text Summary:  \nThe following text provides additional guidance on accessing the Purple Cloud Mountain area, where the Celestial Registry Tablet is located. It also mentions other guides available for finding various items in the game, such as Drinks, Soaks, Weapons, Armor, and Gear sets."
}