{
    "chunk_id": 940545406935,
    "source_file": "Captain_Lotus-Vision.md",
    "h1_title": "Captain Lotus-Vision",
    "h2_title": "Where to Find Captain Lotus-Vision",
    "h3_title": "Captain Lotus-Vision Miniboss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5a/Wukong_Pagoda_36.jpg",
    "alt_text": "Wukong Pagoda 36.jpg",
    "position_desc": 6,
    "img_above_text": "# Captain Lotus-Vision\n\nCaptain Lotus-Vision is an optional miniboss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Responsible for sealing captives in the cells of the Pagoda Realm, you can find this boss in a secret chamber within the Pagoda Prison.\n\n* **Rewards:** Spirit of Captain Lotus-Vision, Frostsprout Twig, Mind Core, Cold Iron Leaves, 1847 Experience, 1198 Will\n\n## Where to Find Captain Lotus-Vision\n\nCaptain Lotus-Vision is one of the four captains you can find in Chapter 3, and is an optional Yaoguai Chief you can encounter in the Pagoda Realm.\n\nTo find him, you'll need to reach the Upper Pagoda Shrine on the third level of the prison. Just behind the shrine, there is a pit with purple light emanating below that you can drop into and find this boss.\n\n### Captain Lotus-Vision Miniboss Fight and Guide\n\nThings will get more difficult any time you see the crystal on his staff flare brighter. These brief flashes indicate a laser beam blast that you'll only have a moment to dodge or take considerable damage, and you'll have to deal with even more as time goes on. Early on, watch for a laser to shoot out as he creates projectiles rings before you start spinning your staff.",
    "img_below_text": "Once you take out around a third of his health, he'll teleport back near his original position, and shatter the remaining corpses as he draws power, creating a large and intricate circle of runic power behind him.\n\nThings will get extremely dangerous and annoying at this point, as he'll not only unleash a constant beam from his crystal, but the ring behind him will form smaller rings to blast you from four different locations. This will result in dodging on top of dodging as you have to escape the constant laser, and also four different blasts, and a final blast from all four circles at once.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Captain Lotus-Vision\n            - Section Title: Where to Find Captain Lotus-Vision\n            - Sub-Section Title: Captain Lotus-Vision Miniboss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Captain Lotus-Vision\n\nCaptain Lotus-Vision is an optional miniboss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Responsible for sealing captives in the cells of the Pagoda Realm, you can find this boss in a secret chamber within the Pagoda Prison.\n\n* **Rewards:** Spirit of Captain Lotus-Vision, Frostsprout Twig, Mind Core, Cold Iron Leaves, 1847 Experience, 1198 Will\n\n## Where to Find Captain Lotus-Vision\n\nCaptain Lotus-Vision is one of the four captains you can find in Chapter 3, and is an optional Yaoguai Chief you can encounter in the Pagoda Realm.\n\nTo find him, you'll need to reach the Upper Pagoda Shrine on the third level of the prison. Just behind the shrine, there is a pit with purple light emanating below that you can drop into and find this boss.\n\n### Captain Lotus-Vision Miniboss Fight and Guide\n\nThings will get more difficult any time you see the crystal on his staff flare brighter. These brief flashes indicate a laser beam blast that you'll only have a moment to dodge or take considerable damage, and you'll have to deal with even more as time goes on. Early on, watch for a laser to shoot out as he creates projectiles rings before you start spinning your staff.\"\n            - Following Text: \"Once you take out around a third of his health, he'll teleport back near his original position, and shatter the remaining corpses as he draws power, creating a large and intricate circle of runic power behind him.\n\nThings will get extremely dangerous and annoying at this point, as he'll not only unleash a constant beam from his crystal, but the ring behind him will form smaller rings to blast you from four different locations. This will result in dodging on top of dodging as you have to escape the constant laser, and also four different blasts, and a final blast from all four circles at once.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Captain Lotus-Vision as an optional miniboss in *Black Myth Wukong*, encountered in Chapter 3 within the Pagoda Realm. The boss is responsible for imprisoning captives and can be found in a secret chamber near the Upper Pagoda Shrine. The text also describes the rewards for defeating him and provides initial combat tips, such as dodging laser attacks from his staff.\n\nImage Summary:  \nThe image depicts the miniboss fight against Captain Lotus-Vision. The scene is set in a dark, ominous chamber with glowing purple energy emanating from a large runic circle behind the boss. Captain Lotus-Vision is shown at the center of the circle, wielding a staff and surrounded by an intense aura of power. The player's character is positioned in the foreground, preparing for combat, with visible health bars, abilities, and interface elements indicating an active battle.\n\nFollowing Text Summary:  \nThe following text explains the next phase of the fight after reducing Captain Lotus-Vision's health by one-third. The boss teleports and draws power from shattered corpses, creating a runic circle that unleashes multiple laser blasts. The player must navigate increasingly complex and dangerous attacks, including constant beams and synchronized blasts from multiple sources."
}