{
    "chunk_id": 373391613833,
    "source_file": "Black_Loong.md",
    "h1_title": "Black Loong",
    "h2_title": "Where to Find Black Loong",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/97/Wukong_Fright_1.jpg",
    "alt_text": "Wukong Fright 1.jpg",
    "position_desc": 5,
    "img_above_text": "# Black Loong\n\nBlack Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Hidden beyond a waterfall of sand in the Fright Cliff, you won't be able to encounter this boss until you obtain a Key Item elswhere in this chapter, Black Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* **Rewards:** Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n\n## Where to Find Black Loong\n\nYou can enter the crack in the wall, and on the other side you’ll find a chest containing the Loong Scales. With this item, you’ll be able to uncover the lair of the Loong Dragons.",
    "img_below_text": "Head to the Fright Cliff on the opposite side of the Yellow Wind Ridge from the Valley of Despair, and travel through it to reach an area with the Rockrest Flat Shrine.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Black Loong\n            - Section Title: Where to Find Black Loong\n\n            Context:\n            - Preceding Text: \"# Black Loong\n\nBlack Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Hidden beyond a waterfall of sand in the Fright Cliff, you won't be able to encounter this boss until you obtain a Key Item elswhere in this chapter, Black Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* **Rewards:** Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n\n## Where to Find Black Loong\n\nYou can enter the crack in the wall, and on the other side you’ll find a chest containing the Loong Scales. With this item, you’ll be able to uncover the lair of the Loong Dragons.\"\n            - Following Text: \"Head to the Fright Cliff on the opposite side of the Yellow Wind Ridge from the Valley of Despair, and travel through it to reach an area with the Rockrest Flat Shrine.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Black Loong, a secret boss in *Black Myth: Wukong* that players can encounter in Chapter 2. Black Loong is hidden behind a sand waterfall in the Fright Cliff area and requires a specific key item to access. Defeating this boss yields valuable rewards, including weapon crafting materials and unique items.\n\nImage Summary:\nThe image depicts a player character running through a rugged, desolate landscape toward a large, ornate gate structure nestled between rocky cliffs. The environment appears barren, with sparse vegetation and broken fences, suggesting a challenging or foreboding area. The visual context aligns with the narrative of exploring the Fright Cliff region to uncover hidden areas or progress toward the Black Loong encounter.\n\nFollowing Text Summary:\nThe following text directs players to travel through the Fright Cliff, located opposite the Yellow Wind Ridge from the Valley of Despair, to reach the Rockrest Flat Shrine. This area is part of the journey to uncover the lair of the Loong Dragons, further tying the image to the exploration of the Fright Cliff region."
}