{
    "chunk_id": 568009875785,
    "source_file": "Drunken_Boar_Questline.md",
    "h1_title": "Drunken Boar Questline",
    "h2_title": "Where to Find the Drunken Boar",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7e/Wukong_Fright_39.jpg",
    "alt_text": "Wukong Fright 39.jpg",
    "position_desc": 1,
    "img_above_text": "# Drunken Boar Questline\n\nThe Drunken Boar (aka Drunken Pig or his official name, the Yellow-Robed Squire) is a character you can meet and also fight in Chapter 2 of Black Myth Wukong. This character will ask you to complete a side quest for him that will unlock Chapter 2’s Secret Area: The Kingdom of Sahali.\n\n## Where to Find the Drunken Boar",
    "img_below_text": "You can first meet the Yellow-Robed Squire Boar in the Fright Cliff region of the Yellow Wind Ridge. Head through the Fright Cliff area to reach the **Rockrest Flat Shrine** , and continue to the back of this area past a small destructible wooden fence to find a large dry field.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Drunken Boar Questline\n            - Section Title: Where to Find the Drunken Boar\n\n            Context:\n            - Preceding Text: \"# Drunken Boar Questline\n\nThe Drunken Boar (aka Drunken Pig or his official name, the Yellow-Robed Squire) is a character you can meet and also fight in Chapter 2 of Black Myth Wukong. This character will ask you to complete a side quest for him that will unlock Chapter 2’s Secret Area: The Kingdom of Sahali.\n\n## Where to Find the Drunken Boar\"\n            - Following Text: \"You can first meet the Yellow-Robed Squire Boar in the Fright Cliff region of the Yellow Wind Ridge. Head through the Fright Cliff area to reach the **Rockrest Flat Shrine** , and continue to the back of this area past a small destructible wooden fence to find a large dry field.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Drunken Boar, also known as the Yellow-Robed Squire, a character in Chapter 2 of the game Black Myth Wukong. This character offers a side quest that unlocks a secret area called the Kingdom of Sahali.\n\nImage Summary:\nThe image depicts a scene from the game Black Myth Wukong, showing a player character approaching the Drunken Boar, who is armed and appears ready for combat. The setting is an outdoor, rocky area with dry grass, suggesting a confrontation or interaction related to the questline.\n\nFollowing Text Summary:\nThe following text provides directions to locate the Yellow-Robed Squire Boar in the Fright Cliff region of the Yellow Wind Ridge. Players are instructed to navigate through the area to reach the Rockrest Flat Shrine and proceed past a wooden fence to find a large dry field where the character can be encountered."
}