{
    "chunk_id": 753967393655,
    "source_file": "Chapter_4_Secret_-_Purple_Cloud_Mountain_Walkthrough.md",
    "h1_title": "Chapter 4 Secret - Purple Cloud Mountain Walkthrough",
    "h2_title": "Valley of Blooms",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/cd/Wukong_PurpleCloud_5.jpg",
    "alt_text": "Wukong PurpleCloud 5.jpg",
    "position_desc": 10,
    "img_above_text": "# Chapter 4 Secret - Purple Cloud Mountain Walkthrough\n\nThe Purple Cloud Mountain is a Secret Area found in Chapter 4's Webbed Hollow of Black Myth Wukong. Below you'll find a guide to accessing the mountain by defeating the Venom Daoist, and how to complete Hong Yi the Snake Guai's quest to defeat the Daoist Mi and Duskveil, as well as the formidable Scorpionlord.\n\n* **Jump to a Section:**\n* How to Access Purple Cloud Mountain\n* **Valley of Blooms**\n* **Bounds of Deity's Abode**\n- Yaoguai King - The Scorpionlord\n* **Petalfall Hamlet**\n- Yaoguai Chief - Daoist Mi\n* **Cloudnest Peak**\n- Yaoguai King - The Duskveil\n\nThis Chapter 4 Secret can only be accessed by finding and defeating the Venom Daoist in two different locations, and will transport you to a different location to fight a secret Yaoguai King and repair a Vessel that is instrumental in defeating the Hundred-Eyed Daoist Master.\n\n\nWhen the Venom Daoist is finally defeated, he'll point to a mural that will appear on a nearby wall, sending you to Purple Cloud Mountain.\n\n\nThe start of this region is a linear mountain path lined with a few materials to harvest, and up ahead you'll hear the sounds of someone crying. The \"someone\" is actually a snake guai (named Hong Yi). The widower was forced out of her mountaintop village by insect guais led by the Scorpionlord, rendering her unable to retrieve her late husband's keepsakes.\n\nShe'll warn you of the dangerous venom of the enemies ahead, and you can even find a **Treasure Chest** near her that holds 3 Antimiasma Powder that will be incredibly useful when taking on the Scorpionlord.\n\nHead across the bridge to the right and grab a green Wisp, and go through the archway into the next larger area.\n\n## Valley of Blooms\n\nThe Lushleaf is a tree spirit that attacks fairly slowly, either stomping down or swinging its head in wide arcs to hit you -- though it can also perform a surprisingly fast low sweeping kick.\n\nIf you notice it make a strange gesture with its hands, it will summon two smaller tree-like enemies to assist it that can also perform a variety of kicks, but have much less health.",
    "img_below_text": "Watch for a Dragonfly Guai hiding in a left alcove as you move further up the path, and you'll find a large archway gate guarded by an empowered Snake Herbalist. Before charging in, you may notice a sloping path to the left of the gate where an archer waits, but there's another path just to the right across from where the Dragonfly Guai was.\n\nThis leads up to yet another Dragonfly Guai archer overlooking the gate who will ambush you if you try to attack the snake or his other archer friend.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chapter 4 Secret - Purple Cloud Mountain Walkthrough\n            - Section Title: Valley of Blooms\n\n            Context:\n            - Preceding Text: \"# Chapter 4 Secret - Purple Cloud Mountain Walkthrough\n\nThe Purple Cloud Mountain is a Secret Area found in Chapter 4's Webbed Hollow of Black Myth Wukong. Below you'll find a guide to accessing the mountain by defeating the Venom Daoist, and how to complete Hong Yi the Snake Guai's quest to defeat the Daoist Mi and Duskveil, as well as the formidable Scorpionlord.\n\n* **Jump to a Section:**\n* How to Access Purple Cloud Mountain\n* **Valley of Blooms**\n* **Bounds of Deity's Abode**\n- Yaoguai King - The Scorpionlord\n* **Petalfall Hamlet**\n- Yaoguai Chief - Daoist Mi\n* **Cloudnest Peak**\n- Yaoguai King - The Duskveil\n\nThis Chapter 4 Secret can only be accessed by finding and defeating the Venom Daoist in two different locations, and will transport you to a different location to fight a secret Yaoguai King and repair a Vessel that is instrumental in defeating the Hundred-Eyed Daoist Master.\n\n\nWhen the Venom Daoist is finally defeated, he'll point to a mural that will appear on a nearby wall, sending you to Purple Cloud Mountain.\n\n\nThe start of this region is a linear mountain path lined with a few materials to harvest, and up ahead you'll hear the sounds of someone crying. The \"someone\" is actually a snake guai (named Hong Yi). The widower was forced out of her mountaintop village by insect guais led by the Scorpionlord, rendering her unable to retrieve her late husband's keepsakes.\n\nShe'll warn you of the dangerous venom of the enemies ahead, and you can even find a **Treasure Chest** near her that holds 3 Antimiasma Powder that will be incredibly useful when taking on the Scorpionlord.\n\nHead across the bridge to the right and grab a green Wisp, and go through the archway into the next larger area.\n\n## Valley of Blooms\n\nThe Lushleaf is a tree spirit that attacks fairly slowly, either stomping down or swinging its head in wide arcs to hit you -- though it can also perform a surprisingly fast low sweeping kick.\n\nIf you notice it make a strange gesture with its hands, it will summon two smaller tree-like enemies to assist it that can also perform a variety of kicks, but have much less health.\"\n            - Following Text: \"Watch for a Dragonfly Guai hiding in a left alcove as you move further up the path, and you'll find a large archway gate guarded by an empowered Snake Herbalist. Before charging in, you may notice a sloping path to the left of the gate where an archer waits, but there's another path just to the right across from where the Dragonfly Guai was.\n\nThis leads up to yet another Dragonfly Guai archer overlooking the gate who will ambush you if you try to attack the snake or his other archer friend.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the \"Valley of Blooms\" section of the \"Purple Cloud Mountain Walkthrough\" in *Black Myth Wukong*. It describes the area as part of a secret region accessed after defeating the Venom Daoist. Players encounter Hong Yi, a snake guai, who warns of venomous enemies ahead. The area begins with a linear path and includes a treasure chest with useful items for upcoming challenges.\n\nImage Summary:  \nThe image shows a player character in a vibrant autumnal forest within the \"Valley of Blooms.\" The environment features lush foliage, rocky terrain, and a clear path ahead. A red arrow overlay points toward a side path on the right, likely indicating an optional or recommended route for exploration. The HUD displays the player's health, abilities, and resources, suggesting active gameplay.\n\nFollowing Text Summary:  \nThe following text provides guidance on navigating the area further. It warns of a hidden Dragonfly Guai in an alcove and describes a large archway gate guarded by a Snake Herbalist and archers. It also highlights alternative paths to flank the enemies, including a sloping path to the left and another path to the right."
}