{
    "chunk_id": 753861024822,
    "source_file": "Bamboo_Grove_Walkthrough.md",
    "h1_title": "Bamboo Grove Walkthrough",
    "h2_title": "Back Hills",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d5/Wukong_Bamboo_3.jpg",
    "alt_text": "Wukong Bamboo 3.jpg",
    "position_desc": 3,
    "img_above_text": "# Bamboo Grove Walkthrough\n\nThe Bamboo Grove is the second main region of Chapter 1's Black Wind Mountain in Black Myth: Wukong. Below you'll find a guide to the progressing through the grove and learning how to cultivate Spirits, accessing a secret realm, as well as how to defeat the many bosses of this area that include Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble.\n\n* **Jump to A Section:**\n* **Back Hills**\n* **Snake Trail**\n- Yaoguai Chief - Baw-Li-Guhh-Lang\n- Yaoguai Chief - Guangmo\n* **Marsh of the White Mist**\n- Boss FIght - Whiteclad Noble\n\n## Back Hills\n\nThe whip-wielding warrior will offer some interesting insight about the Black Wind King that rules over this mountain, and the greed and lies that have infected him and his people. While you’re here, you can interact with a small pillow in the middle of the cave to rest at a new **Meditation Spot** in front of the altar, granting you a new Skill Point.\n\nBack outside, continue on the main path taking out the three lesser wolves and harvesting Jade Lotus from the pond and Gentian on to the right of the path.",
    "img_below_text": "Look for some broken fencing path the plants on the right and you’ll find a new type of Wolf, the Wolf Sentinel, who uses a small halberd for quick slicing attacks. Dodge around them and his final jump attack before unleashing a charged attack of your own, and then loot the large wooden chest he was guarding to grab 270 **Will** and 2 **Stone Spirit**.\n\nContinue along the main narrow path and down some stairs until you see a large slab with a mural on it. Just to the right is a small alcove that holds a Snake-Head Mushroom you can harvest.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bamboo Grove Walkthrough\n            - Section Title: Back Hills\n\n            Context:\n            - Preceding Text: \"# Bamboo Grove Walkthrough\n\nThe Bamboo Grove is the second main region of Chapter 1's Black Wind Mountain in Black Myth: Wukong. Below you'll find a guide to the progressing through the grove and learning how to cultivate Spirits, accessing a secret realm, as well as how to defeat the many bosses of this area that include Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble.\n\n* **Jump to A Section:**\n* **Back Hills**\n* **Snake Trail**\n- Yaoguai Chief - Baw-Li-Guhh-Lang\n- Yaoguai Chief - Guangmo\n* **Marsh of the White Mist**\n- Boss FIght - Whiteclad Noble\n\n## Back Hills\n\nThe whip-wielding warrior will offer some interesting insight about the Black Wind King that rules over this mountain, and the greed and lies that have infected him and his people. While you’re here, you can interact with a small pillow in the middle of the cave to rest at a new **Meditation Spot** in front of the altar, granting you a new Skill Point.\n\nBack outside, continue on the main path taking out the three lesser wolves and harvesting Jade Lotus from the pond and Gentian on to the right of the path.\"\n            - Following Text: \"Look for some broken fencing path the plants on the right and you’ll find a new type of Wolf, the Wolf Sentinel, who uses a small halberd for quick slicing attacks. Dodge around them and his final jump attack before unleashing a charged attack of your own, and then loot the large wooden chest he was guarding to grab 270 **Will** and 2 **Stone Spirit**.\n\nContinue along the main narrow path and down some stairs until you see a large slab with a mural on it. Just to the right is a small alcove that holds a Snake-Head Mushroom you can harvest.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the \"Back Hills\" section of the Bamboo Grove Walkthrough in *Black Myth: Wukong*. It describes a whip-wielding warrior who provides insight into the Black Wind King and the corruption of his people. Players can rest at a Meditation Spot in a cave to gain a Skill Point before continuing along a path where they encounter lesser wolves and gather resources like Jade Lotus and Gentian.\n\nImage Summary:  \nThe image depicts an in-game combat scene from the \"Back Hills\" section of *Black Myth: Wukong*. A player character is engaged in a dynamic battle with a humanoid enemy wielding a glowing weapon. The environment features dense greenery, broken fencing, and a fallen log, suggesting the fight occurs on a forested path. The red arrow in the image highlights a specific environmental detail, possibly indicating an important location or route.\n\nFollowing Text Summary:  \nThe following text advises players to look for broken fencing near plants on the right to encounter a Wolf Sentinel, a new enemy wielding a halberd. Tips for defeating the Wolf Sentinel are provided, along with details about looting a chest containing Will and Stone Spirit. Players are then directed to continue down a narrow path to discover a mural and a Snake-Head Mushroom in a nearby alcove."
}