{
    "chunk_id": 740531066645,
    "source_file": "Baw-Li-Guhh-Baw.md",
    "h1_title": "Baw-Li-Guhh-Baw",
    "h2_title": "Baw-Li-Guhh-Baw Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1b/Wukong_LowerHollow_31.jpg",
    "alt_text": "Wukong LowerHollow 31.jpg",
    "position_desc": 6,
    "img_above_text": "# Baw-Li-Guhh-Baw\n\nBaw-Li-Guhh-Baw is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the lowest section of The Webbed Hollow, he is one of the many frog minibosses you can encounter in the game, though he sports a hidden surprise.\n\n* Rewards: Buddha's Left Hand (Key Item), Tadpole, Refined Iron Sand, 1562 Experience, 1449 Will\n\n\nBaw-Li-Guhh-Baw is an optional encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down past the Buddha's Right Hand and spying on the Spider Sisters, you can head down a long path with an optional passage through a fissure on the right.\n\nThis path will lead you to a ledge with an archer, and then right along the path above the main trail where the Lower Hollow Shrine is to where the frog boss waits in a flooded cavern. You can also climb up to the ledge from the Shrine by jumping and performing aerial heavy attacks.\n\n## Baw-Li-Guhh-Baw Boss Fight and Guide\n\nWhat used to be a standard straight tongue attack will now also retract while he fires to projectiles as the hand flicks its fingers to fire magic darts in quick succession, meaning even if you dodge the tongue-hand shooting out, you need to dodge when it retracts as well.",
    "img_below_text": "He can also wave the tongue-hand around in a haphazard fashion, making it weave in a large arc from side to side as it swipes at you three times, before rising high up to slam down at you (but you can use Rock Solid to send him tumbling back in surprise).",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Baw-Li-Guhh-Baw\n            - Section Title: Baw-Li-Guhh-Baw Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Baw-Li-Guhh-Baw\n\nBaw-Li-Guhh-Baw is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the lowest section of The Webbed Hollow, he is one of the many frog minibosses you can encounter in the game, though he sports a hidden surprise.\n\n* Rewards: Buddha's Left Hand (Key Item), Tadpole, Refined Iron Sand, 1562 Experience, 1449 Will\n\n\nBaw-Li-Guhh-Baw is an optional encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down past the Buddha's Right Hand and spying on the Spider Sisters, you can head down a long path with an optional passage through a fissure on the right.\n\nThis path will lead you to a ledge with an archer, and then right along the path above the main trail where the Lower Hollow Shrine is to where the frog boss waits in a flooded cavern. You can also climb up to the ledge from the Shrine by jumping and performing aerial heavy attacks.\n\n## Baw-Li-Guhh-Baw Boss Fight and Guide\n\nWhat used to be a standard straight tongue attack will now also retract while he fires to projectiles as the hand flicks its fingers to fire magic darts in quick succession, meaning even if you dodge the tongue-hand shooting out, you need to dodge when it retracts as well.\"\n            - Following Text: \"He can also wave the tongue-hand around in a haphazard fashion, making it weave in a large arc from side to side as it swipes at you three times, before rising high up to slam down at you (but you can use Rock Solid to send him tumbling back in surprise).\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Baw-Li-Guhh-Baw, an optional Yaoguai Chief boss encountered in Chapter 4 of *Black Myth Wukong*. Located in the Webbed Hollow, this frog-like miniboss features unique mechanics and rewards, such as Buddha's Left Hand (a key item), Tadpole, Refined Iron Sand, and experience points. The text describes the path leading to the boss's flooded cavern, emphasizing exploration and traversal mechanics.\n\nImage Summary:\nThe image depicts the boss fight against Baw-Li-Guhh-Baw in a dark, flooded cavern. The boss, a large amphibian-like creature with glowing green and blue features, is shown mid-action, likely attacking the player. The interface displays the boss's name and health bar, alongside combat abilities and consumable items available to the player, such as \"Rock Solid\" and \"Enhanced Tiger Subduing Pellets.\" The environment includes intricate stone architecture and dim lighting, enhancing the ominous atmosphere of the encounter.\n\nFollowing Text Summary:\nThe following text elaborates on Baw-Li-Guhh-Baw's attack patterns, including a haphazard tongue-hand swipe that arcs side to side and culminates in a slam. It suggests using the \"Rock Solid\" ability to counter the slam attack and stagger the boss, providing strategic advice for overcoming the encounter."
}