{
    "chunk_id": 95118523356,
    "source_file": "Yellow_Wind_Sage.md",
    "h1_title": "Yellow Wind Sage",
    "h2_title": "Yellow Wind Sage Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bb/Wukong_Yellow_62.jpg",
    "alt_text": "Wukong Yellow 62.jpg",
    "position_desc": 10,
    "img_above_text": "# Yellow Wind Sage\n\nThe Yellow Wind Sage is a required Yaoguai King and the final boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Located at the center of the large black tornado in the Yellow Wind Formation in the center of the region, you'll need two Key Items to open a path to him.\n\n* **Rewards:** Samahdi Wind Agate, Cold Iron Leaves x2, Refined Iron Sand x1, Silk x5, Yaoguai Core x2, Mind Core x1, 2583 Experience, 1944 Will\n\n\nWith both pieces, you can open the door where you defeated the King of Flowing Sands, or open up the temple cellar in the Crouching Tiger Temple, or slide down past the Rock Crash Platform to the Windseal Gate.\n\n## Yellow Wind Sage Boss Fight and Guide\n\nOnce you’ve carved out around a third of the Yellow Wind Sage’s health bar, things will get a little more scary. He’ll suddenly toss the head into the sky, and begin to sweep his spear around him to create a giant sandstorm — the power of the Samahdi Winds. Stay very clear of his repeated swings when this happens, as he’ll end the move with a giant whirling spin attack.",
    "img_below_text": "Note - if you have the Wind Tamer, you can use it now to fully negate the sandstorm and stop it from happening, which will also force him out of many of the attacks he uses in this phase. As an added bonus, using the Wind Tamer will also stun him for an extended period, so make use of it by hitting him with your biggest charged heavy strikes!\n\nIf you don’t have the Wind Tamer, he’ll vanish into the sandstorm, and instead send out giant sand copies of himself to strike at you in different directions. Since they are copies, you can’t really counter attack them, and they’ll fade away right after attacking:",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Yellow Wind Sage\n            - Section Title: Yellow Wind Sage Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Yellow Wind Sage\n\nThe Yellow Wind Sage is a required Yaoguai King and the final boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Located at the center of the large black tornado in the Yellow Wind Formation in the center of the region, you'll need two Key Items to open a path to him.\n\n* **Rewards:** Samahdi Wind Agate, Cold Iron Leaves x2, Refined Iron Sand x1, Silk x5, Yaoguai Core x2, Mind Core x1, 2583 Experience, 1944 Will\n\n\nWith both pieces, you can open the door where you defeated the King of Flowing Sands, or open up the temple cellar in the Crouching Tiger Temple, or slide down past the Rock Crash Platform to the Windseal Gate.\n\n## Yellow Wind Sage Boss Fight and Guide\n\nOnce you’ve carved out around a third of the Yellow Wind Sage’s health bar, things will get a little more scary. He’ll suddenly toss the head into the sky, and begin to sweep his spear around him to create a giant sandstorm — the power of the Samahdi Winds. Stay very clear of his repeated swings when this happens, as he’ll end the move with a giant whirling spin attack.\"\n            - Following Text: \"Note - if you have the Wind Tamer, you can use it now to fully negate the sandstorm and stop it from happening, which will also force him out of many of the attacks he uses in this phase. As an added bonus, using the Wind Tamer will also stun him for an extended period, so make use of it by hitting him with your biggest charged heavy strikes!\n\nIf you don’t have the Wind Tamer, he’ll vanish into the sandstorm, and instead send out giant sand copies of himself to strike at you in different directions. Since they are copies, you can’t really counter attack them, and they’ll fade away right after attacking:\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}