{
    "chunk_id": 85727969688,
    "source_file": "Crow_Diviner_Spirit.md",
    "h1_title": "Crow Diviner Spirit",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/17/Crow_Diviner.jpg",
    "alt_text": "Crow Diviner.jpg",
    "position_desc": 1,
    "img_above_text": "# Crow Diviner Spirit\n\nThe **Crow Diviner** is a foe that you will face off against in Black Myth: Wukong. Once defeated, the Crow Diviner offers up his Spirit for you to absorb, allowing you to use some of his powers for a short time. On this page, we will go over everything you need to know about the Crow Diviner, including where to find him, how to defeat him, and what power his Spirit gives you.\n\n* Crow Diviner Location\n* Crow Diviner Fight\n* Crow Diviner Spirit",
    "img_below_text": "## Crow Diviner Location\n\nThe Crow Diviner is lurking very close to the Brook of Bliss Keeper's Shrine in Chapter 3. To find him, head to the Shrine and look over the bridge opposite it. The lake that you see under the bridge is the lake where you can find the Crow Diviner. You can cross the bridge and make your way down the hill to reach the lake without getting any fall damage, or carefully jump down the cliff on the Shrine side.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Crow Diviner Spirit\n\n            Context:\n            - Preceding Text: \"# Crow Diviner Spirit\n\nThe **Crow Diviner** is a foe that you will face off against in Black Myth: Wukong. Once defeated, the Crow Diviner offers up his Spirit for you to absorb, allowing you to use some of his powers for a short time. On this page, we will go over everything you need to know about the Crow Diviner, including where to find him, how to defeat him, and what power his Spirit gives you.\n\n* Crow Diviner Location\n* Crow Diviner Fight\n* Crow Diviner Spirit\"\n            - Following Text: \"## Crow Diviner Location\n\nThe Crow Diviner is lurking very close to the Brook of Bliss Keeper's Shrine in Chapter 3. To find him, head to the Shrine and look over the bridge opposite it. The lake that you see under the bridge is the lake where you can find the Crow Diviner. You can cross the bridge and make your way down the hill to reach the lake without getting any fall damage, or carefully jump down the cliff on the Shrine side.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Crow Diviner, a foe encountered in *Black Myth: Wukong*. It explains that defeating the Crow Diviner allows the player to absorb his Spirit, granting temporary access to some of his powers. The section outlines key topics, including the Crow Diviner's location, the fight, and the abilities gained from his Spirit.\n\nImage Summary:  \nThe image depicts an in-game scene from *Black Myth: Wukong* where the player character, dressed in red and armed, is facing off against the Crow Diviner. The Crow Diviner, a humanoid figure wielding a staff and glowing with blue energy, is positioned in a shallow, snowy lake surrounded by rocky terrain. The image highlights the setting of the encounter and the combat-ready stance of both characters, emphasizing the tension of the upcoming battle.\n\nFollowing Text Summary:  \nThe following text provides detailed instructions on locating the Crow Diviner. It states that he can be found near the Brook of Bliss Keeper's Shrine in Chapter 3, specifically in the lake beneath the bridge opposite the Shrine. Directions are given for safely reaching the lake without taking fall damage."
}