{
    "chunk_id": 642291648533,
    "source_file": "Chapter_2_Secret_-_Kingdom_of_Sahali_Walkthrough.md",
    "h1_title": "Chapter 2 Secret - Kingdom of Sahali Walkthrough",
    "h2_title": "How to Access the Kingdom of Sahali",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4f/Wukong_Yellow_34.jpg",
    "alt_text": "Wukong Yellow 34.jpg",
    "position_desc": 6,
    "img_above_text": "# Chapter 2 Secret - Kingdom of Sahali Walkthrough\n\nThe Kingdom of Sahali is a Secret Area found in Chapter 2's Yellow Wind Ridge of Black Myth Wukong. Below you'll find a guide to accessing the kingdom of the past by undertaking the Drunk Boar's Questline to find a Sobering Stone, and how to defeat the Tiger Vanguard and secret Yaoguai King Boss, Fuban.\n\n* Jump to a Section:\n* **How to Access the Kingdom of Sahali**\n- Yaoguai Chief - \"Tiger Vanguard\"\n* **Sandgate Bound**\n- Yaoguai King - Fuban\n\nThis Chapter 2 Secret can only be accessed by meeting the Yellow-Robed Square in Fright Cliff (aka the Drunken Boar), and helping him in his search for the \"Realm of Gold\" which requires a few steps (and for you to best him in combat).\n\n## How to Access the Kingdom of Sahali\n\nWhen you return it to the Drunken Boar, he’ll thank you, and declare that he’s now off in search of a meaty meal. He doesn’t actually want you to get some for him, and will set off himself to the Crouching Tiger Temple.",
    "img_below_text": "At the temple entrance, start to head up the stairs, and then turn right before the top — opposite where the Meditation Spot is. You’ll find the Boar resting against a far wall under one of the giant tiger sculptures.He’ll complain of the poor meat quality, and instead ask that you bring him a **Jade Lotus**. If you don’t already have plenty gathered, you’ll find Jade Lotus to harvest in most ponds and bodies of water, like the one right at the start of the chapter.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chapter 2 Secret - Kingdom of Sahali Walkthrough\n            - Section Title: How to Access the Kingdom of Sahali\n\n            Context:\n            - Preceding Text: \"# Chapter 2 Secret - Kingdom of Sahali Walkthrough\n\nThe Kingdom of Sahali is a Secret Area found in Chapter 2's Yellow Wind Ridge of Black Myth Wukong. Below you'll find a guide to accessing the kingdom of the past by undertaking the Drunk Boar's Questline to find a Sobering Stone, and how to defeat the Tiger Vanguard and secret Yaoguai King Boss, Fuban.\n\n* Jump to a Section:\n* **How to Access the Kingdom of Sahali**\n- Yaoguai Chief - \"Tiger Vanguard\"\n* **Sandgate Bound**\n- Yaoguai King - Fuban\n\nThis Chapter 2 Secret can only be accessed by meeting the Yellow-Robed Square in Fright Cliff (aka the Drunken Boar), and helping him in his search for the \"Realm of Gold\" which requires a few steps (and for you to best him in combat).\n\n## How to Access the Kingdom of Sahali\n\nWhen you return it to the Drunken Boar, he’ll thank you, and declare that he’s now off in search of a meaty meal. He doesn’t actually want you to get some for him, and will set off himself to the Crouching Tiger Temple.\"\n            - Following Text: \"At the temple entrance, start to head up the stairs, and then turn right before the top — opposite where the Meditation Spot is. You’ll find the Boar resting against a far wall under one of the giant tiger sculptures.He’ll complain of the poor meat quality, and instead ask that you bring him a **Jade Lotus**. If you don’t already have plenty gathered, you’ll find Jade Lotus to harvest in most ponds and bodies of water, like the one right at the start of the chapter.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Kingdom of Sahali, a secret area in Chapter 2 of *Black Myth: Wukong*. Accessing this area involves completing the Drunken Boar's questline, which begins at Fright Cliff. After returning a Sobering Stone to the Boar, he sets off to Crouching Tiger Temple, where the next steps of the quest unfold.\n\nImage Summary:\nThe image depicts the player character standing near the Drunken Boar, who is resting against a wall at the Crouching Tiger Temple. The setting features intricate stone carvings, statues, and a large tiger sculpture, emphasizing the temple's significance. The dialogue at the bottom of the image reveals the Boar's request for a Jade Lotus, a key item needed to progress the quest.\n\nFollowing Text Summary:\nThe following text provides instructions for locating Jade Lotus, which the Boar requests. It mentions that Jade Lotus can be harvested from ponds and bodies of water, including one at the start of the chapter, helping players fulfill the Boar's request and continue the questline."
}