{
    "chunk_id": 357261961419,
    "source_file": "Gore-Eye_Daoist_Spirit.md",
    "h1_title": "Gore-Eye Daoist Spirit",
    "h2_title": "Gore-Eye Daoist Location",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7f/Gore_eye_daoist_2.png",
    "alt_text": "Gore eye daoist 2.png",
    "position_desc": 2,
    "img_above_text": "# Gore-Eye Daoist Spirit\n\n## Gore-Eye Daoist Location\n\nGore-Eye Daoist can be found after defeating both the Stone Vanguard and Tiger Vanguard bosses. After defeating them, return to the area where you fought the King of Flowing Sands and Second Rat Price and place the Keenness of Tiger and Keenness of Stone items into the receptacle by the large stone door. Open the door, head down the hill, and over the bridge to reach an open cave area with a statue carved into the rock face.",
    "img_below_text": "The Gore-Eye Daoist is guarding a Luojia Fragrant Vine that you can use to empower your Gourd. Don't forget to pluck it off the tree after absorbing the Gore-Eye Daoist's Spirit.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Gore-Eye Daoist Spirit\n            - Section Title: Gore-Eye Daoist Location\n\n            Context:\n            - Preceding Text: \"# Gore-Eye Daoist Spirit\n\n## Gore-Eye Daoist Location\n\nGore-Eye Daoist can be found after defeating both the Stone Vanguard and Tiger Vanguard bosses. After defeating them, return to the area where you fought the King of Flowing Sands and Second Rat Price and place the Keenness of Tiger and Keenness of Stone items into the receptacle by the large stone door. Open the door, head down the hill, and over the bridge to reach an open cave area with a statue carved into the rock face.\"\n            - Following Text: \"The Gore-Eye Daoist is guarding a Luojia Fragrant Vine that you can use to empower your Gourd. Don't forget to pluck it off the tree after absorbing the Gore-Eye Daoist's Spirit.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes how to locate the Gore-Eye Daoist. Players must defeat the Stone Vanguard and Tiger Vanguard bosses, then return to the area where the King of Flowing Sands and Second Rat Prince were fought. By placing specific items (Keenness of Tiger and Keenness of Stone) into a receptacle near a large stone door, the door opens, leading to a cave area where the Gore-Eye Daoist resides.\n\nImage Summary:\nThe image shows an in-game scene featuring a player character facing the Gore-Eye Daoist in a rocky, open cave environment. The Daoist appears as a hostile entity wielding a weapon, with glowing orange vines visible on a nearby tree. The player character is equipped with a staff-like weapon and has various abilities displayed in the user interface, indicating a combat encounter.\n\nFollowing Text Summary:\nThe following text highlights the reward for defeating the Gore-Eye Daoist. After absorbing the Daoist's spirit, players can collect a Luojia Fragrant Vine from the nearby tree, which can be used to enhance their Gourd."
}