{
    "chunk_id": 953360196140,
    "source_file": "Bamboo_Grove_Walkthrough.md",
    "h1_title": "Bamboo Grove Walkthrough",
    "h2_title": "Snake Trail",
    "h3_title": "Yaoguai Chief Mini-Boss Fight - Guangmou",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/10/Wukong_Bamboo_27.jpg",
    "alt_text": "Wukong Bamboo 27.jpg",
    "position_desc": 28,
    "img_above_text": "# Bamboo Grove Walkthrough\n\nThe Bamboo Grove is the second main region of Chapter 1's Black Wind Mountain in Black Myth: Wukong. Below you'll find a guide to the progressing through the grove and learning how to cultivate Spirits, accessing a secret realm, as well as how to defeat the many bosses of this area that include Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble.\n\n* **Jump to A Section:**\n* **Back Hills**\n* **Snake Trail**\n- Yaoguai Chief - Baw-Li-Guhh-Lang\n- Yaoguai Chief - Guangmo\n* **Marsh of the White Mist**\n- Boss FIght - Whiteclad Noble\n\n\nTo advance, keep heading up the stairway to cross the high bridge over the falls, where you’ll soon see the golden trail of a nearby shrine beckoning you left. Before making that turn, be sure to look to the right to find a small wooden gazebo with a small table, and open the small gold box on top to find a variety of medicines, including 2 **Tiger Subduing Pellets** , 1 **Evil Repelling Medicament** and 1 **Amplification Pellet**.\n\n## Snake Trail\n\nThis path leads to a marshy swamp area full of tall white reed flowers. Several Croaky enemies hide within them, so use your lock-on to identify them so you aren’t ambushed. However, as you make your way through the marsh toward a large stone mural in the cliffs, an optional mini-boss will leap out to fight you.\n\n\nTo proceed, look for a small dirt path lined by a few fires through the bamboo grove to a set of statues on either side of a small opening in the walls. On the other side, another large bamboo grove is home to a humble yet deadly Yaoguai Chief.\n\n### Yaoguai Chief Mini-Boss Fight - Guangmou\n\nAn interesting note is that he needs to control the orb’s direction, meaning you can cast Immobilize when he summons the orb to lock both him and his projectile in place, nullifying the attack!\n\nSometimes, he won’t even bother with the orb, and will simply wave his fan rapidly to create a tornado at your last known position, so staying mobile and pressing your attack can help you avoid these attacks.",
    "img_below_text": "Easily the most annoying move in his repertoire is when he calls out to his “Boys”. He’ll then summon a number of poisonous snakes out of the ground all over the arena, who will all spit venom at you around 5-6 times before vanishing. While they technically do have health bar, it’s not worth engaging with any of them — giving you two viable options: Run and dodge like crazy, or find a corner of the arena where you can see them all, and use your staff spin to nullify the projectiles. This last trick won’t last forever due to the stamina drain, and also due to Guangmou’s meddling during the summons, but it can provide a temporary respite.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bamboo Grove Walkthrough\n            - Section Title: Snake Trail\n            - Sub-Section Title: Yaoguai Chief Mini-Boss Fight - Guangmou\n\n            Context:\n            - Preceding Text: \"# Bamboo Grove Walkthrough\n\nThe Bamboo Grove is the second main region of Chapter 1's Black Wind Mountain in Black Myth: Wukong. Below you'll find a guide to the progressing through the grove and learning how to cultivate Spirits, accessing a secret realm, as well as how to defeat the many bosses of this area that include Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble.\n\n* **Jump to A Section:**\n* **Back Hills**\n* **Snake Trail**\n- Yaoguai Chief - Baw-Li-Guhh-Lang\n- Yaoguai Chief - Guangmo\n* **Marsh of the White Mist**\n- Boss FIght - Whiteclad Noble\n\n\nTo advance, keep heading up the stairway to cross the high bridge over the falls, where you’ll soon see the golden trail of a nearby shrine beckoning you left. Before making that turn, be sure to look to the right to find a small wooden gazebo with a small table, and open the small gold box on top to find a variety of medicines, including 2 **Tiger Subduing Pellets** , 1 **Evil Repelling Medicament** and 1 **Amplification Pellet**.\n\n## Snake Trail\n\nThis path leads to a marshy swamp area full of tall white reed flowers. Several Croaky enemies hide within them, so use your lock-on to identify them so you aren’t ambushed. However, as you make your way through the marsh toward a large stone mural in the cliffs, an optional mini-boss will leap out to fight you.\n\n\nTo proceed, look for a small dirt path lined by a few fires through the bamboo grove to a set of statues on either side of a small opening in the walls. On the other side, another large bamboo grove is home to a humble yet deadly Yaoguai Chief.\n\n### Yaoguai Chief Mini-Boss Fight - Guangmou\n\nAn interesting note is that he needs to control the orb’s direction, meaning you can cast Immobilize when he summons the orb to lock both him and his projectile in place, nullifying the attack!\n\nSometimes, he won’t even bother with the orb, and will simply wave his fan rapidly to create a tornado at your last known position, so staying mobile and pressing your attack can help you avoid these attacks.\"\n            - Following Text: \"Easily the most annoying move in his repertoire is when he calls out to his “Boys”. He’ll then summon a number of poisonous snakes out of the ground all over the arena, who will all spit venom at you around 5-6 times before vanishing. While they technically do have health bar, it’s not worth engaging with any of them — giving you two viable options: Run and dodge like crazy, or find a corner of the arena where you can see them all, and use your staff spin to nullify the projectiles. This last trick won’t last forever due to the stamina drain, and also due to Guangmou’s meddling during the summons, but it can provide a temporary respite.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text provides context for the Bamboo Grove area in *Black Myth: Wukong*, specifically focusing on the Snake Trail section. This path leads to a marshy swamp filled with enemies and culminates in an optional mini-boss fight against Guangmou, a Yaoguai Chief. Strategies for dealing with Guangmou's attacks, such as immobilizing his orb and staying mobile to avoid his tornado attack, are highlighted.\n\nImage Summary:  \nThe image depicts the mini-boss fight against Guangmou in the Snake Trail section of the Bamboo Grove. The player character is engaged in combat, dodging green venomous projectiles while Guangmou, the Yaoguai Chief, stands in the background preparing another attack. The interface shows the player's health and stamina bars, abilities, and Guangmou's name and health bar, emphasizing the intensity of the encounter.\n\nFollowing Text Summary:  \nThe following text elaborates on Guangmou's most troublesome attack, where he summons poisonous snakes that spit venom at the player. Strategies to counter this include dodging or using the staff spin to nullify projectiles temporarily, though stamina drain and Guangmou's interference make this tactic limited."
}