{
    "chunk_id": 352972982738,
    "source_file": "Snow_Fox_Questline.md",
    "h1_title": "Snow Fox Questline",
    "h2_title": "Where to Find the Snow Fox",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/ba/Snow_Fox_Questline_%284%29.png",
    "alt_text": "Snow Fox Questline \\(4\\).png",
    "position_desc": 2,
    "img_above_text": "# Snow Fox Questline\n\nThe Snow Fox is a character you can encounter in Chapter 3 of Black Myth: Wukong. Completing her side quest will unlock a secret boss for you to take on and a unique Curio.\n\n## Where to Find the Snow Fox\n\nTo meet the fox, progress through Chapter 3 until you get to the Valley of Ectascy section, which is toward the end. You'll eventually slide down a snowy slope, and arrive at the Forest of Felicity. To the left of the Forest of Felicity Keeper's Shrine, you'll see a skeletal body slumped against a post at the start of a wooden path.",
    "img_below_text": "Approach the body and interact with it, to learn about the fox guai whose soul resides in it. You'll need to keep prompting the fox to talk throughout this interaction, to learn the entire story of the fox being caught in a hunter's trap and rescued by a young scholar. Despite the fox trying to thank the scholar by helping him, the scholar ended up taking the fox's life. With revenge in mind, the fox has managed to track down the scholar, who is now a monk in the New Thunderclap Temple – a place you'll conveniently be visiting soon.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Snow Fox Questline\n            - Section Title: Where to Find the Snow Fox\n\n            Context:\n            - Preceding Text: \"# Snow Fox Questline\n\nThe Snow Fox is a character you can encounter in Chapter 3 of Black Myth: Wukong. Completing her side quest will unlock a secret boss for you to take on and a unique Curio.\n\n## Where to Find the Snow Fox\n\nTo meet the fox, progress through Chapter 3 until you get to the Valley of Ectascy section, which is toward the end. You'll eventually slide down a snowy slope, and arrive at the Forest of Felicity. To the left of the Forest of Felicity Keeper's Shrine, you'll see a skeletal body slumped against a post at the start of a wooden path.\"\n            - Following Text: \"Approach the body and interact with it, to learn about the fox guai whose soul resides in it. You'll need to keep prompting the fox to talk throughout this interaction, to learn the entire story of the fox being caught in a hunter's trap and rescued by a young scholar. Despite the fox trying to thank the scholar by helping him, the scholar ended up taking the fox's life. With revenge in mind, the fox has managed to track down the scholar, who is now a monk in the New Thunderclap Temple – a place you'll conveniently be visiting soon.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}