{
    "chunk_id": 349692910216,
    "source_file": "Centipede_Guai.md",
    "h1_title": "Centipede Guai",
    "h2_title": "Centipede Guai Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a8/Wukong_MiddleHollow_41.jpg",
    "alt_text": "Wukong MiddleHollow 41.jpg",
    "position_desc": 6,
    "img_above_text": "# Centipede Guai\n\nThe Centipede Guai is a required Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the middle section of The Webbed Hollow, this imposing insect guards the Bonevault leading down to the lower parts of the hollow.\n\n* Rewards: Centipede Guai Spirit, Gold Tree Core, Knot of Voidness, 2274 Experience, 1968 Will\n\n\nThe Centipede Guai is an main boss and non-missable encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down to the Vedure Bridge Shrine, you'll find two paths divering when you head right to find a group of buildings in the underground hollow.\n\nBoth will take you on a path to the Centipede Guai's lair, either by way of the Middle Hollow Shrine and dropping down a ledge guarded by Skeletal Snakes, or taking the other lower path to the Bonevault Shrine that leads to his domain.\n\n## Centipede Guai Boss Fight and Guide\n\nOne if its big main attacks can look scary at first until you understand the movement, and will start when it stands up but begins to crouch its body. The Centipede will roll into a ball and charge at you with alarming speed, and even bounce off walls to come back to hit you a second time.",
    "img_below_text": "While it does move fast, it's also extremely susceptible to a well-timed Rock Solid Deflection, and when done at the right time, will topple it to the ground. Use this period to unleash your focus points for a big hit, and it will struggle to rise and give you more time to Immobilize it and keep it vulnerable to more damage.\n\nBe sure to stay on guard when it finally does rise, as it can easily feint into a backward slam with its armored hide.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Centipede Guai\n            - Section Title: Centipede Guai Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Centipede Guai\n\nThe Centipede Guai is a required Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the middle section of The Webbed Hollow, this imposing insect guards the Bonevault leading down to the lower parts of the hollow.\n\n* Rewards: Centipede Guai Spirit, Gold Tree Core, Knot of Voidness, 2274 Experience, 1968 Will\n\n\nThe Centipede Guai is an main boss and non-missable encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down to the Vedure Bridge Shrine, you'll find two paths divering when you head right to find a group of buildings in the underground hollow.\n\nBoth will take you on a path to the Centipede Guai's lair, either by way of the Middle Hollow Shrine and dropping down a ledge guarded by Skeletal Snakes, or taking the other lower path to the Bonevault Shrine that leads to his domain.\n\n## Centipede Guai Boss Fight and Guide\n\nOne if its big main attacks can look scary at first until you understand the movement, and will start when it stands up but begins to crouch its body. The Centipede will roll into a ball and charge at you with alarming speed, and even bounce off walls to come back to hit you a second time.\"\n            - Following Text: \"While it does move fast, it's also extremely susceptible to a well-timed Rock Solid Deflection, and when done at the right time, will topple it to the ground. Use this period to unleash your focus points for a big hit, and it will struggle to rise and give you more time to Immobilize it and keep it vulnerable to more damage.\n\nBe sure to stay on guard when it finally does rise, as it can easily feint into a backward slam with its armored hide.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe Centipede Guai is a mandatory boss fight in Chapter 4 of *Black Myth: Wukong*, located in The Webbed Hollow. Players can reach its lair through two paths, encountering skeletal enemies along the way. The boss uses a rolling attack that can seem intimidating but is manageable with proper timing and strategy.\n\nImage Summary:  \nThe image depicts the Centipede Guai boss mid-battle, showcasing its massive, armored body and the player character engaging it with a glowing weapon. The dark, web-filled environment is littered with bones, emphasizing the eerie and dangerous setting. The boss's health bar and player abilities are visible, suggesting a critical moment in the fight.\n\nFollowing Text Summary:  \nThe following text provides strategies for countering the Centipede Guai's rolling attack, emphasizing the importance of a well-timed Rock Solid Deflection to topple the boss. This creates an opportunity to deal significant damage while it is vulnerable, but players must remain cautious of its feint attacks when it recovers."
}