{
    "chunk_id": 342982076567,
    "source_file": "The_Second_Sister.md",
    "h1_title": "The Second Sister",
    "h2_title": "Second Sister Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/12/Wukong_Lanxi_29.jpg",
    "alt_text": "Wukong Lanxi 29.jpg",
    "position_desc": 9,
    "img_above_text": "# The Second Sister\n\nThe Second Sister is a main Yaoguai Chief boss fight that you can encounter at the start of Chapter 4 of Black Myth Wukong. Located in the Village of Lanxi, the Second Sister is a large spider that guards the entrance to the Webbed Hollow.\n\n* Rewards: Venomous Hair, Gold Tree Core, 2274 Experience, 1933 Will\n\n\nThe Second Sister is a required boss that you'll encounter very early in the start of Chapter 4. Once you arrive at the Village of Lanxi, you'll need to proceed through the town and across a narrow bridge to find a Shrine for the Zhu Estate.\n\nNearby, there's a door you can interact with, and your friend Zhu Bajie will disguise the two of you to gain access, and then encounter the Second Sister.\n\n## Second Sister Boss Fight and Guide\n\nFinally, she can also perform a small leap and extend her front legs forward like spears as she lands, which may cause you to try and backpedal, only for her to follow up by shooting a quick projectile at you immediately afterward, which is both hard to spot and dodge.",
    "img_below_text": "Her moves can get even more unpredictable when she's low on health, often peppering in quick poison projectiles from her mouth, or somersaulting forward to slash at you. Continue to use the Thrust Stance to keep her talons at bay, and when having trouble, always look for when her front legs subtly shift their shape to become more distinct blades to know when the attack is coming.\n\nWith Zhu Bajie backing you up (and you can always fall back to let him heal you), The Second Sister won't be able to stand against the two of you for long. After she's been defeated, she'll make a mad dash to flee, but not before flinging something at Zhu Bajie, who shrugs it off, and then runs ahead to chase her down.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: The Second Sister\n            - Section Title: Second Sister Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# The Second Sister\n\nThe Second Sister is a main Yaoguai Chief boss fight that you can encounter at the start of Chapter 4 of Black Myth Wukong. Located in the Village of Lanxi, the Second Sister is a large spider that guards the entrance to the Webbed Hollow.\n\n* Rewards: Venomous Hair, Gold Tree Core, 2274 Experience, 1933 Will\n\n\nThe Second Sister is a required boss that you'll encounter very early in the start of Chapter 4. Once you arrive at the Village of Lanxi, you'll need to proceed through the town and across a narrow bridge to find a Shrine for the Zhu Estate.\n\nNearby, there's a door you can interact with, and your friend Zhu Bajie will disguise the two of you to gain access, and then encounter the Second Sister.\n\n## Second Sister Boss Fight and Guide\n\nFinally, she can also perform a small leap and extend her front legs forward like spears as she lands, which may cause you to try and backpedal, only for her to follow up by shooting a quick projectile at you immediately afterward, which is both hard to spot and dodge.\"\n            - Following Text: \"Her moves can get even more unpredictable when she's low on health, often peppering in quick poison projectiles from her mouth, or somersaulting forward to slash at you. Continue to use the Thrust Stance to keep her talons at bay, and when having trouble, always look for when her front legs subtly shift their shape to become more distinct blades to know when the attack is coming.\n\nWith Zhu Bajie backing you up (and you can always fall back to let him heal you), The Second Sister won't be able to stand against the two of you for long. After she's been defeated, she'll make a mad dash to flee, but not before flinging something at Zhu Bajie, who shrugs it off, and then runs ahead to chase her down.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}