{
    "chunk_id": 889768433,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "h1_title": "Fright Cliff Walkthrough",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/97/Wukong_Fright_1.jpg",
    "alt_text": "Wukong Fright 1.jpg",
    "position_desc": 2,
    "img_above_text": "# Fright Cliff Walkthrough\n\nFright Cliff is one of the two sub-regions you’ll need to explore in Chapter 2 of Black Myth Wukong in order to unlock the large sealed doors that lead to the end of the chapter. You can first reach this area by heading through the Sandgate Village and defeating the King of Flowing Sands and Second Rat Prince, and then crossing the bridge to the right of the sealed door.",
    "img_below_text": "As you cross the bridge, you can harvest some Licorice on the other side, and look to the left to spot a large archway in the distance, with a whirling black tornado even further left in a canyon separating the Fright Cliffs from the Crouching Tiger Temple.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fright Cliff Walkthrough\n\n            Context:\n            - Preceding Text: \"# Fright Cliff Walkthrough\n\nFright Cliff is one of the two sub-regions you’ll need to explore in Chapter 2 of Black Myth Wukong in order to unlock the large sealed doors that lead to the end of the chapter. You can first reach this area by heading through the Sandgate Village and defeating the King of Flowing Sands and Second Rat Prince, and then crossing the bridge to the right of the sealed door.\"\n            - Following Text: \"As you cross the bridge, you can harvest some Licorice on the other side, and look to the left to spot a large archway in the distance, with a whirling black tornado even further left in a canyon separating the Fright Cliffs from the Crouching Tiger Temple.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Fright Cliff, a sub-region in Chapter 2 of *Black Myth Wukong*. Players access this area by progressing through Sandgate Village, defeating key enemies like the King of Flowing Sands and Second Rat Prince, and crossing a bridge near a sealed door that leads to the chapter's conclusion.\n\nImage Summary:\nThe image depicts a player-character running through a rugged, desolate landscape toward a large, ornate archway embedded in rocky cliffs. The environment features dry grass, barren trees, and scattered debris, emphasizing the harsh and foreboding atmosphere of Fright Cliff. The visible game interface suggests this is an active gameplay moment, guiding the player toward the next objective.\n\nFollowing Text Summary:\nThe following text describes the area beyond the bridge, where players can gather Licorice and observe a large archway in the distance. It also mentions a whirling black tornado in a canyon that separates Fright Cliffs from the Crouching Tiger Temple, hinting at further exploration and environmental storytelling."
}