{
    "chunk_id": 23062076723,
    "source_file": "Captain_Kalpa-Wave.md",
    "h1_title": "Captain Kalpa-Wave",
    "h2_title": "Where to Find Captain Kalpa-Wave",
    "h3_title": "Captain Kalpa-Wave Miniboss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/93/Wukong_Longevity_25.jpg",
    "alt_text": "Wukong Longevity 25.jpg",
    "position_desc": 6,
    "img_above_text": "# Captain Kalpa-Wave\n\nCaptain Kalpa-Wave is an required miniboss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Guarding the entrance to the New Thunderclap Temple, you will have to defeat him to gain access to the final region of The New West.\n\n* **Rewards:** Spirit of Captain Kalpa-Wave, Mind Core, Refined Iron Sand, Random Materials, 1847 Experience, 1190 Will\n\n## Where to Find Captain Kalpa-Wave\n\nAs you approach, a large bloody miasma will block your advance. Once it congeals, you'll find yourself facing the last of the four captains.\n\n### Captain Kalpa-Wave Miniboss Fight and Guide\n\nThe real danger isn't the lotus itself, its what it leaves behind. Similar to that Frog Guai's ice attacks coating the area in frost, many of Kalpa-Wave's attacks (including stomps!) will leave behind large pools of blood. Stepping into any of these pools for a second will start to drain your health, so you'll need to steer clear of them at all costs!",
    "img_below_text": "Much of this fight will come down to being constantly mobile to evade the various pools of blood Kalpa-Wave will create, and find times after deflecting his projectiles to run up and unleash damage on the boss.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Captain Kalpa-Wave\n            - Section Title: Where to Find Captain Kalpa-Wave\n            - Sub-Section Title: Captain Kalpa-Wave Miniboss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Captain Kalpa-Wave\n\nCaptain Kalpa-Wave is an required miniboss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Guarding the entrance to the New Thunderclap Temple, you will have to defeat him to gain access to the final region of The New West.\n\n* **Rewards:** Spirit of Captain Kalpa-Wave, Mind Core, Refined Iron Sand, Random Materials, 1847 Experience, 1190 Will\n\n## Where to Find Captain Kalpa-Wave\n\nAs you approach, a large bloody miasma will block your advance. Once it congeals, you'll find yourself facing the last of the four captains.\n\n### Captain Kalpa-Wave Miniboss Fight and Guide\n\nThe real danger isn't the lotus itself, its what it leaves behind. Similar to that Frog Guai's ice attacks coating the area in frost, many of Kalpa-Wave's attacks (including stomps!) will leave behind large pools of blood. Stepping into any of these pools for a second will start to drain your health, so you'll need to steer clear of them at all costs!\"\n            - Following Text: \"Much of this fight will come down to being constantly mobile to evade the various pools of blood Kalpa-Wave will create, and find times after deflecting his projectiles to run up and unleash damage on the boss.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Captain Kalpa-Wave as a mandatory miniboss in Chapter 3 of Black Myth Wukong, guarding the entrance to the New Thunderclap Temple. Defeating him is essential to access the final region of The New West. Rewards for defeating him include various items and experience points.\n\nImage Summary:\nThe image depicts a scene from the game Black Myth Wukong, showing the player character engaged in combat with Captain Kalpa-Wave. The environment is snowy, with pools of blood visible on the ground, which are likely hazards that drain health if stepped on. The image serves to illustrate the miniboss fight, highlighting the visual elements of the encounter.\n\nFollowing Text Summary:\nThe following text advises players to remain mobile during the fight to avoid the blood pools created by Captain Kalpa-Wave's attacks. It suggests deflecting projectiles and finding opportunities to deal damage to the boss, emphasizing the importance of movement and strategy in overcoming this challenge."
}