{
    "chunk_id": 365173161736,
    "source_file": "Captain_Kalpa-Wave.md",
    "h1_title": "Captain Kalpa-Wave",
    "h2_title": "Where to Find Captain Kalpa-Wave",
    "h3_title": "Captain Kalpa-Wave Miniboss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b8/Wukong_Longevity_24.jpg",
    "alt_text": "Wukong Longevity 24.jpg",
    "position_desc": 5,
    "img_above_text": "# Captain Kalpa-Wave\n\nCaptain Kalpa-Wave is an required miniboss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Guarding the entrance to the New Thunderclap Temple, you will have to defeat him to gain access to the final region of The New West.\n\n* **Rewards:** Spirit of Captain Kalpa-Wave, Mind Core, Refined Iron Sand, Random Materials, 1847 Experience, 1190 Will\n\n## Where to Find Captain Kalpa-Wave\n\nAs you approach, a large bloody miasma will block your advance. Once it congeals, you'll find yourself facing the last of the four captains.\n\n### Captain Kalpa-Wave Miniboss Fight and Guide\n\nOther times he'll mix up his blood projectiles by also creating more blood, which include a stomp attack (or bending down to tilt the wings on its back) that generates a trail of blood heading in your direction. Dodge the blood trails, or they'll burst into a bloody lotus flowers that damage you as they erupt.",
    "img_below_text": "The real danger isn't the lotus itself, its what it leaves behind. Similar to that Frog Guai's ice attacks coating the area in frost, many of Kalpa-Wave's attacks (including stomps!) will leave behind large pools of blood. Stepping into any of these pools for a second will start to drain your health, so you'll need to steer clear of them at all costs!",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Captain Kalpa-Wave\n            - Section Title: Where to Find Captain Kalpa-Wave\n            - Sub-Section Title: Captain Kalpa-Wave Miniboss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Captain Kalpa-Wave\n\nCaptain Kalpa-Wave is an required miniboss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Guarding the entrance to the New Thunderclap Temple, you will have to defeat him to gain access to the final region of The New West.\n\n* **Rewards:** Spirit of Captain Kalpa-Wave, Mind Core, Refined Iron Sand, Random Materials, 1847 Experience, 1190 Will\n\n## Where to Find Captain Kalpa-Wave\n\nAs you approach, a large bloody miasma will block your advance. Once it congeals, you'll find yourself facing the last of the four captains.\n\n### Captain Kalpa-Wave Miniboss Fight and Guide\n\nOther times he'll mix up his blood projectiles by also creating more blood, which include a stomp attack (or bending down to tilt the wings on its back) that generates a trail of blood heading in your direction. Dodge the blood trails, or they'll burst into a bloody lotus flowers that damage you as they erupt.\"\n            - Following Text: \"The real danger isn't the lotus itself, its what it leaves behind. Similar to that Frog Guai's ice attacks coating the area in frost, many of Kalpa-Wave's attacks (including stomps!) will leave behind large pools of blood. Stepping into any of these pools for a second will start to drain your health, so you'll need to steer clear of them at all costs!\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Captain Kalpa-Wave as a required miniboss in Chapter 3 of the game Black Myth Wukong. This boss guards the entrance to the New Thunderclap Temple, and defeating him is necessary to access the final region of The New West. The text also mentions the rewards for defeating Captain Kalpa-Wave.\n\nImage Summary:\nThe image depicts a player character facing off against the miniboss Captain Kalpa-Wave in a snowy mountainous environment. The boss appears large and menacing, with a grotesque and monstrous appearance. The player's health and ability bars are visible, indicating an ongoing battle. This image serves to illustrate the miniboss fight described in the text.\n\nFollowing Text Summary:\nThe following text provides additional details about Captain Kalpa-Wave's attacks, emphasizing the danger of blood trails and pools left by his attacks. These pools can drain the player's health if stepped into, highlighting the need for strategic movement during the fight."
}