{
    "chunk_id": 360214429309,
    "source_file": "Green-Capped_Martialist.md",
    "h1_title": "Green-Capped Martialist",
    "h2_title": "Green-Capped Martialist Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/22/Wukong_Martial_4.jpg",
    "alt_text": "Wukong Martial 4.jpg",
    "position_desc": 10,
    "img_above_text": "# Green-Capped Martialist\n\nThe Green-Capped Martialist is an optional and secret Character Boss fight that you can encounter in Chapter 3 of Black Myth Wukong. This boss can only be fought by undertaking a Treasure Hunter's Quest that begins along the Bitter Lake and leads to the Valley of Ecstasy, where you'll have to uncover a secret Melon Field.\n\n* Rewards: Spell-Binder Spell, Cold Iron Leaves, Random Materials, 1847 Experience, 1190 Will\n\n\nAs you approach, the Treasure Hunter will reveal his true form and attack!\n\n## Green-Capped Martialist Boss Fight and Guide\n\nA second part of this attack will trigger a ring of projectiles around his chakram to zoom toward you, which you'll need to also dodge shortly after the first blast.",
    "img_below_text": "When this boss chooses to close the distance on you, he'll employ some deceitful moves, like tossing his chakram to the side of your position, making you think he's going to miss, or tossing it in an arc. In reality, he'll dash up to it and then grab it to swing in a large arc toward your position, creating a second chakram for a two-hit combo.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Green-Capped Martialist\n            - Section Title: Green-Capped Martialist Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Green-Capped Martialist\n\nThe Green-Capped Martialist is an optional and secret Character Boss fight that you can encounter in Chapter 3 of Black Myth Wukong. This boss can only be fought by undertaking a Treasure Hunter's Quest that begins along the Bitter Lake and leads to the Valley of Ecstasy, where you'll have to uncover a secret Melon Field.\n\n* Rewards: Spell-Binder Spell, Cold Iron Leaves, Random Materials, 1847 Experience, 1190 Will\n\n\nAs you approach, the Treasure Hunter will reveal his true form and attack!\n\n## Green-Capped Martialist Boss Fight and Guide\n\nA second part of this attack will trigger a ring of projectiles around his chakram to zoom toward you, which you'll need to also dodge shortly after the first blast.\"\n            - Following Text: \"When this boss chooses to close the distance on you, he'll employ some deceitful moves, like tossing his chakram to the side of your position, making you think he's going to miss, or tossing it in an arc. In reality, he'll dash up to it and then grab it to swing in a large arc toward your position, creating a second chakram for a two-hit combo.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe Green-Capped Martialist is a secret optional boss in *Black Myth: Wukong*, encountered during Chapter 3 as part of a Treasure Hunter's Quest. The quest involves uncovering a hidden Melon Field in the Valley of Ecstasy. Upon approach, the Treasure Hunter reveals his true form and initiates combat. Rewards for defeating this boss include items, materials, experience points, and a spell.\n\nImage Summary:\nThe image depicts an in-game combat scene featuring the Green-Capped Martialist boss fight. The boss is shown mid-action, tossing a chakram imbued with fiery effects, while the player character is positioned in the foreground, preparing to engage. The environment is a rocky, barren area with scattered snow patches, emphasizing the intensity of the battle. The health bar labeled \"Green-Capped Martialist\" and various player UI elements, such as health and abilities, are visible, indicating active gameplay.\n\nFollowing Text Summary:\nThe Green-Capped Martialist employs deceptive close-range tactics, such as throwing his chakram in misleading trajectories to trick the player. He then dashes to retrieve the chakram, executing a two-hit combo with a second chakram swing. Players must anticipate and adapt to these unpredictable moves during the fight."
}