{
    "chunk_id": 698891236454,
    "source_file": "Drinks.md",
    "h1_title": "Drinks",
    "h2_title": "Black Myth: Wukong Drinks Locations",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2f/Black-myth-wukong-loong-balm.jpg",
    "alt_text": "Black-myth-wukong-loong-balm.jpg",
    "position_desc": 8,
    "img_above_text": "# Drinks\n\nBlack Myth: Wukong has a selection of different Drinks you can equip that change the Gourd’s behavior. From restoring your health quickly, restoring it over time, or in alternative ways, the drink options allow you to pick an option that suits your playstyle.\n\nThese Gourd Drinks are rare in the game, and there are only a few different options to be found, mostly through exploration. You can also find individual Gourds and Soaks that provide additional perks.\n\n## Black Myth: Wukong Drinks Locations",
    "img_below_text": "",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Drinks\n            - Section Title: Black Myth: Wukong Drinks Locations\n\n            Context:\n            - Preceding Text: \"# Drinks\n\nBlack Myth: Wukong has a selection of different Drinks you can equip that change the Gourd’s behavior. From restoring your health quickly, restoring it over time, or in alternative ways, the drink options allow you to pick an option that suits your playstyle.\n\nThese Gourd Drinks are rare in the game, and there are only a few different options to be found, mostly through exploration. You can also find individual Gourds and Soaks that provide additional perks.\n\n## Black Myth: Wukong Drinks Locations\"\n            - Following Text: \"\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the concept of Drinks in *Black Myth: Wukong*, which are items that modify the behavior of the Gourd. These Drinks can restore health in various ways and are rare, found primarily through exploration. The text highlights their importance in tailoring gameplay to individual preferences.\n\nImage Summary:  \nThe image depicts an ornate, antique-style vessel resembling a gourd or flask, likely representing one of the Gourd Drinks mentioned in the preceding text. Its intricate design suggests it may be a significant or rare item in the game, aligning with the context of exploration and rarity.\n\nFollowing Text Summary:  \nThe following text is absent, but the section title \"Black Myth: Wukong Drinks Locations\" implies that further details or locations of these Drinks will be provided, expanding on the gameplay mechanics introduced earlier."
}