{
    "chunk_id": 280573652310,
    "source_file": "Baw-Li-Guhh-Baw.md",
    "h1_title": "Baw-Li-Guhh-Baw",
    "h2_title": "Baw-Li-Guhh-Baw Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/53/Wukong_LowerHollow_28.jpg",
    "alt_text": "Wukong LowerHollow 28.jpg",
    "position_desc": 2,
    "img_above_text": "# Baw-Li-Guhh-Baw\n\nBaw-Li-Guhh-Baw is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the lowest section of The Webbed Hollow, he is one of the many frog minibosses you can encounter in the game, though he sports a hidden surprise.\n\n* Rewards: Buddha's Left Hand (Key Item), Tadpole, Refined Iron Sand, 1562 Experience, 1449 Will\n\n\nBaw-Li-Guhh-Baw is an optional encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down past the Buddha's Right Hand and spying on the Spider Sisters, you can head down a long path with an optional passage through a fissure on the right.\n\nThis path will lead you to a ledge with an archer, and then right along the path above the main trail where the Lower Hollow Shrine is to where the frog boss waits in a flooded cavern. You can also climb up to the ledge from the Shrine by jumping and performing aerial heavy attacks.\n\n## Baw-Li-Guhh-Baw Boss Fight and Guide\n\nBy now you should be more than familiar with these frogs' basic attacks - the leaps, the swipes and backhands, the belly thrust, and the backward kicks. They'll likely deal a lot of damage on their own, which makes his unique attacks all the more terrifying.",
    "img_below_text": "After taking a bit of damage, Baw-Li-Guhh-Baw will rear back and spew out poison while looking above. This will cause a literal poison rain to cascade down, covering a huge portion of the arena in toxicity that will build your poison meter at an alarming rate. It is sometimes possible to Pillar Stance out of the poison, but the frog's repeated attacks will likely knock you down anyway.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Baw-Li-Guhh-Baw\n            - Section Title: Baw-Li-Guhh-Baw Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Baw-Li-Guhh-Baw\n\nBaw-Li-Guhh-Baw is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the lowest section of The Webbed Hollow, he is one of the many frog minibosses you can encounter in the game, though he sports a hidden surprise.\n\n* Rewards: Buddha's Left Hand (Key Item), Tadpole, Refined Iron Sand, 1562 Experience, 1449 Will\n\n\nBaw-Li-Guhh-Baw is an optional encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down past the Buddha's Right Hand and spying on the Spider Sisters, you can head down a long path with an optional passage through a fissure on the right.\n\nThis path will lead you to a ledge with an archer, and then right along the path above the main trail where the Lower Hollow Shrine is to where the frog boss waits in a flooded cavern. You can also climb up to the ledge from the Shrine by jumping and performing aerial heavy attacks.\n\n## Baw-Li-Guhh-Baw Boss Fight and Guide\n\nBy now you should be more than familiar with these frogs' basic attacks - the leaps, the swipes and backhands, the belly thrust, and the backward kicks. They'll likely deal a lot of damage on their own, which makes his unique attacks all the more terrifying.\"\n            - Following Text: \"After taking a bit of damage, Baw-Li-Guhh-Baw will rear back and spew out poison while looking above. This will cause a literal poison rain to cascade down, covering a huge portion of the arena in toxicity that will build your poison meter at an alarming rate. It is sometimes possible to Pillar Stance out of the poison, but the frog's repeated attacks will likely knock you down anyway.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Baw-Li-Guhh-Baw, an optional Yaoguai Chief boss in *Black Myth Wukong*, encountered in Chapter 4 within The Webbed Hollow. The text describes the boss's location, the path to reach him, and the rewards for defeating him. It also highlights the frog miniboss's basic attacks, which include leaps, swipes, belly thrusts, and backward kicks.\n\nImage Summary:  \nThe image depicts the boss fight against Baw-Li-Guhh-Baw in a flooded cavern. The scene shows the player character engaging the large frog-like boss, with the boss mid-action, spewing a green substance upward. The environment features reflective water, intricate carvings on the cavern walls, and a dimly lit, atmospheric setting. The player's health and ability bars, as well as combat-related icons, are visible on the screen, emphasizing the active gameplay.\n\nFollowing Text Summary:  \nThe following text explains one of Baw-Li-Guhh-Baw's unique attacks, where he spews poison into the air, causing a toxic rain that covers much of the arena. This attack rapidly builds the player's poison meter, making it difficult to avoid damage, especially as the boss's repeated strikes can interrupt attempts to evade or counter."
}