{
    "chunk_id": 205511361439,
    "source_file": "Fuban.md",
    "h1_title": "Fuban",
    "h2_title": "Fuban Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/15/Wukong_Sahali_30.jpg",
    "alt_text": "Wukong Sahali 30.jpg",
    "position_desc": 14,
    "img_above_text": "# Fuban\n\nFuban is a secret optional Yaoguai King boss fight that you can encounter in Chapter 2's secret area in Black Myth Wukong. Located in the Kingdom of Sahali locked away in the past, you'll need to help fulfill a drunken Boar's quest to access this area.\n\n* **Rewards:** Wind Tamer, Sky-Piercing Horn\n\n\nOnce you follow him through the large gate with the small crawlspace, you’ll find yourself overlooking an ancient and forgotten kingdom, and suddenly be transported into the past and into the Kingdom of Sahali.\n\nAfter besting the \"Tiger Vanguard\", you'll find none other than the Yellow Rat Sage, who needs your help defeating a giant scarab Guai in the sands below.\n\n## Fuban Boss Fight and Guide\n\nAfter he lands, you’ll be instructed to strike at its claws, so move yourself to the side and lock onto one of the front claws of the beast. Fuban won’t move around too much during this period, but may shake its head around requiring you to dodge a few slams.",
    "img_below_text": "Fuban can also slowly pull one of its claws back to then sweep upward in front of his face, which can damage you if you aren’t paying attention. If you’re worried about getting hit, you can also play it safe and stick with the Thrust Stance to hit its claws with a long range heavy attack.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fuban\n            - Section Title: Fuban Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Fuban\n\nFuban is a secret optional Yaoguai King boss fight that you can encounter in Chapter 2's secret area in Black Myth Wukong. Located in the Kingdom of Sahali locked away in the past, you'll need to help fulfill a drunken Boar's quest to access this area.\n\n* **Rewards:** Wind Tamer, Sky-Piercing Horn\n\n\nOnce you follow him through the large gate with the small crawlspace, you’ll find yourself overlooking an ancient and forgotten kingdom, and suddenly be transported into the past and into the Kingdom of Sahali.\n\nAfter besting the \"Tiger Vanguard\", you'll find none other than the Yellow Rat Sage, who needs your help defeating a giant scarab Guai in the sands below.\n\n## Fuban Boss Fight and Guide\n\nAfter he lands, you’ll be instructed to strike at its claws, so move yourself to the side and lock onto one of the front claws of the beast. Fuban won’t move around too much during this period, but may shake its head around requiring you to dodge a few slams.\"\n            - Following Text: \"Fuban can also slowly pull one of its claws back to then sweep upward in front of his face, which can damage you if you aren’t paying attention. If you’re worried about getting hit, you can also play it safe and stick with the Thrust Stance to hit its claws with a long range heavy attack.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Fuban as a secret optional boss in *Black Myth: Wukong*, encountered in Chapter 2's secret area within the Kingdom of Sahali. Players must assist a drunken Boar to access this area and are transported into the past. After defeating the \"Tiger Vanguard\" and meeting the Yellow Rat Sage, players are tasked with fighting Fuban, a giant scarab-like creature, by targeting its claws during the battle.\n\nImage Summary:  \nThe image depicts the intense combat against Fuban, the giant scarab-like boss. The player character is shown striking one of Fuban's claws in a sandy battlefield, with visible health bars and action icons indicating an active boss fight. The environment features desert terrain and distant structures, emphasizing the game's immersive setting.\n\nFollowing Text Summary:  \nThe following text elaborates on Fuban's attack patterns, describing a claw sweep that can deal damage if players are not attentive. It suggests using the Thrust Stance for safer, long-range heavy attacks to target the claws effectively."
}