{
    "chunk_id": 125018831799,
    "source_file": "Captain_Kalpa-Wave.md",
    "h1_title": "Captain Kalpa-Wave",
    "h2_title": "Where to Find Captain Kalpa-Wave",
    "h3_title": "Captain Kalpa-Wave Miniboss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b5/Wukong_Longevity_27.jpg",
    "alt_text": "Wukong Longevity 27.jpg",
    "position_desc": 9,
    "img_above_text": "# Captain Kalpa-Wave\n\nCaptain Kalpa-Wave is an required miniboss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Guarding the entrance to the New Thunderclap Temple, you will have to defeat him to gain access to the final region of The New West.\n\n* **Rewards:** Spirit of Captain Kalpa-Wave, Mind Core, Refined Iron Sand, Random Materials, 1847 Experience, 1190 Will\n\n## Where to Find Captain Kalpa-Wave\n\nAs you approach, a large bloody miasma will block your advance. Once it congeals, you'll find yourself facing the last of the four captains.\n\n### Captain Kalpa-Wave Miniboss Fight and Guide\n\nThe good news is Kalpa-Wave is extremely susceptible to getting knocked down. So long as you build up some focus points with light attacks where possible, you can use your Pillar Stance heavy attack with three focus points built up to send the boss crashing to the ground -- which is the perfect time to Immobilize him on the ground and go wild with Spirit Attacks and Transformations.",
    "img_below_text": "Beyond this, Kalpa-Wave doesn't have too many other variations on his moves, so as long as you avoid those blood pools, you'll be able to cut him down to size, and gain the Spirit of Captain Kalpa-Wave to add to your collection.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Captain Kalpa-Wave\n            - Section Title: Where to Find Captain Kalpa-Wave\n            - Sub-Section Title: Captain Kalpa-Wave Miniboss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Captain Kalpa-Wave\n\nCaptain Kalpa-Wave is an required miniboss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Guarding the entrance to the New Thunderclap Temple, you will have to defeat him to gain access to the final region of The New West.\n\n* **Rewards:** Spirit of Captain Kalpa-Wave, Mind Core, Refined Iron Sand, Random Materials, 1847 Experience, 1190 Will\n\n## Where to Find Captain Kalpa-Wave\n\nAs you approach, a large bloody miasma will block your advance. Once it congeals, you'll find yourself facing the last of the four captains.\n\n### Captain Kalpa-Wave Miniboss Fight and Guide\n\nThe good news is Kalpa-Wave is extremely susceptible to getting knocked down. So long as you build up some focus points with light attacks where possible, you can use your Pillar Stance heavy attack with three focus points built up to send the boss crashing to the ground -- which is the perfect time to Immobilize him on the ground and go wild with Spirit Attacks and Transformations.\"\n            - Following Text: \"Beyond this, Kalpa-Wave doesn't have too many other variations on his moves, so as long as you avoid those blood pools, you'll be able to cut him down to size, and gain the Spirit of Captain Kalpa-Wave to add to your collection.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Captain Kalpa-Wave as a required miniboss in Chapter 3 of Black Myth Wukong. He guards the entrance to the New Thunderclap Temple, and defeating him is necessary to access the final region of The New West. Rewards for defeating him include the Spirit of Captain Kalpa-Wave, Mind Core, Refined Iron Sand, Random Materials, 1847 Experience, and 1190 Will.\n\nImage Summary:\nThe image likely depicts the aftermath of the miniboss fight with Captain Kalpa-Wave, showcasing the rewards obtained. It features a character standing in front of an ancient temple structure, with a visual representation of the Mind Core material being collected. This reinforces the narrative of defeating Captain Kalpa-Wave to gain access to the temple and collect rewards.\n\nFollowing Text Summary:\nThe following text provides additional guidance for defeating Captain Kalpa-Wave, emphasizing his susceptibility to being knocked down. Players are advised to use light attacks to build focus points and then employ a heavy attack to immobilize him, allowing for Spirit Attacks and Transformations. The text also warns to avoid blood pools during the fight to successfully defeat him and collect the Spirit of Captain Kalpa-Wave."
}