{
    "chunk_id": 606763397441,
    "source_file": "Yellow_Loong.md",
    "h1_title": "Yellow Loong",
    "h2_title": "Where to Find Yellow Loong",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/94/Wukong_Sandgate_71.jpg",
    "alt_text": "Wukong Sandgate 71.jpg",
    "position_desc": 3,
    "img_above_text": "# Yellow Loong\n\nYellow Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 4 of Black Myth Wukong. Hiding across several rope bridges outside the middle of the Webbed Hollow, this boss can't be activated until you obtain a Key Item in the previous chapter. Yellow Loong is the final of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* Rewards: Golden Lining Transformation Spell, Sea-Supporting Tendon, Golden Carp Curio, Kun Steel, Loong Pearl, Mind Core, 6998 Experience, 5049 Will\n\n## Where to Find Yellow Loong\n\nHead through the Sandgate Village and defeat the King of Flowing Sand and his Second Rat Prince son. After defeating the pair (or only the son), head left from the boss arena and into the Valley of Despair.",
    "img_below_text": "Once you arrive in the large covered valley area, keep to the left to find a large lower platform by a slightly rounded red wall lined with small statues. At this point, if you did not kill the King of Flowing Sand, he’ll summon his other son, the First Rat Prince — otherwise you can use the Pungent Flesh Chunk to summon him yourself.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Yellow Loong\n            - Section Title: Where to Find Yellow Loong\n\n            Context:\n            - Preceding Text: \"# Yellow Loong\n\nYellow Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 4 of Black Myth Wukong. Hiding across several rope bridges outside the middle of the Webbed Hollow, this boss can't be activated until you obtain a Key Item in the previous chapter. Yellow Loong is the final of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* Rewards: Golden Lining Transformation Spell, Sea-Supporting Tendon, Golden Carp Curio, Kun Steel, Loong Pearl, Mind Core, 6998 Experience, 5049 Will\n\n## Where to Find Yellow Loong\n\nHead through the Sandgate Village and defeat the King of Flowing Sand and his Second Rat Prince son. After defeating the pair (or only the son), head left from the boss arena and into the Valley of Despair.\"\n            - Following Text: \"Once you arrive in the large covered valley area, keep to the left to find a large lower platform by a slightly rounded red wall lined with small statues. At this point, if you did not kill the King of Flowing Sand, he’ll summon his other son, the First Rat Prince — otherwise you can use the Pungent Flesh Chunk to summon him yourself.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}