{
    "chunk_id": 256537040900,
    "source_file": "Chapter_5_Secret_-_Bishui_Cave_Walkthrough.md",
    "h1_title": "Chapter 5 Secret - Bishui Cave Walkthrough",
    "h2_title": "Yaoguai King - Bishui Golden-Eyed Beast",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7b/Bishui_Cave_Walkthrough_%2844%29.png",
    "alt_text": "Bishui Cave Walkthrough \\(44\\).png",
    "position_desc": 19,
    "img_above_text": "# Chapter 5 Secret - Bishui Cave Walkthrough\n\nTo your left, immediately as you enter the room, you'll find the Purge Pit Keeper's Shrine.\n\n\nAfter activating the first of the Keeper's Shrines, face away from it and head to the right. Go down the stairs and to the end of the path to find a Meditation Spot.\n\nReturn to the Keeper's Shrine and continue past it, following the path to the right. Head down to the slope, collecting the green Wisp on the left and into the center of the room. As you reach the middle, you'll be met by the first of the bosses in this secret area.\n\n\nGet back to the path and go past the next two bull guards to find the Cave Depths Keeper's Shrine.\n\n\nDrop down toward the lava and go left into the ice-covered portion of the room. Open the chest on the right to collect Celestial Ribbon and a Mind Core.\n\nHead down to the left, and slide all the way down the slope. Here you'll reach the final Keeper's Shrine of the hidden area, called the Corridor of Fire and Ice.\n\n\nHead right from the Keeper's Shrine and go down the stairs. A cutscene will play as you drop down, and the Bishui Golden-Eyed Beast will appear.\n\n## Yaoguai King - Bishui Golden-Eyed Beast",
    "img_below_text": "The fight will begin immediately as the beast launches itself at you. It's extremely agile, and a lot of the fight will be the beast hurtling towards you, trying to take swipes at you. Despite this agility, you'll see familiar moves to other bosses you've encountered in this Chapter so far.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chapter 5 Secret - Bishui Cave Walkthrough\n            - Section Title: Yaoguai King - Bishui Golden-Eyed Beast\n\n            Context:\n            - Preceding Text: \"# Chapter 5 Secret - Bishui Cave Walkthrough\n\nTo your left, immediately as you enter the room, you'll find the Purge Pit Keeper's Shrine.\n\n\nAfter activating the first of the Keeper's Shrines, face away from it and head to the right. Go down the stairs and to the end of the path to find a Meditation Spot.\n\nReturn to the Keeper's Shrine and continue past it, following the path to the right. Head down to the slope, collecting the green Wisp on the left and into the center of the room. As you reach the middle, you'll be met by the first of the bosses in this secret area.\n\n\nGet back to the path and go past the next two bull guards to find the Cave Depths Keeper's Shrine.\n\n\nDrop down toward the lava and go left into the ice-covered portion of the room. Open the chest on the right to collect Celestial Ribbon and a Mind Core.\n\nHead down to the left, and slide all the way down the slope. Here you'll reach the final Keeper's Shrine of the hidden area, called the Corridor of Fire and Ice.\n\n\nHead right from the Keeper's Shrine and go down the stairs. A cutscene will play as you drop down, and the Bishui Golden-Eyed Beast will appear.\n\n## Yaoguai King - Bishui Golden-Eyed Beast\"\n            - Following Text: \"The fight will begin immediately as the beast launches itself at you. It's extremely agile, and a lot of the fight will be the beast hurtling towards you, trying to take swipes at you. Despite this agility, you'll see familiar moves to other bosses you've encountered in this Chapter so far.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the progression through Bishui Cave, detailing the discovery of Keeper's Shrines and collectible items. It culminates in reaching the Corridor of Fire and Ice, where a cutscene introduces the Bishui Golden-Eyed Beast, marking the start of a boss fight.\n\nImage Summary:\nThe image depicts the Bishui Golden-Eyed Beast, a large, menacing creature with glowing eyes, sharp claws, and an aggressive posture, lunging toward a player character. The setting is a dark, cavernous environment with icy and fiery elements, emphasizing the dramatic and dangerous nature of the encounter.\n\nFollowing Text Summary:\nThe following text explains the boss fight mechanics against the Bishui Golden-Eyed Beast, highlighting its agility and attack patterns. The beast uses familiar moves seen in earlier bosses, making the fight challenging but recognizable for players."
}