{
    "chunk_id": 589534611079,
    "source_file": "Earth_Wolf.md",
    "h1_title": "Earth Wolf",
    "h2_title": "Earth Wolf Miniboss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3f/Wukong_Sandgate_39.jpg",
    "alt_text": "Wukong Sandgate 39.jpg",
    "position_desc": 3,
    "img_above_text": "# Earth Wolf\n\nThe Earth Wolf is an optional Yaoguai Chief miniboss that you can encounter in Chapter 2 of Black Myth Wukong. As an optional foe, you can seek out this enemy to gain their Spirit power by defeating them inside the Sandgate Village.\n\n* Rewards: Earth Wolf Spirit\n\n\nTake the path to the right of the sealed gate, and fight past two Rat Captains while keeping the village shacks on your left. As you circle the area, you can find a pathway leading to an archway guarded by a Rat Archer and Rat Governor, and you'll find the boss inside.\n\n## Earth Wolf Miniboss Fight and Guide\n\nThis strange looking yaoguai has a lot of rushing attacks that are hard to get a sense of due to its attack patterns, and you’ll want to utilize your Immobilize spell for help interrupting these when possible.",
    "img_below_text": "It will often start the fight with a leaping attack, using its head to ram into you as it rolls when it hits the ground. Wait until it comes crashing down to dodge, then move along with it to keep attacking as it rights itself.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Earth Wolf\n            - Section Title: Earth Wolf Miniboss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Earth Wolf\n\nThe Earth Wolf is an optional Yaoguai Chief miniboss that you can encounter in Chapter 2 of Black Myth Wukong. As an optional foe, you can seek out this enemy to gain their Spirit power by defeating them inside the Sandgate Village.\n\n* Rewards: Earth Wolf Spirit\n\n\nTake the path to the right of the sealed gate, and fight past two Rat Captains while keeping the village shacks on your left. As you circle the area, you can find a pathway leading to an archway guarded by a Rat Archer and Rat Governor, and you'll find the boss inside.\n\n## Earth Wolf Miniboss Fight and Guide\n\nThis strange looking yaoguai has a lot of rushing attacks that are hard to get a sense of due to its attack patterns, and you’ll want to utilize your Immobilize spell for help interrupting these when possible.\"\n            - Following Text: \"It will often start the fight with a leaping attack, using its head to ram into you as it rolls when it hits the ground. Wait until it comes crashing down to dodge, then move along with it to keep attacking as it rights itself.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Earth Wolf, an optional miniboss in *Black Myth Wukong*, encountered in Chapter 2 at Sandgate Village. Players can defeat this Yaoguai Chief to obtain the Earth Wolf Spirit reward. Directions to the boss include navigating past Rat Captains, a Rat Archer, and a Rat Governor to reach the archway leading to the fight.\n\nImage Summary:\nThe image depicts the Earth Wolf miniboss in mid-air during a leaping attack, showcasing its aggressive combat style. The player character is positioned below, ready to engage, with visible health and ability icons indicating an active battle scenario. The environment features barren trees and rocky terrain, reinforcing the game's atmospheric setting.\n\nFollowing Text Summary:\nThe following text describes the Earth Wolf's leaping attack, where it uses its head to ram into the player while rolling upon landing. Players are advised to dodge after the crash and follow the boss's movements to continue attacking as it recovers."
}