{
    "chunk_id": 748759079349,
    "source_file": "Black_Loong.md",
    "h1_title": "Black Loong",
    "h2_title": "Black Loong Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2b/Wukong_BlackLoong_13.jpg",
    "alt_text": "Wukong BlackLoong 13.jpg",
    "position_desc": 19,
    "img_above_text": "# Black Loong\n\nBlack Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Hidden beyond a waterfall of sand in the Fright Cliff, you won't be able to encounter this boss until you obtain a Key Item elswhere in this chapter, Black Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* **Rewards:** Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n\n\nWith the Loong Scales, you'll be able to interact with the sandfall and remove it as a barrier, revealing a door behind it to take you into the Black Loong's lair.\n\n## Black Loong Boss Fight and Guide\nLuckily, just like the Yellow Wind Sage, you can negate this attack entirely by using the Wind Tamer Vessel gained from defeating the Fuban boss of the Chapter 2 Secret area. This will not only shatter the sandstorm, but stun him for several seconds as well!",
    "img_below_text": "Learning the electric ring dance is arguably the hardest part of this fight, as is evading his sandstorm if you can’t dissipate it. Immobilize can help you get some breathing room, but it’s harder to stagger him out of attacks, and even Rock Solid deflections aren’t guaranteed to stop his assaults. However, the Azure Dust Transformation can reliably keep him stumbling with many of its attacks, and sometimes even knock him out of his attempts to create rings of electricity altogether! You can also try using the Pluck of Many to disorient him with attacks on all sides, and use that time wisely to charge up your strikes when he’s distracted.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Black Loong\n            - Section Title: Black Loong Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Black Loong\n\nBlack Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Hidden beyond a waterfall of sand in the Fright Cliff, you won't be able to encounter this boss until you obtain a Key Item elswhere in this chapter, Black Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* **Rewards:** Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n\n\nWith the Loong Scales, you'll be able to interact with the sandfall and remove it as a barrier, revealing a door behind it to take you into the Black Loong's lair.\n\n## Black Loong Boss Fight and Guide\nLuckily, just like the Yellow Wind Sage, you can negate this attack entirely by using the Wind Tamer Vessel gained from defeating the Fuban boss of the Chapter 2 Secret area. This will not only shatter the sandstorm, but stun him for several seconds as well!\"\n            - Following Text: \"Learning the electric ring dance is arguably the hardest part of this fight, as is evading his sandstorm if you can’t dissipate it. Immobilize can help you get some breathing room, but it’s harder to stagger him out of attacks, and even Rock Solid deflections aren’t guaranteed to stop his assaults. However, the Azure Dust Transformation can reliably keep him stumbling with many of its attacks, and sometimes even knock him out of his attempts to create rings of electricity altogether! You can also try using the Pluck of Many to disorient him with attacks on all sides, and use that time wisely to charge up your strikes when he’s distracted.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Black Loong, a secret optional boss in *Black Myth: Wukong*, encountered in Chapter 2. Found behind a sandfall in the Fright Cliff, players must acquire the Loong Scales key item to access its lair. Defeating Black Loong rewards players with valuable crafting materials and items. The Wind Tamer Vessel can be used to counter its sandstorm attack, stunning the boss temporarily.\n\nImage Summary:\nThe image depicts gameplay during the Black Loong boss fight. The player character appears to be transformed into a powerful form, executing an attack or spell (\"Rockfall\") that causes area damage. The interface displays abilities such as \"Earth Shatter,\" \"Mountain Splitter,\" and \"Rockfall,\" alongside transformation options like \"Skullcrusher\" and \"De-Transform.\" The boss’s health bar, labeled \"Black Loong,\" is visible at the bottom, indicating active combat in a rocky, sand-filled environment.\n\nFollowing Text Summary:\nThe following text provides strategies for overcoming Black Loong’s challenging attacks, such as its electric ring and sandstorm. It suggests using abilities like Azure Dust Transformation to stagger the boss and disrupt its attacks, or the Pluck of Many to disorient it. These tactics allow players to create opportunities for charging strikes and managing the fight effectively."
}