{
    "chunk_id": 727460927111,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "h1_title": "Furnace Valley Walkthrough",
    "h2_title": "The Emerald Hall",
    "h3_title": "Missable Transformation Spell",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d6/Furnace_Valley_Walkthrough_%28109%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(109\\).png",
    "position_desc": 56,
    "img_above_text": "# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n\nOpen the giant door at the top of the stairs. Go straight ahead and activate the Rakshasa Palace Keeper's Shrine.\n\n\nInside here, you'll find the old man who gave you the gourd at the start of the game and an Awaken Wine Worm to the left.\n\nSpeak to the old man, and he'll tell you to find yourself a decent gourd (if you haven't already upgraded yours fully) and you can share a drink with him.\n\n\n## The Emerald Hall\n\nFrom The Emerald Hall Keeper's Shrine, go left and up the stairs. A cutscene will start to play, where you'll transform into a Cicada and fly toward the center of the hall. This is where you'll find Pingping speaking to her mother, Rakshasi, accompanied by the Keeper of the Flaming Mountains.\n\nAfter they discuss The Destined One obtaining the relics, the Keeper of the Flaming Mountains offers to care for Rakshashi, which Pingping protests. After he binds Pingping, Rakshashi is revealed to be Zhu Bajie transformed and it's time to take on the Keeper of the Flaming Mountains for yourself.\n\n\nWhen he's almost dead, he will then summon Ma Tianba for you to fight against.\n\n### Missable Transformation Spell\n\nTo continue along the main path head up the stairs and onto the ashen path. Follow it up and around to the left, crossing over the bridge and heading toward the archway in the distance.",
    "img_below_text": "Step through the archway and look to the left to see a treasure chest. Open this to find Blood of the Iron Bull and gold pieces. Proceed up the stairs to the right, past the bull guard, and fire will start to rain down on you -- which you know means another cart is not far off!",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Furnace Valley Walkthrough\n            - Section Title: The Emerald Hall\n            - Sub-Section Title: Missable Transformation Spell\n\n            Context:\n            - Preceding Text: \"# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n\nOpen the giant door at the top of the stairs. Go straight ahead and activate the Rakshasa Palace Keeper's Shrine.\n\n\nInside here, you'll find the old man who gave you the gourd at the start of the game and an Awaken Wine Worm to the left.\n\nSpeak to the old man, and he'll tell you to find yourself a decent gourd (if you haven't already upgraded yours fully) and you can share a drink with him.\n\n\n## The Emerald Hall\n\nFrom The Emerald Hall Keeper's Shrine, go left and up the stairs. A cutscene will start to play, where you'll transform into a Cicada and fly toward the center of the hall. This is where you'll find Pingping speaking to her mother, Rakshasi, accompanied by the Keeper of the Flaming Mountains.\n\nAfter they discuss The Destined One obtaining the relics, the Keeper of the Flaming Mountains offers to care for Rakshashi, which Pingping protests. After he binds Pingping, Rakshashi is revealed to be Zhu Bajie transformed and it's time to take on the Keeper of the Flaming Mountains for yourself.\n\n\nWhen he's almost dead, he will then summon Ma Tianba for you to fight against.\n\n### Missable Transformation Spell\n\nTo continue along the main path head up the stairs and onto the ashen path. Follow it up and around to the left, crossing over the bridge and heading toward the archway in the distance.\"\n            - Following Text: \"Step through the archway and look to the left to see a treasure chest. Open this to find Blood of the Iron Bull and gold pieces. Proceed up the stairs to the right, past the bull guard, and fire will start to rain down on you -- which you know means another cart is not far off!\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text describes the events leading up to the Emerald Hall in the game. After activating the Emerald Hall Keeper's Shrine, the player encounters a cutscene involving Pingping, her mother Rakshasi, and the Keeper of the Flaming Mountains. This culminates in a battle with the Keeper, and later, Ma Tianba is summoned as an additional challenge. The section sets the stage for exploration and combat within the Emerald Hall.\n\nImage Summary:  \nThe image depicts a section of the Emerald Hall environment. On the left, a treasure chest is highlighted, indicating a collectible item. To the right, a path is marked with an arrow, guiding the player toward the next area. A bull-like enemy stands in the distance, suggesting an upcoming encounter. The image serves as a visual aid to highlight exploration points and potential threats in the area.\n\nFollowing Text Summary:  \nThe following text provides guidance on what to do after the area shown in the image. It instructs the player to open the treasure chest on the left to collect Blood of the Iron Bull and gold pieces. The player is then directed to proceed up the stairs on the right, where they will face fire raining down, signaling the proximity of another elemental cart."
}