{
    "chunk_id": 641226637966,
    "source_file": "Crouching_Tiger_Temple_Walkthrough.md",
    "h1_title": "Crouching Tiger Temple Walkthrough",
    "h2_title": "Yaoguai King Boss Fight - Tiger Vanguard",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ec/Wukong_Tiger_5.jpg",
    "alt_text": "Wukong Tiger 5.jpg",
    "position_desc": 6,
    "img_above_text": "# Crouching Tiger Temple Walkthrough\n\nOnce you reach the top, you’ll come face to bloody face with the Tiger Vanguard, who looks like he just found his next meal.\n\n## Yaoguai King Boss Fight - Tiger Vanguard\n\nCompared to the slow and measured slams of the Stone Vanguard, the Tiger Vanguard is a relentless beast of a foe. You’ll need to be well prepared to take him down, and make sure you have the best armor and weapons crafted. If you haven’t been using them much before, now is also an excellent time to invest in crafting consumable medicines. Items like the Evil Repelling Medicament to reduce incoming damage, and the Tiger Subduing Pellets to increase your own.",
    "img_below_text": "Despite carrying a sword on his back, it’s the Tiger Vanguard’s fists you’ll need to worry about — at least for the start. He’ll use adapting martial arts moves with a mix of heavy punches, kicks, and slams that can come from any direction due to his agile movements.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Crouching Tiger Temple Walkthrough\n            - Section Title: Yaoguai King Boss Fight - Tiger Vanguard\n\n            Context:\n            - Preceding Text: \"# Crouching Tiger Temple Walkthrough\n\nOnce you reach the top, you’ll come face to bloody face with the Tiger Vanguard, who looks like he just found his next meal.\n\n## Yaoguai King Boss Fight - Tiger Vanguard\n\nCompared to the slow and measured slams of the Stone Vanguard, the Tiger Vanguard is a relentless beast of a foe. You’ll need to be well prepared to take him down, and make sure you have the best armor and weapons crafted. If you haven’t been using them much before, now is also an excellent time to invest in crafting consumable medicines. Items like the Evil Repelling Medicament to reduce incoming damage, and the Tiger Subduing Pellets to increase your own.\"\n            - Following Text: \"Despite carrying a sword on his back, it’s the Tiger Vanguard’s fists you’ll need to worry about — at least for the start. He’ll use adapting martial arts moves with a mix of heavy punches, kicks, and slams that can come from any direction due to his agile movements.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Tiger Vanguard, a ferocious boss encountered at the top of the Crouching Tiger Temple. It highlights the importance of preparation, including crafting strong armor, weapons, and consumable medicines like Evil Repelling Medicament and Tiger Subduing Pellets to aid in the fight.\n\nImage Summary:  \nThe image depicts an intense moment from the Yaoguai King Boss Fight against the Tiger Vanguard. The Tiger Vanguard, a large and agile beast, is mid-air, preparing to strike the player character, who is armed and poised for combat. The setting is a dramatic, open area with a reddish ground, likely symbolizing blood or danger, and the game's interface elements are visible, including health bars and consumable icons.\n\nFollowing Text Summary:  \nThe following text elaborates on the Tiger Vanguard’s combat style, emphasizing his reliance on martial arts moves, heavy punches, kicks, and slams. It warns players to be cautious of his agility and unpredictable attacks, which make him a formidable opponent."
}