{
    "chunk_id": 462443432182,
    "source_file": "Crow_Diviner_Spirit.md",
    "h1_title": "Crow Diviner Spirit",
    "h2_title": "Crow Diviner Spirit",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c7/Crow_Diviner_Power.png",
    "alt_text": "Crow Diviner Power.png",
    "position_desc": 3,
    "img_above_text": "# Crow Diviner Spirit\n\n\n\nThe Crow Diviner fights with a sword and deals frost damage. He also uses a skill that renders him almost invisible, making him blend into the white snow around the area. He's not completely invisible while using this move. You can still make out his outline just like you can still see yourself while using the Cloud Step spell, but it definitely complicates things all the same. Lock onto him so you don't lose him when he is using this skill.\n\n## Crow Diviner Spirit",
    "img_below_text": "* **Frigid Fragrance**\n* Equipped Effect: Moderately increases Chill Resistance.\n\nThe Crow Diviner's Spirit Power allows you to embody him for a short time and cover the surrounding area in a blanket of frost. This frost deals Frost Bane to both you and your enemies. Thankfully, the Crow Diviner's equipped effect makes you more resistant to Frost Bane, so it won't affect you as much as it will your foes.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Crow Diviner Spirit\n            - Section Title: Crow Diviner Spirit\n\n            Context:\n            - Preceding Text: \"# Crow Diviner Spirit\n\n\n\nThe Crow Diviner fights with a sword and deals frost damage. He also uses a skill that renders him almost invisible, making him blend into the white snow around the area. He's not completely invisible while using this move. You can still make out his outline just like you can still see yourself while using the Cloud Step spell, but it definitely complicates things all the same. Lock onto him so you don't lose him when he is using this skill.\n\n## Crow Diviner Spirit\"\n            - Following Text: \"* **Frigid Fragrance**\n* Equipped Effect: Moderately increases Chill Resistance.\n\nThe Crow Diviner's Spirit Power allows you to embody him for a short time and cover the surrounding area in a blanket of frost. This frost deals Frost Bane to both you and your enemies. Thankfully, the Crow Diviner's equipped effect makes you more resistant to Frost Bane, so it won't affect you as much as it will your foes.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Crow Diviner Spirit, a character who wields a sword and deals frost damage. It describes his ability to become nearly invisible by blending into the snowy environment, making combat more challenging. Players are advised to lock onto him to maintain visibility during his stealth move.\n\nImage Summary:  \nThe image showcases the Crow Diviner Spirit's equipment screen in a game interface. It highlights the \"Frigid Fragrance\" ability, which allows players to take the form of the Crow Diviner and scatter frost that inflicts Frost Bane on both allies and enemies. The equipped effect moderately increases Chill Resistance, mitigating the frost's impact on the player. The interface also displays character stats, resistance levels, and a selection of other spirits available for use.\n\nFollowing Text Summary:  \nThe following text elaborates on the Crow Diviner Spirit's power, emphasizing its ability to create a frost field that deals Frost Bane damage to all affected. The equipped effect enhances Chill Resistance, reducing the negative impact on the player while amplifying the effect on enemies."
}