{
    "chunk_id": 197258307463,
    "source_file": "Cloudy_Mist,_Misty_Cloud.md",
    "h1_title": "Cloudy Mist, Misty Cloud",
    "h2_title": "How to Find Cloudy Mist, Misty Cloud",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ec/Furnace_Valley_Walkthrough_%2845%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(45\\).png",
    "position_desc": 1,
    "img_above_text": "# Cloudy Mist, Misty Cloud\n\nCloudy Mist, Misty Cloud are a pair of Yaoguai Chiefs you'll fight before you reach The Emerald Hall in Chapter 5 in Black Myth: Wukong. This is the second duo of chiefs you'll fight in Chapter 5 and they'll try a number of tricks to disappear right before your eyes.\n\n## How to Find Cloudy Mist, Misty Cloud\n\nContinue up the path, past where you'll fight the Flint Chief. At the top, you'll reach a crossroads, where you can go left, or right. Take the path up to the right and at the top, you'll come to another archway and the start of Rakshasa Palace.",
    "img_below_text": "As soon as you pass through the archway, the next boss battle will begin and you'll discover who was responsible for the voices you heard earlier.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Cloudy Mist, Misty Cloud\n            - Section Title: How to Find Cloudy Mist, Misty Cloud\n\n            Context:\n            - Preceding Text: \"# Cloudy Mist, Misty Cloud\n\nCloudy Mist, Misty Cloud are a pair of Yaoguai Chiefs you'll fight before you reach The Emerald Hall in Chapter 5 in Black Myth: Wukong. This is the second duo of chiefs you'll fight in Chapter 5 and they'll try a number of tricks to disappear right before your eyes.\n\n## How to Find Cloudy Mist, Misty Cloud\n\nContinue up the path, past where you'll fight the Flint Chief. At the top, you'll reach a crossroads, where you can go left, or right. Take the path up to the right and at the top, you'll come to another archway and the start of Rakshasa Palace.\"\n            - Following Text: \"As soon as you pass through the archway, the next boss battle will begin and you'll discover who was responsible for the voices you heard earlier.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Yaoguai Chiefs, Cloudy Mist and Misty Cloud, who are encountered in Chapter 5 of *Black Myth: Wukong*. These bosses are located before reaching The Emerald Hall and employ disappearing tricks during combat. The text provides directions to their location, instructing players to follow the path past the Flint Chief, take the right-hand path at a crossroads, and proceed through an archway leading to Rakshasa Palace.\n\nImage Summary:\nThe image depicts a dark, atmospheric scene featuring an ancient, mystical archway leading to a grand structure illuminated by fiery, glowing elements. The setting appears to be a desolate and foreboding area, with intricate architectural details and a misty ambiance. This visual likely represents the archway described in the preceding text, marking the entrance to Rakshasa Palace and signaling the transition to the boss battle with Cloudy Mist and Misty Cloud.\n\nFollowing Text Summary:\nThe following text explains that upon passing through the archway shown in the image, the next boss battle begins. Players will confront the source of mysterious voices heard earlier, indicating the imminent encounter with Cloudy Mist and Misty Cloud."
}