{
    "chunk_id": 555002581040,
    "source_file": "Bamboo_Grove_Walkthrough.md",
    "h1_title": "Bamboo Grove Walkthrough",
    "h2_title": "Snake Trail",
    "h3_title": "Yaoguai Chief Mini-Boss Fight - Baw-Li-Guhh-Lang",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3f/Wukong_Bamboo_22.jpg",
    "alt_text": "Wukong Bamboo 22.jpg",
    "position_desc": 21,
    "img_above_text": "# Bamboo Grove Walkthrough\n\nThe Bamboo Grove is the second main region of Chapter 1's Black Wind Mountain in Black Myth: Wukong. Below you'll find a guide to the progressing through the grove and learning how to cultivate Spirits, accessing a secret realm, as well as how to defeat the many bosses of this area that include Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble.\n\n* **Jump to A Section:**\n* **Back Hills**\n* **Snake Trail**\n- Yaoguai Chief - Baw-Li-Guhh-Lang\n- Yaoguai Chief - Guangmo\n* **Marsh of the White Mist**\n- Boss FIght - Whiteclad Noble\n\n\nTo advance, keep heading up the stairway to cross the high bridge over the falls, where you’ll soon see the golden trail of a nearby shrine beckoning you left. Before making that turn, be sure to look to the right to find a small wooden gazebo with a small table, and open the small gold box on top to find a variety of medicines, including 2 **Tiger Subduing Pellets** , 1 **Evil Repelling Medicament** and 1 **Amplification Pellet**.\n\n## Snake Trail\n\nThis path leads to a marshy swamp area full of tall white reed flowers. Several Croaky enemies hide within them, so use your lock-on to identify them so you aren’t ambushed. However, as you make your way through the marsh toward a large stone mural in the cliffs, an optional mini-boss will leap out to fight you.\n\n### Yaoguai Chief Mini-Boss Fight - Baw-Li-Guhh-Lang\n\nThis bamboo forest is full of various Snake Patrollers, and a great amount of Skeletal Snake bones lying in wait and just waiting to ambush you as the bones awaken. Because of this, it’s best to proceed slowly through this region and alert the snakes one by one, defeating them as they come alive, and luring the living Snake Patrollers backward so your fights don’t attract more attention.",
    "img_below_text": "There’s just a few materials to find in this large circular grove, including more Snake-Head Mushroom — and one by a broken stone brazier that is actually a Fungiling in disguise. Much like the Ginsengling, these plant-head monsters are fairly durable and hit hard with a poleblade, so try to shut them down with Immobilize to press the attack while you can.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bamboo Grove Walkthrough\n            - Section Title: Snake Trail\n            - Sub-Section Title: Yaoguai Chief Mini-Boss Fight - Baw-Li-Guhh-Lang\n\n            Context:\n            - Preceding Text: \"# Bamboo Grove Walkthrough\n\nThe Bamboo Grove is the second main region of Chapter 1's Black Wind Mountain in Black Myth: Wukong. Below you'll find a guide to the progressing through the grove and learning how to cultivate Spirits, accessing a secret realm, as well as how to defeat the many bosses of this area that include Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble.\n\n* **Jump to A Section:**\n* **Back Hills**\n* **Snake Trail**\n- Yaoguai Chief - Baw-Li-Guhh-Lang\n- Yaoguai Chief - Guangmo\n* **Marsh of the White Mist**\n- Boss FIght - Whiteclad Noble\n\n\nTo advance, keep heading up the stairway to cross the high bridge over the falls, where you’ll soon see the golden trail of a nearby shrine beckoning you left. Before making that turn, be sure to look to the right to find a small wooden gazebo with a small table, and open the small gold box on top to find a variety of medicines, including 2 **Tiger Subduing Pellets** , 1 **Evil Repelling Medicament** and 1 **Amplification Pellet**.\n\n## Snake Trail\n\nThis path leads to a marshy swamp area full of tall white reed flowers. Several Croaky enemies hide within them, so use your lock-on to identify them so you aren’t ambushed. However, as you make your way through the marsh toward a large stone mural in the cliffs, an optional mini-boss will leap out to fight you.\n\n### Yaoguai Chief Mini-Boss Fight - Baw-Li-Guhh-Lang\n\nThis bamboo forest is full of various Snake Patrollers, and a great amount of Skeletal Snake bones lying in wait and just waiting to ambush you as the bones awaken. Because of this, it’s best to proceed slowly through this region and alert the snakes one by one, defeating them as they come alive, and luring the living Snake Patrollers backward so your fights don’t attract more attention.\"\n            - Following Text: \"There’s just a few materials to find in this large circular grove, including more Snake-Head Mushroom — and one by a broken stone brazier that is actually a Fungiling in disguise. Much like the Ginsengling, these plant-head monsters are fairly durable and hit hard with a poleblade, so try to shut them down with Immobilize to press the attack while you can.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Bamboo Grove region in *Black Myth: Wukong*, specifically focusing on the Snake Trail area. It describes the dangers of navigating through a marshy swamp filled with ambushing enemies like Croaky and skeletal snake bones. It also highlights the presence of an optional mini-boss, Yaoguai Chief Baw-Li-Guhh-Lang, who appears as players progress through the trail. The text advises caution and strategic combat to deal with the patrolling snakes and skeletal ambushes.\n\nImage Summary:  \nThe image depicts a combat encounter in the Bamboo Grove's Snake Trail area. The player character is engaged in a fight with a large, grotesque mini-boss, likely Yaoguai Chief Baw-Li-Guhh-Lang, near a small gazebo-like structure. The environment is dense with bamboo and foliage, emphasizing the forest setting. The player is actively attacking the boss, while the boss retaliates with a glowing attack, suggesting a challenging and dynamic fight. HUD elements indicate health, abilities, and combat readiness.\n\nFollowing Text Summary:  \nThe following text shifts focus to exploring the circular grove after the mini-boss encounter. It mentions collectible materials like Snake-Head Mushroom and warns of a disguised enemy, the Fungiling, near a broken stone brazier. These plant-based monsters are durable and wield poleblades, requiring immobilization tactics for effective combat."
}