{
    "chunk_id": 245057727556,
    "source_file": "Elder_Jinchi.md",
    "h1_title": "Elder Jinchi",
    "h2_title": "Where to Find Elder Jinchi",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3e/Wukong_Wolves_42.jpg",
    "alt_text": "Wukong Wolves 42.jpg",
    "position_desc": 1,
    "img_above_text": "# Elder Jinchi\n\nElder Jinchi is an optional secret Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located in a secret realm locked away in the past, you'll need to activate three bells in order to locate and defeat him.\n\n* **Rewards:** Fireproof Mantle, 2,000 Will\n\n## Where to Find Elder Jinchi\n\nThe only way to be transported to this secret area in Chapter 1 is by locating and interacting with three bells found around the Black Wind Mountain region. They can be rung in any order, and ringing the third bell will automatically transport you to the Secret Area, which you can then fast travel to and from as you wish. The three bells are located in the following regions:",
    "img_below_text": "* **Forest of Wolves** \\- From the Outside the Forest Shrine, you can head up the left path to a higher road leading to a rope bridge across a stream. Follow the path straight past the bridge to find an optional Yaoguai Chief named Guangzhi who drops the Red Tides Transformation Spell. At the far end of the arena, you’ll find the first bell.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Elder Jinchi\n            - Section Title: Where to Find Elder Jinchi\n\n            Context:\n            - Preceding Text: \"# Elder Jinchi\n\nElder Jinchi is an optional secret Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located in a secret realm locked away in the past, you'll need to activate three bells in order to locate and defeat him.\n\n* **Rewards:** Fireproof Mantle, 2,000 Will\n\n## Where to Find Elder Jinchi\n\nThe only way to be transported to this secret area in Chapter 1 is by locating and interacting with three bells found around the Black Wind Mountain region. They can be rung in any order, and ringing the third bell will automatically transport you to the Secret Area, which you can then fast travel to and from as you wish. The three bells are located in the following regions:\"\n            - Following Text: \"* **Forest of Wolves** \\- From the Outside the Forest Shrine, you can head up the left path to a higher road leading to a rope bridge across a stream. Follow the path straight past the bridge to find an optional Yaoguai Chief named Guangzhi who drops the Red Tides Transformation Spell. At the far end of the arena, you’ll find the first bell.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Elder Jinchi as an optional secret boss in *Black Myth Wukong*, accessible in Chapter 1. To locate him, players must activate three bells scattered across the Black Wind Mountain region. Ringing the third bell transports players to a secret area where Elder Jinchi can be fought.\n\nImage Summary:  \nThe image shows a player character approaching one of the three bells required to unlock the secret area leading to Elder Jinchi. The bell is located in a shrine-like structure surrounded by a forested environment. A red arrow highlights the bell's location, emphasizing its importance as an interactive object.\n\nFollowing Text Summary:  \nThe following text provides specific directions to the first bell, located in the Forest of Wolves. Players must navigate through a path near the Forest Shrine, cross a rope bridge, and defeat an optional Yaoguai Chief named Guangzhi before reaching the bell at the far end of the arena."
}