{
    "chunk_id": 879896434290,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "h1_title": "Fright Cliff Walkthrough",
    "h2_title": "Squall Hideout",
    "h3_title": "Yaoguai Chief Mini-Boss Fight - Mother of Stones",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c1/Wukong_Fright_34.jpg",
    "alt_text": "Wukong Fright 34.jpg",
    "position_desc": 35,
    "img_above_text": "# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n## Squall Hideout\n\n\nThe large cave entrance has a few paths, with the outer one on the right leading past another Pitstone to a wooden coffin chest holding 3 **Silk** and some **Will**.\n\n\nStart by luring the shieldless Spearbone out of range of the Blazebones above, then climb the stairs to rush down the projectile throwers. Be sure to look at the ruined home at the first landing below the first Blazebone for a yellow chest that has 2 **Yaoguai Core** and 3 **Tiny Piece of Gold**.\n\n\nAt the end of the crevice, you’ll find an unusual looking stone. He’s actually a Man-in-Stone, and claims to have been trapped within the rock form. He’s betting on one of the rock guai in the large cave nearby to hold the secrets to reversing his fate, and asks you to seek it out.\n\n\nAt the end of the cave path, you’ll find the object of the Man-in-Stone’s quest - an even larger statue embedded with shining blue crystals. Don’t get too enraptured that you miss a Poisestone along the walls trying to ambush you, though.\n\nUpon reaching the end of the large cave system where you’ll find the Mother of Stones, look for a large opening to the right to exit back outside and onto a cliff edge. There’s a raised platform here, and you’ll find another statue head to harvest its Buddha Eyeball.\n\n### Yaoguai Chief Mini-Boss Fight - Mother of Stones\n\nOnce all six Palestones are down, there’s nothing left that the Mother of Stones can do, so keep smacking it until the boss breaks apart. You’ll be awarded the **Stone Essence** Key Item, as well as some Stone Spirits and Yaoguai Cores.\n\nRest up, and then return to the Man-in-Stone. You may want to also clear out the Bladebones above him just so they don’t harass you as you try to turn in the Stone Essence.",
    "img_below_text": "Once you hand it over, the Man-in-Stone will burst out of the ground and declare you gullible for just giving it to him. That’s not very nice, and it sounds like he deserves a beatdown.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fright Cliff Walkthrough\n            - Section Title: Squall Hideout\n            - Sub-Section Title: Yaoguai Chief Mini-Boss Fight - Mother of Stones\n\n            Context:\n            - Preceding Text: \"# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n## Squall Hideout\n\n\nThe large cave entrance has a few paths, with the outer one on the right leading past another Pitstone to a wooden coffin chest holding 3 **Silk** and some **Will**.\n\n\nStart by luring the shieldless Spearbone out of range of the Blazebones above, then climb the stairs to rush down the projectile throwers. Be sure to look at the ruined home at the first landing below the first Blazebone for a yellow chest that has 2 **Yaoguai Core** and 3 **Tiny Piece of Gold**.\n\n\nAt the end of the crevice, you’ll find an unusual looking stone. He’s actually a Man-in-Stone, and claims to have been trapped within the rock form. He’s betting on one of the rock guai in the large cave nearby to hold the secrets to reversing his fate, and asks you to seek it out.\n\n\nAt the end of the cave path, you’ll find the object of the Man-in-Stone’s quest - an even larger statue embedded with shining blue crystals. Don’t get too enraptured that you miss a Poisestone along the walls trying to ambush you, though.\n\nUpon reaching the end of the large cave system where you’ll find the Mother of Stones, look for a large opening to the right to exit back outside and onto a cliff edge. There’s a raised platform here, and you’ll find another statue head to harvest its Buddha Eyeball.\n\n### Yaoguai Chief Mini-Boss Fight - Mother of Stones\n\nOnce all six Palestones are down, there’s nothing left that the Mother of Stones can do, so keep smacking it until the boss breaks apart. You’ll be awarded the **Stone Essence** Key Item, as well as some Stone Spirits and Yaoguai Cores.\n\nRest up, and then return to the Man-in-Stone. You may want to also clear out the Bladebones above him just so they don’t harass you as you try to turn in the Stone Essence.\"\n            - Following Text: \"Once you hand it over, the Man-in-Stone will burst out of the ground and declare you gullible for just giving it to him. That’s not very nice, and it sounds like he deserves a beatdown.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the progression through the Squall Hideout area in the game, leading up to the mini-boss fight against the Mother of Stones. Players are tasked with defeating six Palestones to weaken the boss and ultimately obtain the **Stone Essence** Key Item, along with other rewards. The text also mentions returning to the Man-in-Stone to deliver the Stone Essence, which is part of the narrative.\n\nImage Summary:\nThe image depicts a player character standing near the Man-in-Stone, who has emerged from the ground holding a glowing blue object, likely the **Stone Essence**. The environment features rocky terrain, a lit brazier, and carved statues in the background, suggesting a mystical or ancient setting. The text overlay reveals the Man-in-Stone mocking the player for being gullible after handing over the Stone Essence, setting the stage for a confrontation.\n\nFollowing Text Summary:\nThe following text explains that after handing over the Stone Essence, the Man-in-Stone betrays the player, mocking them for their gullibility. This betrayal leads to a fight, as the player is prompted to confront and defeat the Man-in-Stone for his deception."
}