{
    "chunk_id": 135556410027,
    "source_file": "Bishui_Golden-Eyed_Beast.md",
    "h1_title": "Bishui Golden-Eyed Beast",
    "h2_title": "Bishui Golden-Eyed Beast Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7b/Bishui_Cave_Walkthrough_%2844%29.png",
    "alt_text": "Bishui Cave Walkthrough \\(44\\).png",
    "position_desc": 2,
    "img_above_text": "# Bishui Golden-Eyed Beast\n\nBishui Golden-Eyed Beast is a secret Yaoguai King boss hidden in Chapter 5 of Chapter 5 in Black Myth: Wukong. You can find this ferocious beast at the end of the hidden area, with its two types of elemental attacks making it a difficult fight.\n\n\nHead right from the Keeper's Shrine and go down the stairs. A cutscene will play as you drop down, and the Bishui Golden-Eyed Beast will appear.\n\n## Bishui Golden-Eyed Beast Boss Fight and Guide",
    "img_below_text": "The fight will begin immediately as the beast launches itself at you. It's extremely agile, and a lot of the fight will be the beast hurtling towards you, trying to take swipes at you. Despite this agility, you'll see familiar moves to other bosses you've encountered in this Chapter so far.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bishui Golden-Eyed Beast\n            - Section Title: Bishui Golden-Eyed Beast Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Bishui Golden-Eyed Beast\n\nBishui Golden-Eyed Beast is a secret Yaoguai King boss hidden in Chapter 5 of Chapter 5 in Black Myth: Wukong. You can find this ferocious beast at the end of the hidden area, with its two types of elemental attacks making it a difficult fight.\n\n\nHead right from the Keeper's Shrine and go down the stairs. A cutscene will play as you drop down, and the Bishui Golden-Eyed Beast will appear.\n\n## Bishui Golden-Eyed Beast Boss Fight and Guide\"\n            - Following Text: \"The fight will begin immediately as the beast launches itself at you. It's extremely agile, and a lot of the fight will be the beast hurtling towards you, trying to take swipes at you. Despite this agility, you'll see familiar moves to other bosses you've encountered in this Chapter so far.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe Bishui Golden-Eyed Beast is introduced as a secret Yaoguai King boss in *Black Myth: Wukong*, hidden in Chapter 5. It resides in a hidden area and is known for its challenging fight due to its two elemental attack types. The player encounters the beast after descending stairs from the Keeper's Shrine, triggering a cutscene.\n\nImage Summary:  \nThe image depicts the Bishui Golden-Eyed Beast mid-attack, leaping aggressively toward the player character in a dark, cavernous setting. The player, illuminated by a glowing weapon or ability, appears to be preparing to defend or counter the attack. The environment features intricate stone carvings and a dimly lit, foreboding atmosphere, emphasizing the intensity of the boss fight.\n\nFollowing Text Summary:  \nThe fight begins with the Bishui Golden-Eyed Beast demonstrating its agility, frequently lunging at the player and attempting to strike. The beast's attack patterns include moves reminiscent of other bosses encountered earlier in the chapter, requiring players to adapt quickly."
}