{
    "chunk_id": 143574672723,
    "source_file": "Bitter_Lake_Walkthrough.md",
    "h1_title": "Bitter Lake Walkthrough",
    "h2_title": "North Shore of the Bitter Lake",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/05/Wukong_Bitter_2.jpg",
    "alt_text": "Wukong Bitter 2.jpg",
    "position_desc": 38,
    "img_above_text": "# Bitter Lake Walkthrough\n\nAs you draw close, you'll hear a voice coming from the cymbals, who is arguing with a woman refusing to let the trapped person out. With a loud gong, the trapped \"Admiral\" will use the cymbal to awaken a giant turtle whose mountainous shell you're actually standing on.\n\nAs the turtle begins to swim through the Bitter Seal, the woman will become aware of your presence, starting this new region off with a bang of a boss fight.\n\n\nAs long as your patient to wait for the right moments to get in close and attack, and make sure you're using shock-quelling medicine, you'll be able to come out on top. Even as Kang-Jin Star tries to flee in her dragon form, the Destined One will see to it that she crashes into the large cymbals, freeing the prisoner inside!\n\nThis imprisoned Pig Guai is none other than Zhu Bajie, who traveled with Sun Wukong during his adventures in Journey to the West!\n\n\nAs you start exploring the path over to the right, an echoing voice will lead you to a large open platform where dragon humanoid figure appears to be frozen in place with its fishing rod. If you interact with it while holding the Loong Scales, it will crackle to life, and begin a new secret boss fight.\n\n\nWhen he falls, you'll earn some Fine Gold Thread and another Loong Pearl, and can loot a nearby chest that appears for the Mountain-Shaking Claw material and Breath of Fire Soak for your Gourd. This new material will unlock the upgrade path for your Loongwreathe Staff into the Golden Loong Staff, but you'll need to find and defeat the last of the four Loongs to craft it.\n\nOnce you've had your fill of exploring the \"Turtle Island\", you can head to the front where the small Pig Guai stands waiting, and interact with him for the turtle to finally make its landing at the next part of the Bitter Lake.\n\n## North Shore of the Bitter Lake\n\nOnce you and Zhu Bajie drop down onto the shore of the lake, you'll find there are a couple different directions you can go in. Just ahead on the right you'll find the North Shore Shrine, with the shore extending in both directions for optional areas to explore with bosses. However, if you want to hurry ahead, you can also look for a frozen tunnel a little ways to the right and proceed in toward the Precept Corridor.\n\nSince there's a good deal of important optional stuff (including some that can be missed if you proceed too far!) we'll start off checking the left side of the shore when facing the away from the water.",
    "img_below_text": "The good news is Zhu Bajie has now agreed to accompany you, and despite his size, the little pig is a handy follower to have. Not only is he pretty adept with his rake weapon, and can also belch poison at enemies, he can also expel a healing mist to help you recover your health and save on using your gourd!",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bitter Lake Walkthrough\n            - Section Title: North Shore of the Bitter Lake\n\n            Context:\n            - Preceding Text: \"# Bitter Lake Walkthrough\n\nAs you draw close, you'll hear a voice coming from the cymbals, who is arguing with a woman refusing to let the trapped person out. With a loud gong, the trapped \"Admiral\" will use the cymbal to awaken a giant turtle whose mountainous shell you're actually standing on.\n\nAs the turtle begins to swim through the Bitter Seal, the woman will become aware of your presence, starting this new region off with a bang of a boss fight.\n\n\nAs long as your patient to wait for the right moments to get in close and attack, and make sure you're using shock-quelling medicine, you'll be able to come out on top. Even as Kang-Jin Star tries to flee in her dragon form, the Destined One will see to it that she crashes into the large cymbals, freeing the prisoner inside!\n\nThis imprisoned Pig Guai is none other than Zhu Bajie, who traveled with Sun Wukong during his adventures in Journey to the West!\n\n\nAs you start exploring the path over to the right, an echoing voice will lead you to a large open platform where dragon humanoid figure appears to be frozen in place with its fishing rod. If you interact with it while holding the Loong Scales, it will crackle to life, and begin a new secret boss fight.\n\n\nWhen he falls, you'll earn some Fine Gold Thread and another Loong Pearl, and can loot a nearby chest that appears for the Mountain-Shaking Claw material and Breath of Fire Soak for your Gourd. This new material will unlock the upgrade path for your Loongwreathe Staff into the Golden Loong Staff, but you'll need to find and defeat the last of the four Loongs to craft it.\n\nOnce you've had your fill of exploring the \"Turtle Island\", you can head to the front where the small Pig Guai stands waiting, and interact with him for the turtle to finally make its landing at the next part of the Bitter Lake.\n\n## North Shore of the Bitter Lake\n\nOnce you and Zhu Bajie drop down onto the shore of the lake, you'll find there are a couple different directions you can go in. Just ahead on the right you'll find the North Shore Shrine, with the shore extending in both directions for optional areas to explore with bosses. However, if you want to hurry ahead, you can also look for a frozen tunnel a little ways to the right and proceed in toward the Precept Corridor.\n\nSince there's a good deal of important optional stuff (including some that can be missed if you proceed too far!) we'll start off checking the left side of the shore when facing the away from the water.\"\n            - Following Text: \"The good news is Zhu Bajie has now agreed to accompany you, and despite his size, the little pig is a handy follower to have. Not only is he pretty adept with his rake weapon, and can also belch poison at enemies, he can also expel a healing mist to help you recover your health and save on using your gourd!\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text describes the events leading up to the North Shore of the Bitter Lake. After defeating a boss and freeing Zhu Bajie, the protagonist explores Turtle Island and collects valuable items. Zhu Bajie then guides the player to the North Shore, where new areas and challenges await, including optional bosses and key locations.\n\nImage Summary:  \nThe image depicts a snowy battlefield on the North Shore of the Bitter Lake. The player character, wielding a staff, is engaged in combat with humanoid enemies amidst a frozen landscape. The interface shows health and stamina bars, as well as abilities and items available for use, indicating active gameplay. The scene highlights the challenging environment and combat mechanics central to this section of the walkthrough.\n\nFollowing Text Summary:  \nThe following text explains that Zhu Bajie becomes a companion, offering support in combat with his rake weapon, poison attacks, and healing abilities. This makes him a valuable ally as the player explores the North Shore, where multiple paths and optional content can be pursued."
}