{
    "chunk_id": 194373407741,
    "source_file": "Chapter_2_Secret_-_Kingdom_of_Sahali_Walkthrough.md",
    "h1_title": "Chapter 2 Secret - Kingdom of Sahali Walkthrough",
    "h2_title": "How to Access the Kingdom of Sahali",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/55/Wukong_Yellow_33.jpg",
    "alt_text": "Wukong Yellow 33.jpg",
    "position_desc": 5,
    "img_above_text": "# Chapter 2 Secret - Kingdom of Sahali Walkthrough\n\nThe Kingdom of Sahali is a Secret Area found in Chapter 2's Yellow Wind Ridge of Black Myth Wukong. Below you'll find a guide to accessing the kingdom of the past by undertaking the Drunk Boar's Questline to find a Sobering Stone, and how to defeat the Tiger Vanguard and secret Yaoguai King Boss, Fuban.\n\n* Jump to a Section:\n* **How to Access the Kingdom of Sahali**\n- Yaoguai Chief - \"Tiger Vanguard\"\n* **Sandgate Bound**\n- Yaoguai King - Fuban\n\nThis Chapter 2 Secret can only be accessed by meeting the Yellow-Robed Square in Fright Cliff (aka the Drunken Boar), and helping him in his search for the \"Realm of Gold\" which requires a few steps (and for you to best him in combat).\n\n## How to Access the Kingdom of Sahali\n\n* To locate the stone itself, you’ll need to head through the Yellow Wind Formation to the Windrest Hamlet, which is across the Windrest Bridge up the road past the Crouching Tiger Temple. Once you enter the hamlet, take a left to find a large building guarded by a Rat Soldier and Rat Imperial Guard. On the left side when looking at the large building, defeat a Blazebone monster, and then look to the right for a small alcove, where you can spot a glowing pot. Break the pot, and you’ll find the **Sobering Stone**.",
    "img_below_text": "When you return it to the Drunken Boar, he’ll thank you, and declare that he’s now off in search of a meaty meal. He doesn’t actually want you to get some for him, and will set off himself to the Crouching Tiger Temple.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chapter 2 Secret - Kingdom of Sahali Walkthrough\n            - Section Title: How to Access the Kingdom of Sahali\n\n            Context:\n            - Preceding Text: \"# Chapter 2 Secret - Kingdom of Sahali Walkthrough\n\nThe Kingdom of Sahali is a Secret Area found in Chapter 2's Yellow Wind Ridge of Black Myth Wukong. Below you'll find a guide to accessing the kingdom of the past by undertaking the Drunk Boar's Questline to find a Sobering Stone, and how to defeat the Tiger Vanguard and secret Yaoguai King Boss, Fuban.\n\n* Jump to a Section:\n* **How to Access the Kingdom of Sahali**\n- Yaoguai Chief - \"Tiger Vanguard\"\n* **Sandgate Bound**\n- Yaoguai King - Fuban\n\nThis Chapter 2 Secret can only be accessed by meeting the Yellow-Robed Square in Fright Cliff (aka the Drunken Boar), and helping him in his search for the \"Realm of Gold\" which requires a few steps (and for you to best him in combat).\n\n## How to Access the Kingdom of Sahali\n\n* To locate the stone itself, you’ll need to head through the Yellow Wind Formation to the Windrest Hamlet, which is across the Windrest Bridge up the road past the Crouching Tiger Temple. Once you enter the hamlet, take a left to find a large building guarded by a Rat Soldier and Rat Imperial Guard. On the left side when looking at the large building, defeat a Blazebone monster, and then look to the right for a small alcove, where you can spot a glowing pot. Break the pot, and you’ll find the **Sobering Stone**.\"\n            - Following Text: \"When you return it to the Drunken Boar, he’ll thank you, and declare that he’s now off in search of a meaty meal. He doesn’t actually want you to get some for him, and will set off himself to the Crouching Tiger Temple.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text provides instructions on how to access the Kingdom of Sahali, a secret area in Chapter 2 of *Black Myth: Wukong*. It explains that players must complete the Drunken Boar's questline by finding the Sobering Stone, which is located in Windrest Hamlet after defeating specific enemies and breaking a glowing pot. This quest is part of the process to unlock the secret area.\n\nImage Summary:\nThe image depicts the Drunken Boar character interacting with the player in a rocky, outdoor setting. The Drunken Boar is a large humanoid creature with boar-like features, standing near a small altar with a candle and other objects. The player character is facing the Drunken Boar, suggesting a dialogue or quest progression. The text at the bottom of the image reads: \"The Temple of Crouching Tiger, they say there's meat there. Worth a look!\" This indicates the Drunken Boar is providing a hint or direction related to the next step in the quest.\n\nFollowing Text Summary:\nThe following text explains that after receiving the Sobering Stone, the Drunken Boar expresses gratitude and announces his intention to search for a meaty meal at the Crouching Tiger Temple. This marks the continuation of the questline, with the player not required to provide the meal but instead following the Boar's lead to the next location."
}