{
    "chunk_id": 822176776843,
    "source_file": "Daoist_Mi.md",
    "h1_title": "Daoist Mi",
    "h2_title": "Daoist Mi Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/92/Wukong_PurpleCloud_51.jpg",
    "alt_text": "Wukong PurpleCloud 51.jpg",
    "position_desc": 9,
    "img_above_text": "# Daoist Mi\n\nThe Daoist Mi is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the secret area of the Purple Cloud Mountain, the Daoist Mi will have a quest for you before you can face him in battle.\n\n* Rewards: Violet Hail Transformation Spell, Refined Iron Sand, 1562 Experience, 1451 Will\n\n\nHowever, once you return it to him, he'll reveal that he want the egg's power all to himself, and is willing to kill for it.\n\n## Daoist Mi Boss Fight and Guide\n\nMuch of the worm's moves rely on stumbling and staggering slashes with their long poisonous appendage, either thrusting forward or dragging it along the ground toward you. While they can be a little unpredictable, they still move very slowly.",
    "img_below_text": "The one big new move that Daoist Mi can use in this form is spewing a lot more poison across the arena. In particular, if they arch backwards for a long moment before getting up, they'll run towards you while spewing poison in every possible direction. Knowing this in advance, simply keep your distance or prepare a charged thrust attack to repel them.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Daoist Mi\n            - Section Title: Daoist Mi Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Daoist Mi\n\nThe Daoist Mi is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the secret area of the Purple Cloud Mountain, the Daoist Mi will have a quest for you before you can face him in battle.\n\n* Rewards: Violet Hail Transformation Spell, Refined Iron Sand, 1562 Experience, 1451 Will\n\n\nHowever, once you return it to him, he'll reveal that he want the egg's power all to himself, and is willing to kill for it.\n\n## Daoist Mi Boss Fight and Guide\n\nMuch of the worm's moves rely on stumbling and staggering slashes with their long poisonous appendage, either thrusting forward or dragging it along the ground toward you. While they can be a little unpredictable, they still move very slowly.\"\n            - Following Text: \"The one big new move that Daoist Mi can use in this form is spewing a lot more poison across the arena. In particular, if they arch backwards for a long moment before getting up, they'll run towards you while spewing poison in every possible direction. Knowing this in advance, simply keep your distance or prepare a charged thrust attack to repel them.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Daoist Mi as an optional boss encounter in *Black Myth: Wukong*, found in Chapter 4 within the Purple Cloud Mountain area. Before the fight, Daoist Mi tasks the player with retrieving an egg, but upon returning, he reveals his intent to claim the egg's power for himself, leading to a confrontation. The text also outlines rewards for defeating him and describes the boss's slow but unpredictable attacks using a poisonous appendage.\n\nImage Summary:\nThe image depicts the boss fight against Daoist Mi in *Black Myth: Wukong*. The player character is engaged in combat in an outdoor arena surrounded by autumnal trees and rocky terrain. Daoist Mi is shown emitting poison, which appears to be a key mechanic of the fight. The interface displays health bars, abilities, and status effects, emphasizing the strategic nature of the encounter.\n\nFollowing Text Summary:\nThe following text elaborates on a specific move used by Daoist Mi during the fight, where he spews poison across the arena while rushing toward the player. It advises maintaining distance or preparing a charged thrust attack to counter this move effectively, emphasizing the importance of anticipating his actions."
}