{
    "chunk_id": 375115056781,
    "source_file": "Coconut_Wine.md",
    "h1_title": "Coconut Wine",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/89/Coconut_Wine.jpg",
    "alt_text": "Coconut Wine.jpg",
    "position_desc": 1,
    "img_above_text": "# Coconut Wine\n\nCoconut Wine is the default drink in Black Myth: Wukong, so it can't be found. It is given to you at the start of Chapter 1. Compared to the other Drinks in the game, it offers the most basic buff, but arguably the best for the Gourds.",
    "img_below_text": "With the Coconut Wine equipped, you will restore 33% of your maximum health with each Gourd use by default. However, as with all Drinks, the potency of this can be increased by finding the Awoken Wine Worm locations around each of the game's chapters. Our guide has all of their locations for you.\n\nYou can then use these unique Crafting Materials to upgrade the Drink at the Shen Monkey Vendor in Bamboo Grove within Black Wind Mountain. Each upgrade will provide a sizeable buff to your healing potential, but as you level the Drink up, more Awoken Wine Worms will be needed.\n\nThis carries over to New Game Plus too, as you can upgrade your Drinks even more, but once again more Awoken Wine Worms will be needed, so you will have to recollect them all in your new game plus run.\n\nDespite the Coconut Wine being the first Drink you get, chances are you will stick with it for most of your playthrough, unless you are keen to play in a specific way, healing in an alternative way, or want to sacrifice some of your healing potential overall.\n\nThere aren't too many Drinks in the game compared to the Soaks, so be sure to keep your eye out for them. Although, they tend to be located close to the main path through a chapter or area. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Coconut Wine\n\n            Context:\n            - Preceding Text: \"# Coconut Wine\n\nCoconut Wine is the default drink in Black Myth: Wukong, so it can't be found. It is given to you at the start of Chapter 1. Compared to the other Drinks in the game, it offers the most basic buff, but arguably the best for the Gourds.\"\n            - Following Text: \"With the Coconut Wine equipped, you will restore 33% of your maximum health with each Gourd use by default. However, as with all Drinks, the potency of this can be increased by finding the Awoken Wine Worm locations around each of the game's chapters. Our guide has all of their locations for you.\n\nYou can then use these unique Crafting Materials to upgrade the Drink at the Shen Monkey Vendor in Bamboo Grove within Black Wind Mountain. Each upgrade will provide a sizeable buff to your healing potential, but as you level the Drink up, more Awoken Wine Worms will be needed.\n\nThis carries over to New Game Plus too, as you can upgrade your Drinks even more, but once again more Awoken Wine Worms will be needed, so you will have to recollect them all in your new game plus run.\n\nDespite the Coconut Wine being the first Drink you get, chances are you will stick with it for most of your playthrough, unless you are keen to play in a specific way, healing in an alternative way, or want to sacrifice some of your healing potential overall.\n\nThere aren't too many Drinks in the game compared to the Soaks, so be sure to keep your eye out for them. Although, they tend to be located close to the main path through a chapter or area. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Coconut Wine as the default drink in the game Black Myth: Wukong, given to players at the start of Chapter 1. It provides a basic but effective buff for healing, especially when using Gourds.\n\nImage Summary:\nThe image displays the inventory screen from the game Black Myth: Wukong, highlighting the Coconut Wine item. It is categorized as a common drink, with the description noting that each sip restores 33% of maximum health. The image serves to visually represent the item and its basic function within the game.\n\nFollowing Text Summary:\nThe following text explains that equipping Coconut Wine allows players to restore 33% of their maximum health with each Gourd use. The effectiveness of this drink can be enhanced by collecting Awoken Wine Worms throughout the game, which are used to upgrade the drink at a specific vendor. These upgrades carry over into New Game Plus, requiring players to collect more Awoken Wine Worms for further enhancements. The text suggests that players might continue using Coconut Wine throughout the game unless they choose a different healing strategy."
}