{
    "chunk_id": 837534327855,
    "source_file": "Black_Wind_Cave_Walkthrough.md",
    "h1_title": "Black Wind Cave Walkthrough",
    "h2_title": "Outside the Cave",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3d/Wukong_BlackWind_25.jpg",
    "alt_text": "Wukong BlackWind 25.jpg",
    "position_desc": 23,
    "img_above_text": "# Black Wind Cave Walkthrough\n\nThe Black Wind Cave is the final region of Chapter 2's Black Wind Mountain in Black Myth: Wukong. Though it is a short area, it will prove to be a challenging one as you go up against the greedy King of the Mountain. Below you'll find a guide to the progressing through the cave to the mountaintop, as well as how to defeat the boss of this area in his two forms, the Black Wind King and the Black Bear Guai.\n\n* **Jump to A Section:**\n* **Cave Interior**\n- Black Wind King\n* **Outside the Cave**\n* **Bodhi Peak**\n- Black Bear Guai\n\n\nReturn to the path and take the stairs up to fight against another Wolf Assassin as the cave grows dark, and draw them into the light if needed.\n\nAs you reach an open part of the cave, you’ll have to face one more assassin along the darkened path, and you may notice they’ll go out of their way to destroy the torches along the path to further envelop them in darkness. If you have trouble facing them, always try to bring them to a brighter spot.\n\nNote that if you went ahead and defeated the Secret Boss by ringing the three bells, you should also have access to craft an additional Bronze Set that improves your abilities using the Immobilize Spell!\n\nCraft and upgrade whatever you can afford at the moment, because a boss is waiting inside the temple to test your might, and he’s no pushover.\n\n\nCheck the sides of the cave to find some Jade Lotus and Aged Ginseng, then head to the far end to sidle through an exit. This disguised loading screen will turn the day into dusk as you find yourself closer to the top of the mountain.\n\n## Outside the Cave\n\nIf you look just to the left of this wooden walkway before the ruins, you can spot a small wooden plank leading off to an area where a Wolf Assassin is waiting in the shadows. Unlike the other assassins you fought in the cave, this one is a lot stronger than the rest, and his evasive maneuvers can make him hard to pin down.",
    "img_below_text": "Once you defeat this stronger Wolf Assassin, you’ll find that he will leave behind a Blue Spirit you can absorb for a new Spirit Attack! He also guards a chest you can loot to earn a **Blood of the Iron Bull** material upgrade, and 3 **Stone Spirit**.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Black Wind Cave Walkthrough\n            - Section Title: Outside the Cave\n\n            Context:\n            - Preceding Text: \"# Black Wind Cave Walkthrough\n\nThe Black Wind Cave is the final region of Chapter 2's Black Wind Mountain in Black Myth: Wukong. Though it is a short area, it will prove to be a challenging one as you go up against the greedy King of the Mountain. Below you'll find a guide to the progressing through the cave to the mountaintop, as well as how to defeat the boss of this area in his two forms, the Black Wind King and the Black Bear Guai.\n\n* **Jump to A Section:**\n* **Cave Interior**\n- Black Wind King\n* **Outside the Cave**\n* **Bodhi Peak**\n- Black Bear Guai\n\n\nReturn to the path and take the stairs up to fight against another Wolf Assassin as the cave grows dark, and draw them into the light if needed.\n\nAs you reach an open part of the cave, you’ll have to face one more assassin along the darkened path, and you may notice they’ll go out of their way to destroy the torches along the path to further envelop them in darkness. If you have trouble facing them, always try to bring them to a brighter spot.\n\nNote that if you went ahead and defeated the Secret Boss by ringing the three bells, you should also have access to craft an additional Bronze Set that improves your abilities using the Immobilize Spell!\n\nCraft and upgrade whatever you can afford at the moment, because a boss is waiting inside the temple to test your might, and he’s no pushover.\n\n\nCheck the sides of the cave to find some Jade Lotus and Aged Ginseng, then head to the far end to sidle through an exit. This disguised loading screen will turn the day into dusk as you find yourself closer to the top of the mountain.\n\n## Outside the Cave\n\nIf you look just to the left of this wooden walkway before the ruins, you can spot a small wooden plank leading off to an area where a Wolf Assassin is waiting in the shadows. Unlike the other assassins you fought in the cave, this one is a lot stronger than the rest, and his evasive maneuvers can make him hard to pin down.\"\n            - Following Text: \"Once you defeat this stronger Wolf Assassin, you’ll find that he will leave behind a Blue Spirit you can absorb for a new Spirit Attack! He also guards a chest you can loot to earn a **Blood of the Iron Bull** material upgrade, and 3 **Stone Spirit**.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the Black Wind Cave, a challenging area in the game Black Myth: Wukong, where players face a series of Wolf Assassins and a boss. Players are advised to use light strategically against enemies and to craft and upgrade items before facing a boss. The text also mentions collecting items like Jade Lotus and Aged Ginseng before exiting the cave to reach the mountain's top.\n\nImage Summary:\nThe image depicts a scene outside the Black Wind Cave, showing a character in a wooded area with a chest nearby. The environment is lush with trees and foliage, and an item labeled \"Aged Ginseng x1\" is highlighted, suggesting it can be collected. The image likely serves to illustrate the location and items players can find after exiting the cave.\n\nFollowing Text Summary:\nThe following text explains that after defeating a stronger Wolf Assassin outside the cave, players can absorb a Blue Spirit for a new Spirit Attack and loot a chest containing a material upgrade called \"Blood of the Iron Bull\" and three \"Stone Spirit\" items. This text provides details on the rewards for overcoming the challenge presented in the image."
}