{
    "chunk_id": 305472769287,
    "source_file": "Feng-Tail_General.md",
    "h1_title": "Feng-Tail General",
    "h2_title": "Feng-Tail General Boss Fight and Guides",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d6/Foothills_Walkthrough_%2828%29.png",
    "alt_text": "Foothills Walkthrough \\(28\\).png",
    "position_desc": 4,
    "img_above_text": "# Feng-Tail General\n\nFeng-Tail General is one of the main Yaoguai Chiefs you'll need to find in Chapter 6 of Black Myth: Wukong. Rather than being a traditional boss fight, the Feng-Tail General acts as a test of your stamina and health to make sure you're fit for the journey ahead.\n\n\nWhen the first Poison Chief is down, fly up and continue left toward the water. Go almost to the end of the water, where you should see a giant creature. When you get close to it, it will leap in the air and jump to a nearby rock. Fly over to it, then land on its head.\n\n## Feng-Tail General Boss Fight and Guides\n\nFirstly, it will test your stamina. When you approach it near the Mantis-Catching Swamp, and land on its head you'll need to approach its antennae. Interact with them and hold on. It will begin to jump around the water, eventually ending up near the Rhino Watch Slope. Your stamina bar will drain as it does this, and you'll only be able to complete the test if it doesn't completely run out before the critter stops jumping. If you're finding it hard to hold on, reset some skills and ensure that Rampant Vigor is maxed out under Survival, and see if you've missed any Celestial Nonary Pill Locations.",
    "img_below_text": "The second test will be on your health bar, and particularly test your fire resistance. When the insect stops jumping, you'll be expected to interact with its flaming antennae. Before you do this, equip your Fireproof Mantle, and ensure you've maxed out your Bane Mitigation skill. Check to see if you have any other gear you can equip that helps with burn resistance, and see if you've missed any Celestial Jade Lotus Pill Locations.\n\nIf you're able to hang on without dying, you'll snap the antennae from the insect and receive the Golden Feng-Tail Crown.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Feng-Tail General\n            - Section Title: Feng-Tail General Boss Fight and Guides\n\n            Context:\n            - Preceding Text: \"# Feng-Tail General\n\nFeng-Tail General is one of the main Yaoguai Chiefs you'll need to find in Chapter 6 of Black Myth: Wukong. Rather than being a traditional boss fight, the Feng-Tail General acts as a test of your stamina and health to make sure you're fit for the journey ahead.\n\n\nWhen the first Poison Chief is down, fly up and continue left toward the water. Go almost to the end of the water, where you should see a giant creature. When you get close to it, it will leap in the air and jump to a nearby rock. Fly over to it, then land on its head.\n\n## Feng-Tail General Boss Fight and Guides\n\nFirstly, it will test your stamina. When you approach it near the Mantis-Catching Swamp, and land on its head you'll need to approach its antennae. Interact with them and hold on. It will begin to jump around the water, eventually ending up near the Rhino Watch Slope. Your stamina bar will drain as it does this, and you'll only be able to complete the test if it doesn't completely run out before the critter stops jumping. If you're finding it hard to hold on, reset some skills and ensure that Rampant Vigor is maxed out under Survival, and see if you've missed any Celestial Nonary Pill Locations.\"\n            - Following Text: \"The second test will be on your health bar, and particularly test your fire resistance. When the insect stops jumping, you'll be expected to interact with its flaming antennae. Before you do this, equip your Fireproof Mantle, and ensure you've maxed out your Bane Mitigation skill. Check to see if you have any other gear you can equip that helps with burn resistance, and see if you've missed any Celestial Jade Lotus Pill Locations.\n\nIf you're able to hang on without dying, you'll snap the antennae from the insect and receive the Golden Feng-Tail Crown.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Feng-Tail General, a significant Yaoguai Chief encountered in Chapter 6 of *Black Myth: Wukong*. This encounter serves as a test of stamina and health rather than a traditional boss fight. Players must approach the creature near the Mantis-Catching Swamp, interact with its antennae, and endure its jumping sequence while managing their stamina.\n\nImage Summary:\nThe image depicts a dramatic moment in the Feng-Tail General boss fight. A character is seen standing on the head of a massive creature, interacting with its flaming antennae. The fiery visual effects and dark, stormy background emphasize the intensity of the encounter, suggesting the health and fire resistance test described in the context.\n\nFollowing Text Summary:\nThe following text explains the second phase of the encounter, where players must interact with the creature's flaming antennae. To survive, players are advised to equip fire-resistant gear, such as the Fireproof Mantle, and maximize relevant skills like Bane Mitigation. Successfully completing this phase rewards the player with the Golden Feng-Tail Crown."
}