{
    "chunk_id": 645739677731,
    "source_file": "Baw-Lang_Lang.md",
    "h1_title": "Baw-Lang Lang",
    "h2_title": "How to Find Baw-Lang-Lang",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/51/Chapter_5_Secret_Area_%2812%29.png",
    "alt_text": "Chapter 5 Secret Area \\(12\\).png",
    "position_desc": 1,
    "img_above_text": "# Baw-Lang Lang\n\nBaw-Lang-Lang is one of the six frog bosses you can find in Black Myth: Wukong. The fifth of the frogs, Baw-Lang-Lang can only be discovered once you've taken down the Five Element Carts and gained access to Bishui Cave.\n\n## How to Find Baw-Lang-Lang",
    "img_below_text": "When you've beaten the Rusty-Gold Cart approach the frozen-over entrance and break through to head inside.\n\nThis doorway will take you to the chapter's secret area called the Bishui Cave. We'd recommend completing this before you finish up the chapter. But there's one last miniboss to fight before you teleport to the secret area.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Baw-Lang Lang\n            - Section Title: How to Find Baw-Lang-Lang\n\n            Context:\n            - Preceding Text: \"# Baw-Lang Lang\n\nBaw-Lang-Lang is one of the six frog bosses you can find in Black Myth: Wukong. The fifth of the frogs, Baw-Lang-Lang can only be discovered once you've taken down the Five Element Carts and gained access to Bishui Cave.\n\n## How to Find Baw-Lang-Lang\"\n            - Following Text: \"When you've beaten the Rusty-Gold Cart approach the frozen-over entrance and break through to head inside.\n\nThis doorway will take you to the chapter's secret area called the Bishui Cave. We'd recommend completing this before you finish up the chapter. But there's one last miniboss to fight before you teleport to the secret area.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Baw-Lang-Lang, the fifth frog boss in *Black Myth: Wukong*. It explains that players can find this boss after defeating the Five Element Carts and gaining access to Bishui Cave.\n\nImage Summary:  \nThe image appears to depict the entrance to Bishui Cave, with a frozen, cracked doorway highlighted by a red arrow. A character, likely the player, stands in the foreground holding a staff, facing the doorway. A red-circled area in the background suggests the presence of an enemy or object of interest near the cave entrance. The image serves as a visual guide to help players locate the cave and prepare for the next steps.\n\nFollowing Text Summary:  \nThe following text provides instructions for proceeding after defeating the Rusty-Gold Cart. It advises breaking through the frozen doorway to access Bishui Cave, a secret area in the chapter. Players are encouraged to complete this area before finishing the chapter, but they will encounter a miniboss before teleporting to the secret area."
}