{
    "chunk_id": 315280076587,
    "source_file": "Falcon_Hermit_Spirit.md",
    "h1_title": "Falcon Hermit Spirit",
    "h2_title": "Falcon Hermit Spirit Power",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/13/Falcon_Hermit_Power.png",
    "alt_text": "Falcon Hermit Power.png",
    "position_desc": 3,
    "img_above_text": "# Falcon Hermit Spirit\n\n\n\nFalcon Hermits are difficult to fight at the best of times. They aren't bosses, but they are one of the more tricky foes to tussle within Black Myth: Wukong. Falcon Hermits have both wings and fans that work together to send out a large variety of wind-based moves. There is a corkscrew charge move that hits hard and fast, a tornado move that travels around the area, razor-sharp wind gusts, and blunt damage moves inflicted by the Falcon Hermit's fan weapon.\n\nImmobilize can drastically help when fighting a Falcon Hermit, and always keep your eyes peeled for wind-based attacks. These can easily blend in with the snowy surroundings of the mountain.\n\n## Falcon Hermit Spirit Power",
    "img_below_text": "* **Frosty Wind**\n* Equipped Effect: Moderately increases Frost Damage\n\nThe Falcon Hermit's Spirit allows you to make use of his wind tornado move. This tornado travels around the area, damaging anything it makes contact with. It has a pretty decent lifespan, allowing you to potentially damage many enemies at once and freeze them so you can land some combos on them before they recover. The Falcon Hermit's equipped effect boosts your Frost Damage, making the Hoarfrost transformation spell more powerful.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Falcon Hermit Spirit\n            - Section Title: Falcon Hermit Spirit Power\n\n            Context:\n            - Preceding Text: \"# Falcon Hermit Spirit\n\n\n\nFalcon Hermits are difficult to fight at the best of times. They aren't bosses, but they are one of the more tricky foes to tussle within Black Myth: Wukong. Falcon Hermits have both wings and fans that work together to send out a large variety of wind-based moves. There is a corkscrew charge move that hits hard and fast, a tornado move that travels around the area, razor-sharp wind gusts, and blunt damage moves inflicted by the Falcon Hermit's fan weapon.\n\nImmobilize can drastically help when fighting a Falcon Hermit, and always keep your eyes peeled for wind-based attacks. These can easily blend in with the snowy surroundings of the mountain.\n\n## Falcon Hermit Spirit Power\"\n            - Following Text: \"* **Frosty Wind**\n* Equipped Effect: Moderately increases Frost Damage\n\nThe Falcon Hermit's Spirit allows you to make use of his wind tornado move. This tornado travels around the area, damaging anything it makes contact with. It has a pretty decent lifespan, allowing you to potentially damage many enemies at once and freeze them so you can land some combos on them before they recover. The Falcon Hermit's equipped effect boosts your Frost Damage, making the Hoarfrost transformation spell more powerful.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Falcon Hermit, a challenging enemy in *Black Myth: Wukong*. It describes the Falcon Hermit's abilities, which include wind-based attacks such as a corkscrew charge, tornadoes, and fan-inflicted damage. Players are advised to use immobilization techniques and stay vigilant against wind attacks that blend into snowy environments.\n\nImage Summary:\nThe image displays the equipment menu in *Black Myth: Wukong*, specifically showcasing the Falcon Hermit Spirit. It highlights the \"Frosty Wind\" ability, which allows players to summon a wind gust that deals Frost Damage and can freeze enemies. The equipped effect moderately increases Frost Damage, enhancing related abilities. A small demo image illustrates the tornado move in action, showing its potential to damage and freeze enemies.\n\nFollowing Text Summary:\nThe following text elaborates on the Falcon Hermit Spirit's \"Frosty Wind\" ability, emphasizing its utility in combat. The tornado move can damage multiple enemies over time and freeze them, enabling players to perform combos. The equipped effect boosts Frost Damage, making spells like Hoarfrost transformation more effective."
}