{
    "chunk_id": 145221446346,
    "source_file": "Flint_Vanguard_Spirit.md",
    "h1_title": "Flint Vanguard Spirit",
    "h2_title": "Flint Vanguard Spirit",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0b/Flint_Vanguard_Spirit.jpg",
    "alt_text": "Flint Vanguard Spirit.jpg",
    "position_desc": 3,
    "img_above_text": "# Flint Vanguard Spirit\n\n\n\nThe Flint Vanguard is a lava-rock copy of the Stone Vanguard you face in Yellow Wind Ridge. He has all the same attacks, but the battle is further complicated by his fire abilities and the horde of enemies that join the fight as well.\n\nThe Flint Vanguard is protected by a significant amount of Searing Fire and Scorching Fire enemies. These enemies make it extremely easy to get overwhelmed in this fight. A Pluck of Many can help you clear out some of the minions so you can focus on the Flint Vanguard itself.\n\nThe best way to fight this foe is by sticking behind it. The Flint Vanguard punches into the ground with its fists and has a sweeping attack that reaches either side of the beast, but both can be avoided by staying directly behind the creature.\n\n## Flint Vanguard Spirit",
    "img_below_text": "* **Flaming Flint**\n* Equipped Effect: Moderately increases Scorch Damage and Burn Resistance.\n\nThe Flint Vanguard's Spirit allows you to take the form of the rocky beast and beat your great fists into the ground, inflicting Scorch Bane and dealing Burn Damage to any enemies caught in the blasts. The equipped effect increases Scorch Damage and Burn Resistance, making it a great Spirit to channel while exploring the Flaming Mountains.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Flint Vanguard Spirit\n            - Section Title: Flint Vanguard Spirit\n\n            Context:\n            - Preceding Text: \"# Flint Vanguard Spirit\n\n\n\nThe Flint Vanguard is a lava-rock copy of the Stone Vanguard you face in Yellow Wind Ridge. He has all the same attacks, but the battle is further complicated by his fire abilities and the horde of enemies that join the fight as well.\n\nThe Flint Vanguard is protected by a significant amount of Searing Fire and Scorching Fire enemies. These enemies make it extremely easy to get overwhelmed in this fight. A Pluck of Many can help you clear out some of the minions so you can focus on the Flint Vanguard itself.\n\nThe best way to fight this foe is by sticking behind it. The Flint Vanguard punches into the ground with its fists and has a sweeping attack that reaches either side of the beast, but both can be avoided by staying directly behind the creature.\n\n## Flint Vanguard Spirit\"\n            - Following Text: \"* **Flaming Flint**\n* Equipped Effect: Moderately increases Scorch Damage and Burn Resistance.\n\nThe Flint Vanguard's Spirit allows you to take the form of the rocky beast and beat your great fists into the ground, inflicting Scorch Bane and dealing Burn Damage to any enemies caught in the blasts. The equipped effect increases Scorch Damage and Burn Resistance, making it a great Spirit to channel while exploring the Flaming Mountains.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Flint Vanguard, a lava-rock variant of the Stone Vanguard, with added fire-based abilities. The battle against this foe is challenging due to its powerful attacks and the presence of numerous fire-themed enemies. Strategies for defeating it include staying behind the creature to avoid its frontal and sweeping attacks.\n\nImage Summary:  \nThe image displays the in-game equipment menu, highlighting the \"Flint Vanguard\" Spirit. The description explains its abilities, allowing the player to transform into the Flint Vanguard, delivering powerful ground punches that inflict Scorch Bane and Burn Damage. The equipped effect enhances Scorch Damage and Burn Resistance, making it a valuable asset for fire-themed areas. The menu also shows other available Spirits and the player's stats.\n\nFollowing Text Summary:  \nThe following text elaborates on the Flint Vanguard Spirit's abilities and benefits. It emphasizes its utility in combat, particularly in fire-heavy environments, by increasing Scorch Damage and Burn Resistance. This Spirit is especially useful for exploring areas like the Flaming Mountains."
}