{
    "chunk_id": 370270274098,
    "source_file": "Captain_Lotus-Vision.md",
    "h1_title": "Captain Lotus-Vision",
    "h2_title": "Where to Find Captain Lotus-Vision",
    "h3_title": "Captain Lotus-Vision Miniboss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5d/Wukong_Pagoda_46.jpg",
    "alt_text": "Wukong Pagoda 46.jpg",
    "position_desc": 16,
    "img_above_text": "# Captain Lotus-Vision\n\nCaptain Lotus-Vision is an optional miniboss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Responsible for sealing captives in the cells of the Pagoda Realm, you can find this boss in a secret chamber within the Pagoda Prison.\n\n* **Rewards:** Spirit of Captain Lotus-Vision, Frostsprout Twig, Mind Core, Cold Iron Leaves, 1847 Experience, 1198 Will\n\n## Where to Find Captain Lotus-Vision\n\nCaptain Lotus-Vision is one of the four captains you can find in Chapter 3, and is an optional Yaoguai Chief you can encounter in the Pagoda Realm.\n\nTo find him, you'll need to reach the Upper Pagoda Shrine on the third level of the prison. Just behind the shrine, there is a pit with purple light emanating below that you can drop into and find this boss.\n\n### Captain Lotus-Vision Miniboss Fight and Guide\n\n* Level 1 - On the path from the first locked cell to the Lower Pagoda Shrine, another locked cell holds a Bandit Chief (like the one you encountered in the Forest of Wolves) that guards a **Treasure Chest** of materials.",
    "img_below_text": "* Level 2 - Technically the door is back on level 1, but to reach it you'll need to climb the stairs to level 2 and left to find a pit leading back down to the first floor. Here you'll find a cell you can now open, and inside is a Red-Haired Yaksha guarding a **Treasure Chest** with a Mind Core and materials.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Captain Lotus-Vision\n            - Section Title: Where to Find Captain Lotus-Vision\n            - Sub-Section Title: Captain Lotus-Vision Miniboss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Captain Lotus-Vision\n\nCaptain Lotus-Vision is an optional miniboss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Responsible for sealing captives in the cells of the Pagoda Realm, you can find this boss in a secret chamber within the Pagoda Prison.\n\n* **Rewards:** Spirit of Captain Lotus-Vision, Frostsprout Twig, Mind Core, Cold Iron Leaves, 1847 Experience, 1198 Will\n\n## Where to Find Captain Lotus-Vision\n\nCaptain Lotus-Vision is one of the four captains you can find in Chapter 3, and is an optional Yaoguai Chief you can encounter in the Pagoda Realm.\n\nTo find him, you'll need to reach the Upper Pagoda Shrine on the third level of the prison. Just behind the shrine, there is a pit with purple light emanating below that you can drop into and find this boss.\n\n### Captain Lotus-Vision Miniboss Fight and Guide\n\n* Level 1 - On the path from the first locked cell to the Lower Pagoda Shrine, another locked cell holds a Bandit Chief (like the one you encountered in the Forest of Wolves) that guards a **Treasure Chest** of materials.\"\n            - Following Text: \"* Level 2 - Technically the door is back on level 1, but to reach it you'll need to climb the stairs to level 2 and left to find a pit leading back down to the first floor. Here you'll find a cell you can now open, and inside is a Red-Haired Yaksha guarding a **Treasure Chest** with a Mind Core and materials.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Captain Lotus-Vision as an optional miniboss in Chapter 3 of *Black Myth: Wukong*. This boss is located in a secret chamber within the Pagoda Prison and is associated with imprisoning captives in the Pagoda Realm. Players are rewarded with valuable items and experience points upon defeating him. Directions to find Captain Lotus-Vision include reaching the Upper Pagoda Shrine and dropping into a pit with purple light.\n\nImage Summary:  \nThe image appears to depict two key moments related to locating and confronting Captain Lotus-Vision. The left panel shows the player character navigating a rocky descent, likely representing the pit with purple light mentioned in the preceding text. The right panel shows the player character inside a chamber, facing a gated area with a red-circled object or location of interest, possibly indicating the miniboss's lair or a significant event tied to the encounter.\n\nFollowing Text Summary:  \nThe following text provides additional guidance for navigating the Pagoda Prison. It describes how to access a locked cell on the first floor by climbing to the second floor and finding a pit that leads back down. Inside the cell, players encounter a Red-Haired Yaksha guarding a treasure chest containing a Mind Core and other materials."
}