{
    "chunk_id": 250743736916,
    "source_file": "Yaksha_King.md",
    "h1_title": "Yaksha King",
    "h2_title": "Yaksha King Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/67/Field_Fire_Walkthrough_%2859%29.png",
    "alt_text": "Field Fire Walkthrough \\(59\\).png",
    "position_desc": 5,
    "img_above_text": "# Yaksha King\n\nYaksha King is one of the Yaoguai Kings you'll need to fight at the end of Chapter 5 in Black Myth: Wukong. He's the final boss of the Chapter, so expect a challenging fight.\n\n\nThis fight will begin immediately after finishing the fight against Red Boy.\n\n## Yaksha King Boss Fight and Guide\n\nYou'll also find that he performs acrobatics around the arena, and will run up the wall occasionally. When he does this, he'll flip off of the rocks and try to land on you. As he lands, he will also send the blades up from the ground, along with rocks.",
    "img_below_text": "After knocking down a chunk of his health, there will be times when he starts to switch to using just one blade. You'll know when this is about to happen, as only one blade will glow brightly, while the other will be dimmed. When he does this, this will mean that the blade will be able to reach much further, and he'll create huge extended arcs with it. He often does this in chains of three and will start to say a word like \"Merciless\" or \"Sheathless\" before each attack. You'll want to learn the timings of this attack, so you can dodge and roll right underneath it each time.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Yaksha King\n            - Section Title: Yaksha King Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Yaksha King\n\nYaksha King is one of the Yaoguai Kings you'll need to fight at the end of Chapter 5 in Black Myth: Wukong. He's the final boss of the Chapter, so expect a challenging fight.\n\n\nThis fight will begin immediately after finishing the fight against Red Boy.\n\n## Yaksha King Boss Fight and Guide\n\nYou'll also find that he performs acrobatics around the arena, and will run up the wall occasionally. When he does this, he'll flip off of the rocks and try to land on you. As he lands, he will also send the blades up from the ground, along with rocks.\"\n            - Following Text: \"After knocking down a chunk of his health, there will be times when he starts to switch to using just one blade. You'll know when this is about to happen, as only one blade will glow brightly, while the other will be dimmed. When he does this, this will mean that the blade will be able to reach much further, and he'll create huge extended arcs with it. He often does this in chains of three and will start to say a word like \"Merciless\" or \"Sheathless\" before each attack. You'll want to learn the timings of this attack, so you can dodge and roll right underneath it each time.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}