{
    "chunk_id": 335920923408,
    "source_file": "Captain_Void-Illusion.md",
    "h1_title": "Captain Void-Illusion",
    "h2_title": "Where to Find Captain Void-Illusion",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/35/Wukong_Longevity_7.jpg",
    "alt_text": "Wukong Longevity 7.jpg",
    "position_desc": 1,
    "img_above_text": "# Captain Void-Illusion\n\nCaptain Void-Illusion is one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Unlike the other Captains, Void-Illusion isn't actually a boss fight, but still has an important item to loot.\n\n* **Rewards:** Spirit of Captain Void-Illusion\n\n## Where to Find Captain Void-Illusion\n\nYou can find Captain Void-Illusion along the Road of Longevity in the Valley of Ecstasy. From the Shrine, head directly right and up the small hill past a large inacessible tower. You'll find a large corpse of some kind at the base of a statue built into the cliffs ahead.",
    "img_below_text": "This is actually one of the four Captains that the Pagoda Realm Prisoner spoke of, but it looks like someone beat you to putting this captain out of their misery. You can still interact with the body to claim the Spirit of Captain Void-Illusion. And hey, since they still count as a Yaoguai Chief in the journal, that's one less boss to worry about!",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Captain Void-Illusion\n            - Section Title: Where to Find Captain Void-Illusion\n\n            Context:\n            - Preceding Text: \"# Captain Void-Illusion\n\nCaptain Void-Illusion is one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Unlike the other Captains, Void-Illusion isn't actually a boss fight, but still has an important item to loot.\n\n* **Rewards:** Spirit of Captain Void-Illusion\n\n## Where to Find Captain Void-Illusion\n\nYou can find Captain Void-Illusion along the Road of Longevity in the Valley of Ecstasy. From the Shrine, head directly right and up the small hill past a large inacessible tower. You'll find a large corpse of some kind at the base of a statue built into the cliffs ahead.\"\n            - Following Text: \"This is actually one of the four Captains that the Pagoda Realm Prisoner spoke of, but it looks like someone beat you to putting this captain out of their misery. You can still interact with the body to claim the Spirit of Captain Void-Illusion. And hey, since they still count as a Yaoguai Chief in the journal, that's one less boss to worry about!\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nCaptain Void-Illusion is one of four captains encountered in Chapter 3 of *Black Myth: Wukong*. Unlike other captains, Void-Illusion is not a boss fight but offers an important reward: the Spirit of Captain Void-Illusion. The captain is located along the Road of Longevity in the Valley of Ecstasy, near a statue built into the cliffs.\n\nImage Summary:  \nThe image depicts a snowy landscape with a character approaching a large corpse lying at the base of a cliffside statue. The corpse appears to be the remains of Captain Void-Illusion, situated in the described location. The scene visually aligns with the narrative context of finding and interacting with the captain's body.\n\nFollowing Text Summary:  \nCaptain Void-Illusion is already deceased when encountered, as someone else has defeated them. However, players can still interact with the body to claim the Spirit of Captain Void-Illusion. The captain is considered a Yaoguai Chief in the journal, reducing the number of bosses to face."
}