{
    "chunk_id": 794616520112,
    "source_file": "Bitter_Lake_Walkthrough.md",
    "h1_title": "Bitter Lake Walkthrough",
    "h2_title": "Yaoguai King Boss Fight - Cyan Loong",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/ad/Wukong_Turtle_30.jpg",
    "alt_text": "Wukong Turtle 30.jpg",
    "position_desc": 28,
    "img_above_text": "# Bitter Lake Walkthrough\n\nAs you draw close, you'll hear a voice coming from the cymbals, who is arguing with a woman refusing to let the trapped person out. With a loud gong, the trapped \"Admiral\" will use the cymbal to awaken a giant turtle whose mountainous shell you're actually standing on.\n\nAs the turtle begins to swim through the Bitter Seal, the woman will become aware of your presence, starting this new region off with a bang of a boss fight.\n\n\nAs long as your patient to wait for the right moments to get in close and attack, and make sure you're using shock-quelling medicine, you'll be able to come out on top. Even as Kang-Jin Star tries to flee in her dragon form, the Destined One will see to it that she crashes into the large cymbals, freeing the prisoner inside!\n\nThis imprisoned Pig Guai is none other than Zhu Bajie, who traveled with Sun Wukong during his adventures in Journey to the West!\n\n\nAs you start exploring the path over to the right, an echoing voice will lead you to a large open platform where dragon humanoid figure appears to be frozen in place with its fishing rod. If you interact with it while holding the Loong Scales, it will crackle to life, and begin a new secret boss fight.\n\n## Yaoguai King Boss Fight - Cyan Loong\n\nAnother dangerous attack he can launch with little warning only comes with a small tell -- when he quickly swaps his sword to hold in a reverse grip behind his back. He'll then quickly launch himself through the air at you with a spinning slash that can take a chunk off your health, and then dive back to your position after a moment for sword slice when he reaches the ground.",
    "img_below_text": "The good news is his final sword slice allows for an extended moment to dodge around and attack him from behind. However, you'll need to keep your eyes open when trying to attack from behind, as he can easily whip his mace-like tail around to hit you. Watch for it to rise up to the top left before slashing down to the bottom right to know when to deflect or evade.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bitter Lake Walkthrough\n            - Section Title: Yaoguai King Boss Fight - Cyan Loong\n\n            Context:\n            - Preceding Text: \"# Bitter Lake Walkthrough\n\nAs you draw close, you'll hear a voice coming from the cymbals, who is arguing with a woman refusing to let the trapped person out. With a loud gong, the trapped \"Admiral\" will use the cymbal to awaken a giant turtle whose mountainous shell you're actually standing on.\n\nAs the turtle begins to swim through the Bitter Seal, the woman will become aware of your presence, starting this new region off with a bang of a boss fight.\n\n\nAs long as your patient to wait for the right moments to get in close and attack, and make sure you're using shock-quelling medicine, you'll be able to come out on top. Even as Kang-Jin Star tries to flee in her dragon form, the Destined One will see to it that she crashes into the large cymbals, freeing the prisoner inside!\n\nThis imprisoned Pig Guai is none other than Zhu Bajie, who traveled with Sun Wukong during his adventures in Journey to the West!\n\n\nAs you start exploring the path over to the right, an echoing voice will lead you to a large open platform where dragon humanoid figure appears to be frozen in place with its fishing rod. If you interact with it while holding the Loong Scales, it will crackle to life, and begin a new secret boss fight.\n\n## Yaoguai King Boss Fight - Cyan Loong\n\nAnother dangerous attack he can launch with little warning only comes with a small tell -- when he quickly swaps his sword to hold in a reverse grip behind his back. He'll then quickly launch himself through the air at you with a spinning slash that can take a chunk off your health, and then dive back to your position after a moment for sword slice when he reaches the ground.\"\n            - Following Text: \"The good news is his final sword slice allows for an extended moment to dodge around and attack him from behind. However, you'll need to keep your eyes open when trying to attack from behind, as he can easily whip his mace-like tail around to hit you. Watch for it to rise up to the top left before slashing down to the bottom right to know when to deflect or evade.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text sets the stage for the \"Yaoguai King Boss Fight - Cyan Loong.\" It describes the lead-up to this encounter, where the player interacts with a frozen dragon humanoid figure holding a fishing rod. Upon using the Loong Scales, the figure comes to life, initiating a secret boss fight. The text also highlights one of Cyan Loong's dangerous attacks, where he quickly switches his sword to a reverse grip and performs a spinning aerial slash followed by a ground strike.\n\nImage Summary:  \nThe image depicts the intense boss fight with Cyan Loong, showcasing the player character engaged in combat with the dragon-like humanoid. Cyan Loong is mid-attack, wielding a glowing sword surrounded by crackling energy, emphasizing the dynamic and dangerous nature of the encounter. The snowy, rocky environment serves as the backdrop, and the visible health bar at the bottom indicates the ongoing battle.\n\nFollowing Text Summary:  \nThe following text provides tactical advice for the fight, noting that Cyan Loong's final sword slice creates an opportunity to dodge and counterattack from behind. However, players are warned to stay vigilant, as Cyan Loong can retaliate with a powerful tail whip, signaled by the tail rising to the top left before striking downward."
}