{
    "chunk_id": 772359632318,
    "source_file": "Crouching_Tiger_Temple_Walkthrough.md",
    "h1_title": "Crouching Tiger Temple Walkthrough",
    "h2_title": "Yaoguai King Boss Fight - Tiger Vanguard",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/59/Wukong_Tiger_21.jpg",
    "alt_text": "Wukong Tiger 21.jpg",
    "position_desc": 22,
    "img_above_text": "# Crouching Tiger Temple Walkthrough\n\nOnce you reach the top, you’ll come face to bloody face with the Tiger Vanguard, who looks like he just found his next meal.\n\n## Yaoguai King Boss Fight - Tiger Vanguard\n\nWhen at last the Tiger Vanguard is finally beaten by your attacks, he’ll turn to stone and crumble away. The headless musician will reappear, and return Sun Wukong’s legendary stone form back to the Destined One, giving you the **Rock Solid Spell**! This is your one big defensive parry, taking the place of Cloud Step to completely negate and incoming attack when timed right, and will stagger the enemy to open them up for attack.",
    "img_below_text": "Defeating the Tiger Vanguard will award you a Mind Core, and the Keeness of Tiger, the second Key Item needed along with the Sterness of Stone to finally open the big stone doors in this chapter that lead to the final boss. In fact, there’s one of those tallies in this very arena that can open up a secret path!",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Crouching Tiger Temple Walkthrough\n            - Section Title: Yaoguai King Boss Fight - Tiger Vanguard\n\n            Context:\n            - Preceding Text: \"# Crouching Tiger Temple Walkthrough\n\nOnce you reach the top, you’ll come face to bloody face with the Tiger Vanguard, who looks like he just found his next meal.\n\n## Yaoguai King Boss Fight - Tiger Vanguard\n\nWhen at last the Tiger Vanguard is finally beaten by your attacks, he’ll turn to stone and crumble away. The headless musician will reappear, and return Sun Wukong’s legendary stone form back to the Destined One, giving you the **Rock Solid Spell**! This is your one big defensive parry, taking the place of Cloud Step to completely negate and incoming attack when timed right, and will stagger the enemy to open them up for attack.\"\n            - Following Text: \"Defeating the Tiger Vanguard will award you a Mind Core, and the Keeness of Tiger, the second Key Item needed along with the Sterness of Stone to finally open the big stone doors in this chapter that lead to the final boss. In fact, there’s one of those tallies in this very arena that can open up a secret path!\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text describes the conclusion of the Tiger Vanguard boss fight in the \"Yaoguai King Boss Fight - Tiger Vanguard\" section of the Crouching Tiger Temple walkthrough. After defeating the Tiger Vanguard, the player receives the **Rock Solid Spell**, a defensive ability that negates incoming attacks and staggers enemies for counterattacks. This marks a significant progression in the narrative and gameplay.\n\nImage Summary:  \nThe image depicts the aftermath of the Tiger Vanguard encounter. The player character stands before a large stone structure resembling a carved figure, with a smaller statue or object in front of it marked for interaction (\"Examine\"). The interface indicates that a new anecdote related to the Yaoguai King has been recorded, suggesting the image's purpose is to highlight narrative progression and exploration following the boss fight.\n\nFollowing Text Summary:  \nThe following text explains the rewards for defeating the Tiger Vanguard, including a **Mind Core** and the **Keeness of Tiger**, a key item required to open the stone doors leading to the final boss. It also mentions a secret path accessible from the arena, encouraging further exploration and progression."
}