{
    "chunk_id": 489875541440,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "h1_title": "Furnace Valley Walkthrough",
    "h2_title": "Valley Entrance",
    "h3_title": "Yaoguai Chief - Flint Chief",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ec/Furnace_Valley_Walkthrough_%2845%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(45\\).png",
    "position_desc": 23,
    "img_above_text": "# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n## Valley Entrance\n\nUltimately, you're going to go left to continue on the main path (and you may start to hear characters talk as you approach this pillar), but for now, you'll want to detour and explore the area to the right.\n\nThe first thing you'll see as you go to the right is the Flamlings that sit in the lava. These will spit fire at you, so it's best to deal with them to remove the ranged attacks while you explore.\n\n\nDrop down here, and head right first to collect the Fire Date from the tree. Then go in the opposite direction toward the lava streaming from the ceiling. This is where you can find one of the optional bosses in Chapter 5, the Flint Chief.\n\n### Yaoguai Chief - Flint Chief\n\nWhen you're back up to the arch, continue forward to the top of the slope. The path goes left and right here. Right is the main path, so for now, let's take a look at the left side. As you head over, you'll see an Earth Rakshasa waiting for you that guards a chest. It also has a Spirit for you to collect once you defeat it.\n\nAs soon as you pass by the torch, a Flamling will appear. Take down the Flamling and Rakshasa, then collect the Earth Rakshasa Spirit. After this, open the chest and collect Celestial Ribbon and a Mind Core.",
    "img_below_text": "Now turn back the other way and continue up the valley. At the top of the path, you'll come to another archway and the start of Rakshasa Palace.\n\nAs soon as you pass through the archway, the next boss battle will begin and you'll discover who was responsible for the voices you heard earlier.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Furnace Valley Walkthrough\n            - Section Title: Valley Entrance\n            - Sub-Section Title: Yaoguai Chief - Flint Chief\n\n            Context:\n            - Preceding Text: \"# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n## Valley Entrance\n\nUltimately, you're going to go left to continue on the main path (and you may start to hear characters talk as you approach this pillar), but for now, you'll want to detour and explore the area to the right.\n\nThe first thing you'll see as you go to the right is the Flamlings that sit in the lava. These will spit fire at you, so it's best to deal with them to remove the ranged attacks while you explore.\n\n\nDrop down here, and head right first to collect the Fire Date from the tree. Then go in the opposite direction toward the lava streaming from the ceiling. This is where you can find one of the optional bosses in Chapter 5, the Flint Chief.\n\n### Yaoguai Chief - Flint Chief\n\nWhen you're back up to the arch, continue forward to the top of the slope. The path goes left and right here. Right is the main path, so for now, let's take a look at the left side. As you head over, you'll see an Earth Rakshasa waiting for you that guards a chest. It also has a Spirit for you to collect once you defeat it.\n\nAs soon as you pass by the torch, a Flamling will appear. Take down the Flamling and Rakshasa, then collect the Earth Rakshasa Spirit. After this, open the chest and collect Celestial Ribbon and a Mind Core.\"\n            - Following Text: \"Now turn back the other way and continue up the valley. At the top of the path, you'll come to another archway and the start of Rakshasa Palace.\n\nAs soon as you pass through the archway, the next boss battle will begin and you'll discover who was responsible for the voices you heard earlier.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the player's exploration of Furnace Valley, specifically the Valley Entrance area. It introduces the optional boss, Flint Chief, and provides guidance on navigating the area, including defeating enemies like Flamlings and an Earth Rakshasa to collect items such as the Earth Rakshasa Spirit, Celestial Ribbon, and Mind Core.\n\nImage Summary:\nThe image depicts a dark, atmospheric scene within Furnace Valley, showcasing an archway leading to a fiery, ornate structure in the distance. The environment is characterized by rocky terrain, dim lighting, and glowing lava elements, emphasizing the ominous and mystical tone of the setting. This visual likely represents the transition point near the Valley Entrance, where players prepare to face the challenges ahead, including the Flint Chief.\n\nFollowing Text Summary:\nThe following text directs players to continue up the valley, passing through another archway that leads to Rakshasa Palace. It hints at an imminent boss battle and reveals the source of mysterious voices heard earlier, marking a significant narrative and gameplay progression."
}