{
    "chunk_id": 686021483882,
    "source_file": "Elder_Jinchi.md",
    "h1_title": "Elder Jinchi",
    "h2_title": "Elder Jinchi Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/77/Wukong_Guanyin_12.jpg",
    "alt_text": "Wukong Guanyin 12.jpg",
    "position_desc": 11,
    "img_above_text": "# Elder Jinchi\n\nElder Jinchi is an optional secret Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located in a secret realm locked away in the past, you'll need to activate three bells in order to locate and defeat him.\n\n* **Rewards:** Fireproof Mantle, 2,000 Will\n\n\n* **Bamboo Grove** \\- Traveling through the very short region of the Marsh of the White Mists, you’ll have to defeat a character boss, the Whiteclad Noble. Once he retreats, look for a path off to the left instead of heading straight into Black Wind Cave, and you’ll find a large plaza past the marsh where several Wolf Guai sit before a wolf that has been hung from a tree. Just beyond them is the final bell.\n\nNote - Before facing this boss, be sure to defeat the optional **Wandering Wight** that is found in the Forest of Wolves region of Black Wind Mountain if you haven’t faced him already. Not only does he share many attacks with this secret boss, but defeating this one will cause the Wandering Wight to disappear, and you will not be able to gain the Curio and Spirit that the Wight drops.\n\n## Elder Jinchi Fight and Guide\n\nThe only thing you can do is beat Jinchi to the punch. Start sprinting around the arena the moment you spot a body, and use a single attack to defeat them and steal their health instead. You’ll have to race back and forth, so conserve your stamina by only using quick attacks before getting back to sprinting.\n\nOnce enough have been absorbed by either you or him, he’ll return to the ground and the fight will resume.",
    "img_below_text": "So long as you deny him opportunities to restore his health, and watch out for when his followers are activated, you only need to keep up the assault and shut down his ground slams or stay far away when they happen. Save your Red Tides transformation spell for right after his healing segment so you don’t waste any time in that form killing walking corpses.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Elder Jinchi\n            - Section Title: Elder Jinchi Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Elder Jinchi\n\nElder Jinchi is an optional secret Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located in a secret realm locked away in the past, you'll need to activate three bells in order to locate and defeat him.\n\n* **Rewards:** Fireproof Mantle, 2,000 Will\n\n\n* **Bamboo Grove** \\- Traveling through the very short region of the Marsh of the White Mists, you’ll have to defeat a character boss, the Whiteclad Noble. Once he retreats, look for a path off to the left instead of heading straight into Black Wind Cave, and you’ll find a large plaza past the marsh where several Wolf Guai sit before a wolf that has been hung from a tree. Just beyond them is the final bell.\n\nNote - Before facing this boss, be sure to defeat the optional **Wandering Wight** that is found in the Forest of Wolves region of Black Wind Mountain if you haven’t faced him already. Not only does he share many attacks with this secret boss, but defeating this one will cause the Wandering Wight to disappear, and you will not be able to gain the Curio and Spirit that the Wight drops.\n\n## Elder Jinchi Fight and Guide\n\nThe only thing you can do is beat Jinchi to the punch. Start sprinting around the arena the moment you spot a body, and use a single attack to defeat them and steal their health instead. You’ll have to race back and forth, so conserve your stamina by only using quick attacks before getting back to sprinting.\n\nOnce enough have been absorbed by either you or him, he’ll return to the ground and the fight will resume.\"\n            - Following Text: \"So long as you deny him opportunities to restore his health, and watch out for when his followers are activated, you only need to keep up the assault and shut down his ground slams or stay far away when they happen. Save your Red Tides transformation spell for right after his healing segment so you don’t waste any time in that form killing walking corpses.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Elder Jinchi as a secret Yaoguai King boss in *Black Myth Wukong*, encountered in Chapter 1. Players must activate three bells to locate him. The text also provides tips for preparation, such as defeating the Wandering Wight to gain an advantage and avoid losing unique rewards. The fight involves strategic movement and stamina management to counter Elder Jinchi’s abilities.\n\nImage Summary:  \nThe image depicts an intense moment during the boss fight with Elder Jinchi. The player character is engaged in combat, using fiery attacks against the boss in a dark, eerie arena. On-screen prompts provide combat instructions, such as using \"Moon Dance\" and \"Moon Chase\" attacks, emphasizing the dynamic and skill-based nature of the encounter. The boss's health bar is visible, indicating the ongoing battle.\n\nFollowing Text Summary:  \nThe following text offers additional strategies for defeating Elder Jinchi, focusing on denying his healing opportunities and managing his followers. It advises players to use the Red Tides transformation spell immediately after his healing phase to maximize damage and avoid wasting time on lesser enemies."
}