{
    "chunk_id": 850512950518,
    "source_file": "Bitter_Lake_Walkthrough.md",
    "h1_title": "Bitter Lake Walkthrough",
    "h2_title": "Yoaguai King Boss Fight - Kang-Jin Star",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9c/Wukong_Turtle_16.jpg",
    "alt_text": "Wukong Turtle 16.jpg",
    "position_desc": 16,
    "img_above_text": "# Bitter Lake Walkthrough\n\nAs you draw close, you'll hear a voice coming from the cymbals, who is arguing with a woman refusing to let the trapped person out. With a loud gong, the trapped \"Admiral\" will use the cymbal to awaken a giant turtle whose mountainous shell you're actually standing on.\n\nAs the turtle begins to swim through the Bitter Seal, the woman will become aware of your presence, starting this new region off with a bang of a boss fight.\n\n## Yoaguai King Boss Fight - Kang-Jin Star\n\nAfter the spears have been thrown out from around her, she'll summon one last giant spear in her hand, and leap down towards you to pierce you with it.",
    "img_below_text": "Quickly dodge to the side, and keep your distance as the embedded spear will explode after a short moment, sending rocks up all around it.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bitter Lake Walkthrough\n            - Section Title: Yoaguai King Boss Fight - Kang-Jin Star\n\n            Context:\n            - Preceding Text: \"# Bitter Lake Walkthrough\n\nAs you draw close, you'll hear a voice coming from the cymbals, who is arguing with a woman refusing to let the trapped person out. With a loud gong, the trapped \"Admiral\" will use the cymbal to awaken a giant turtle whose mountainous shell you're actually standing on.\n\nAs the turtle begins to swim through the Bitter Seal, the woman will become aware of your presence, starting this new region off with a bang of a boss fight.\n\n## Yoaguai King Boss Fight - Kang-Jin Star\n\nAfter the spears have been thrown out from around her, she'll summon one last giant spear in her hand, and leap down towards you to pierce you with it.\"\n            - Following Text: \"Quickly dodge to the side, and keep your distance as the embedded spear will explode after a short moment, sending rocks up all around it.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the setting of the Bitter Lake region, where a dramatic sequence unfolds involving a trapped \"Admiral\" awakening a giant turtle. As the turtle swims through the Bitter Seal, the narrative transitions into a boss fight against the Yoaguai King, Kang-Jin Star. The boss prepares to attack by summoning spears, culminating in a leap with a giant spear aimed at the player.\n\nImage Summary:\nThe image depicts the Yoaguai King boss fight against Kang-Jin Star in a snowy, mountainous environment. The player character is shown mid-dodge, avoiding an attack from Kang-Jin Star, who stands in the background wielding a large spear. The scene is visually intense, with stormy skies and lightning effects adding to the dramatic atmosphere. The game's interface is visible, including health bars, abilities, and the boss's name, emphasizing the active combat scenario.\n\nFollowing Text Summary:\nThe following text advises players to quickly dodge Kang-Jin Star's spear attack, as the embedded spear will explode shortly after impact, causing rocks to erupt around it. It emphasizes maintaining distance to avoid the explosion and its hazardous effects."
}