{
    "chunk_id": 83832272364,
    "source_file": "Ebongold_Set.md",
    "h1_title": "Ebongold Set",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/61/Ebongold_Silk_Robe.jpg",
    "alt_text": "Ebongold Silk Robe.jpg",
    "position_desc": 1,
    "img_above_text": "# Ebongold Set\n\nThe Ebongold Set of Armor and Gear in Black Myth: Wukong consists of three Rare pieces. It is advanced, with a special stat, and a Unique Effect too. The Ebongold Set of Armor and Gear comes with:\n\n* Ebongold Silk Robe (body) - 31 Defense\n* Ebongold Armguard (arms) - 13 Defense, 4% Burn Resistance\n* Ebongold Gaiters (legs) - 19 Defense, 4% Burn Resistance, After a moment in Cloud Step, considerably increases Unveiling Strike damage\n\nThe Set Bonus for the Ebongold Set is:\n\n* Dance of the Black Wind: In Cloud Step, shrouding black wind will attack enemies nearby the Destined One and the decoy continuously (4 pieces required, unsure if fourth piece of armor is glitched)\n\nThe full Ebongold Set of Armor and Gear is located in Chapter 1 - Black Wind Mountain upon defeating Black Bear Guai at the end of the Chapter. From Chapter 2 onwards you can then craft this gear at any Shrine.",
    "img_below_text": "The Ebongold Set of Armor and Gear can be crafted, as it is the only way to get it. To craft it you need the following:\n\n* 5 Yarn, 2 Silk, 1,080 Will - body\n* 1 Yarn, 1 Silk, 810 Will - arms\n* 4 Yarn, 2 Silk, 1,080 Will - legs\n\nThe armor can also be upgraded, with Silk and Cold Iron Leaves once you reach Chen Loong and open the Zodiac Realm in The New West in Chapter 3.\n\nFor even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Weapons locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Ebongold Set\n\n            Context:\n            - Preceding Text: \"# Ebongold Set\n\nThe Ebongold Set of Armor and Gear in Black Myth: Wukong consists of three Rare pieces. It is advanced, with a special stat, and a Unique Effect too. The Ebongold Set of Armor and Gear comes with:\n\n* Ebongold Silk Robe (body) - 31 Defense\n* Ebongold Armguard (arms) - 13 Defense, 4% Burn Resistance\n* Ebongold Gaiters (legs) - 19 Defense, 4% Burn Resistance, After a moment in Cloud Step, considerably increases Unveiling Strike damage\n\nThe Set Bonus for the Ebongold Set is:\n\n* Dance of the Black Wind: In Cloud Step, shrouding black wind will attack enemies nearby the Destined One and the decoy continuously (4 pieces required, unsure if fourth piece of armor is glitched)\n\nThe full Ebongold Set of Armor and Gear is located in Chapter 1 - Black Wind Mountain upon defeating Black Bear Guai at the end of the Chapter. From Chapter 2 onwards you can then craft this gear at any Shrine.\"\n            - Following Text: \"The Ebongold Set of Armor and Gear can be crafted, as it is the only way to get it. To craft it you need the following:\n\n* 5 Yarn, 2 Silk, 1,080 Will - body\n* 1 Yarn, 1 Silk, 810 Will - arms\n* 4 Yarn, 2 Silk, 1,080 Will - legs\n\nThe armor can also be upgraded, with Silk and Cold Iron Leaves once you reach Chen Loong and open the Zodiac Realm in The New West in Chapter 3.\n\nFor even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Weapons locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Ebongold Set, a collection of Rare armor and gear in *Black Myth: Wukong*. It details the set's components, including their defense stats, special attributes, and unique effects. The set bonus, \"Dance of the Black Wind,\" enhances combat abilities during Cloud Step. The armor is obtained by defeating Black Bear Guai in Chapter 1 and can be crafted from Chapter 2 onwards.\n\nImage Summary:\nThe image showcases the crafting interface for the Ebongold Silk Robe, part of the Ebongold Set in *Black Myth: Wukong*. It highlights the item's stats (31 Defense), its unique effect (\"Dance of the Black Wind\"), and the crafting requirements (5 Yarn, 2 Silk, 1,800 Will). The character model displays the robe, accompanied by a poetic description emphasizing its aesthetic and thematic significance.\n\nFollowing Text Summary:\nThe following text elaborates on crafting and upgrading the Ebongold Set. It specifies the materials needed for crafting each piece and explains that upgrades require Silk and Cold Iron Leaves, accessible in Chapter 3. Additional guides are mentioned for locating other items and resources in the game, including weapons, spells, and consumables."
}