{
    "chunk_id": 158598287368,
    "source_file": "First_Prince_of_Flowing_Sands.md",
    "h1_title": "First Prince of Flowing Sands",
    "h2_title": "Where to Find First Prince of Flowing Sands",
    "h3_title": "Yaoguai Chief Mini-Boss Fight - First Prince of Flowing Sands",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5a/Wukong_Sandgate_76.jpg",
    "alt_text": "Wukong Sandgate 76.jpg",
    "position_desc": 7,
    "img_above_text": "# First Prince of Flowing Sands\n\nThe First Prince of Flowing Sands is an optional Yaoguai Chief miniboss that you can encounter in Chapter 2 of Black Myth Wukong. As an optional foe, you can seek out this boss just past the Sandgate Village in a large valley cave, and will need to defeat him to unlock more than one secret boss.\n\n* Rewards: Arhat Hold Piece, Silk x2, Yarn x2, 1102 Experience, 1020 Will\n\n## Where to Find First Prince of Flowing Sands\n\nIf you did kill the King (and made his Second Son very angry), you'll have gained a Pungent Flesh Chunk Key Item from defeating the duo. This item can be used at the very edge of the valley's cliff to summon the First Prince himself.\n\n### Yaoguai Chief Mini-Boss Fight - First Prince of Flowing Sands\n\nSome scarier attacks that the First Prince can employ will have him stand up holding his arms to the side, then stumbling forward in a large swing as he topples down on his side, which covers a large area both from the arm swipe and body slam. Be sure to dodge to the side he puts his arms up and you’ll avoid him swinging in the opposite direction.",
    "img_below_text": "He also has a surprisingly quick lunge that’s very hard to dodge if you don’t look for the subtle cue of him slowly extending one arm backward before lunging forward with a quick sliding swipe attack. If you see it early, you can also Immobilize him to interrupt before he can perform it.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: First Prince of Flowing Sands\n            - Section Title: Where to Find First Prince of Flowing Sands\n            - Sub-Section Title: Yaoguai Chief Mini-Boss Fight - First Prince of Flowing Sands\n\n            Context:\n            - Preceding Text: \"# First Prince of Flowing Sands\n\nThe First Prince of Flowing Sands is an optional Yaoguai Chief miniboss that you can encounter in Chapter 2 of Black Myth Wukong. As an optional foe, you can seek out this boss just past the Sandgate Village in a large valley cave, and will need to defeat him to unlock more than one secret boss.\n\n* Rewards: Arhat Hold Piece, Silk x2, Yarn x2, 1102 Experience, 1020 Will\n\n## Where to Find First Prince of Flowing Sands\n\nIf you did kill the King (and made his Second Son very angry), you'll have gained a Pungent Flesh Chunk Key Item from defeating the duo. This item can be used at the very edge of the valley's cliff to summon the First Prince himself.\n\n### Yaoguai Chief Mini-Boss Fight - First Prince of Flowing Sands\n\nSome scarier attacks that the First Prince can employ will have him stand up holding his arms to the side, then stumbling forward in a large swing as he topples down on his side, which covers a large area both from the arm swipe and body slam. Be sure to dodge to the side he puts his arms up and you’ll avoid him swinging in the opposite direction.\"\n            - Following Text: \"He also has a surprisingly quick lunge that’s very hard to dodge if you don’t look for the subtle cue of him slowly extending one arm backward before lunging forward with a quick sliding swipe attack. If you see it early, you can also Immobilize him to interrupt before he can perform it.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the \"First Prince of Flowing Sands,\" an optional miniboss in *Black Myth: Wukong*. Players can encounter this Yaoguai Chief in Chapter 2 near Sandgate Village, within a large valley cave. Defeating this boss unlocks additional secret bosses and rewards the player with items like Arhat Hold Piece, Silk, Yarn, and experience points. Instructions are provided on how to summon the boss using the Pungent Flesh Chunk Key Item.\n\nImage Summary:  \nThe image depicts an intense combat scene between the player character and the \"First Prince of Flowing Sands.\" The boss, a large, monstrous creature, is mid-attack, with its massive body and glowing effects emphasizing the danger of the encounter. The player is shown dodging or countering the attack, with visible health bars and action icons indicating an active battle. The image highlights the scale and ferocity of the miniboss fight.\n\nFollowing Text Summary:  \nThe following text describes another attack from the First Prince, a swift lunge that is difficult to avoid unless players recognize the subtle cue of the boss extending its arm backward before striking. It also suggests that players can interrupt this attack by immobilizing the boss if they act quickly."
}