{
    "chunk_id": 964469919409,
    "source_file": "Gore-Eye_Daoist.md",
    "h1_title": "Gore-Eye Daoist",
    "h2_title": "Where to Find the Gore-Eye Daoist",
    "h3_title": "Gore-Eye Daoist Mini-Boss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d1/Wukong_Yellow_42.jpg",
    "alt_text": "Wukong Yellow 42.jpg",
    "position_desc": 4,
    "img_above_text": "# Gore-Eye Daoist\n\nThe Gore-Eye Daoist is an optional Yaoguai Chief miniboss that you can encounter in Chapter 2 of Black Myth Wukong. As an optional foe, you can seek out this boss in the Yellow Wind Formation through one of three possible entrances to where the Chapter Boss resides behind sealed stone gates.\n\n* Rewards: Gore-Eye Daoist Spirit\n\n## Where to Find the Gore-Eye Daoist\n\nHowever, in order to open the door, you will need both the Sterness of Stone from the Stone Vanguard Boss, and Keeness of Tiger from the Tiger Vanguard Boss. With both Key Items, you'll be able to interact with the Tally in front of the door and open it, and you'll find the boss after crossing a bridge down to the Windseal Gate.\n\n### Gore-Eye Daoist Mini-Boss Fight and Guide\n\nWhen the fight begins, he’ll begin a loud cry, punctuated by slamming his staff into the ground that will cause several pools of blood to splash down all around him. If you’re caught in the blast, expect to be instantly poisoned, so be ready to dodge away the moment his staff slams down.",
    "img_below_text": "There’s many more ways he can create more blood pools, and not all of them look the same. Sometimes he’ll dance about and ring his staff, shooting them out in all directions and ending with a shockwave of bloody force you need to dodge.\n\nUp close, the Gore-Eye Daoist can only employ a few staff swings that don’t hit hard, and will regularly rely on his blood spells to keep you at bay.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Gore-Eye Daoist\n            - Section Title: Where to Find the Gore-Eye Daoist\n            - Sub-Section Title: Gore-Eye Daoist Mini-Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Gore-Eye Daoist\n\nThe Gore-Eye Daoist is an optional Yaoguai Chief miniboss that you can encounter in Chapter 2 of Black Myth Wukong. As an optional foe, you can seek out this boss in the Yellow Wind Formation through one of three possible entrances to where the Chapter Boss resides behind sealed stone gates.\n\n* Rewards: Gore-Eye Daoist Spirit\n\n## Where to Find the Gore-Eye Daoist\n\nHowever, in order to open the door, you will need both the Sterness of Stone from the Stone Vanguard Boss, and Keeness of Tiger from the Tiger Vanguard Boss. With both Key Items, you'll be able to interact with the Tally in front of the door and open it, and you'll find the boss after crossing a bridge down to the Windseal Gate.\n\n### Gore-Eye Daoist Mini-Boss Fight and Guide\n\nWhen the fight begins, he’ll begin a loud cry, punctuated by slamming his staff into the ground that will cause several pools of blood to splash down all around him. If you’re caught in the blast, expect to be instantly poisoned, so be ready to dodge away the moment his staff slams down.\"\n            - Following Text: \"There’s many more ways he can create more blood pools, and not all of them look the same. Sometimes he’ll dance about and ring his staff, shooting them out in all directions and ending with a shockwave of bloody force you need to dodge.\n\nUp close, the Gore-Eye Daoist can only employ a few staff swings that don’t hit hard, and will regularly rely on his blood spells to keep you at bay.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Gore-Eye Daoist as an optional miniboss in *Black Myth: Wukong*, found in Chapter 2 within the Yellow Wind Formation. To access the boss, players must obtain two key items—Sterness of Stone and Keeness of Tiger—from other bosses. The fight begins after crossing a bridge to the Windseal Gate, where the Gore-Eye Daoist uses blood-based attacks, including a staff slam that creates poisonous blood pools.\n\nImage Summary:\nThe image depicts the Gore-Eye Daoist miniboss fight in *Black Myth: Wukong*. The scene shows the boss surrounded by glowing red blood pools and casting an attack, with the player character engaged in combat. The environment is dark and ominous, emphasizing the boss's blood-themed abilities. The health bar labeled \"Gore-Eye Daoist\" is visible, along with UI elements indicating player abilities and resources.\n\nFollowing Text Summary:\nThe following text elaborates on the Gore-Eye Daoist's combat mechanics, describing additional ways he generates blood pools, such as dancing and ringing his staff to create shockwaves. While his close-range staff swings are less threatening, his blood-based spells are his primary method of keeping players at a distance, requiring strategic dodging to avoid damage."
}