{
    "chunk_id": 381296034907,
    "source_file": "Yellow_Loong.md",
    "h1_title": "Yellow Loong",
    "h2_title": "Yellow Loong Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f2/Wukong_YellowLoong_16.jpg",
    "alt_text": "Wukong YellowLoong 16.jpg",
    "position_desc": 13,
    "img_above_text": "# Yellow Loong\n\nYellow Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 4 of Black Myth Wukong. Hiding across several rope bridges outside the middle of the Webbed Hollow, this boss can't be activated until you obtain a Key Item in the previous chapter. Yellow Loong is the final of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* Rewards: Golden Lining Transformation Spell, Sea-Supporting Tendon, Golden Carp Curio, Kun Steel, Loong Pearl, Mind Core, 6998 Experience, 5049 Will\n\n\nYou can enter the crack in the wall, and on the other side you’ll find a chest containing the Loong Scales. With this item, you’ll be able to unlock the boss.\n\n## Yellow Loong Boss Fight and Guide\n\nYou'll want to dodge toward him and not away and get the hang of evading this attack early, as it won't be long before he'll upgrade the move to detonate a second bigger orange electric arc a moment after the initial slice.",
    "img_below_text": "Speaking of which, his other quick melee move will begin with a quick stab from the opposite end of his weapon (while turning his back to you) followed by an electric overhead slam. Don't get greedy, because he'll quickly pull his weapon out to swing it around for a big spinning arc that also extends a huge electric wave, which will shortly detonate with a bigger orange blast that you need to be well away from.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Yellow Loong\n            - Section Title: Yellow Loong Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Yellow Loong\n\nYellow Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 4 of Black Myth Wukong. Hiding across several rope bridges outside the middle of the Webbed Hollow, this boss can't be activated until you obtain a Key Item in the previous chapter. Yellow Loong is the final of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* Rewards: Golden Lining Transformation Spell, Sea-Supporting Tendon, Golden Carp Curio, Kun Steel, Loong Pearl, Mind Core, 6998 Experience, 5049 Will\n\n\nYou can enter the crack in the wall, and on the other side you’ll find a chest containing the Loong Scales. With this item, you’ll be able to unlock the boss.\n\n## Yellow Loong Boss Fight and Guide\n\nYou'll want to dodge toward him and not away and get the hang of evading this attack early, as it won't be long before he'll upgrade the move to detonate a second bigger orange electric arc a moment after the initial slice.\"\n            - Following Text: \"Speaking of which, his other quick melee move will begin with a quick stab from the opposite end of his weapon (while turning his back to you) followed by an electric overhead slam. Don't get greedy, because he'll quickly pull his weapon out to swing it around for a big spinning arc that also extends a huge electric wave, which will shortly detonate with a bigger orange blast that you need to be well away from.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}