{
    "chunk_id": 104964559757,
    "source_file": "Emerald-Armed_Mantis.md",
    "h1_title": "Emerald-Armed Mantis",
    "h2_title": "Emerald-Armed Mantis Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/21/Foothills_Walkthrough_%2897%29.png",
    "alt_text": "Foothills Walkthrough \\(97\\).png",
    "position_desc": 6,
    "img_above_text": "# Emerald-Armed Mantis\n\nEmerald-Armed Mantis is one of the main Yaoguai Chiefs you'll need to find in Chapter 6 of Black Myth: Wukong. There are two phases to this intense battle inside the pit of Zhu Bajie's stomach.\n\n\nYou need to have defeated the Feng-Tail General, Gold Armored Rhino, and Cloudtreading Deer before you can take on the Emerald-Armed Mantis. Look for the golden tree near where you saw the Feng-Tail General and Water-Wood Beast.\n\nThe golden tree will have a slight fog around it when you're able to fight the Emerald-Armed Mantis. Zoom toward the fog and you'll see that it glistens with green speckles. As you land by it a cutscene will begin.\n\n## Emerald-Armed Mantis Boss Fight and Guide\n\nIt's only when the mantis' health bar drops to around 70% that the fight changes drastically. A cutscene will play and the mantis will sharpen its blades, then dip them in the liquid, pulling them out so that they're now red.",
    "img_below_text": "The mantis will now become quite erratic with its movements, flipping all around the stomach. Immobilize will help out with this, but so will the Plantain Fan, which will push the Mantis back to a part of the stomach and pin it there for you to attack. It will also stop it from being able to fly too much in the air.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Emerald-Armed Mantis\n            - Section Title: Emerald-Armed Mantis Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Emerald-Armed Mantis\n\nEmerald-Armed Mantis is one of the main Yaoguai Chiefs you'll need to find in Chapter 6 of Black Myth: Wukong. There are two phases to this intense battle inside the pit of Zhu Bajie's stomach.\n\n\nYou need to have defeated the Feng-Tail General, Gold Armored Rhino, and Cloudtreading Deer before you can take on the Emerald-Armed Mantis. Look for the golden tree near where you saw the Feng-Tail General and Water-Wood Beast.\n\nThe golden tree will have a slight fog around it when you're able to fight the Emerald-Armed Mantis. Zoom toward the fog and you'll see that it glistens with green speckles. As you land by it a cutscene will begin.\n\n## Emerald-Armed Mantis Boss Fight and Guide\n\nIt's only when the mantis' health bar drops to around 70% that the fight changes drastically. A cutscene will play and the mantis will sharpen its blades, then dip them in the liquid, pulling them out so that they're now red.\"\n            - Following Text: \"The mantis will now become quite erratic with its movements, flipping all around the stomach. Immobilize will help out with this, but so will the Plantain Fan, which will push the Mantis back to a part of the stomach and pin it there for you to attack. It will also stop it from being able to fly too much in the air.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe Emerald-Armed Mantis is a boss encountered in Chapter 6 of *Black Myth: Wukong*. Players must defeat several other bosses before accessing this fight, which takes place in Zhu Bajie's stomach. The battle begins near a golden tree surrounded by fog with green speckles, triggering a cutscene. The mantis undergoes a significant transformation when its health drops to 70%, sharpening its blades and coating them in a red liquid.\n\nImage Summary:\nThe image depicts the Emerald-Armed Mantis in its transformed state during the boss fight. The mantis is shown with red-coated blades, emphasizing its heightened aggression and power. The dark, organic environment reflects the setting inside Zhu Bajie's stomach, with twisted roots and fleshy textures surrounding the combat scene. The glowing red effects and dynamic pose of the mantis suggest the intensity of this phase of the battle.\n\nFollowing Text Summary:\nIn this phase, the Emerald-Armed Mantis becomes erratic, moving unpredictably and flying around the stomach. Players can use abilities like Immobilize or the Plantain Fan to control its movements, pinning it down for attacks and limiting its aerial mobility. These strategies are critical for managing the mantis' heightened aggression and chaotic behavior."
}