{
    "chunk_id": 262933598248,
    "source_file": "Bull_Governor_Spirit.md",
    "h1_title": "Bull Governor Spirit",
    "h2_title": "Bull Governor Location",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c2/Bull_Governor_Location.jpg",
    "alt_text": "Bull Governor Location.jpg",
    "position_desc": 2,
    "img_above_text": "# Bull Governor Spirit\n\n## Bull Governor Location\n\nThe Bull Governor can be found in Bushui Cave, which is the secret area in the Flaming Mountains. Unlocking the secret area and gaining access to Bushui Cave is a long process. Follow these instructions to get there:\n\n* Defeat the Pale-Axe Stalwart at the beginning of Chapter 5. Exhaust all dialogue with him.\n* Defeat the Gray-Bronze Cart.\n* Defeat the Crimson-Silver Cart.\n* Speak to the Pale-Axe Stalwart again at the Crimson-Silver Cart location. Exhaust all dialogue with him.\n* Complete the Iron Ball challenge to remove all barriers on the hill.\n* Head back down the hill and take the new pathway on the left.\n* Run towards the large gate to the right of the Cooling Slope Keeper's Shrine and defeat the Rusty-Gold Cart.\n* Speak to the Pale-Axe Stalwart once again to open the gate to Bushui Cave.",
    "img_below_text": "Once you make it into Bushui Cave, continue through the area until you come across Top Takes Bottom, Bottom Takes Top. Climb the stairs after defeating them and follow the path around to the right to find the Bull Governor.\n\nTurn left before turning right to collect a Celestial Nonary Pill.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bull Governor Spirit\n            - Section Title: Bull Governor Location\n\n            Context:\n            - Preceding Text: \"# Bull Governor Spirit\n\n## Bull Governor Location\n\nThe Bull Governor can be found in Bushui Cave, which is the secret area in the Flaming Mountains. Unlocking the secret area and gaining access to Bushui Cave is a long process. Follow these instructions to get there:\n\n* Defeat the Pale-Axe Stalwart at the beginning of Chapter 5. Exhaust all dialogue with him.\n* Defeat the Gray-Bronze Cart.\n* Defeat the Crimson-Silver Cart.\n* Speak to the Pale-Axe Stalwart again at the Crimson-Silver Cart location. Exhaust all dialogue with him.\n* Complete the Iron Ball challenge to remove all barriers on the hill.\n* Head back down the hill and take the new pathway on the left.\n* Run towards the large gate to the right of the Cooling Slope Keeper's Shrine and defeat the Rusty-Gold Cart.\n* Speak to the Pale-Axe Stalwart once again to open the gate to Bushui Cave.\"\n            - Following Text: \"Once you make it into Bushui Cave, continue through the area until you come across Top Takes Bottom, Bottom Takes Top. Climb the stairs after defeating them and follow the path around to the right to find the Bull Governor.\n\nTurn left before turning right to collect a Celestial Nonary Pill.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text provides a detailed guide on how to access Bushui Cave, a secret area in the Flaming Mountains, where the Bull Governor is located. It involves defeating various carts and engaging in dialogues with the Pale-Axe Stalwart, as well as completing challenges to unlock pathways and gates.\n\nImage Summary:\nThe image depicts a scene within Bushui Cave, showing a character armed with a staff navigating through a dimly lit, rocky environment. The presence of multiple creatures or entities in the distance suggests an impending encounter or battle. The interface elements indicate the character's status and available actions, emphasizing the exploratory and combat aspects of the location.\n\nFollowing Text Summary:\nThe following text instructs the player to continue through Bushui Cave, defeat specific adversaries, and follow a path to locate the Bull Governor. It also mentions a collectible item, the Celestial Nonary Pill, which can be found by taking a specific route within the cave."
}