{
    "chunk_id": 367190508094,
    "source_file": "Hundred-Eyed_Daoist_Master.md",
    "h1_title": "Hundred-Eyed Daoist Master",
    "h2_title": "Hundred-Eyed Daoist Master Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ee/Wukong_YellowFlower_83.jpg",
    "alt_text": "Wukong YellowFlower 83.jpg",
    "position_desc": 22,
    "img_above_text": "# Hundred-Eyed Daoist Master\n\nThe Hundred-Eyed Daoist Master is a required Yaoguai King boss fight that you can encounter in Chapter 4 of Black Myth Wukong. The leader of the Temple of Yellow Flowers and master of the Spider Guai, he is the final boss of the larger Webbed Hollow region.\n\n* Rewards: Golden Glowing Eye, Sky-Piercing Horn, Celestial Ribbon, Fine Gold Thread, Gold Tree Core, Kun Steel, Mind Core, 5329 Experience, 3693 Will\n\n\nThe Hundred-Eyed Daoist Master is a main Yaoguai King, and the final boss you'll encounter in Chapter 4. You'll find him by following the blood trail of the Crimson Spider through the Temple of Yellow Flowers.\n\nOnce you reach the Court of Illumination, you'll find a pathway to the right that leads to a large field where the final boss is located.\n\n## Hundred-Eyed Daoist Master Boss Fight and Guide\n\nThese attacks can be followed up often by him raising up on his claws while holding his electric orb high. After a moment, he'll slam everything down to create a massive shockwave that you need to either run from, or dodge at just the right moment (your Pillar Stance won't save you here). The good news is this blast leaves him very vulnerable for several moments afterward, once you get the dodge timing down.",
    "img_below_text": "If you see him perform an extravagant twisting somersault through the air, don't be dazzled, as he'll chain this feinting maneuver into a quick grab once he touches back on the ground and take a few step, lunging extra distance to try and yank you forward and take off a huge portion of your health with his crazy unblockable grab attack.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Hundred-Eyed Daoist Master\n            - Section Title: Hundred-Eyed Daoist Master Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Hundred-Eyed Daoist Master\n\nThe Hundred-Eyed Daoist Master is a required Yaoguai King boss fight that you can encounter in Chapter 4 of Black Myth Wukong. The leader of the Temple of Yellow Flowers and master of the Spider Guai, he is the final boss of the larger Webbed Hollow region.\n\n* Rewards: Golden Glowing Eye, Sky-Piercing Horn, Celestial Ribbon, Fine Gold Thread, Gold Tree Core, Kun Steel, Mind Core, 5329 Experience, 3693 Will\n\n\nThe Hundred-Eyed Daoist Master is a main Yaoguai King, and the final boss you'll encounter in Chapter 4. You'll find him by following the blood trail of the Crimson Spider through the Temple of Yellow Flowers.\n\nOnce you reach the Court of Illumination, you'll find a pathway to the right that leads to a large field where the final boss is located.\n\n## Hundred-Eyed Daoist Master Boss Fight and Guide\n\nThese attacks can be followed up often by him raising up on his claws while holding his electric orb high. After a moment, he'll slam everything down to create a massive shockwave that you need to either run from, or dodge at just the right moment (your Pillar Stance won't save you here). The good news is this blast leaves him very vulnerable for several moments afterward, once you get the dodge timing down.\"\n            - Following Text: \"If you see him perform an extravagant twisting somersault through the air, don't be dazzled, as he'll chain this feinting maneuver into a quick grab once he touches back on the ground and take a few step, lunging extra distance to try and yank you forward and take off a huge portion of your health with his crazy unblockable grab attack.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}