{
    "chunk_id": 47822851077,
    "source_file": "Crimson-Silver_Cart.md",
    "h1_title": "Crimson-Silver Cart",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d9/Furnace_Valley_Walkthrough_%28110%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(110\\).png",
    "position_desc": 3,
    "img_above_text": "# Crimson-Silver Cart\n\nStep through the archway and look to the left to see a treasure chest. Open this to find Blood of the Iron Bull and gold pieces. Proceed up the stairs to the right, past the bull guard, and fire will start to rain down on you -- which you know means another cart is not far off!",
    "img_below_text": "Take the stairs up to the right and follow these up and into the dark cave. Then go right again, and up the next set of stairs to find the Crimson-Silver Cart\n\n## Crimson Silver Cart Boss Fight and Guide\n\nIf you've exhausted all the dialogue with the Pale-Axe Stalwart so far, the first thing you'll notice is that you've got his help when it comes to beating this boss.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Crimson-Silver Cart\n\n            Context:\n            - Preceding Text: \"# Crimson-Silver Cart\n\nStep through the archway and look to the left to see a treasure chest. Open this to find Blood of the Iron Bull and gold pieces. Proceed up the stairs to the right, past the bull guard, and fire will start to rain down on you -- which you know means another cart is not far off!\"\n            - Following Text: \"Take the stairs up to the right and follow these up and into the dark cave. Then go right again, and up the next set of stairs to find the Crimson-Silver Cart\n\n## Crimson Silver Cart Boss Fight and Guide\n\nIf you've exhausted all the dialogue with the Pale-Axe Stalwart so far, the first thing you'll notice is that you've got his help when it comes to beating this boss.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text describes a journey through a dangerous environment. After passing an archway and collecting treasure, the player is warned about fire raining down, signaling the proximity of another cart. The narrative sets up a tense and action-oriented atmosphere.\n\nImage Summary:  \nThe image depicts a dark, rocky environment with a staircase leading upward into a shadowy cave. An arrow highlights the direction to proceed, guiding the viewer toward the next objective. The setting conveys a sense of mystery and foreboding, aligning with the exploration and danger described in the context.\n\nFollowing Text Summary:  \nThe following text provides instructions to ascend the stairs and enter the dark cave, continuing the journey. It also introduces the \"Crimson-Silver Cart\" and hints at an upcoming boss fight, with assistance from the Pale-Axe Stalwart if prior interactions with the character have been completed."
}