{
    "chunk_id": 743364528188,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "h1_title": "Furnace Valley Walkthrough",
    "h2_title": "The Emerald Hall",
    "h3_title": "Missable Transformation Spell",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/ae/Furnace_Valley_Walkthrough_%28114%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(114\\).png",
    "position_desc": 52,
    "img_above_text": "# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n\nOpen the giant door at the top of the stairs. Go straight ahead and activate the Rakshasa Palace Keeper's Shrine.\n\n\nInside here, you'll find the old man who gave you the gourd at the start of the game and an Awaken Wine Worm to the left.\n\nSpeak to the old man, and he'll tell you to find yourself a decent gourd (if you haven't already upgraded yours fully) and you can share a drink with him.\n\n\n## The Emerald Hall\n\nFrom The Emerald Hall Keeper's Shrine, go left and up the stairs. A cutscene will start to play, where you'll transform into a Cicada and fly toward the center of the hall. This is where you'll find Pingping speaking to her mother, Rakshasi, accompanied by the Keeper of the Flaming Mountains.\n\nAfter they discuss The Destined One obtaining the relics, the Keeper of the Flaming Mountains offers to care for Rakshashi, which Pingping protests. After he binds Pingping, Rakshashi is revealed to be Zhu Bajie transformed and it's time to take on the Keeper of the Flaming Mountains for yourself.\n\n\nWhen he's almost dead, he will then summon Ma Tianba for you to fight against.\n\n### Missable Transformation Spell\n\nWhen you've knocked its health down to almost halfway, it will begin to move quite erratically and cover a large amount of distance across the arena. Use Cloudstep to catch up to it and sneakily attack and Immobilize to temporarily halt it from darting off.\n\nThis is also when it will begin to float up in the air and throw the projectiles down. You'll need to dodge in quick succession to avoid these.\n\nOnce you've beaten the Keeper of the Flaming Mountains and the Yin-Yang Fish, you'll be returned to The Emerald Hall.",
    "img_below_text": "Turn and face away from the altar. There are two places you'll want to go here to get collectibles. First, head to the stairs, but take the small path down to the right. Follow this to find a golden turtle, where you can get the Slumbering Beetle Husk.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Furnace Valley Walkthrough\n            - Section Title: The Emerald Hall\n            - Sub-Section Title: Missable Transformation Spell\n\n            Context:\n            - Preceding Text: \"# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n\nOpen the giant door at the top of the stairs. Go straight ahead and activate the Rakshasa Palace Keeper's Shrine.\n\n\nInside here, you'll find the old man who gave you the gourd at the start of the game and an Awaken Wine Worm to the left.\n\nSpeak to the old man, and he'll tell you to find yourself a decent gourd (if you haven't already upgraded yours fully) and you can share a drink with him.\n\n\n## The Emerald Hall\n\nFrom The Emerald Hall Keeper's Shrine, go left and up the stairs. A cutscene will start to play, where you'll transform into a Cicada and fly toward the center of the hall. This is where you'll find Pingping speaking to her mother, Rakshasi, accompanied by the Keeper of the Flaming Mountains.\n\nAfter they discuss The Destined One obtaining the relics, the Keeper of the Flaming Mountains offers to care for Rakshashi, which Pingping protests. After he binds Pingping, Rakshashi is revealed to be Zhu Bajie transformed and it's time to take on the Keeper of the Flaming Mountains for yourself.\n\n\nWhen he's almost dead, he will then summon Ma Tianba for you to fight against.\n\n### Missable Transformation Spell\n\nWhen you've knocked its health down to almost halfway, it will begin to move quite erratically and cover a large amount of distance across the arena. Use Cloudstep to catch up to it and sneakily attack and Immobilize to temporarily halt it from darting off.\n\nThis is also when it will begin to float up in the air and throw the projectiles down. You'll need to dodge in quick succession to avoid these.\n\nOnce you've beaten the Keeper of the Flaming Mountains and the Yin-Yang Fish, you'll be returned to The Emerald Hall.\"\n            - Following Text: \"Turn and face away from the altar. There are two places you'll want to go here to get collectibles. First, head to the stairs, but take the small path down to the right. Follow this to find a golden turtle, where you can get the Slumbering Beetle Husk.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the events leading up to the encounter in The Emerald Hall. After activating the Rakshasa Palace Keeper's Shrine, players witness a cutscene involving Pingping, her mother Rakshasi, and the Keeper of the Flaming Mountains. A battle ensues, revealing Rakshasi's true identity as Zhu Bajie. The Keeper summons Ma Tianba as a secondary opponent, and players must use specific strategies, such as Cloudstep and Immobilize, to defeat them. The section concludes with the player returning to The Emerald Hall after defeating the enemies.\n\nImage Summary:\nThe image depicts The Emerald Hall, showcasing its grand architecture with ornate pillars, an altar, and stairs leading to a central structure. The arrows indicate key paths: one pointing straight ahead toward the altar and another pointing to a smaller path on the right. The scene suggests exploration opportunities, such as collecting items or interacting with objects, following the battle in the preceding text.\n\nFollowing Text Summary:\nThe following text provides guidance for exploration after the battle. Players are instructed to turn away from the altar and explore two specific areas for collectibles. The first is a small path to the right of the stairs, leading to a golden turtle where the Slumbering Beetle Husk can be obtained. This emphasizes the importance of thorough exploration in The Emerald Hall."
}