{
    "chunk_id": 197030341420,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "h1_title": "Fright Cliff Walkthrough",
    "h2_title": "Squall Hideout",
    "h3_title": "Yaoguai Chief Mini-Boss Fight - Mother of Stones",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7e/Wukong_Fright_31.jpg",
    "alt_text": "Wukong Fright 31.jpg",
    "position_desc": 33,
    "img_above_text": "# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n## Squall Hideout\n\n\nThe large cave entrance has a few paths, with the outer one on the right leading past another Pitstone to a wooden coffin chest holding 3 **Silk** and some **Will**.\n\n\nStart by luring the shieldless Spearbone out of range of the Blazebones above, then climb the stairs to rush down the projectile throwers. Be sure to look at the ruined home at the first landing below the first Blazebone for a yellow chest that has 2 **Yaoguai Core** and 3 **Tiny Piece of Gold**.\n\n\nAt the end of the crevice, you’ll find an unusual looking stone. He’s actually a Man-in-Stone, and claims to have been trapped within the rock form. He’s betting on one of the rock guai in the large cave nearby to hold the secrets to reversing his fate, and asks you to seek it out.\n\n\nAt the end of the cave path, you’ll find the object of the Man-in-Stone’s quest - an even larger statue embedded with shining blue crystals. Don’t get too enraptured that you miss a Poisestone along the walls trying to ambush you, though.\n\nUpon reaching the end of the large cave system where you’ll find the Mother of Stones, look for a large opening to the right to exit back outside and onto a cliff edge. There’s a raised platform here, and you’ll find another statue head to harvest its Buddha Eyeball.\n\n### Yaoguai Chief Mini-Boss Fight - Mother of Stones\n\nOnce you’ve defeated two waves of single Palestones each, the third wave will consist of two Palestones at the same time. This can be a huge problem fast if they gang up on you with alternating attacks. Deflecting their ranged quartz missiles isn’t too bad… until you’re also dealing with one trying to body slam you.\n\nThis is the time to use everything in your arsenal to stay alive. Make sure you’re using your Spirit attacks to focus fire a target, unleash any stored Focus Points, and use Immobilize or Cloud Step to stay out of danger.",
    "img_below_text": "There’s one last wave of two after this, for a total of six Palestones for the whole fight. Again, don’t hold back, and use your Transformation Spell to power down at least one of the enemies as quickly as possible so you aren’t overwhelmed. Don’t be afraid to back well off and heal to stay out of range of their projectiles.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fright Cliff Walkthrough\n            - Section Title: Squall Hideout\n            - Sub-Section Title: Yaoguai Chief Mini-Boss Fight - Mother of Stones\n\n            Context:\n            - Preceding Text: \"# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n## Squall Hideout\n\n\nThe large cave entrance has a few paths, with the outer one on the right leading past another Pitstone to a wooden coffin chest holding 3 **Silk** and some **Will**.\n\n\nStart by luring the shieldless Spearbone out of range of the Blazebones above, then climb the stairs to rush down the projectile throwers. Be sure to look at the ruined home at the first landing below the first Blazebone for a yellow chest that has 2 **Yaoguai Core** and 3 **Tiny Piece of Gold**.\n\n\nAt the end of the crevice, you’ll find an unusual looking stone. He’s actually a Man-in-Stone, and claims to have been trapped within the rock form. He’s betting on one of the rock guai in the large cave nearby to hold the secrets to reversing his fate, and asks you to seek it out.\n\n\nAt the end of the cave path, you’ll find the object of the Man-in-Stone’s quest - an even larger statue embedded with shining blue crystals. Don’t get too enraptured that you miss a Poisestone along the walls trying to ambush you, though.\n\nUpon reaching the end of the large cave system where you’ll find the Mother of Stones, look for a large opening to the right to exit back outside and onto a cliff edge. There’s a raised platform here, and you’ll find another statue head to harvest its Buddha Eyeball.\n\n### Yaoguai Chief Mini-Boss Fight - Mother of Stones\n\nOnce you’ve defeated two waves of single Palestones each, the third wave will consist of two Palestones at the same time. This can be a huge problem fast if they gang up on you with alternating attacks. Deflecting their ranged quartz missiles isn’t too bad… until you’re also dealing with one trying to body slam you.\n\nThis is the time to use everything in your arsenal to stay alive. Make sure you’re using your Spirit attacks to focus fire a target, unleash any stored Focus Points, and use Immobilize or Cloud Step to stay out of danger.\"\n            - Following Text: \"There’s one last wave of two after this, for a total of six Palestones for the whole fight. Again, don’t hold back, and use your Transformation Spell to power down at least one of the enemies as quickly as possible so you aren’t overwhelmed. Don’t be afraid to back well off and heal to stay out of range of their projectiles.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the lead-up to the encounter with the mini-boss, Mother of Stones, in the Squall Hideout section of the Fright Cliff Walkthrough. Players are guided through the cave system, encountering various enemies and environmental hazards, including Palestones and Poisestones. The narrative introduces the Man-in-Stone, who tasks players with defeating a rock-like Yaoguai to uncover secrets that may reverse his fate. The Mother of Stones is located at the end of the cave, where players are warned about ambushes and advised to prepare for the fight.\n\nImage Summary:\nThe image depicts the in-game battle against the mini-boss, Mother of Stones, in the Squall Hideout section. The scene shows a dark, rocky environment illuminated by a small fire, with the player engaged in combat against the Mother of Stones. The boss's health bar is visible at the bottom of the screen, and the player’s abilities and resources, such as Spirit attacks and health, are displayed in the interface. The visual reinforces the intense nature of the fight described in the walkthrough.\n\nFollowing Text Summary:\nThe following text provides additional details on the final waves of the Mother of Stones fight. Players face a total of six Palestones, with the last wave consisting of two enemies simultaneously. Strategies include using Transformation Spells to weaken enemies quickly, leveraging Spirit attacks, and retreating to heal when overwhelmed. The walkthrough emphasizes the importance of using all available tools to survive and avoid being overpowered by the boss's ranged and melee attacks."
}