{
    "chunk_id": 347527927932,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "h1_title": "Fright Cliff Walkthrough",
    "h2_title": "Squall Hideout",
    "h3_title": "The First Buddha’s Eyeball",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9e/Wukong_Fright_12.jpg",
    "alt_text": "Wukong Fright 12.jpg",
    "position_desc": 13,
    "img_above_text": "# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n## Squall Hideout\n\n### The First Buddha’s Eyeball\n\nLook at the top of the ridge near where the Palestone emerged, and you can find a chest to open above the doorway you came through that holds 1 **Small Piece of Gold** and 3 **Tiny Piece of Gold**. Nearby, you can also find a wooden walkway taking you along the scaffolding that leads to the ranged Bladeblone that was harassing you earlier so you can deal with it.",
    "img_below_text": "The large cave entrance has a few paths, with the outer one on the right leading past another Pitstone to a wooden coffin chest holding 3 **Silk** and some **Will**.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fright Cliff Walkthrough\n            - Section Title: Squall Hideout\n            - Sub-Section Title: The First Buddha’s Eyeball\n\n            Context:\n            - Preceding Text: \"# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n## Squall Hideout\n\n### The First Buddha’s Eyeball\n\nLook at the top of the ridge near where the Palestone emerged, and you can find a chest to open above the doorway you came through that holds 1 **Small Piece of Gold** and 3 **Tiny Piece of Gold**. Nearby, you can also find a wooden walkway taking you along the scaffolding that leads to the ranged Bladeblone that was harassing you earlier so you can deal with it.\"\n            - Following Text: \"The large cave entrance has a few paths, with the outer one on the right leading past another Pitstone to a wooden coffin chest holding 3 **Silk** and some **Will**.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes gameplay strategies for navigating the Squall Hideout area in the \"Fright Cliff Walkthrough.\" It advises players to avoid locking onto smaller threats to prevent being attacked by a larger enemy, the Pitstone, and suggests using a Cloud Step maneuver for positioning and sneak attacks. It also highlights a chest containing gold pieces located above a doorway, as well as a wooden walkway leading to a ranged enemy.\n\nImage Summary:\nThe image depicts a player character engaged in combat within the Squall Hideout area, specifically near \"The First Buddha’s Eyeball\" sub-section. The environment includes rocky terrain, a statue embedded in the cliffside, and candles, suggesting a significant location. A large enemy resembling the Pitstone is visible, emphasizing the combat challenge. The red-circled area may indicate a point of interest or an objective, aligning with the walkthrough's guidance on exploration and item collection.\n\nFollowing Text Summary:\nThe following text describes the next steps in the walkthrough, focusing on a large cave entrance with multiple paths. One path leads past another Pitstone enemy to a wooden coffin chest containing silk and will-related items, continuing the exploration and resource collection theme."
}