{
    "chunk_id": 273085016923,
    "source_file": "Temple_of_Yellow_Flowers_Walkthrough.md",
    "h1_title": "Temple of Yellow Flowers Walkthrough",
    "h2_title": "Yaoguai King Boss Fight - Hundred-Eyed Daoist Master",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/68/Wukong_YellowFlower_74.jpg",
    "alt_text": "Wukong YellowFlower 74.jpg",
    "position_desc": 71,
    "img_above_text": "# Temple of Yellow Flowers Walkthrough\n\nWhen you untangle yourself from the webbing, you'll find yourself high above the Webbed Hollow, on a mountain path leading to a large temple filled with Daoist martial artists.\n\n\nAfter grabbing the Treasure Chest they were guarding, head right past a third green Wisp, and through a small ravine guarded by several Daoists to reach a large forested area.\n\n\nFollow the pathway, and you'll find a set of stairs leading up to a large courtyard where a tough Yaoguai Chief is training a large group of Sword Daoists.\n\n\nBe sure to look for a smaller path off to the right as you climb, and you can spot a lone **Treasure Chest** hiding in an alcove.\n\n\nFollow the winding mountain trail up several stairs and avoiding other Worm Practitioners until you reach the very top. The road will widen out as it follows a cliffside path toward a small shack with Snake Head Mushrooms all around it. One of these mushrooms... is not what it seems.\n\n\nAs you head back down the path, look to the right when you reach the top of the stairs leading back down to the temple. A long slope here will send you down to a large arena, and its here you'll have your second and final encounter with an old foe - the Venom Daoist.\n\n\nBefore you do, you should also head through the nearby gateway to find a large field with a giant tree in the middle. Off on the right, you can find a wooden ledge overlooking the mountains with a **Treasure Chest** full of random materials and a Soul Remigration Pill.\n\n\nHead back to the altar, and pluck what should be the fourth and final talisman. Before you can celebrate this act, a large winged monster with a hand for a face will appear to aggressively punish you for this deed!\n\n\nNow that you've done all there is to do here, you can return to rest at the Shrine, and head toward the large field to finally catch up to the Violet Spider and her master, the Hundred-Eyed Daoist.\n\n## Yaoguai King Boss Fight - Hundred-Eyed Daoist Master\n\nHis other burrowing attack is equally damaging, though it comes less often. He'll start by tossing his sword at you, which will continue to spin wildly in a small circle near your position. As soon as you dodge it, immediately sprint away, as his tail will burst forth around the sword, spraying poison in nearly every direction.",
    "img_below_text": "The attack won't stop there, as once he re-burrows, you'll need to keep your eyes and ears peeled. After a brief moment, his electrified sword will come hurtling in from a corner of the arena with a small lightning strike noise, and you'll need to dodge it as it embeds itself in the ground. Stay clear of the impact site, as the boss will then burrow out to grab it and perform a quick double slash with the electrified blade before spinning about (at which you should then hop in and attack).",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Temple of Yellow Flowers Walkthrough\n            - Section Title: Yaoguai King Boss Fight - Hundred-Eyed Daoist Master\n\n            Context:\n            - Preceding Text: \"# Temple of Yellow Flowers Walkthrough\n\nWhen you untangle yourself from the webbing, you'll find yourself high above the Webbed Hollow, on a mountain path leading to a large temple filled with Daoist martial artists.\n\n\nAfter grabbing the Treasure Chest they were guarding, head right past a third green Wisp, and through a small ravine guarded by several Daoists to reach a large forested area.\n\n\nFollow the pathway, and you'll find a set of stairs leading up to a large courtyard where a tough Yaoguai Chief is training a large group of Sword Daoists.\n\n\nBe sure to look for a smaller path off to the right as you climb, and you can spot a lone **Treasure Chest** hiding in an alcove.\n\n\nFollow the winding mountain trail up several stairs and avoiding other Worm Practitioners until you reach the very top. The road will widen out as it follows a cliffside path toward a small shack with Snake Head Mushrooms all around it. One of these mushrooms... is not what it seems.\n\n\nAs you head back down the path, look to the right when you reach the top of the stairs leading back down to the temple. A long slope here will send you down to a large arena, and its here you'll have your second and final encounter with an old foe - the Venom Daoist.\n\n\nBefore you do, you should also head through the nearby gateway to find a large field with a giant tree in the middle. Off on the right, you can find a wooden ledge overlooking the mountains with a **Treasure Chest** full of random materials and a Soul Remigration Pill.\n\n\nHead back to the altar, and pluck what should be the fourth and final talisman. Before you can celebrate this act, a large winged monster with a hand for a face will appear to aggressively punish you for this deed!\n\n\nNow that you've done all there is to do here, you can return to rest at the Shrine, and head toward the large field to finally catch up to the Violet Spider and her master, the Hundred-Eyed Daoist.\n\n## Yaoguai King Boss Fight - Hundred-Eyed Daoist Master\n\nHis other burrowing attack is equally damaging, though it comes less often. He'll start by tossing his sword at you, which will continue to spin wildly in a small circle near your position. As soon as you dodge it, immediately sprint away, as his tail will burst forth around the sword, spraying poison in nearly every direction.\"\n            - Following Text: \"The attack won't stop there, as once he re-burrows, you'll need to keep your eyes and ears peeled. After a brief moment, his electrified sword will come hurtling in from a corner of the arena with a small lightning strike noise, and you'll need to dodge it as it embeds itself in the ground. Stay clear of the impact site, as the boss will then burrow out to grab it and perform a quick double slash with the electrified blade before spinning about (at which you should then hop in and attack).\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}