{
    "chunk_id": 595637245021,
    "source_file": "Cat_Eye_Beads.md",
    "h1_title": "Cat Eye Beads",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/64/Cat_Eye_Beads_2.jpg",
    "alt_text": "Cat Eye Beads 2.jpg",
    "position_desc": 1,
    "img_above_text": "# Cat Eye Beads\n\nThe Cat Eye Beads iare one of the Curios items you can find in Black Myth: Wukong. Given its location in the game, it will likely be one of the first ones you find.\n\nWith the Cat Eye Beads equipped, you will get a slightly increased critical hit chance, which can provide a decent attack boost when you need it.",
    "img_below_text": "Curios items in Black Myth: Wukong can't be upgraded, so you can't increase their strength. Therefore, if you want to increase their power or find a better item for your build, you will need to search them out and switch your Curios item from the Equipment menu.\n\n## Black Myth: Wukong Cat Eye Beads Location\n\nThe Cat Eye Beads can be found by killing the Wandering Wight in the Forest of Wolves \\- Outside the Forest Shrine area in Black Wind Mountain. The Wight is located along the main path towards Guanyin Temple.\n\nYou need to defeat the Wandering Wight before ringing all three bells in Black Wind Mountain and killing Elder Jinchi. This secret boss in the Ancient Guanyin Temple will despawn the Wandering Wight, making the Beads unobtainable. You can also grab the Wandering Wight Spirit here too upon defeating him.\n\nThe Wandering Wight acts as a skill check boss early in the game, so don't be afraid to come back after you have levelled up, just don't kill Elder Jinchi.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Cat Eye Beads\n\n            Context:\n            - Preceding Text: \"# Cat Eye Beads\n\nThe Cat Eye Beads iare one of the Curios items you can find in Black Myth: Wukong. Given its location in the game, it will likely be one of the first ones you find.\n\nWith the Cat Eye Beads equipped, you will get a slightly increased critical hit chance, which can provide a decent attack boost when you need it.\"\n            - Following Text: \"Curios items in Black Myth: Wukong can't be upgraded, so you can't increase their strength. Therefore, if you want to increase their power or find a better item for your build, you will need to search them out and switch your Curios item from the Equipment menu.\n\n## Black Myth: Wukong Cat Eye Beads Location\n\nThe Cat Eye Beads can be found by killing the Wandering Wight in the Forest of Wolves \\- Outside the Forest Shrine area in Black Wind Mountain. The Wight is located along the main path towards Guanyin Temple.\n\nYou need to defeat the Wandering Wight before ringing all three bells in Black Wind Mountain and killing Elder Jinchi. This secret boss in the Ancient Guanyin Temple will despawn the Wandering Wight, making the Beads unobtainable. You can also grab the Wandering Wight Spirit here too upon defeating him.\n\nThe Wandering Wight acts as a skill check boss early in the game, so don't be afraid to come back after you have levelled up, just don't kill Elder Jinchi.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Cat Eye Beads as one of the Curios items in *Black Myth: Wukong*. It explains that equipping the beads slightly increases critical hit chance, offering a modest attack boost early in the game.\n\nImage Summary:  \nThe image displays the in-game equipment menu in *Black Myth: Wukong*, highlighting the Cat Eye Beads as a rare Curios item. The item description confirms its effect of slightly increasing critical hit chance, and it is currently equipped. Additional stats and other Curios items are visible, emphasizing the item's role in gameplay customization.\n\nFollowing Text Summary:  \nThe following text elaborates that Curios items, including the Cat Eye Beads, cannot be upgraded. Players must find and equip other items to enhance their builds. It also details the location of the Cat Eye Beads, which can be obtained by defeating the Wandering Wight in the Forest of Wolves before specific game events occur."
}