{
    "chunk_id": 646297292502,
    "source_file": "Gore-Eye_Daoist.md",
    "h1_title": "Gore-Eye Daoist",
    "h2_title": "Where to Find the Gore-Eye Daoist",
    "h3_title": "Gore-Eye Daoist Mini-Boss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/54/Wukong_Yellow_45.jpg",
    "alt_text": "Wukong Yellow 45.jpg",
    "position_desc": 7,
    "img_above_text": "# Gore-Eye Daoist\n\nThe Gore-Eye Daoist is an optional Yaoguai Chief miniboss that you can encounter in Chapter 2 of Black Myth Wukong. As an optional foe, you can seek out this boss in the Yellow Wind Formation through one of three possible entrances to where the Chapter Boss resides behind sealed stone gates.\n\n* Rewards: Gore-Eye Daoist Spirit\n\n## Where to Find the Gore-Eye Daoist\n\nHowever, in order to open the door, you will need both the Sterness of Stone from the Stone Vanguard Boss, and Keeness of Tiger from the Tiger Vanguard Boss. With both Key Items, you'll be able to interact with the Tally in front of the door and open it, and you'll find the boss after crossing a bridge down to the Windseal Gate.\n\n### Gore-Eye Daoist Mini-Boss Fight and Guide\n\nIf you see him begin to lean back and shake his staff over his head, prepare for him to create several more blood projectiles to shoot out of the eyes on his back. They’ll track your position and fly in an arc towards you, so be ready to dodge or employ your staff spin to destroy the projectiles before they can poison you.",
    "img_below_text": "The most annoying part will be when he hunches over and starts to mumble. Lines of red will start appearing from the eyes on his back toward each of the blood pools he’s created, and will essentially suck the pools back in and regenerate a portion of health. Stop him the moment you see this with a well timed Immobilize, or try a Spirit with a mighty attack to stagger him out of it, otherwise the fight will just go on longer.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Gore-Eye Daoist\n            - Section Title: Where to Find the Gore-Eye Daoist\n            - Sub-Section Title: Gore-Eye Daoist Mini-Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Gore-Eye Daoist\n\nThe Gore-Eye Daoist is an optional Yaoguai Chief miniboss that you can encounter in Chapter 2 of Black Myth Wukong. As an optional foe, you can seek out this boss in the Yellow Wind Formation through one of three possible entrances to where the Chapter Boss resides behind sealed stone gates.\n\n* Rewards: Gore-Eye Daoist Spirit\n\n## Where to Find the Gore-Eye Daoist\n\nHowever, in order to open the door, you will need both the Sterness of Stone from the Stone Vanguard Boss, and Keeness of Tiger from the Tiger Vanguard Boss. With both Key Items, you'll be able to interact with the Tally in front of the door and open it, and you'll find the boss after crossing a bridge down to the Windseal Gate.\n\n### Gore-Eye Daoist Mini-Boss Fight and Guide\n\nIf you see him begin to lean back and shake his staff over his head, prepare for him to create several more blood projectiles to shoot out of the eyes on his back. They’ll track your position and fly in an arc towards you, so be ready to dodge or employ your staff spin to destroy the projectiles before they can poison you.\"\n            - Following Text: \"The most annoying part will be when he hunches over and starts to mumble. Lines of red will start appearing from the eyes on his back toward each of the blood pools he’s created, and will essentially suck the pools back in and regenerate a portion of health. Stop him the moment you see this with a well timed Immobilize, or try a Spirit with a mighty attack to stagger him out of it, otherwise the fight will just go on longer.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Gore-Eye Daoist, an optional miniboss in *Black Myth: Wukong*. Players can encounter this Yaoguai Chief in Chapter 2 by unlocking sealed gates in the Yellow Wind Formation using two key items obtained from other bosses. The miniboss rewards players with the Gore-Eye Daoist Spirit upon defeat. The text also provides initial combat tips, warning players about blood projectiles that track their position and suggesting strategies to dodge or counter them.\n\nImage Summary:\nThe image depicts the Gore-Eye Daoist miniboss during combat. The scene is dominated by a dark, red-hued environment, with the boss surrounded by glowing red lines and blood-like effects. The player character is engaged in battle, wielding a staff against the miniboss, whose grotesque appearance includes multiple eyes on its back. The health bar labeled \"Gore-Eye Daoist\" is visible, indicating the ongoing fight. The UI elements at the bottom suggest active abilities and health/mana status, reinforcing the image's role as part of a gameplay guide.\n\nFollowing Text Summary:\nThe following text provides additional combat strategies for the Gore-Eye Daoist fight. It warns players about the boss's ability to regenerate health by absorbing blood pools through red lines emanating from its back. Players are advised to interrupt this action using Immobilize or a Spirit with a powerful attack to prevent prolonged combat."
}