{
    "chunk_id": 877139864749,
    "source_file": "Captain_Wise-Voice.md",
    "h1_title": "Captain Wise-Voice",
    "h2_title": "Where to Find Captain Wise-Voice",
    "h3_title": "Captain Wise-Voice Boss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/91/Wukong_Pagoda_85.jpg",
    "alt_text": "Wukong Pagoda 85.jpg",
    "position_desc": 5,
    "img_above_text": "# Captain Wise-Voice\n\nCaptain Wise-Voice is a required Yaoguai King boss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Responsible for the \"beguiling chant\" that curses you in the Pagoda Realm, you can find this boss inside the Mani Wheel at the top of the prison.\n\n* **Rewards:** Spirit of Captain Wise-Voice, Mind Core\n\n## Where to Find Captain Wise-Voice\n\nCaptain Wise-Voice is one of the four captains you can find in Chapter 3, and is a required boss to escape the prison of the Pagoda Realm. You can reach him by escaping up through the four levels of the Pagoda Prison and past the Outside the Wheel Shrine.\n\n### Captain Wise-Voice Boss Fight and Guide\n\nIt can also generate electrical power in its front leg, and stomp down to create a ring that extends outward, requiring you to dodge over it or use the Pillar Stance to evade it entirely.",
    "img_below_text": "Other times, it will perform a series of slow stomps, causing multiple electric spots to appear around you. You'll need to sprint away from these spots before a delayed lightning blast can strike the ground where you are.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Captain Wise-Voice\n            - Section Title: Where to Find Captain Wise-Voice\n            - Sub-Section Title: Captain Wise-Voice Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Captain Wise-Voice\n\nCaptain Wise-Voice is a required Yaoguai King boss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Responsible for the \"beguiling chant\" that curses you in the Pagoda Realm, you can find this boss inside the Mani Wheel at the top of the prison.\n\n* **Rewards:** Spirit of Captain Wise-Voice, Mind Core\n\n## Where to Find Captain Wise-Voice\n\nCaptain Wise-Voice is one of the four captains you can find in Chapter 3, and is a required boss to escape the prison of the Pagoda Realm. You can reach him by escaping up through the four levels of the Pagoda Prison and past the Outside the Wheel Shrine.\n\n### Captain Wise-Voice Boss Fight and Guide\n\nIt can also generate electrical power in its front leg, and stomp down to create a ring that extends outward, requiring you to dodge over it or use the Pillar Stance to evade it entirely.\"\n            - Following Text: \"Other times, it will perform a series of slow stomps, causing multiple electric spots to appear around you. You'll need to sprint away from these spots before a delayed lightning blast can strike the ground where you are.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Captain Wise-Voice as a required boss fight in Chapter 3 of *Black Myth: Wukong*. This Yaoguai King boss is responsible for a curse in the Pagoda Realm and can be found inside the Mani Wheel at the top of the prison. It describes the rewards for defeating Captain Wise-Voice and briefly mentions its ability to generate electrical power with its front leg, creating an outward ring attack that players must evade.\n\nImage Summary:\nThe image depicts an in-game scene from *Black Myth: Wukong*, showing the boss fight against Captain Wise-Voice. The dark, ominous environment highlights the boss's large and grotesque form, with visible tentacle-like appendages and a glowing attack effect on the ground. The player’s health and stamina bars, along with ability icons, are visible in the interface, emphasizing the combat mechanics. The boss’s name and health bar are displayed at the bottom, indicating an active fight.\n\nFollowing Text Summary:\nThe following text elaborates on Captain Wise-Voice's attack patterns, describing a series of slow stomps that create electric spots around the player. These spots trigger delayed lightning blasts, requiring the player to sprint away to avoid damage. This further emphasizes the strategic evasion required during the fight."
}