{
    "chunk_id": 733831437105,
    "source_file": "Chapter_5_Secret_-_Bishui_Cave_Walkthrough.md",
    "h1_title": "Chapter 5 Secret - Bishui Cave Walkthrough",
    "h2_title": "Yaoguai Chief - Top Takes Bottom, Bottom Takes Top",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/c0/Bishui_Cave_Walkthrough_%2824%29.png",
    "alt_text": "Bishui Cave Walkthrough \\(24\\).png",
    "position_desc": 10,
    "img_above_text": "# Chapter 5 Secret - Bishui Cave Walkthrough\n\nTo your left, immediately as you enter the room, you'll find the Purge Pit Keeper's Shrine.\n\n\nAfter activating the first of the Keeper's Shrines, face away from it and head to the right. Go down the stairs and to the end of the path to find a Meditation Spot.\n\nReturn to the Keeper's Shrine and continue past it, following the path to the right. Head down to the slope, collecting the green Wisp on the left and into the center of the room. As you reach the middle, you'll be met by the first of the bosses in this secret area.\n\n## Yaoguai Chief - Top Takes Bottom, Bottom Takes Top\n\nAfter successfully wounding them both enough, you'll see them merge together and form the golden spiked ball. They'll use this to jump up in the air, pull back, and spin to launch themselves toward you. They will keep rolling around the room, and it's just a case of dodging this. However, when they're about to finish, they become significantly more aggressive and will leap up in the air again, slamming the ball down and causing explosions on impact. You'll need to dodge or jump to avoid this. Then the cycle will repeat again until you're able to put an end to them.",
    "img_below_text": "After defeating Top Takes Bottom, Bottom Takes Top, go up the stairs. Take out the bull guard on the right as you enter the next section, and collect the green Wisp it stands near.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chapter 5 Secret - Bishui Cave Walkthrough\n            - Section Title: Yaoguai Chief - Top Takes Bottom, Bottom Takes Top\n\n            Context:\n            - Preceding Text: \"# Chapter 5 Secret - Bishui Cave Walkthrough\n\nTo your left, immediately as you enter the room, you'll find the Purge Pit Keeper's Shrine.\n\n\nAfter activating the first of the Keeper's Shrines, face away from it and head to the right. Go down the stairs and to the end of the path to find a Meditation Spot.\n\nReturn to the Keeper's Shrine and continue past it, following the path to the right. Head down to the slope, collecting the green Wisp on the left and into the center of the room. As you reach the middle, you'll be met by the first of the bosses in this secret area.\n\n## Yaoguai Chief - Top Takes Bottom, Bottom Takes Top\n\nAfter successfully wounding them both enough, you'll see them merge together and form the golden spiked ball. They'll use this to jump up in the air, pull back, and spin to launch themselves toward you. They will keep rolling around the room, and it's just a case of dodging this. However, when they're about to finish, they become significantly more aggressive and will leap up in the air again, slamming the ball down and causing explosions on impact. You'll need to dodge or jump to avoid this. Then the cycle will repeat again until you're able to put an end to them.\"\n            - Following Text: \"After defeating Top Takes Bottom, Bottom Takes Top, go up the stairs. Take out the bull guard on the right as you enter the next section, and collect the green Wisp it stands near.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the initial steps in navigating Bishui Cave, including activating the Purge Pit Keeper's Shrine and encountering the first boss, Yaoguai Chief, in the secret area. The boss battle involves dodging a golden spiked ball attack.\n\nImage Summary:\nThe image depicts a dark, rocky cave entrance with stairs leading up to it, surrounded by intricate stone carvings and illuminated lanterns. A character is positioned in the foreground, seemingly preparing to ascend the stairs. The environment suggests a mysterious and potentially dangerous area, consistent with the narrative of exploring Bishui Cave and facing challenges like the Yaoguai Chief.\n\nFollowing Text Summary:\nThe following text provides guidance on what to do after defeating the Yaoguai Chief. It instructs the player to ascend the stairs, defeat a bull guard in the next section, and collect a green Wisp near the guard."
}