{
    "chunk_id": 45034570682,
    "source_file": "Black_Wind_King.md",
    "h1_title": "Black Wind King",
    "h2_title": "Black Wind King Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/ba/Wukong_BlackWind_15.jpg",
    "alt_text": "Wukong BlackWind 15.jpg",
    "position_desc": 9,
    "img_above_text": "# Black Wind King\n\nThe Black Wind King is a required Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located in the middle of Black Wind Cave, this is the first of two forms you'll fight the self-imposed King of Black Wind Mountain. Even in his human form, he can be incredibly powerful.\n\n* **Rewards:** Cloud Step Spell, Yarn x3, 1049 Experience, 688 Will\n\n\nAs a required boss, you won't be able to miss running into the Black Wind King. Once you reach the Black Wind Cave area, simply head through the tunnel, take out any Wolf Assassins that may appear, and keep to the right when you spot a Meditation Spot to continue through the darkened passages to reach the Cave Interior Shrine, where the King waits beyond the nearby doors.\n\n## Black Wind King Boss Fight and Guide\n\nAfter losing about half his health, the Black Wind King will get even more aggressive with his titular wind, and start disappearing entirely in a gust without forming into a wisp. When this happens, retreat and regain your stamina, and be ready for the moment he appears, as he’ll likely do so in mid-combo attack.",
    "img_below_text": "These can include a length combo that he’ll usually start with a shove before stabbing his spear into the ground in front of him, then grabbing onto it to launch himself off feet first before quickly slicing downward at you, and then slamming his fist down for a massive explosion you’ll want to steer clear of.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Black Wind King\n            - Section Title: Black Wind King Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Black Wind King\n\nThe Black Wind King is a required Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located in the middle of Black Wind Cave, this is the first of two forms you'll fight the self-imposed King of Black Wind Mountain. Even in his human form, he can be incredibly powerful.\n\n* **Rewards:** Cloud Step Spell, Yarn x3, 1049 Experience, 688 Will\n\n\nAs a required boss, you won't be able to miss running into the Black Wind King. Once you reach the Black Wind Cave area, simply head through the tunnel, take out any Wolf Assassins that may appear, and keep to the right when you spot a Meditation Spot to continue through the darkened passages to reach the Cave Interior Shrine, where the King waits beyond the nearby doors.\n\n## Black Wind King Boss Fight and Guide\n\nAfter losing about half his health, the Black Wind King will get even more aggressive with his titular wind, and start disappearing entirely in a gust without forming into a wisp. When this happens, retreat and regain your stamina, and be ready for the moment he appears, as he’ll likely do so in mid-combo attack.\"\n            - Following Text: \"These can include a length combo that he’ll usually start with a shove before stabbing his spear into the ground in front of him, then grabbing onto it to launch himself off feet first before quickly slicing downward at you, and then slamming his fist down for a massive explosion you’ll want to steer clear of.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Black Wind King, a mandatory boss in *Black Myth Wukong* encountered in Chapter 1. The fight takes place in the Black Wind Cave and marks the first of two forms of this Yaoguai King. Players are advised on how to navigate the cave to reach the boss and are informed about the rewards for defeating him. The text also highlights the boss's increasing aggression and use of wind-based attacks as his health decreases.\n\nImage Summary:  \nThe image depicts an in-game moment from the boss fight with the Black Wind King in *Black Myth Wukong*. The scene shows the player character mid-battle, evading an attack from the Black Wind King, who is wielding a spear and surrounded by swirling wind effects. The boss's health bar is visible, along with a dialogue line from the Black Wind King, emphasizing his disdain for the player. The image visually reinforces the intensity and dynamic nature of the fight.\n\nFollowing Text Summary:  \nThe following text provides a detailed description of the Black Wind King's attack patterns, including a complex combo starting with a shove and ending with a powerful explosion. Players are advised to avoid these attacks and stay cautious during the fight. This elaboration helps players anticipate and strategize against the boss's moves."
}