{
    "chunk_id": 198334067116,
    "source_file": "Agate_Jar.md",
    "h1_title": "Agate Jar",
    "h2_title": "Black Myth: Wukong Agate Jar Location",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a3/Agate_Jar_1.jpg",
    "alt_text": "Agate Jar 1.jpg",
    "position_desc": 2,
    "img_above_text": "# Agate Jar\n\nThe Curios items in Black Myth: Wukong can't be upgraded, so you can't enhance their buffs in any way. Therefore, if you find a better item for your build, you will want to switch the items out as soon as you can.\n\n## Black Myth: Wukong Agate Jar Location\n\nThe Agate Jar can be found in a box in the arena after fighting the Black Wind King in Black Wind Cave \\- Cave Interior in Black Wind Mountain. Simply defeat the Black Wind King and head over to this box in the arena to get the Agate Jar.",
    "img_below_text": "For even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Agate Jar\n            - Section Title: Black Myth: Wukong Agate Jar Location\n\n            Context:\n            - Preceding Text: \"# Agate Jar\n\nThe Curios items in Black Myth: Wukong can't be upgraded, so you can't enhance their buffs in any way. Therefore, if you find a better item for your build, you will want to switch the items out as soon as you can.\n\n## Black Myth: Wukong Agate Jar Location\n\nThe Agate Jar can be found in a box in the arena after fighting the Black Wind King in Black Wind Cave \\- Cave Interior in Black Wind Mountain. Simply defeat the Black Wind King and head over to this box in the arena to get the Agate Jar.\"\n            - Following Text: \"For even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text explains that Curios items in *Black Myth: Wukong*, such as the Agate Jar, cannot be upgraded or enhanced. It provides details on the location of the Agate Jar, which is found in a box within the arena after defeating the Black Wind King in the Black Wind Cave (Cave Interior) at Black Wind Mountain.\n\nImage Summary:  \nThe image depicts the in-game location where the Agate Jar can be found in *Black Myth: Wukong*. It shows a character standing in front of a wooden platform with a box placed on a table, which is likely the container holding the Agate Jar. The setting appears to be an arena with a dark, atmospheric design, consistent with the description of the Black Wind Cave.\n\nFollowing Text Summary:  \nThe following text suggests exploring additional guides for locating other items in *Black Myth: Wukong*, including Drinks, Soaks, Weapons, Armor, and Gear sets, to assist players in their progression and item collection."
}