{
    "chunk_id": 270326134026,
    "source_file": "Apramana_Bat.md",
    "h1_title": "Apramana Bat",
    "h2_title": "Where to Find the Apramana Bat",
    "h3_title": "Apramana Bat Miniboss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/53/Wukong_Bitter_42.jpg",
    "alt_text": "Wukong Bitter 42.jpg",
    "position_desc": 6,
    "img_above_text": "# Apramana Bat\n\nApramana Bat is an optional and missable Yaoguai Chief boss fight, and can be encountered in Chapter 3 of Black Myth Wukong. First located along the North Shore of the Bitter Lake, you'll want to face it before entering the Valley of Ecstasy or you'll miss out on this fight altogether.\n\n* **Rewards:** Cold Iron Leaves x2, 1847 Experience, 1176 Will (First Encounter), Apramana Bat Spirit (Second Encounter)\n\n## Where to Find the Apramana Bat\n\nA much larger gold variant of the Apramana Bats you can encounter elsewhere in Chapter 3, the Apramana Bat boss can be found once you leave the Turtle Island. From the North Shore of Bitter Lake, head right from the Shrine and along the coast until you come upon the skeletal remains of the Snake General. Once you arrive where his skull is located, the giant bat will ambush you.\n\n### Apramana Bat Miniboss Fight and Guide\n\nIf you see its legs extend upwards (similar to the lesser variants) it's preparing to slam down its talons on you in a quick downward slam. However, deflecting with Rock Solid will send it flying backward, only to topple out of the sky and provide you a moment to sprint over and retaliate.",
    "img_below_text": "If you aren't getting enough time in, consider using Immobilize to keep him grounded, and use the Pillar Stance to extend your height as it tries to take off.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Apramana Bat\n            - Section Title: Where to Find the Apramana Bat\n            - Sub-Section Title: Apramana Bat Miniboss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Apramana Bat\n\nApramana Bat is an optional and missable Yaoguai Chief boss fight, and can be encountered in Chapter 3 of Black Myth Wukong. First located along the North Shore of the Bitter Lake, you'll want to face it before entering the Valley of Ecstasy or you'll miss out on this fight altogether.\n\n* **Rewards:** Cold Iron Leaves x2, 1847 Experience, 1176 Will (First Encounter), Apramana Bat Spirit (Second Encounter)\n\n## Where to Find the Apramana Bat\n\nA much larger gold variant of the Apramana Bats you can encounter elsewhere in Chapter 3, the Apramana Bat boss can be found once you leave the Turtle Island. From the North Shore of Bitter Lake, head right from the Shrine and along the coast until you come upon the skeletal remains of the Snake General. Once you arrive where his skull is located, the giant bat will ambush you.\n\n### Apramana Bat Miniboss Fight and Guide\n\nIf you see its legs extend upwards (similar to the lesser variants) it's preparing to slam down its talons on you in a quick downward slam. However, deflecting with Rock Solid will send it flying backward, only to topple out of the sky and provide you a moment to sprint over and retaliate.\"\n            - Following Text: \"If you aren't getting enough time in, consider using Immobilize to keep him grounded, and use the Pillar Stance to extend your height as it tries to take off.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces the Apramana Bat, an optional miniboss in *Black Myth Wukong* that players can encounter in Chapter 3. It explains the boss's location near the North Shore of Bitter Lake and provides details on how to find it. The text also mentions the rewards for defeating the boss and hints at its unique appearance as a larger, golden variant of other bats encountered earlier.\n\nImage Summary:  \nThe image depicts an in-game battle scene from *Black Myth Wukong*, showing the player character engaged in combat with the Apramana Bat miniboss. The snowy terrain and skeletal remains in the background align with the described location near the Snake General's skull. The player's health bar, abilities, and the Apramana Bat's health bar are visible, emphasizing the active fight and the boss's role as a challenging enemy.\n\nFollowing Text Summary:  \nThe following text provides additional combat strategies for defeating the Apramana Bat. It suggests using the Immobilize ability to keep the boss grounded and the Pillar Stance to counter its aerial movements, offering tactical advice to players struggling with the fight."
}