{
    "chunk_id": 87590149194,
    "source_file": "Chen_Loong.md",
    "h1_title": "Chen Loong",
    "h2_title": "Where to Find Chen Loong",
    "h3_title": "Chen Loong Boss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/fc/Wukong_Bitter_16.jpg",
    "alt_text": "Wukong Bitter 16.jpg",
    "position_desc": 12,
    "img_above_text": "# Chen Loong\n\nChen Loong is a character and possible boss fight first found in Chapter 3 of Black Myth Wukong. Though initially hostile, you can perform a task after defeating him in combat to unlock a Painted Realm where you can quickly access multiple merchants and services.\n\n* **Rewards:** TBA\n\n## Where to Find Chen Loong\n\nChen Loong is an optional opponent who has their own quest, which you can find shortly after leaving Turtle Rock for the North Shore of the Bitter Lake. From the Shrine, head left while facing it to head along the lakeshore toward a lone shack by the water.\n\nSearch the shallows near this shack, and you'll find the old dragon wandering the waters, and will become hostile as you approach.\n\n### Chen Loong Boss Fight and Guide\n\nHis strongest attack by far is when he jumps into the air with his green weapon, charging it with energy before crashing down with it. It will cause a huge electrical explosion when he lands, but then spread outward with several lighting strikes that cover a wide area.",
    "img_below_text": "The second hit can be extremely tough to dodge, but using the Pillar Stance to get off the ground can soak the blow if you have stamina to spare (though it will probably still stun you).\n\nRemember that you also have Zhu Bajie as an ally in this fight, and while he won't be able to hold his attention for too long, but he can be useful at giving you some breathing room or interrupting attacks.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chen Loong\n            - Section Title: Where to Find Chen Loong\n            - Sub-Section Title: Chen Loong Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Chen Loong\n\nChen Loong is a character and possible boss fight first found in Chapter 3 of Black Myth Wukong. Though initially hostile, you can perform a task after defeating him in combat to unlock a Painted Realm where you can quickly access multiple merchants and services.\n\n* **Rewards:** TBA\n\n## Where to Find Chen Loong\n\nChen Loong is an optional opponent who has their own quest, which you can find shortly after leaving Turtle Rock for the North Shore of the Bitter Lake. From the Shrine, head left while facing it to head along the lakeshore toward a lone shack by the water.\n\nSearch the shallows near this shack, and you'll find the old dragon wandering the waters, and will become hostile as you approach.\n\n### Chen Loong Boss Fight and Guide\n\nHis strongest attack by far is when he jumps into the air with his green weapon, charging it with energy before crashing down with it. It will cause a huge electrical explosion when he lands, but then spread outward with several lighting strikes that cover a wide area.\"\n            - Following Text: \"The second hit can be extremely tough to dodge, but using the Pillar Stance to get off the ground can soak the blow if you have stamina to spare (though it will probably still stun you).\n\nRemember that you also have Zhu Bajie as an ally in this fight, and while he won't be able to hold his attention for too long, but he can be useful at giving you some breathing room or interrupting attacks.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Chen Loong as a character and optional boss in *Black Myth Wukong*, encountered in Chapter 3 near the North Shore of the Bitter Lake. It describes his location and mentions that he becomes hostile when approached. The text also highlights his most powerful attack, which involves a charged leap with a green weapon, resulting in a large electrical explosion and subsequent lightning strikes.\n\nImage Summary:  \nThe image depicts the intense moment of Chen Loong's signature attack during the boss fight. The scene shows a dramatic electrical explosion spreading across the battlefield, with the player character mid-air, seemingly evading or reacting to the attack. The visual effects emphasize the destructive power of the attack, with lightning and energy radiating outward. The HUD elements indicate this is an in-game combat sequence, with Chen Loong's name and health bar visible at the bottom.\n\nFollowing Text Summary:  \nThe following text provides strategies for dealing with Chen Loong's powerful attack. It suggests using the Pillar Stance to mitigate damage and avoid being grounded, though it may still result in a stun. Additionally, it notes that Zhu Bajie, an ally, can assist in the fight by distracting Chen Loong or interrupting his attacks, giving the player opportunities to recover or reposition."
}