{
    "chunk_id": 899214777307,
    "source_file": "Bamboo_Grove_Walkthrough.md",
    "h1_title": "Bamboo Grove Walkthrough",
    "h2_title": "Snake Trail",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/45/Wukong_Bamboo_13.jpg",
    "alt_text": "Wukong Bamboo 13.jpg",
    "position_desc": 13,
    "img_above_text": "# Bamboo Grove Walkthrough\n\nThe Bamboo Grove is the second main region of Chapter 1's Black Wind Mountain in Black Myth: Wukong. Below you'll find a guide to the progressing through the grove and learning how to cultivate Spirits, accessing a secret realm, as well as how to defeat the many bosses of this area that include Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble.\n\n* **Jump to A Section:**\n* **Back Hills**\n* **Snake Trail**\n- Yaoguai Chief - Baw-Li-Guhh-Lang\n- Yaoguai Chief - Guangmo\n* **Marsh of the White Mist**\n- Boss FIght - Whiteclad Noble\n\n\nTo advance, keep heading up the stairway to cross the high bridge over the falls, where you’ll soon see the golden trail of a nearby shrine beckoning you left. Before making that turn, be sure to look to the right to find a small wooden gazebo with a small table, and open the small gold box on top to find a variety of medicines, including 2 **Tiger Subduing Pellets** , 1 **Evil Repelling Medicament** and 1 **Amplification Pellet**.\n\n## Snake Trail\n\nHeading down the trail from the Skeletal Snakes, you’ll find a stream where another Snake Patroller wanders, as well as an optional area you can investigate by following the stream instead of going under the bridge (though you should still look just past the bridge to find green wisp spirits to capture for a huge amount of Will).",
    "img_below_text": "This path leads to a marshy swamp area full of tall white reed flowers. Several Croaky enemies hide within them, so use your lock-on to identify them so you aren’t ambushed. However, as you make your way through the marsh toward a large stone mural in the cliffs, an optional mini-boss will leap out to fight you.\n\n### Yaoguai Chief Mini-Boss Fight - Baw-Li-Guhh-Lang\n\nA gargantuan Yaoguai Toad, Baw-Li-Guhh-Lang will waste no time leaping into battle with a powerful slam attack from the air. While he doesn’t have many moves, they can often land extremely quickly, which means you’ll need to be ready to dodge at any moment.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bamboo Grove Walkthrough\n            - Section Title: Snake Trail\n\n            Context:\n            - Preceding Text: \"# Bamboo Grove Walkthrough\n\nThe Bamboo Grove is the second main region of Chapter 1's Black Wind Mountain in Black Myth: Wukong. Below you'll find a guide to the progressing through the grove and learning how to cultivate Spirits, accessing a secret realm, as well as how to defeat the many bosses of this area that include Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble.\n\n* **Jump to A Section:**\n* **Back Hills**\n* **Snake Trail**\n- Yaoguai Chief - Baw-Li-Guhh-Lang\n- Yaoguai Chief - Guangmo\n* **Marsh of the White Mist**\n- Boss FIght - Whiteclad Noble\n\n\nTo advance, keep heading up the stairway to cross the high bridge over the falls, where you’ll soon see the golden trail of a nearby shrine beckoning you left. Before making that turn, be sure to look to the right to find a small wooden gazebo with a small table, and open the small gold box on top to find a variety of medicines, including 2 **Tiger Subduing Pellets** , 1 **Evil Repelling Medicament** and 1 **Amplification Pellet**.\n\n## Snake Trail\n\nHeading down the trail from the Skeletal Snakes, you’ll find a stream where another Snake Patroller wanders, as well as an optional area you can investigate by following the stream instead of going under the bridge (though you should still look just past the bridge to find green wisp spirits to capture for a huge amount of Will).\"\n            - Following Text: \"This path leads to a marshy swamp area full of tall white reed flowers. Several Croaky enemies hide within them, so use your lock-on to identify them so you aren’t ambushed. However, as you make your way through the marsh toward a large stone mural in the cliffs, an optional mini-boss will leap out to fight you.\n\n### Yaoguai Chief Mini-Boss Fight - Baw-Li-Guhh-Lang\n\nA gargantuan Yaoguai Toad, Baw-Li-Guhh-Lang will waste no time leaping into battle with a powerful slam attack from the air. While he doesn’t have many moves, they can often land extremely quickly, which means you’ll need to be ready to dodge at any moment.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text provides a guide to navigating the Bamboo Grove region in the game \"Black Myth: Wukong,\" specifically focusing on the Snake Trail section. It describes the path players should take, including a bridge and a gazebo with valuable items, and mentions the presence of Snake Patrollers and green wisp spirits.\n\nImage Summary:\nThe image depicts an in-game scene from \"Black Myth: Wukong,\" showing a character engaged in combat with a frog-like creature in a marshy area with tall white reed flowers. The setting appears to be part of the Snake Trail section, where players encounter various enemies, including Croaky foes, as they progress through the game.\n\nFollowing Text Summary:\nThe following text describes the continuation of the player's journey through a marshy swamp area filled with tall white reed flowers, where Croaky enemies are hidden. It warns players to use lock-on to avoid ambushes and introduces an optional mini-boss fight against a Yaoguai Toad named Baw-Li-Guhh-Lang, who attacks with a powerful slam."
}