{
    "chunk_id": 719676724070,
    "source_file": "Bitter_Lake_Walkthrough.md",
    "h1_title": "Bitter Lake Walkthrough",
    "h2_title": "Boss Fight - Chen Loong",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/4b/Wukong_Bitter_13.jpg",
    "alt_text": "Wukong Bitter 13.jpg",
    "position_desc": 44,
    "img_above_text": "# Bitter Lake Walkthrough\n\nAs you draw close, you'll hear a voice coming from the cymbals, who is arguing with a woman refusing to let the trapped person out. With a loud gong, the trapped \"Admiral\" will use the cymbal to awaken a giant turtle whose mountainous shell you're actually standing on.\n\nAs the turtle begins to swim through the Bitter Seal, the woman will become aware of your presence, starting this new region off with a bang of a boss fight.\n\n\nAs long as your patient to wait for the right moments to get in close and attack, and make sure you're using shock-quelling medicine, you'll be able to come out on top. Even as Kang-Jin Star tries to flee in her dragon form, the Destined One will see to it that she crashes into the large cymbals, freeing the prisoner inside!\n\nThis imprisoned Pig Guai is none other than Zhu Bajie, who traveled with Sun Wukong during his adventures in Journey to the West!\n\n\nAs you start exploring the path over to the right, an echoing voice will lead you to a large open platform where dragon humanoid figure appears to be frozen in place with its fishing rod. If you interact with it while holding the Loong Scales, it will crackle to life, and begin a new secret boss fight.\n\n\nWhen he falls, you'll earn some Fine Gold Thread and another Loong Pearl, and can loot a nearby chest that appears for the Mountain-Shaking Claw material and Breath of Fire Soak for your Gourd. This new material will unlock the upgrade path for your Loongwreathe Staff into the Golden Loong Staff, but you'll need to find and defeat the last of the four Loongs to craft it.\n\nOnce you've had your fill of exploring the \"Turtle Island\", you can head to the front where the small Pig Guai stands waiting, and interact with him for the turtle to finally make its landing at the next part of the Bitter Lake.\n\n\nStart by heading along the shore and defeating various Frozen Corpses, and look for a small building in the distance by the water's edge. As you near it, you can also spot a dragon man standing alone in the shallows. Zhu Bajie seems to know him, but as you approach, you'll be pulled into another boss fight.\n\n## Boss Fight - Chen Loong\n\nAnother electric variation will have him performing an underhanded toss of anywhere between one and three small lightning orbs. They'll bounce along the water for a few hops, and then explode in a much wider area to damage you unless you can dodge to the side.",
    "img_below_text": "He can also shoot lightning directly out of his mouth in a beam of energy. This can happen both when he's on the ground in a quick straight burst right in front of him, or when floating above you in a quick sweep in front of him, and both need quick dodges to stop a quick attack.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bitter Lake Walkthrough\n            - Section Title: Boss Fight - Chen Loong\n\n            Context:\n            - Preceding Text: \"# Bitter Lake Walkthrough\n\nAs you draw close, you'll hear a voice coming from the cymbals, who is arguing with a woman refusing to let the trapped person out. With a loud gong, the trapped \"Admiral\" will use the cymbal to awaken a giant turtle whose mountainous shell you're actually standing on.\n\nAs the turtle begins to swim through the Bitter Seal, the woman will become aware of your presence, starting this new region off with a bang of a boss fight.\n\n\nAs long as your patient to wait for the right moments to get in close and attack, and make sure you're using shock-quelling medicine, you'll be able to come out on top. Even as Kang-Jin Star tries to flee in her dragon form, the Destined One will see to it that she crashes into the large cymbals, freeing the prisoner inside!\n\nThis imprisoned Pig Guai is none other than Zhu Bajie, who traveled with Sun Wukong during his adventures in Journey to the West!\n\n\nAs you start exploring the path over to the right, an echoing voice will lead you to a large open platform where dragon humanoid figure appears to be frozen in place with its fishing rod. If you interact with it while holding the Loong Scales, it will crackle to life, and begin a new secret boss fight.\n\n\nWhen he falls, you'll earn some Fine Gold Thread and another Loong Pearl, and can loot a nearby chest that appears for the Mountain-Shaking Claw material and Breath of Fire Soak for your Gourd. This new material will unlock the upgrade path for your Loongwreathe Staff into the Golden Loong Staff, but you'll need to find and defeat the last of the four Loongs to craft it.\n\nOnce you've had your fill of exploring the \"Turtle Island\", you can head to the front where the small Pig Guai stands waiting, and interact with him for the turtle to finally make its landing at the next part of the Bitter Lake.\n\n\nStart by heading along the shore and defeating various Frozen Corpses, and look for a small building in the distance by the water's edge. As you near it, you can also spot a dragon man standing alone in the shallows. Zhu Bajie seems to know him, but as you approach, you'll be pulled into another boss fight.\n\n## Boss Fight - Chen Loong\n\nAnother electric variation will have him performing an underhanded toss of anywhere between one and three small lightning orbs. They'll bounce along the water for a few hops, and then explode in a much wider area to damage you unless you can dodge to the side.\"\n            - Following Text: \"He can also shoot lightning directly out of his mouth in a beam of energy. This can happen both when he's on the ground in a quick straight burst right in front of him, or when floating above you in a quick sweep in front of him, and both need quick dodges to stop a quick attack.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the progression of the Bitter Lake Walkthrough, leading to a boss fight with Chen Loong. Players encounter Zhu Bajie near a small building by the water's edge, where a dragon-like humanoid figure stands alone in the shallows. Approaching this figure triggers the boss fight with Chen Loong, who uses electric attacks, including bouncing lightning orbs that explode over a wide area.\n\nImage Summary:\nThe image depicts the boss fight against Chen Loong, showcasing the dragon-like humanoid mid-attack, emitting a powerful beam of lightning energy. The setting includes a snowy landscape with frosted trees, a small building in the background, and a water-covered foreground. The player's health and stamina bars are visible, along with ability icons, emphasizing the active combat scenario.\n\nFollowing Text Summary:\nThe following text elaborates on Chen Loong's lightning-based attacks, including a direct beam of energy from his mouth. These attacks occur both on the ground and while floating, requiring precise dodging to avoid damage. The description highlights the intensity of the fight and the need for quick reflexes during the encounter."
}