{
    "chunk_id": 380296451173,
    "source_file": "Black_Loong.md",
    "h1_title": "Black Loong",
    "h2_title": "Black Loong Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5f/Wukong_BlackLoong_10.jpg",
    "alt_text": "Wukong BlackLoong 10.jpg",
    "position_desc": 17,
    "img_above_text": "# Black Loong\n\nBlack Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Hidden beyond a waterfall of sand in the Fright Cliff, you won't be able to encounter this boss until you obtain a Key Item elswhere in this chapter, Black Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* **Rewards:** Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n\n\nWith the Loong Scales, you'll be able to interact with the sandfall and remove it as a barrier, revealing a door behind it to take you into the Black Loong's lair.\n\n## Black Loong Boss Fight and Guide\n\nAnother cheekier way to evade this attack is to simply find some high ground. There are a few raised rocks in the arena — some that he may destroy over time — but can be used to get off the floor where the electric rings travel. There’s one large rock as you first enter the arena, two more near the back on either side of the stairs, and one more opposite the stairs in the far corner.",
    "img_below_text": "Finally, Black Loong can also employ a sandstorm similar to the Yellow Wind Sage. He’ll start to spin his weapons around as he marches toward you, and a sandstorm vortex will spread out to capture you within. You’ll be essentially pulled into its grip, forcing you extremely close to Black Loong, at which point he’ll stop spinning his weapons and slam them outward from his body, causing a massive detonation that’s hard to dodge with low visibility and movement options.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Black Loong\n            - Section Title: Black Loong Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Black Loong\n\nBlack Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Hidden beyond a waterfall of sand in the Fright Cliff, you won't be able to encounter this boss until you obtain a Key Item elswhere in this chapter, Black Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* **Rewards:** Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n\n\nWith the Loong Scales, you'll be able to interact with the sandfall and remove it as a barrier, revealing a door behind it to take you into the Black Loong's lair.\n\n## Black Loong Boss Fight and Guide\n\nAnother cheekier way to evade this attack is to simply find some high ground. There are a few raised rocks in the arena — some that he may destroy over time — but can be used to get off the floor where the electric rings travel. There’s one large rock as you first enter the arena, two more near the back on either side of the stairs, and one more opposite the stairs in the far corner.\"\n            - Following Text: \"Finally, Black Loong can also employ a sandstorm similar to the Yellow Wind Sage. He’ll start to spin his weapons around as he marches toward you, and a sandstorm vortex will spread out to capture you within. You’ll be essentially pulled into its grip, forcing you extremely close to Black Loong, at which point he’ll stop spinning his weapons and slam them outward from his body, causing a massive detonation that’s hard to dodge with low visibility and movement options.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Black Loong, a secret optional boss in Chapter 2 of *Black Myth: Wukong*. Found behind a sandfall in Fright Cliff, this Yaoguai King requires a key item to access. Defeating Black Loong rewards players with rare crafting materials and powerful items. The text also provides a strategy to evade one of Black Loong's electric ring attacks by using elevated rocks in the arena.\n\nImage Summary:  \nThe image depicts a player character engaged in combat with Black Loong in a sandy, low-visibility arena. Black Loong, a large and imposing creature emitting lightning-like energy, dominates the scene, while the player's health and ability icons are visible on the screen. The image highlights the intensity of the boss fight and the challenging environment.\n\nFollowing Text Summary:  \nThe following text describes another of Black Loong's attacks, where he creates a sandstorm vortex that pulls the player close, culminating in a powerful area-wide detonation. The attack is difficult to avoid due to reduced visibility and limited movement options."
}