{
    "chunk_id": 87353143460,
    "source_file": "Centipede_Set.md",
    "h1_title": "Centipede Set",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ee/Wukong_YellowFlower_83.jpg",
    "alt_text": "Wukong YellowFlower 83.jpg",
    "position_desc": 1,
    "img_above_text": "# Centipede Set\n\nThe Centipede Set of Armor and Gear in Black Myth: Wukong consists of four Legendary pieces. It is high-end, mid-game gear. The Centipede Set of Armor and Gear comes with:\n\n* Centipede Hat of Transcendence (headgear) - 43 Defense\n* Centipede Qiang-Jin Armor (body) - 86 Defense, For a short duration after defeating an enemy, moderately increases attack\n* Centipede Spiked Armguard (arms) - 35 Defense, 5% Poison Resistance\n* Centipede Gaiters of Transcendence (legs) - 52 Defense, 5% Poison Resistance\n\nThe Set Bonus for the Centipede Set is\n\n* Poison Ward - For a short duration after defeating an enemy, moderately increases attack (2 pieces)\n* Significantly increases attack while suffering from Poisoned State (4 pieces)\n\nThe full Centipede Set of Armor and Gear is located within Chapter 4 - The Webbed Hollow. It is craftable at any Shrine upon finishing the chapter. Simply rest at the next Shrine to unlock it in the crafting menu.",
    "img_below_text": "The Centipede Set of Armor and Gear can be crafted, as it is the only way to get it. To craft it you need the following:\n\n* 4 Cold Iron Leaves, 2 Fine Gold Thread, 7,500 Will - headgear\n* 5 Cold Iron Leaves, 2 Fine Gold Thread, 8,400 Will - body\n* 1 Cold Iron Leaves, 1 Fine Gold Thread, 4,000 Will - arms\n* 2 Cold Iron Leaves, 1 Fine Gold Thread, 6,000 Will - legs\n\nThe armor can also be upgraded, with Fine Gold Thread and Cold Iron Leaves once you reach Chen Loong and open the Zodiac Realm in The New West in Chapter 3.\n\nFor even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Weapons locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Centipede Set\n\n            Context:\n            - Preceding Text: \"# Centipede Set\n\nThe Centipede Set of Armor and Gear in Black Myth: Wukong consists of four Legendary pieces. It is high-end, mid-game gear. The Centipede Set of Armor and Gear comes with:\n\n* Centipede Hat of Transcendence (headgear) - 43 Defense\n* Centipede Qiang-Jin Armor (body) - 86 Defense, For a short duration after defeating an enemy, moderately increases attack\n* Centipede Spiked Armguard (arms) - 35 Defense, 5% Poison Resistance\n* Centipede Gaiters of Transcendence (legs) - 52 Defense, 5% Poison Resistance\n\nThe Set Bonus for the Centipede Set is\n\n* Poison Ward - For a short duration after defeating an enemy, moderately increases attack (2 pieces)\n* Significantly increases attack while suffering from Poisoned State (4 pieces)\n\nThe full Centipede Set of Armor and Gear is located within Chapter 4 - The Webbed Hollow. It is craftable at any Shrine upon finishing the chapter. Simply rest at the next Shrine to unlock it in the crafting menu.\"\n            - Following Text: \"The Centipede Set of Armor and Gear can be crafted, as it is the only way to get it. To craft it you need the following:\n\n* 4 Cold Iron Leaves, 2 Fine Gold Thread, 7,500 Will - headgear\n* 5 Cold Iron Leaves, 2 Fine Gold Thread, 8,400 Will - body\n* 1 Cold Iron Leaves, 1 Fine Gold Thread, 4,000 Will - arms\n* 2 Cold Iron Leaves, 1 Fine Gold Thread, 6,000 Will - legs\n\nThe armor can also be upgraded, with Fine Gold Thread and Cold Iron Leaves once you reach Chen Loong and open the Zodiac Realm in The New West in Chapter 3.\n\nFor even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Weapons locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Centipede Set of Armor and Gear in *Black Myth: Wukong*, describing its four Legendary pieces, defensive stats, special abilities, and set bonuses. It explains that the gear is mid-game equipment located in Chapter 4 - The Webbed Hollow, and can be crafted at Shrines after completing the chapter.\n\n---\n\nImage Summary:\nThe image depicts an intense battle scene from *Black Myth: Wukong*. It shows a player character fighting a large centipede-like creature named \"Hundred-Eyed Daoist Master\" in a vibrant field of yellow flowers. The creature has a humanoid upper body and insect-like lower body, emphasizing its monstrous design. The game's user interface (UI) is visible, including health bars, abilities, and status indicators, suggesting this is a boss fight tied to the game's narrative progression.\n\n---\n\nFollowing Text Summary:\nThe following text provides crafting requirements for the Centipede Set of Armor and Gear, listing specific materials and in-game currency needed for each piece. It also mentions that the armor can be upgraded later in the game using the same materials, once the Zodiac Realm is unlocked in Chapter 3. Additional guides for other items and locations in *Black Myth: Wukong* are referenced for further exploration."
}