{
    "chunk_id": 940881852224,
    "source_file": "Fuban.md",
    "h1_title": "Fuban",
    "h2_title": "Fuban Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5b/Wukong_Sahali_43.jpg",
    "alt_text": "Wukong Sahali 43.jpg",
    "position_desc": 26,
    "img_above_text": "# Fuban\n\nFuban is a secret optional Yaoguai King boss fight that you can encounter in Chapter 2's secret area in Black Myth Wukong. Located in the Kingdom of Sahali locked away in the past, you'll need to help fulfill a drunken Boar's quest to access this area.\n\n* **Rewards:** Wind Tamer, Sky-Piercing Horn\n\n\nOnce you follow him through the large gate with the small crawlspace, you’ll find yourself overlooking an ancient and forgotten kingdom, and suddenly be transported into the past and into the Kingdom of Sahali.\n\nAfter besting the \"Tiger Vanguard\", you'll find none other than the Yellow Rat Sage, who needs your help defeating a giant scarab Guai in the sands below.\n\n## Fuban Boss Fight and Guide\n\nThat’s your cue to rush in and hit Fuban’s exposed area with your biggest hits, using charged strikes, Spirit Attacks, and Transformation Spells to unload on the beetle before he can rise up.\n\nWhen following this strategy, you’ll quickly burn through the rest of Fuban’s health bar, and between you and the Yellow Wind Sage, the beetle will stand little chance. He can still repeatedly slam his head in the ground to create shockwaves, and finally pull up with a massive explosion. Again, the Pillar Stance can be useful for dodging these blasts, so long as you have a bit of distance away from him too.",
    "img_below_text": "When he’s finally out of health, the battle will be won, and the Yellow Wind Sage will valiantly land the final blow. It’s a shame we’ll have to beat him up in the future. For your part in the battle, you’ll earn a Sky-Piercing Horn weapon material, and a new Vessel: The Wind Tamer!",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fuban\n            - Section Title: Fuban Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Fuban\n\nFuban is a secret optional Yaoguai King boss fight that you can encounter in Chapter 2's secret area in Black Myth Wukong. Located in the Kingdom of Sahali locked away in the past, you'll need to help fulfill a drunken Boar's quest to access this area.\n\n* **Rewards:** Wind Tamer, Sky-Piercing Horn\n\n\nOnce you follow him through the large gate with the small crawlspace, you’ll find yourself overlooking an ancient and forgotten kingdom, and suddenly be transported into the past and into the Kingdom of Sahali.\n\nAfter besting the \"Tiger Vanguard\", you'll find none other than the Yellow Rat Sage, who needs your help defeating a giant scarab Guai in the sands below.\n\n## Fuban Boss Fight and Guide\n\nThat’s your cue to rush in and hit Fuban’s exposed area with your biggest hits, using charged strikes, Spirit Attacks, and Transformation Spells to unload on the beetle before he can rise up.\n\nWhen following this strategy, you’ll quickly burn through the rest of Fuban’s health bar, and between you and the Yellow Wind Sage, the beetle will stand little chance. He can still repeatedly slam his head in the ground to create shockwaves, and finally pull up with a massive explosion. Again, the Pillar Stance can be useful for dodging these blasts, so long as you have a bit of distance away from him too.\"\n            - Following Text: \"When he’s finally out of health, the battle will be won, and the Yellow Wind Sage will valiantly land the final blow. It’s a shame we’ll have to beat him up in the future. For your part in the battle, you’ll earn a Sky-Piercing Horn weapon material, and a new Vessel: The Wind Tamer!\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Fuban as a secret optional boss in *Black Myth: Wukong*, encountered in Chapter 2 within the Kingdom of Sahali. Players must complete a quest involving a drunken Boar to access this area. The boss fight involves strategic attacks on Fuban, a giant scarab-like creature, with assistance from the Yellow Rat Sage. Players are advised to use powerful strikes and spells to exploit Fuban's vulnerabilities.\n\nImage Summary:  \nThe image depicts an intense moment from the Fuban boss fight, showcasing the protagonist engaging in combat with the massive scarab-like creature. The dynamic scene captures the chaos of the battle, with debris and sand flying through the air, emphasizing the scale and ferocity of the encounter.\n\nFollowing Text Summary:  \nThe following text explains that defeating Fuban results in the Yellow Rat Sage delivering the final blow. Players are rewarded with the Sky-Piercing Horn weapon material and the Wind Tamer Vessel, which serve as valuable items for progression in the game."
}