{
    "chunk_id": 895648966241,
    "source_file": "Red_Loong.md",
    "h1_title": "Red Loong",
    "h2_title": "Where to Find Red Loong",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/d5/Wukong_RedLoong_1.jpg",
    "alt_text": "Wukong RedLoong 1.jpg",
    "position_desc": 3,
    "img_above_text": "# Red Loong\n\nRed Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Hidden away in the Forest of Wolves, you won't be able to encounter this boss until you obtain a Key Item later in the game, and this boss is and appropriate challenging fight far stronger than anything else in Black Wind Mountain. Red Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* **Rewards:** Boshan Censer, Thunder Tail, Loong Pearl x1, Mind Core x1, Silk x3, 1652 Experience, 1376 Will\n\n## Where to Find Red Loong\n\nOnce you arrive in the large covered valley area, keep to the left to find a large lower platform by a slightly rounded red wall lined with small statues. At this point, if you did not kill the King of Flowing Sand, he’ll summon his other son, the First Rat Prince — otherwise you can use the Pungent Flesh Chunk to summon him yourself.",
    "img_below_text": "While fighting the First Rat Prince, you can lure him into performing one of his large slam attacks when facing the rounded wall, and it will cause a crack to appear in the wall. If you are unable to lure the boss into forming a crack in the wall, you can even do so yourself by hitting it with a very strong attack - we recommend the Wandering Wight’s Spirit Attack, or the Azure Dust Transformation Spell’s final attack.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Red Loong\n            - Section Title: Where to Find Red Loong\n\n            Context:\n            - Preceding Text: \"# Red Loong\n\nRed Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Hidden away in the Forest of Wolves, you won't be able to encounter this boss until you obtain a Key Item later in the game, and this boss is and appropriate challenging fight far stronger than anything else in Black Wind Mountain. Red Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n\n* **Rewards:** Boshan Censer, Thunder Tail, Loong Pearl x1, Mind Core x1, Silk x3, 1652 Experience, 1376 Will\n\n## Where to Find Red Loong\n\nOnce you arrive in the large covered valley area, keep to the left to find a large lower platform by a slightly rounded red wall lined with small statues. At this point, if you did not kill the King of Flowing Sand, he’ll summon his other son, the First Rat Prince — otherwise you can use the Pungent Flesh Chunk to summon him yourself.\"\n            - Following Text: \"While fighting the First Rat Prince, you can lure him into performing one of his large slam attacks when facing the rounded wall, and it will cause a crack to appear in the wall. If you are unable to lure the boss into forming a crack in the wall, you can even do so yourself by hitting it with a very strong attack - we recommend the Wandering Wight’s Spirit Attack, or the Azure Dust Transformation Spell’s final attack.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}