{
    "chunk_id": 865885884732,
    "source_file": "Crouching_Tiger_Temple_Walkthrough.md",
    "h1_title": "Crouching Tiger Temple Walkthrough",
    "h2_title": "Temple Cellar",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/2e/Wukong_Tiger_30.jpg",
    "alt_text": "Wukong Tiger 30.jpg",
    "position_desc": 31,
    "img_above_text": "# Crouching Tiger Temple Walkthrough\n\nOnce you reach the top, you’ll come face to bloody face with the Tiger Vanguard, who looks like he just found his next meal.\n\n\nUsing the Keeness of Tiger and Sterness of Stone, head up the steps to the large headless statue in the middle of the temple’s blood-soaked plaza. By activating this two-headed tally, you’ll drain the bloody pool, and reveal a large lion mouth that serves as a pit into the cellar below.\n\n## Temple Cellar\n\nOrdinarily you’ll slip and slide on past, unable to do much or jump off to the sides. However, if you jump right before reaching the ledge, perform a heavy attack in mid-air, and you’ll do a small double jump before crashing down. Done correctly, you’ll get enough height to land right by the small turtle chest, which holds a **Tiger Relic** Soak for your Gourd!",
    "img_below_text": "Slide down the rest of the way, and you’ll come up to a Shrine for the Crouching Tiger Temple’s Cellar. In the far corner of the cellar, you’ll find a familiar friendly face - the Xu Dog you helped get medicine recipes for!\n\nTalk to him while he’s in front of his large furnace, and the Xu Dog will thank you for your help thus far with a Mind Core. He'll also teach you the art of crafting your own Celestial Medicines in addition to the Mortal Medicine consumables you’ve been creating.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Crouching Tiger Temple Walkthrough\n            - Section Title: Temple Cellar\n\n            Context:\n            - Preceding Text: \"# Crouching Tiger Temple Walkthrough\n\nOnce you reach the top, you’ll come face to bloody face with the Tiger Vanguard, who looks like he just found his next meal.\n\n\nUsing the Keeness of Tiger and Sterness of Stone, head up the steps to the large headless statue in the middle of the temple’s blood-soaked plaza. By activating this two-headed tally, you’ll drain the bloody pool, and reveal a large lion mouth that serves as a pit into the cellar below.\n\n## Temple Cellar\n\nOrdinarily you’ll slip and slide on past, unable to do much or jump off to the sides. However, if you jump right before reaching the ledge, perform a heavy attack in mid-air, and you’ll do a small double jump before crashing down. Done correctly, you’ll get enough height to land right by the small turtle chest, which holds a **Tiger Relic** Soak for your Gourd!\"\n            - Following Text: \"Slide down the rest of the way, and you’ll come up to a Shrine for the Crouching Tiger Temple’s Cellar. In the far corner of the cellar, you’ll find a familiar friendly face - the Xu Dog you helped get medicine recipes for!\n\nTalk to him while he’s in front of his large furnace, and the Xu Dog will thank you for your help thus far with a Mind Core. He'll also teach you the art of crafting your own Celestial Medicines in addition to the Mortal Medicine consumables you’ve been creating.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text describes the player’s progression through the Crouching Tiger Temple, where they drain a bloody pool to access the Temple Cellar. It introduces a challenging maneuver to reach a hidden turtle chest containing a **Tiger Relic** for enhancing the player's Gourd.\n\nImage Summary:\nThe image depicts a dimly lit section of the Temple Cellar, featuring a character standing near a large furnace and a fenced area. A creature resembling the Xu Dog is visible inside a cauldron, with dialogue text reading, \"It's... it's you again?\" This scene suggests a reunion with the Xu Dog, who plays a narrative role in crafting medicines.\n\nFollowing Text Summary:\nThe following text elaborates on the interaction with the Xu Dog in the Temple Cellar. The Xu Dog expresses gratitude for the player’s previous assistance and provides a **Mind Core** item. Additionally, the Xu Dog teaches the player how to craft **Celestial Medicines**, expanding their consumable crafting abilities."
}