{
    "chunk_id": 133554775456,
    "source_file": "Baw-Li-Guhh-Baw.md",
    "h1_title": "Baw-Li-Guhh-Baw",
    "h2_title": "Baw-Li-Guhh-Baw Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1d/Wukong_LowerHollow_27.jpg",
    "alt_text": "Wukong LowerHollow 27.jpg",
    "position_desc": 1,
    "img_above_text": "# Baw-Li-Guhh-Baw\n\nBaw-Li-Guhh-Baw is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the lowest section of The Webbed Hollow, he is one of the many frog minibosses you can encounter in the game, though he sports a hidden surprise.\n\n* Rewards: Buddha's Left Hand (Key Item), Tadpole, Refined Iron Sand, 1562 Experience, 1449 Will\n\n\nBaw-Li-Guhh-Baw is an optional encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down past the Buddha's Right Hand and spying on the Spider Sisters, you can head down a long path with an optional passage through a fissure on the right.\n\nThis path will lead you to a ledge with an archer, and then right along the path above the main trail where the Lower Hollow Shrine is to where the frog boss waits in a flooded cavern. You can also climb up to the ledge from the Shrine by jumping and performing aerial heavy attacks.\n\n## Baw-Li-Guhh-Baw Boss Fight and Guide\n\nThe fourth Frog Guai boss in as many chapters, Baw-Li-Guhh-Baw is a poison-infused boss, much the way the previous frog enemies have used lightning or ice in their respective arenas. However, you'll soon find that poison isn't the only new thing that this particular boss brings to the table. Still, having Antimiasma Pills can be essential to your survival, due to the ability for you to resist repeat poisoning when consuming them.",
    "img_below_text": "By now you should be more than familiar with these frogs' basic attacks - the leaps, the swipes and backhands, the belly thrust, and the backward kicks. They'll likely deal a lot of damage on their own, which makes his unique attacks all the more terrifying.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Baw-Li-Guhh-Baw\n            - Section Title: Baw-Li-Guhh-Baw Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Baw-Li-Guhh-Baw\n\nBaw-Li-Guhh-Baw is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the lowest section of The Webbed Hollow, he is one of the many frog minibosses you can encounter in the game, though he sports a hidden surprise.\n\n* Rewards: Buddha's Left Hand (Key Item), Tadpole, Refined Iron Sand, 1562 Experience, 1449 Will\n\n\nBaw-Li-Guhh-Baw is an optional encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down past the Buddha's Right Hand and spying on the Spider Sisters, you can head down a long path with an optional passage through a fissure on the right.\n\nThis path will lead you to a ledge with an archer, and then right along the path above the main trail where the Lower Hollow Shrine is to where the frog boss waits in a flooded cavern. You can also climb up to the ledge from the Shrine by jumping and performing aerial heavy attacks.\n\n## Baw-Li-Guhh-Baw Boss Fight and Guide\n\nThe fourth Frog Guai boss in as many chapters, Baw-Li-Guhh-Baw is a poison-infused boss, much the way the previous frog enemies have used lightning or ice in their respective arenas. However, you'll soon find that poison isn't the only new thing that this particular boss brings to the table. Still, having Antimiasma Pills can be essential to your survival, due to the ability for you to resist repeat poisoning when consuming them.\"\n            - Following Text: \"By now you should be more than familiar with these frogs' basic attacks - the leaps, the swipes and backhands, the belly thrust, and the backward kicks. They'll likely deal a lot of damage on their own, which makes his unique attacks all the more terrifying.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Baw-Li-Guhh-Baw, an optional poison-infused Yaoguai Chief boss in *Black Myth Wukong*. Found in the Webbed Hollow during Chapter 4, he is one of several frog minibosses, offering rewards such as Buddha's Left Hand and other items upon defeat. The text describes the path to his arena, emphasizing exploration and traversal mechanics.\n\nImage Summary:\nThe image depicts the boss fight against Baw-Li-Guhh-Baw, showcasing the frog-like enemy in a flooded cavern adorned with intricate carvings on the walls. The player character is engaged in combat, with visible health bars and ability icons indicating an active battle. The environment reflects the described Webbed Hollow setting, with water effects and dim lighting adding to the atmosphere.\n\nFollowing Text Summary:\nThe following text elaborates on Baw-Li-Guhh-Baw's attack patterns, including leaps, swipes, belly thrusts, and backward kicks, which are familiar from previous frog enemies. It highlights the danger posed by his unique poison-based attacks, suggesting the use of Antimiasma Pills to resist repeated poisoning during the fight."
}