{
    "chunk_id": 939170613708,
    "source_file": "Whiteclad_Noble.md",
    "h1_title": "Whiteclad Noble",
    "h2_title": "Whiteclad Noble Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/e4/Wukong_Bamboo_44.jpg",
    "alt_text": "Wukong Bamboo 44.jpg",
    "position_desc": 3,
    "img_above_text": "# Whiteclad Noble\n\nThe Whiteclad Noble is a required Character boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located at the end of the Bamboo Grove, he is not listed as a Yaoguai Boss, but is akin to a end-of-area Yaoguai King, and even has two boss phases you'll need to survive.\n\n* **Rewards:** Jade Fang, 3x Yarn, 1049 Experience, 688 Will\n\n\nAs a required boss, you can't miss running into this character when exploring Black Wind Mountain. You'll find him guarding the end of the Marsh of White Mist in the Bamboo Grove, past where you save and befriend the Shen Monkey that can upgrade your Gourd.\n\nYou'll find him at the bottom of the ramp across a large flooded marsh area lined with reeds.\n\n## Whiteclad Noble Boss Fight and Guide\n\nThis boss usually begins the battle with a jumping lunge attack, but is also highly mobile and will retreat without warning to reposition himself. Get your hits in when able, but be wary as you pursue his retreats. His jumping lunge can be used when he dodges and strafes around you, so be on your guard whenever he starts to move around the arena quickly.",
    "img_below_text": "His most common attack up close from a series of spear swings — starting with two quick swings and the delayed thrust — or sometimes three slower swinging attacks. Oftentimes, he’ll follow these with another set of five quick spear swings, and ending with a sixth jumping attack. Unless you have a full bar of stamina, dodging the bulk of them can prove tricky, so you may want to dance out of range until you can dodge under his final jump and then retaliate — or use your Immobilize Spell to interrupt his combo entirely.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Whiteclad Noble\n            - Section Title: Whiteclad Noble Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Whiteclad Noble\n\nThe Whiteclad Noble is a required Character boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located at the end of the Bamboo Grove, he is not listed as a Yaoguai Boss, but is akin to a end-of-area Yaoguai King, and even has two boss phases you'll need to survive.\n\n* **Rewards:** Jade Fang, 3x Yarn, 1049 Experience, 688 Will\n\n\nAs a required boss, you can't miss running into this character when exploring Black Wind Mountain. You'll find him guarding the end of the Marsh of White Mist in the Bamboo Grove, past where you save and befriend the Shen Monkey that can upgrade your Gourd.\n\nYou'll find him at the bottom of the ramp across a large flooded marsh area lined with reeds.\n\n## Whiteclad Noble Boss Fight and Guide\n\nThis boss usually begins the battle with a jumping lunge attack, but is also highly mobile and will retreat without warning to reposition himself. Get your hits in when able, but be wary as you pursue his retreats. His jumping lunge can be used when he dodges and strafes around you, so be on your guard whenever he starts to move around the arena quickly.\"\n            - Following Text: \"His most common attack up close from a series of spear swings — starting with two quick swings and the delayed thrust — or sometimes three slower swinging attacks. Oftentimes, he’ll follow these with another set of five quick spear swings, and ending with a sixth jumping attack. Unless you have a full bar of stamina, dodging the bulk of them can prove tricky, so you may want to dance out of range until you can dodge under his final jump and then retaliate — or use your Immobilize Spell to interrupt his combo entirely.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}