{
    "chunk_id": 25783048664,
    "source_file": "Lang-Baw-Baw.md",
    "h1_title": "Lang-Baw-Baw",
    "h2_title": "Lang-Baw-Baw Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/be/Foothills_Walkthrough_%2837%29.png",
    "alt_text": "Foothills Walkthrough \\(37\\).png",
    "position_desc": 6,
    "img_above_text": "# Lang-Baw-Baw\n\nLang-Baw-Baw is one of the optional Yaoguai Chiefs you can fight in Chapter 6 of Black Myth: Wukong. This frog boss is the final of the six you can find across the chapters.\n\n\nWhen you get to the edge, look down to see a muddy clearing. Down here, you can find the next optional boss, which is the final frog Lang-Baw-Baw.\n\n## Lang-Baw-Baw Boss Fight and Guide\n\nThe big difference with Lang-Baw-Baw is that you need to watch the color of its body to know when it's best to attack and in what way. When its body is red, it's vulnerable to attack. In this state, you'll do the most damage, so you'll want it to stay like this for as long as possible.",
    "img_below_text": "After a certain amount of time, he will solidify, turn brown, and become like stone. If you hit him during this state, your attacks will bounce off of him, though they will do minimal amounts of damage. When he's like this, he will start to use rocks to attack. He can also roar, which will momentarily stun you and damage you at the same time.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Lang-Baw-Baw\n            - Section Title: Lang-Baw-Baw Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Lang-Baw-Baw\n\nLang-Baw-Baw is one of the optional Yaoguai Chiefs you can fight in Chapter 6 of Black Myth: Wukong. This frog boss is the final of the six you can find across the chapters.\n\n\nWhen you get to the edge, look down to see a muddy clearing. Down here, you can find the next optional boss, which is the final frog Lang-Baw-Baw.\n\n## Lang-Baw-Baw Boss Fight and Guide\n\nThe big difference with Lang-Baw-Baw is that you need to watch the color of its body to know when it's best to attack and in what way. When its body is red, it's vulnerable to attack. In this state, you'll do the most damage, so you'll want it to stay like this for as long as possible.\"\n            - Following Text: \"After a certain amount of time, he will solidify, turn brown, and become like stone. If you hit him during this state, your attacks will bounce off of him, though they will do minimal amounts of damage. When he's like this, he will start to use rocks to attack. He can also roar, which will momentarily stun you and damage you at the same time.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}