{
    "chunk_id": 296797216480,
    "source_file": "Chapter_1_Secret_-_Ancient_Guanyin_Temple_Walkthrough.md",
    "h1_title": "Chapter 1 Secret - Ancient Guanyin Temple Walkthrough",
    "h2_title": "How to Access the Ancient Guanyin Temple",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/75/Wukong_Bamboo_55.jpg",
    "alt_text": "Wukong Bamboo 55.jpg",
    "position_desc": 3,
    "img_above_text": "# Chapter 1 Secret - Ancient Guanyin Temple Walkthrough\n\nThe Ancient Guanyin Temple is a Secret Area found in Chapter 1's Black Wind Mountain of Black Myth Wukong. Below you'll find a guide to accessing the temple with all three bell locations, and how to defeat the secret Yaoguai King boss, Elder Jinchi.\n\nThis Chapter 1 Secret can only be accessed by ringing three large bells found around Black Wind Mountain, and will transport you to a different location to fight the secret boss that possess a magical item that is instrumental in defeating the Black Wind King.\n\n## How to Access the Ancient Guanyin Temple\n\n* **Bamboo Grove** \\- At the end of the Snake Trail area before reaching the Marsh of the White Mists, you’ll face a Yaoguai Chief named Guangmou who can summon snakes to attack you. Once defeated, the path up to the next Shrine will be on the right, but if you head some some stairs to the left of the grove, you’ll find the second bell.",
    "img_below_text": "* **Bamboo Grove** \\- Traveling through the very short region of the Marsh of the White Mists, you’ll have to defeat a character boss, the Whiteclad Noble. Once he retreats, look for a path off to the left instead of heading straight into Black Wind Cave, and you’ll find a large plaza past the marsh where several Wolf Guai sit before a wolf that has been hung from a tree. Just beyond them is the final bell.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chapter 1 Secret - Ancient Guanyin Temple Walkthrough\n            - Section Title: How to Access the Ancient Guanyin Temple\n\n            Context:\n            - Preceding Text: \"# Chapter 1 Secret - Ancient Guanyin Temple Walkthrough\n\nThe Ancient Guanyin Temple is a Secret Area found in Chapter 1's Black Wind Mountain of Black Myth Wukong. Below you'll find a guide to accessing the temple with all three bell locations, and how to defeat the secret Yaoguai King boss, Elder Jinchi.\n\nThis Chapter 1 Secret can only be accessed by ringing three large bells found around Black Wind Mountain, and will transport you to a different location to fight the secret boss that possess a magical item that is instrumental in defeating the Black Wind King.\n\n## How to Access the Ancient Guanyin Temple\n\n* **Bamboo Grove** \\- At the end of the Snake Trail area before reaching the Marsh of the White Mists, you’ll face a Yaoguai Chief named Guangmou who can summon snakes to attack you. Once defeated, the path up to the next Shrine will be on the right, but if you head some some stairs to the left of the grove, you’ll find the second bell.\"\n            - Following Text: \"* **Bamboo Grove** \\- Traveling through the very short region of the Marsh of the White Mists, you’ll have to defeat a character boss, the Whiteclad Noble. Once he retreats, look for a path off to the left instead of heading straight into Black Wind Cave, and you’ll find a large plaza past the marsh where several Wolf Guai sit before a wolf that has been hung from a tree. Just beyond them is the final bell.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Ancient Guanyin Temple as a secret area in Chapter 1 of *Black Myth: Wukong*. Accessing the temple requires ringing three large bells scattered across Black Wind Mountain. The temple leads to a secret boss fight against Elder Jinchi, who holds a magical item crucial for defeating the Black Wind King. The text also describes the location of the second bell near the Bamboo Grove, accessible by taking stairs to the left after defeating a Yaoguai Chief.\n\nImage Summary:\nThe image depicts a gameplay scene from *Black Myth: Wukong*, showing the player character facing a group of wolf-like enemies in a forested area. The environment includes stone pillars, dense vegetation, and a hanging wolf in the background, suggesting a grim atmosphere. The player appears to be preparing for combat, with visible health and ability icons indicating active gameplay mechanics. This scene likely corresponds to the location described in the following text, where the final bell is found near a plaza guarded by Wolf Guai.\n\nFollowing Text Summary:\nThe following text describes the path to the final bell, located past the Marsh of the White Mists. After defeating the Whiteclad Noble boss, players should take a left path leading to a large plaza. This area is guarded by several Wolf Guai and features a hanging wolf, which matches the image. The bell is situated just beyond this plaza."
}