{
    "chunk_id": 471857341345,
    "source_file": "Furnace_Valley_Walkthrough.md",
    "h1_title": "Furnace Valley Walkthrough",
    "h2_title": "Valley Entrance",
    "h3_title": "A Note on Flamlings",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a7/Furnace_Valley_Walkthrough_%2835%29.png",
    "alt_text": "Furnace Valley Walkthrough \\(35\\).png",
    "position_desc": 15,
    "img_above_text": "# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n## Valley Entrance\n\nUltimately, you're going to go left to continue on the main path (and you may start to hear characters talk as you approach this pillar), but for now, you'll want to detour and explore the area to the right.\n\nThe first thing you'll see as you go to the right is the Flamlings that sit in the lava. These will spit fire at you, so it's best to deal with them to remove the ranged attacks while you explore.\n\n### A Note on Flamlings\n\nBacktrack on yourself and go straight up through the path on the left between the rocks. Head for the lava stream running from the ceiling straight up ahead but stop to kill the last Flamling on the right, just behind the rock, and harvest the Fire Date from the tree on the right.",
    "img_below_text": "When you reach the lava, go to the dark corner on the right to collect the green Wisp. As you approach, you'll be jumped by Scorching-Fire rocks, so be prepared. Then, go up the ramp on the left to meet another Earth Rakshasa and take this out.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Furnace Valley Walkthrough\n            - Section Title: Valley Entrance\n            - Sub-Section Title: A Note on Flamlings\n\n            Context:\n            - Preceding Text: \"# Furnace Valley Walkthrough\n\nNow that you've beaten two of the Five Element Carts, return to the Camp of Seasons Keeper's Shrine and revisit the Pale-Axe Stalwart. Exhaust all dialogue again, where he'll tell you that the carts belong to the Red Boy, and then jump back to the Valley Entrance Keeper's Shrine to continue your exploration.\n\n## Valley Entrance\n\nUltimately, you're going to go left to continue on the main path (and you may start to hear characters talk as you approach this pillar), but for now, you'll want to detour and explore the area to the right.\n\nThe first thing you'll see as you go to the right is the Flamlings that sit in the lava. These will spit fire at you, so it's best to deal with them to remove the ranged attacks while you explore.\n\n### A Note on Flamlings\n\nBacktrack on yourself and go straight up through the path on the left between the rocks. Head for the lava stream running from the ceiling straight up ahead but stop to kill the last Flamling on the right, just behind the rock, and harvest the Fire Date from the tree on the right.\"\n            - Following Text: \"When you reach the lava, go to the dark corner on the right to collect the green Wisp. As you approach, you'll be jumped by Scorching-Fire rocks, so be prepared. Then, go up the ramp on the left to meet another Earth Rakshasa and take this out.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text describes the exploration of the Valley Entrance in the Furnace Valley Walkthrough. Players are advised to initially detour to the right, where they will encounter Flamlings, fire-spitting enemies that should be dealt with to ensure safe exploration. The text also mentions harvesting a Fire Date from a tree after defeating a Flamling.\n\nImage Summary:  \nThe image shows a player character standing in a lava-filled area, holding a weapon, and facing a path leading upward to the left. A red arrow highlights the direction of the path, and a red-dotted circle marks a point of interest on the right. The setting is dark and volcanic, with glowing lava streams and a pillar in the background, suggesting a hazardous environment.\n\nFollowing Text Summary:  \nThe following text instructs players to proceed to a dark corner near the lava to collect a green Wisp. It warns of an ambush by Scorching-Fire rocks and then directs players to ascend a ramp on the left to confront an Earth Rakshasa."
}