{
    "chunk_id": 786046098814,
    "source_file": "Yellow_Wind_Sage.md",
    "h1_title": "Yellow Wind Sage",
    "h2_title": "Yellow Wind Sage Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/05/Wukong_Yellow_58.jpg",
    "alt_text": "Wukong Yellow 58.jpg",
    "position_desc": 9,
    "img_above_text": "# Yellow Wind Sage\n\nThe Yellow Wind Sage is a required Yaoguai King and the final boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Located at the center of the large black tornado in the Yellow Wind Formation in the center of the region, you'll need two Key Items to open a path to him.\n\n* **Rewards:** Samahdi Wind Agate, Cold Iron Leaves x2, Refined Iron Sand x1, Silk x5, Yaoguai Core x2, Mind Core x1, 2583 Experience, 1944 Will\n\n\nWith both pieces, you can open the door where you defeated the King of Flowing Sands, or open up the temple cellar in the Crouching Tiger Temple, or slide down past the Rock Crash Platform to the Windseal Gate.\n\n## Yellow Wind Sage Boss Fight and Guide\n\nHe can also do a very quick jab with the butt of his trident that comes after the end of the weapon glows for a moment, and he’ll soon follow it with a stomp that’ll be hard to dodge if staggered by the first attack. If you spot the other end of his spear glowing, you should have enough time to parry it with Rock Solid when he jabs, and interrupt his follow up attack!",
    "img_below_text": "Once you’ve carved out around a third of the Yellow Wind Sage’s health bar, things will get a little more scary. He’ll suddenly toss the head into the sky, and begin to sweep his spear around him to create a giant sandstorm — the power of the Samahdi Winds. Stay very clear of his repeated swings when this happens, as he’ll end the move with a giant whirling spin attack.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Yellow Wind Sage\n            - Section Title: Yellow Wind Sage Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Yellow Wind Sage\n\nThe Yellow Wind Sage is a required Yaoguai King and the final boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Located at the center of the large black tornado in the Yellow Wind Formation in the center of the region, you'll need two Key Items to open a path to him.\n\n* **Rewards:** Samahdi Wind Agate, Cold Iron Leaves x2, Refined Iron Sand x1, Silk x5, Yaoguai Core x2, Mind Core x1, 2583 Experience, 1944 Will\n\n\nWith both pieces, you can open the door where you defeated the King of Flowing Sands, or open up the temple cellar in the Crouching Tiger Temple, or slide down past the Rock Crash Platform to the Windseal Gate.\n\n## Yellow Wind Sage Boss Fight and Guide\n\nHe can also do a very quick jab with the butt of his trident that comes after the end of the weapon glows for a moment, and he’ll soon follow it with a stomp that’ll be hard to dodge if staggered by the first attack. If you spot the other end of his spear glowing, you should have enough time to parry it with Rock Solid when he jabs, and interrupt his follow up attack!\"\n            - Following Text: \"Once you’ve carved out around a third of the Yellow Wind Sage’s health bar, things will get a little more scary. He’ll suddenly toss the head into the sky, and begin to sweep his spear around him to create a giant sandstorm — the power of the Samahdi Winds. Stay very clear of his repeated swings when this happens, as he’ll end the move with a giant whirling spin attack.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}