{
    "chunk_id": 803930716674,
    "source_file": "Violet_Spider.md",
    "h1_title": "Violet Spider",
    "h2_title": "Violet Spider Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/cb/Wukong_LowerHollow_81.jpg",
    "alt_text": "Wukong LowerHollow 81.jpg",
    "position_desc": 10,
    "img_above_text": "# Violet Spider\n\nThe Violet Spider is a main Yaoguai \"Queen\" boss fight that you can encounter in Chapter 4 of Black Myth Wukong. The leader of the Spider Guai and master of The Webbed Hollow, the Violet Spider and her six daughters control this region, and their mother has particular plans for the pig known as Zhu Bajie.\n\n* Rewards: Spider Leg, Refined Iron Sand, 3410 Experience, 2608 Will\n\n\nThe Violet Spider is a required and non-missable boss in Chapter 4. She is the final boss of the Webbed Hollow Section, and must be defeated to progress to the next area. After you have reached the Lower Hollow and defeated Zhu Bajie to free him of his bewitching curse, he'll be abducted again.\n\nTo reach him (and the Violet Spider), you'll need to ascend the Purfiying Spring outside the Hut of Immortality, and follow the trail upwards to The Gathering Cave where the spider queen awaits you.\n\n## Violet Spider Boss Fight and Guide\n\nOnce she reaches about half of her health or less, you'll need to keep your eyes peeled for when she dives her head into the ground. This will leave only her rear abdomen sticking out of the ground, but resist the urge to smack at it. Zhu Bajie may try to warn you, but it may not come out in time that she's preparing a deadly poison explosion!",
    "img_below_text": "The poison blast has an extremely wide area of effect, and can be difficult to escape if you're still very close to her when she burrows in. Luckily, as long as you have a lot of stamina saved up, you can also negate the blast by using the Pillar Stance. It will likely take 50% of your stamina bar to soak, but you'll be free of any damage or poison!",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Violet Spider\n            - Section Title: Violet Spider Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Violet Spider\n\nThe Violet Spider is a main Yaoguai \"Queen\" boss fight that you can encounter in Chapter 4 of Black Myth Wukong. The leader of the Spider Guai and master of The Webbed Hollow, the Violet Spider and her six daughters control this region, and their mother has particular plans for the pig known as Zhu Bajie.\n\n* Rewards: Spider Leg, Refined Iron Sand, 3410 Experience, 2608 Will\n\n\nThe Violet Spider is a required and non-missable boss in Chapter 4. She is the final boss of the Webbed Hollow Section, and must be defeated to progress to the next area. After you have reached the Lower Hollow and defeated Zhu Bajie to free him of his bewitching curse, he'll be abducted again.\n\nTo reach him (and the Violet Spider), you'll need to ascend the Purfiying Spring outside the Hut of Immortality, and follow the trail upwards to The Gathering Cave where the spider queen awaits you.\n\n## Violet Spider Boss Fight and Guide\n\nOnce she reaches about half of her health or less, you'll need to keep your eyes peeled for when she dives her head into the ground. This will leave only her rear abdomen sticking out of the ground, but resist the urge to smack at it. Zhu Bajie may try to warn you, but it may not come out in time that she's preparing a deadly poison explosion!\"\n            - Following Text: \"The poison blast has an extremely wide area of effect, and can be difficult to escape if you're still very close to her when she burrows in. Luckily, as long as you have a lot of stamina saved up, you can also negate the blast by using the Pillar Stance. It will likely take 50% of your stamina bar to soak, but you'll be free of any damage or poison!\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": ""
}