{
    "chunk_id": 714861758991,
    "source_file": "Green-Capped_Martialist.md",
    "h1_title": "Green-Capped Martialist",
    "h2_title": "Where to Find the Green-Capped Martialist",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f4/Wukong_Bitter_26.jpg",
    "alt_text": "Wukong Bitter 26.jpg",
    "position_desc": 2,
    "img_above_text": "# Green-Capped Martialist\n\nThe Green-Capped Martialist is an optional and secret Character Boss fight that you can encounter in Chapter 3 of Black Myth Wukong. This boss can only be fought by undertaking a Treasure Hunter's Quest that begins along the Bitter Lake and leads to the Valley of Ecstasy, where you'll have to uncover a secret Melon Field.\n\n* Rewards: Spell-Binder Spell, Cold Iron Leaves, Random Materials, 1847 Experience, 1190 Will\n\n## Where to Find the Green-Capped Martialist\n\nTo unlock this secret boss fight, you'll first need to encounter a simple-looking Treasure Hunter Human in Chapter 3, at the North Shore of the Bitter Lake in The New West.",
    "img_below_text": "Once you reach the shore, take a left when facing the Shrine and head past the area where Chen Loong is and through a gate to find a human being harassed by small Apramana Bats. Defeat them and talk to him to learn of his quest to find a treasure.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Green-Capped Martialist\n            - Section Title: Where to Find the Green-Capped Martialist\n\n            Context:\n            - Preceding Text: \"# Green-Capped Martialist\n\nThe Green-Capped Martialist is an optional and secret Character Boss fight that you can encounter in Chapter 3 of Black Myth Wukong. This boss can only be fought by undertaking a Treasure Hunter's Quest that begins along the Bitter Lake and leads to the Valley of Ecstasy, where you'll have to uncover a secret Melon Field.\n\n* Rewards: Spell-Binder Spell, Cold Iron Leaves, Random Materials, 1847 Experience, 1190 Will\n\n## Where to Find the Green-Capped Martialist\n\nTo unlock this secret boss fight, you'll first need to encounter a simple-looking Treasure Hunter Human in Chapter 3, at the North Shore of the Bitter Lake in The New West.\"\n            - Following Text: \"Once you reach the shore, take a left when facing the Shrine and head past the area where Chen Loong is and through a gate to find a human being harassed by small Apramana Bats. Defeat them and talk to him to learn of his quest to find a treasure.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Green-Capped Martialist, a secret boss in Chapter 3 of *Black Myth Wukong*. Players must undertake a Treasure Hunter's Quest starting at the Bitter Lake and progressing to the Valley of Ecstasy to uncover a hidden Melon Field. Rewards for defeating this boss include items, materials, experience points, and Will.\n\n---\n\nImage Summary:\nThe image depicts a snowy outdoor setting with three characters: a humanoid figure wearing a straw hat and crouching near a wooden structure, another humanoid figure standing with a weapon, and a smaller anthropomorphic character resembling a rodent dressed in green. The scene appears to be part of a quest interaction, as indicated by the text overlay: \"Green without, round and sweet. Red within, a summer treat.\" This suggests a riddle or clue related to the quest.\n\n---\n\nFollowing Text Summary:\nThe following text explains the next steps in the quest. Players must locate a Treasure Hunter being harassed by small Apramana Bats near the North Shore of Bitter Lake. After defeating the bats, players can talk to the Treasure Hunter to learn about his quest to find a treasure, which likely ties into the Green-Capped Martialist storyline."
}