{
    "chunk_id": 334046157623,
    "source_file": "Bamboo_Grove_Walkthrough.md",
    "h1_title": "Bamboo Grove Walkthrough",
    "h2_title": "Back Hills",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/3/3c/Wukong_Bamboo_2.jpg",
    "alt_text": "Wukong Bamboo 2.jpg",
    "position_desc": 2,
    "img_above_text": "# Bamboo Grove Walkthrough\n\nThe Bamboo Grove is the second main region of Chapter 1's Black Wind Mountain in Black Myth: Wukong. Below you'll find a guide to the progressing through the grove and learning how to cultivate Spirits, accessing a secret realm, as well as how to defeat the many bosses of this area that include Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble.\n\n* **Jump to A Section:**\n* **Back Hills**\n* **Snake Trail**\n- Yaoguai Chief - Baw-Li-Guhh-Lang\n- Yaoguai Chief - Guangmo\n* **Marsh of the White Mist**\n- Boss FIght - Whiteclad Noble\n\n## Back Hills\n\nBefore moving on, be sure to hug the left wall to find a small path leading to a cave. Inside, you’ll find a friendly Horse Guai.",
    "img_below_text": "The whip-wielding warrior will offer some interesting insight about the Black Wind King that rules over this mountain, and the greed and lies that have infected him and his people. While you’re here, you can interact with a small pillow in the middle of the cave to rest at a new **Meditation Spot** in front of the altar, granting you a new Skill Point.\n\nBack outside, continue on the main path taking out the three lesser wolves and harvesting Jade Lotus from the pond and Gentian on to the right of the path.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bamboo Grove Walkthrough\n            - Section Title: Back Hills\n\n            Context:\n            - Preceding Text: \"# Bamboo Grove Walkthrough\n\nThe Bamboo Grove is the second main region of Chapter 1's Black Wind Mountain in Black Myth: Wukong. Below you'll find a guide to the progressing through the grove and learning how to cultivate Spirits, accessing a secret realm, as well as how to defeat the many bosses of this area that include Baw-Li-Guhh-Lang, Guangmou, and the Whiteclad Noble.\n\n* **Jump to A Section:**\n* **Back Hills**\n* **Snake Trail**\n- Yaoguai Chief - Baw-Li-Guhh-Lang\n- Yaoguai Chief - Guangmo\n* **Marsh of the White Mist**\n- Boss FIght - Whiteclad Noble\n\n## Back Hills\n\nBefore moving on, be sure to hug the left wall to find a small path leading to a cave. Inside, you’ll find a friendly Horse Guai.\"\n            - Following Text: \"The whip-wielding warrior will offer some interesting insight about the Black Wind King that rules over this mountain, and the greed and lies that have infected him and his people. While you’re here, you can interact with a small pillow in the middle of the cave to rest at a new **Meditation Spot** in front of the altar, granting you a new Skill Point.\n\nBack outside, continue on the main path taking out the three lesser wolves and harvesting Jade Lotus from the pond and Gentian on to the right of the path.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the \"Back Hills\" section of the Bamboo Grove Walkthrough in *Black Myth: Wukong*. It describes a small path leading to a cave where players encounter a friendly Horse Guai character. This cave serves as a key location for interaction and progression in the game.\n\n---\n\nImage Summary:\nThe image depicts the interior of the cave mentioned in the \"Back Hills\" section. The player character is shown standing near an altar, facing a seated Horse Guai illuminated by firelight. The environment includes traditional architectural elements, vegetation, and glowing objects, suggesting an atmosphere of mystery and significance. The UI elements indicate active gameplay, with abilities and health visible, reinforcing the image's role in guiding players through this specific part of the walkthrough.\n\n---\n\nFollowing Text Summary:\nThe following text elaborates on the interaction with the Horse Guai, who provides insights about the Black Wind King and the corruption affecting the mountain's inhabitants. Players can rest at a **Meditation Spot** in the cave to gain a Skill Point. After exiting the cave, players are directed to continue along the main path, defeating enemies and collecting resources like Jade Lotus and Gentian."
}