{
    "chunk_id": 397517459970,
    "source_file": "Chen_Loong.md",
    "h1_title": "Chen Loong",
    "h2_title": "Where to Find Chen Loong",
    "h3_title": "Chen Loong Boss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/7a/Wukong_Bitter_9.jpg",
    "alt_text": "Wukong Bitter 9.jpg",
    "position_desc": 9,
    "img_above_text": "# Chen Loong\n\nChen Loong is a character and possible boss fight first found in Chapter 3 of Black Myth Wukong. Though initially hostile, you can perform a task after defeating him in combat to unlock a Painted Realm where you can quickly access multiple merchants and services.\n\n* **Rewards:** TBA\n\n## Where to Find Chen Loong\n\nChen Loong is an optional opponent who has their own quest, which you can find shortly after leaving Turtle Rock for the North Shore of the Bitter Lake. From the Shrine, head left while facing it to head along the lakeshore toward a lone shack by the water.\n\nSearch the shallows near this shack, and you'll find the old dragon wandering the waters, and will become hostile as you approach.\n\n### Chen Loong Boss Fight and Guide\n\nHe'll often vary this combo up making it hard to read, and either trick you into thinking he's preparing a cast before tail-whipping, or throwing more quick slashes in-between tail attacks -- or even just doing single hits.",
    "img_below_text": "The dragon won't just stop at wacking you with his tail up close, either. If he proclaims \"To the deepest trench I dive!\" Be ready for him to stick his tail in the ground, only for several giant electrified tails to sprout up in a cluster nearby. You'll need to quickly break off your attack and give them a wide berth, as they'll quickly perform a single huge spin attack all at once!",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chen Loong\n            - Section Title: Where to Find Chen Loong\n            - Sub-Section Title: Chen Loong Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Chen Loong\n\nChen Loong is a character and possible boss fight first found in Chapter 3 of Black Myth Wukong. Though initially hostile, you can perform a task after defeating him in combat to unlock a Painted Realm where you can quickly access multiple merchants and services.\n\n* **Rewards:** TBA\n\n## Where to Find Chen Loong\n\nChen Loong is an optional opponent who has their own quest, which you can find shortly after leaving Turtle Rock for the North Shore of the Bitter Lake. From the Shrine, head left while facing it to head along the lakeshore toward a lone shack by the water.\n\nSearch the shallows near this shack, and you'll find the old dragon wandering the waters, and will become hostile as you approach.\n\n### Chen Loong Boss Fight and Guide\n\nHe'll often vary this combo up making it hard to read, and either trick you into thinking he's preparing a cast before tail-whipping, or throwing more quick slashes in-between tail attacks -- or even just doing single hits.\"\n            - Following Text: \"The dragon won't just stop at wacking you with his tail up close, either. If he proclaims \"To the deepest trench I dive!\" Be ready for him to stick his tail in the ground, only for several giant electrified tails to sprout up in a cluster nearby. You'll need to quickly break off your attack and give them a wide berth, as they'll quickly perform a single huge spin attack all at once!\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Chen Loong as a character and optional boss in *Black Myth Wukong*, first encountered in Chapter 3. Players can find him near the North Shore of the Bitter Lake after leaving Turtle Rock. He is initially hostile, and defeating him unlocks access to a Painted Realm with merchants and services. The text also begins describing his combat style, highlighting his unpredictable attack combos involving tail whips and quick slashes.\n\nImage Summary:  \nThe image depicts the boss fight against Chen Loong, showcasing the dragon in a snowy lakeside environment. Chen Loong is performing a special attack, indicated by the text \"To the deepest trench I dive!\" and the emergence of electrified tails from the ground. The player character is positioned nearby, wielding a weapon, while the game's interface displays health bars, abilities, and other combat-related elements. The scene emphasizes the intensity and danger of Chen Loong's electrified tail attack.\n\nFollowing Text Summary:  \nThe following text elaborates on Chen Loong's electrified tail attack, warning players to avoid the cluster of giant tails that sprout from the ground. These tails perform a powerful spin attack, requiring players to break off their offense and maintain a safe distance to avoid significant damage."
}