{
    "chunk_id": 558646248004,
    "source_file": "Fright_Cliff_Walkthrough.md",
    "h1_title": "Fright Cliff Walkthrough",
    "h2_title": "Squall Hideout",
    "h3_title": "The First Buddha’s Eyeball",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f0/Wukong_Fright_10.jpg",
    "alt_text": "Wukong Fright 10.jpg",
    "position_desc": 11,
    "img_above_text": "# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n## Squall Hideout\n\n### The First Buddha’s Eyeball\n\nHead past the ranged attacker above (note the Aged Ginseng on the left is actually a Ginsengling), and go through a doorway to spy a large cave entrance up ahead. Stick to the right to find a sloping path back, and a new stony enemy variant will burrow out of the ground.",
    "img_below_text": "Palestones, like Pitstones, are durable bulky enemies who will try to spin and bash into you with their sharp quartz shells to deal a lot of damage. Even worse, they’ll shake violently to shoot quartz projectiles out around them, and then target you even at a distance. Luckily, a charged hardy smack can severely wound them, so keep your distance and strafe until charged to cut them down to size.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fright Cliff Walkthrough\n            - Section Title: Squall Hideout\n            - Sub-Section Title: The First Buddha’s Eyeball\n\n            Context:\n            - Preceding Text: \"# Fright Cliff Walkthrough\n\nMake sure not to lock on and face the smaller threat, or you’ll be rammed by the Pitstone. Instead use your Cloud Step to get around and sneak attack.\n\n## Squall Hideout\n\n### The First Buddha’s Eyeball\n\nHead past the ranged attacker above (note the Aged Ginseng on the left is actually a Ginsengling), and go through a doorway to spy a large cave entrance up ahead. Stick to the right to find a sloping path back, and a new stony enemy variant will burrow out of the ground.\"\n            - Following Text: \"Palestones, like Pitstones, are durable bulky enemies who will try to spin and bash into you with their sharp quartz shells to deal a lot of damage. Even worse, they’ll shake violently to shoot quartz projectiles out around them, and then target you even at a distance. Luckily, a charged hardy smack can severely wound them, so keep your distance and strafe until charged to cut them down to size.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text provides guidance for navigating the Squall Hideout area in the \"Fright Cliff Walkthrough.\" It advises players to avoid locking onto smaller threats to prevent being attacked by a larger enemy called the Pitstone. Players are encouraged to use a maneuver called Cloud Step to evade and perform sneak attacks. The text introduces the sub-section \"The First Buddha’s Eyeball,\" describing a path leading to a cave entrance and warning of a new stony enemy variant that emerges from the ground.\n\nImage Summary:\nThe image depicts a combat scenario within the Squall Hideout area, specifically during \"The First Buddha’s Eyeball\" sub-section. A player character is engaged in battle with a stony enemy variant, likely one of the burrowing enemies mentioned in the preceding text. The enemy has a sharp, quartz-like shell, and the player is using a glowing weapon to attack. The environment appears rocky and dimly lit, consistent with the description of a cave-like area. HUD elements in the image suggest active gameplay mechanics, including health and abilities.\n\nFollowing Text Summary:\nThe following text elaborates on the characteristics of Palestones, another stony enemy type similar to Pitstones. These enemies are described as durable and aggressive, capable of spinning and bashing with quartz shells to inflict significant damage. They can also shake violently to release quartz projectiles and attack from a distance. The text recommends using charged attacks to wound them while maintaining distance and strafing for safety."
}