{
    "chunk_id": 10558426709,
    "source_file": "Erlang,_The_Sacred_Divinity.md",
    "h1_title": "Erlang, The Sacred Divinity",
    "h2_title": "Erlang, The Sacred Divinity Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b8/Mount_Mei_Walkthrough_%281%29.png",
    "alt_text": "Mount Mei Walkthrough \\(1\\).png",
    "position_desc": 2,
    "img_above_text": "# Erlang, The Sacred Divinity\n\nErlang, The Sacred Divinity is an optional secret boss you can find by entering Chapter 3's Secret Area of Mount Mei in Black Myth: Wukong. You'll need to complete all chapters' secret areas and an elusive side quest before you can find this tough boss.\n\n\nThere are several steps you need to take to unlock Mount Mei. You can find a detailed breakdown on our dedicated page: How to Unlock the Secret Ending (True Ending). But here's a quick rundown of everything you'll need to do by Chapter 6 to reach it.\n\n1. Complete the Chapter 1 secret area of the Ancient Guanyin Temple\n2. Complete the Chapter 2 secret area of the Kingdom of Sahali\n3. Complete the Green-Capped Martialist/Treasure Hunter quest in Chapter 3\n4. Complete the Chapter 4 secret area of the Purple Cloud Mountain\n5. Complete the Chapter 5 secret area of Bishui Cave\n6. Return to **The Great Pagoda in Chapter 3**. You can find it on the Snow-Veiled Trail in the Pagoda Realm.\n\n\nWhen you’re in The Great Pagoda, you’ll see tapestries around the room. One tapestry, at the very top of the room, will be red. Head for this, and a cutscene will begin where the small Buddha from Chapter 3 will be waiting for you. He'll open the tapestry and let you into Mount Mei.\n\nWhen you're through the tapestry, head up the stairs and follow the path. About halfway up you'll need to shimmy across a ledge on the left to reach the other side, then you'll continue up to the Mei-Jian Peak Keeper's Shrine. At the top of the peak is where you'll find Erlang, The Sacred Divinity.\n\n## Erlang, The Sacred Divinity Boss Fight and Guide",
    "img_below_text": "As you reach the peak of the mountain, you'll see a black dog. It will run toward the building at the top of the peak and soon join Erlang, The Sacred Divinity, who you fought at the very beginning of the game. This time, however, it's a bigger challenge.\n\nErlang is undoubtedly one of the toughest bosses in the game. To make it harder, he has a health bar and a shield bar, and you'll need to deplete his shield to do maximum damage. There is a quick way to knock this down, however, and that's to use the Plantain Fan. Each time you're able to throw this out, it will get his shield gone in a few seconds. You can then make the most of his vulnerable state, by following up with heavy attacks.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Erlang, The Sacred Divinity\n            - Section Title: Erlang, The Sacred Divinity Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Erlang, The Sacred Divinity\n\nErlang, The Sacred Divinity is an optional secret boss you can find by entering Chapter 3's Secret Area of Mount Mei in Black Myth: Wukong. You'll need to complete all chapters' secret areas and an elusive side quest before you can find this tough boss.\n\n\nThere are several steps you need to take to unlock Mount Mei. You can find a detailed breakdown on our dedicated page: How to Unlock the Secret Ending (True Ending). But here's a quick rundown of everything you'll need to do by Chapter 6 to reach it.\n\n1. Complete the Chapter 1 secret area of the Ancient Guanyin Temple\n2. Complete the Chapter 2 secret area of the Kingdom of Sahali\n3. Complete the Green-Capped Martialist/Treasure Hunter quest in Chapter 3\n4. Complete the Chapter 4 secret area of the Purple Cloud Mountain\n5. Complete the Chapter 5 secret area of Bishui Cave\n6. Return to **The Great Pagoda in Chapter 3**. You can find it on the Snow-Veiled Trail in the Pagoda Realm.\n\n\nWhen you’re in The Great Pagoda, you’ll see tapestries around the room. One tapestry, at the very top of the room, will be red. Head for this, and a cutscene will begin where the small Buddha from Chapter 3 will be waiting for you. He'll open the tapestry and let you into Mount Mei.\n\nWhen you're through the tapestry, head up the stairs and follow the path. About halfway up you'll need to shimmy across a ledge on the left to reach the other side, then you'll continue up to the Mei-Jian Peak Keeper's Shrine. At the top of the peak is where you'll find Erlang, The Sacred Divinity.\n\n## Erlang, The Sacred Divinity Boss Fight and Guide\"\n            - Following Text: \"As you reach the peak of the mountain, you'll see a black dog. It will run toward the building at the top of the peak and soon join Erlang, The Sacred Divinity, who you fought at the very beginning of the game. This time, however, it's a bigger challenge.\n\nErlang is undoubtedly one of the toughest bosses in the game. To make it harder, he has a health bar and a shield bar, and you'll need to deplete his shield to do maximum damage. There is a quick way to knock this down, however, and that's to use the Plantain Fan. Each time you're able to throw this out, it will get his shield gone in a few seconds. You can then make the most of his vulnerable state, by following up with heavy attacks.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text introduces Erlang, The Sacred Divinity, as a secret optional boss in *Black Myth: Wukong*. Players must complete specific tasks across multiple chapters, including secret areas and side quests, to access Mount Mei, where the boss resides. The journey involves navigating through The Great Pagoda and reaching the Mei-Jian Peak Keeper's Shrine.\n\nImage Summary:  \nThe image depicts a character in ornate attire with intricate golden details, standing in a snowy mountain setting near a traditional Chinese-style building. This scene likely represents the climactic moment before encountering Erlang, The Sacred Divinity, emphasizing the boss's divine and formidable presence.\n\nFollowing Text Summary:  \nThe following text describes the boss fight with Erlang, The Sacred Divinity, highlighting its difficulty. Erlang is accompanied by a black dog and has both a health bar and a shield bar. Players are advised to use the Plantain Fan to quickly deplete his shield, creating opportunities for heavy attacks during his vulnerable state."
}