{
    "chunk_id": 560384652338,
    "source_file": "Buddha's_Right_Hand.md",
    "h1_title": "Buddha's Right Hand",
    "h2_title": "Buddha's Right Hand Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/46/Wukong_MiddleHollow_65.jpg",
    "alt_text": "Wukong MiddleHollow 65.jpg",
    "position_desc": 13,
    "img_above_text": "# Buddha's Right Hand\n\nThe Buddha's Right Hand is a required Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the middle section of The Webbed Hollow, this creepy long hand is more than it seems, and blocks the passage down to the Lower Hollow.\n\n* Rewards: Buddha's Right Hand (Key Item), Past-Echo, Fine Gold Thread, Cold Iron Leaves, 2274 Experience, 1933 Will\n\n\nThe Buddha's Right Hand is an main boss and non-missable encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down to the Vedure Bridge Shrine and defeating the Centipede Guai in the Bonevault, follow the linear path up to the Cliff of Oblivion.\n\nJust past the Shrine, you'll find a narrow passageway with a creepy hand holding a mirror, but this is actually the boss fight you seek!\n\n## Buddha's Right Hand Boss Fight and Guide\n\nOne of its more annoying new attacks is that it can also retch out a cloud of poison bugs that will fly around in front of its head and deal damage to anything nearby. You may just want to back off instead of pressing the attack during this move to avoid taking unnecessary damage.",
    "img_below_text": "Since it won't have too much health left, focus on avoiding its attacks and try to get around its face along the sides to score hits while out of range of many of its attacks, and be ready to dodge falling rocks if it begins shrieking or slamming into walls.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Buddha's Right Hand\n            - Section Title: Buddha's Right Hand Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Buddha's Right Hand\n\nThe Buddha's Right Hand is a required Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the middle section of The Webbed Hollow, this creepy long hand is more than it seems, and blocks the passage down to the Lower Hollow.\n\n* Rewards: Buddha's Right Hand (Key Item), Past-Echo, Fine Gold Thread, Cold Iron Leaves, 2274 Experience, 1933 Will\n\n\nThe Buddha's Right Hand is an main boss and non-missable encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down to the Vedure Bridge Shrine and defeating the Centipede Guai in the Bonevault, follow the linear path up to the Cliff of Oblivion.\n\nJust past the Shrine, you'll find a narrow passageway with a creepy hand holding a mirror, but this is actually the boss fight you seek!\n\n## Buddha's Right Hand Boss Fight and Guide\n\nOne of its more annoying new attacks is that it can also retch out a cloud of poison bugs that will fly around in front of its head and deal damage to anything nearby. You may just want to back off instead of pressing the attack during this move to avoid taking unnecessary damage.\"\n            - Following Text: \"Since it won't have too much health left, focus on avoiding its attacks and try to get around its face along the sides to score hits while out of range of many of its attacks, and be ready to dodge falling rocks if it begins shrieking or slamming into walls.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Buddha's Right Hand as a significant boss fight in Chapter 4 of the game Black Myth Wukong, located in The Webbed Hollow. It describes the hand as a creepy entity blocking the path to the Lower Hollow and outlines the rewards for defeating it, including key items and experience points.\n\nImage Summary:\nThe image depicts a scene from the game Black Myth Wukong, showing the Buddha's Right Hand boss fight. The player character is engaged in combat with a large, ominous hand-like creature in a dimly lit cave setting. The health bar labeled \"Buddha's Right Hand\" indicates the ongoing battle, with various game interface elements visible, suggesting active gameplay.\n\nFollowing Text Summary:\nThe following text provides strategic advice for the boss fight against Buddha's Right Hand. It suggests focusing on evading the creature's attacks and maneuvering around its face to land hits while avoiding damage. Players are advised to be prepared to dodge falling rocks if the creature starts shrieking or slamming into walls."
}