{
    "chunk_id": 257761983706,
    "source_file": "Goji_Shoots.md",
    "h1_title": "Goji Shoots",
    "h2_title": "Black Myth: Wukong Goji Shoots Location",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9c/Wukong_UpperHollow_6.jpg",
    "alt_text": "Wukong UpperHollow 6.jpg",
    "position_desc": 1,
    "img_above_text": "# Goji Shoots\n\nThe Goji Shoots is one of the Epic Soaks for your Gourds in Black Myth: Wukong.\n\nWith the Goji Shoots Soak equipped, each use of the Gourd moderately extends the duration of the next Ring of Fire for a short duration\n\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor.\n\n## Black Myth: Wukong Goji Shoots Location\n\nThe Goji Shoots can be found in the Upper Hollow area of The Webbed Hollow. From the Shrine, turn around and head up the stairs along the hillside. Continue all the way to the top. At the top you can find a hut with the Soak inside.",
    "img_below_text": "Soaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Goji Shoots\n            - Section Title: Black Myth: Wukong Goji Shoots Location\n\n            Context:\n            - Preceding Text: \"# Goji Shoots\n\nThe Goji Shoots is one of the Epic Soaks for your Gourds in Black Myth: Wukong.\n\nWith the Goji Shoots Soak equipped, each use of the Gourd moderately extends the duration of the next Ring of Fire for a short duration\n\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor.\n\n## Black Myth: Wukong Goji Shoots Location\n\nThe Goji Shoots can be found in the Upper Hollow area of The Webbed Hollow. From the Shrine, turn around and head up the stairs along the hillside. Continue all the way to the top. At the top you can find a hut with the Soak inside.\"\n            - Following Text: \"Soaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Goji Shoots, an Epic Soak item in the game *Black Myth: Wukong*. When equipped, it enhances the Gourd's ability by moderately extending the duration of the Ring of Fire effect. Soaks are static buffs and cannot be upgraded. The Goji Shoots can be found in the Upper Hollow area of The Webbed Hollow, inside a hut at the top of a hillside near a Shrine.\n\nImage Summary:\nThe image depicts a player character standing inside a hut, likely the location described as housing the Goji Shoots in *Black Myth: Wukong*. The setting includes a table with a golden turtle-like object, which may represent the Goji Shoots, and a chair. The character is equipped with a fiery weapon and detailed armor, emphasizing the game's fantasy aesthetic. The environment is dimly lit, with a web-like design on the wall, reinforcing the \"Webbed Hollow\" area context.\n\nFollowing Text Summary:\nThe following text highlights the abundance of Soaks in the game, noting their widespread availability across chapters. It suggests consulting the game's walkthrough for more guides on item locations and mentions other collectible items, such as Awaken Wine Worms and Luoija Fragrant Vines, which are essential for upgrading healing abilities and the Gourd."
}