{
    "chunk_id": 879103182652,
    "source_file": "Chapter_2_Secret_-_Kingdom_of_Sahali_Walkthrough.md",
    "h1_title": "Chapter 2 Secret - Kingdom of Sahali Walkthrough",
    "h2_title": "Sandgate Bound",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/05/Wukong_Sahali_24.jpg",
    "alt_text": "Wukong Sahali 24.jpg",
    "position_desc": 24,
    "img_above_text": "# Chapter 2 Secret - Kingdom of Sahali Walkthrough\n\nThe Kingdom of Sahali is a Secret Area found in Chapter 2's Yellow Wind Ridge of Black Myth Wukong. Below you'll find a guide to accessing the kingdom of the past by undertaking the Drunk Boar's Questline to find a Sobering Stone, and how to defeat the Tiger Vanguard and secret Yaoguai King Boss, Fuban.\n\n* Jump to a Section:\n* **How to Access the Kingdom of Sahali**\n- Yaoguai Chief - \"Tiger Vanguard\"\n* **Sandgate Bound**\n- Yaoguai King - Fuban\n\nThis Chapter 2 Secret can only be accessed by meeting the Yellow-Robed Square in Fright Cliff (aka the Drunken Boar), and helping him in his search for the \"Realm of Gold\" which requires a few steps (and for you to best him in combat).\n\n\nOnce you follow him through the large gate with the small crawlspace, you’ll find yourself overlooking an ancient and forgotten kingdom, and suddenly be transported into the past and into the Kingdom of Sahali\n\n\nAs you round the corner, you’ll be told to halt by the defender of a large gate: A slightly familiar looking Tiger Guai who calls himself the Vanguard of the Yellow Wind King. If he looks familiar to another Vanguard you’ve faced, that’s because he’s actually the other Vanguard’s father! He’ll ask that you turn around and head home, which seems like such a waste with all you’ve gone through just to get here.\n\n\nUpon defeat, you’ll gain the **Tiger Tally** curio, and he’ll realize your prowess and invite you to meet his king.\n\n## Sandgate Bound\n\nThere are more than a few plants to gather that are scattered around the upper plains here, including Licorice. If you move straight ahead, you can find the Sandgate Bound Shrine by some rocks before the large cliff.",
    "img_below_text": "If you search the left side when facing the central cliff by the Shrine, you can explore some ruins to find a chest by some wooden columns that contains a **Gold Ridge Beast** to sell, and **Knot of Voidness** material that can be used for advanced Spirit Cultivation.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Chapter 2 Secret - Kingdom of Sahali Walkthrough\n            - Section Title: Sandgate Bound\n\n            Context:\n            - Preceding Text: \"# Chapter 2 Secret - Kingdom of Sahali Walkthrough\n\nThe Kingdom of Sahali is a Secret Area found in Chapter 2's Yellow Wind Ridge of Black Myth Wukong. Below you'll find a guide to accessing the kingdom of the past by undertaking the Drunk Boar's Questline to find a Sobering Stone, and how to defeat the Tiger Vanguard and secret Yaoguai King Boss, Fuban.\n\n* Jump to a Section:\n* **How to Access the Kingdom of Sahali**\n- Yaoguai Chief - \"Tiger Vanguard\"\n* **Sandgate Bound**\n- Yaoguai King - Fuban\n\nThis Chapter 2 Secret can only be accessed by meeting the Yellow-Robed Square in Fright Cliff (aka the Drunken Boar), and helping him in his search for the \"Realm of Gold\" which requires a few steps (and for you to best him in combat).\n\n\nOnce you follow him through the large gate with the small crawlspace, you’ll find yourself overlooking an ancient and forgotten kingdom, and suddenly be transported into the past and into the Kingdom of Sahali\n\n\nAs you round the corner, you’ll be told to halt by the defender of a large gate: A slightly familiar looking Tiger Guai who calls himself the Vanguard of the Yellow Wind King. If he looks familiar to another Vanguard you’ve faced, that’s because he’s actually the other Vanguard’s father! He’ll ask that you turn around and head home, which seems like such a waste with all you’ve gone through just to get here.\n\n\nUpon defeat, you’ll gain the **Tiger Tally** curio, and he’ll realize your prowess and invite you to meet his king.\n\n## Sandgate Bound\n\nThere are more than a few plants to gather that are scattered around the upper plains here, including Licorice. If you move straight ahead, you can find the Sandgate Bound Shrine by some rocks before the large cliff.\"\n            - Following Text: \"If you search the left side when facing the central cliff by the Shrine, you can explore some ruins to find a chest by some wooden columns that contains a **Gold Ridge Beast** to sell, and **Knot of Voidness** material that can be used for advanced Spirit Cultivation.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Kingdom of Sahali, a secret area in Chapter 2 of *Black Myth: Wukong*. It explains how players can access this ancient kingdom by completing the Drunk Boar's questline. Upon entering the kingdom, players encounter the Tiger Vanguard, a gate defender, who challenges them in combat. Defeating him rewards the **Tiger Tally** curio and grants access to meet the Yaoguai King, Fuban. The section titled \"Sandgate Bound\" begins by highlighting collectible plants and the location of the Sandgate Bound Shrine near a cliff.\n\nImage Summary:\nThe image depicts a player-character in a rocky, desert-like environment approaching ruins with wooden columns. A chest, highlighted by a red circle, is partially visible near the ruins. This visual aligns with the context of exploring the area near the Sandgate Bound Shrine to find hidden items, including a chest containing valuable loot such as the **Gold Ridge Beast** and **Knot of Voidness** material.\n\nFollowing Text Summary:\nThe following text elaborates on the exploration opportunities near the Sandgate Bound Shrine. It mentions that searching the left side of the central cliff reveals ruins with a chest containing the **Gold Ridge Beast** (a sellable item) and the **Knot of Voidness** material, which can be used for advanced Spirit Cultivation."
}