{
    "chunk_id": 821750002629,
    "source_file": "Bitter_Lake_Walkthrough.md",
    "h1_title": "Bitter Lake Walkthrough",
    "h2_title": "Yaoguai King Boss Fight - Cyan Loong",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/75/Wukong_Turtle_34.jpg",
    "alt_text": "Wukong Turtle 34.jpg",
    "position_desc": 35,
    "img_above_text": "# Bitter Lake Walkthrough\n\nAs you draw close, you'll hear a voice coming from the cymbals, who is arguing with a woman refusing to let the trapped person out. With a loud gong, the trapped \"Admiral\" will use the cymbal to awaken a giant turtle whose mountainous shell you're actually standing on.\n\nAs the turtle begins to swim through the Bitter Seal, the woman will become aware of your presence, starting this new region off with a bang of a boss fight.\n\n\nAs long as your patient to wait for the right moments to get in close and attack, and make sure you're using shock-quelling medicine, you'll be able to come out on top. Even as Kang-Jin Star tries to flee in her dragon form, the Destined One will see to it that she crashes into the large cymbals, freeing the prisoner inside!\n\nThis imprisoned Pig Guai is none other than Zhu Bajie, who traveled with Sun Wukong during his adventures in Journey to the West!\n\n\nAs you start exploring the path over to the right, an echoing voice will lead you to a large open platform where dragon humanoid figure appears to be frozen in place with its fishing rod. If you interact with it while holding the Loong Scales, it will crackle to life, and begin a new secret boss fight.\n\n## Yaoguai King Boss Fight - Cyan Loong\n\nThe good news is that his blade won't stay enchanted forever, often ending with the previously mentioned attack. Once you no longer see electricity crackling along his blade, that's your cue to go back to pressing the attack by getting in staggering blows.",
    "img_below_text": "In particular, we recommend the Red Tides transformation spell to evade around his attacks while burning him, as he swings are slow enough that you can have an easier time performing the wolf guai's ultimate spell attack for big damage.\n\nThis fight will largely come down to learning his moves enough that you can anticipate and avoid his powerful attacks, and find your opening to keep him staggered and on the defensive. Once you learn how to keep away from his sword swings, you'll be able to take him down for good.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Bitter Lake Walkthrough\n            - Section Title: Yaoguai King Boss Fight - Cyan Loong\n\n            Context:\n            - Preceding Text: \"# Bitter Lake Walkthrough\n\nAs you draw close, you'll hear a voice coming from the cymbals, who is arguing with a woman refusing to let the trapped person out. With a loud gong, the trapped \"Admiral\" will use the cymbal to awaken a giant turtle whose mountainous shell you're actually standing on.\n\nAs the turtle begins to swim through the Bitter Seal, the woman will become aware of your presence, starting this new region off with a bang of a boss fight.\n\n\nAs long as your patient to wait for the right moments to get in close and attack, and make sure you're using shock-quelling medicine, you'll be able to come out on top. Even as Kang-Jin Star tries to flee in her dragon form, the Destined One will see to it that she crashes into the large cymbals, freeing the prisoner inside!\n\nThis imprisoned Pig Guai is none other than Zhu Bajie, who traveled with Sun Wukong during his adventures in Journey to the West!\n\n\nAs you start exploring the path over to the right, an echoing voice will lead you to a large open platform where dragon humanoid figure appears to be frozen in place with its fishing rod. If you interact with it while holding the Loong Scales, it will crackle to life, and begin a new secret boss fight.\n\n## Yaoguai King Boss Fight - Cyan Loong\n\nThe good news is that his blade won't stay enchanted forever, often ending with the previously mentioned attack. Once you no longer see electricity crackling along his blade, that's your cue to go back to pressing the attack by getting in staggering blows.\"\n            - Following Text: \"In particular, we recommend the Red Tides transformation spell to evade around his attacks while burning him, as he swings are slow enough that you can have an easier time performing the wolf guai's ultimate spell attack for big damage.\n\nThis fight will largely come down to learning his moves enough that you can anticipate and avoid his powerful attacks, and find your opening to keep him staggered and on the defensive. Once you learn how to keep away from his sword swings, you'll be able to take him down for good.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:  \nThe preceding text describes the setup for the \"Yaoguai King Boss Fight - Cyan Loong,\" a secret encounter triggered by interacting with a dragon-like figure using the Loong Scales. The fight involves strategic timing to attack when the boss's blade is no longer electrified, emphasizing patience and the use of shock-quelling medicine to counter its abilities.\n\nImage Summary:  \nThe image depicts the intense \"Yaoguai King Boss Fight - Cyan Loong,\" showcasing the boss mid-attack with an electrified blade in a snowy, mountainous environment. The player character is engaged in combat, with on-screen prompts for light and heavy attack options. The boss's imposing design, including fiery and lightning effects, highlights the challenging nature of the encounter.\n\nFollowing Text Summary:  \nThe following text provides tactical advice for the Cyan Loong fight, recommending the use of the Red Tides transformation spell to evade and deal damage. It emphasizes learning the boss's attack patterns to anticipate and avoid its powerful moves, creating opportunities to stagger and defeat it."
}