{
    "chunk_id": 180262025878,
    "source_file": "Captain_Wise-Voice.md",
    "h1_title": "Captain Wise-Voice",
    "h2_title": "Where to Find Captain Wise-Voice",
    "h3_title": "Captain Wise-Voice Boss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/51/Wukong_Pagoda_83.jpg",
    "alt_text": "Wukong Pagoda 83.jpg",
    "position_desc": 3,
    "img_above_text": "# Captain Wise-Voice\n\nCaptain Wise-Voice is a required Yaoguai King boss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Responsible for the \"beguiling chant\" that curses you in the Pagoda Realm, you can find this boss inside the Mani Wheel at the top of the prison.\n\n* **Rewards:** Spirit of Captain Wise-Voice, Mind Core\n\n## Where to Find Captain Wise-Voice\n\nCaptain Wise-Voice is one of the four captains you can find in Chapter 3, and is a required boss to escape the prison of the Pagoda Realm. You can reach him by escaping up through the four levels of the Pagoda Prison and past the Outside the Wheel Shrine.\n\n### Captain Wise-Voice Boss Fight and Guide\n\nCaptain Wise-Voice has a lot of unorthodox attacks, made by violently spinning its golden sphere of a head around to emit thin beams of light. If you start to see beams erupt in different directions, start strafing to get distance, and prepare to dodge or sprint away when all the beams finally flash down in your direction at the same time.",
    "img_below_text": "After a short delay, he'll perform another blast as the laser cuts upward, requiring a second dodge.\n\nOther times, it will create a sustained laser much faster, roving around you to slash upwards, and then create a trail of lightning strikes in a vertical line you'll need to quickly strafe to outpace.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Captain Wise-Voice\n            - Section Title: Where to Find Captain Wise-Voice\n            - Sub-Section Title: Captain Wise-Voice Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Captain Wise-Voice\n\nCaptain Wise-Voice is a required Yaoguai King boss fight, and one of four \"Captains\" that you can encounter in Chapter 3 of Black Myth Wukong. Responsible for the \"beguiling chant\" that curses you in the Pagoda Realm, you can find this boss inside the Mani Wheel at the top of the prison.\n\n* **Rewards:** Spirit of Captain Wise-Voice, Mind Core\n\n## Where to Find Captain Wise-Voice\n\nCaptain Wise-Voice is one of the four captains you can find in Chapter 3, and is a required boss to escape the prison of the Pagoda Realm. You can reach him by escaping up through the four levels of the Pagoda Prison and past the Outside the Wheel Shrine.\n\n### Captain Wise-Voice Boss Fight and Guide\n\nCaptain Wise-Voice has a lot of unorthodox attacks, made by violently spinning its golden sphere of a head around to emit thin beams of light. If you start to see beams erupt in different directions, start strafing to get distance, and prepare to dodge or sprint away when all the beams finally flash down in your direction at the same time.\"\n            - Following Text: \"After a short delay, he'll perform another blast as the laser cuts upward, requiring a second dodge.\n\nOther times, it will create a sustained laser much faster, roving around you to slash upwards, and then create a trail of lightning strikes in a vertical line you'll need to quickly strafe to outpace.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Captain Wise-Voice as a required boss fight in Chapter 3 of *Black Myth Wukong*. This Yaoguai King boss is responsible for a curse in the Pagoda Realm and is located inside the Mani Wheel at the top of the prison. The text also describes his rewards and briefly mentions his unorthodox attack style involving beams of light emitted from his spinning golden sphere head.\n\nImage Summary:\nThe image appears to depict the gameplay during the boss fight against Captain Wise-Voice in *Black Myth Wukong*. The screen shows the boss's name and health bar at the bottom, indicating an active encounter. Bright, chaotic beams of light dominate the scene, likely representing the boss's attack patterns described in the text. The player interface is visible, including health, stamina, and ability icons, suggesting the player is engaged in combat and needs to strategize to avoid the beams.\n\nFollowing Text Summary:\nThe following text elaborates on Captain Wise-Voice's attack patterns, describing additional laser blasts and sustained lasers that require precise dodging and strafing. It emphasizes the need for quick movement to avoid vertical lightning strikes and other dangerous attacks during the fight."
}