{
    "chunk_id": 306424938089,
    "source_file": "Flint_Chief_Spirit.md",
    "h1_title": "Flint Chief Spirit",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/0/0a/Flint_Chief_.jpg",
    "alt_text": "Flint Chief .jpg",
    "position_desc": 1,
    "img_above_text": "# Flint Chief Spirit\n\nThe **Flint Chief** is a foe that you will face off against in Black Myth: Wukong. Once defeated, the Flint Chief offers up its Spirit for you to absorb, allowing you to use some of its powers for a short time. On this page, we will go over everything you need to know about the Flint Chief, including where to find it, how to defeat it, and what power its Spirit gives you.\n\n* Flint Chief Location\n* Flint Chief Fight\n* Flint Chief Spirit",
    "img_below_text": "## Flint Chief Location\n\nThe Flint Chief is a large magma-rock enemy found in Furnace Valley. To get there, travel to the Valley Entrance Keeper's Shrine and head forward until you can drop into the lava flow on the left. Continue heading forward until you start nearing the end of the lava flow. Once you see a collection of rocks in the lava, approach them to lure the Flint Chief out of hiding.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Flint Chief Spirit\n\n            Context:\n            - Preceding Text: \"# Flint Chief Spirit\n\nThe **Flint Chief** is a foe that you will face off against in Black Myth: Wukong. Once defeated, the Flint Chief offers up its Spirit for you to absorb, allowing you to use some of its powers for a short time. On this page, we will go over everything you need to know about the Flint Chief, including where to find it, how to defeat it, and what power its Spirit gives you.\n\n* Flint Chief Location\n* Flint Chief Fight\n* Flint Chief Spirit\"\n            - Following Text: \"## Flint Chief Location\n\nThe Flint Chief is a large magma-rock enemy found in Furnace Valley. To get there, travel to the Valley Entrance Keeper's Shrine and head forward until you can drop into the lava flow on the left. Continue heading forward until you start nearing the end of the lava flow. Once you see a collection of rocks in the lava, approach them to lure the Flint Chief out of hiding.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n            \n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces the Flint Chief as an enemy in the game Black Myth: Wukong. Once defeated, players can absorb its Spirit, gaining temporary access to its powers. The text promises detailed information about the Flint Chief, including its location, how to defeat it, and the benefits of its Spirit.\n\nImage Summary:\nThe image depicts a scene from the game Black Myth: Wukong, showing the Flint Chief, a large magma-rock creature, in a fiery environment. The image likely serves to visually represent the Flint Chief as described in the context, showcasing the intense battle setting and the enemy's formidable appearance.\n\nFollowing Text Summary:\nThe following text provides specific details on the location of the Flint Chief within the game. It is found in Furnace Valley, and players are guided on how to reach this area by traveling from the Valley Entrance Keeper's Shrine and navigating through the lava flow to encounter the Flint Chief."
}