{
    "chunk_id": 745236278193,
    "source_file": "Baw-Li-Guhh-Baw.md",
    "h1_title": "Baw-Li-Guhh-Baw",
    "h2_title": "Baw-Li-Guhh-Baw Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/25/Wukong_LowerHollow_30.jpg",
    "alt_text": "Wukong LowerHollow 30.jpg",
    "position_desc": 9,
    "img_above_text": "# Baw-Li-Guhh-Baw\n\nBaw-Li-Guhh-Baw is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the lowest section of The Webbed Hollow, he is one of the many frog minibosses you can encounter in the game, though he sports a hidden surprise.\n\n* Rewards: Buddha's Left Hand (Key Item), Tadpole, Refined Iron Sand, 1562 Experience, 1449 Will\n\n\nBaw-Li-Guhh-Baw is an optional encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down past the Buddha's Right Hand and spying on the Spider Sisters, you can head down a long path with an optional passage through a fissure on the right.\n\nThis path will lead you to a ledge with an archer, and then right along the path above the main trail where the Lower Hollow Shrine is to where the frog boss waits in a flooded cavern. You can also climb up to the ledge from the Shrine by jumping and performing aerial heavy attacks.\n\n## Baw-Li-Guhh-Baw Boss Fight and Guide\n\nThis will cause his tongue-hand to shoot out and carry you upwards, fill you with poison immediately, and then slam you down! It's more than likely this will eliminate almost all your health, leaving the poison to finish the job if you aren't quick with an antimiasma pill (or took one earlier).",
    "img_below_text": "It may take a bit to learn and anticipate all of his surprises, and you can try using the Thrust Stance to get some distance away from his close-range moves. Make the most of your deflections or Immobilize to press your attack and augment it with Spirits and Transformations to keep the boss staggered so that you can finish him off.\n\nWhen Baw-Li-Guhh-Baw is defeated, you'll gain another Tadpole to upgrade your frog Spirit, as well as the Left Hand of Buddha! This means you can now use both hands to craft and purchase a special Immortal Blessing Gourd when you visit the Shen Monkey in the Zodiac Village!",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Baw-Li-Guhh-Baw\n            - Section Title: Baw-Li-Guhh-Baw Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Baw-Li-Guhh-Baw\n\nBaw-Li-Guhh-Baw is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the lowest section of The Webbed Hollow, he is one of the many frog minibosses you can encounter in the game, though he sports a hidden surprise.\n\n* Rewards: Buddha's Left Hand (Key Item), Tadpole, Refined Iron Sand, 1562 Experience, 1449 Will\n\n\nBaw-Li-Guhh-Baw is an optional encounter that you'll find exploring the massive Webbed Hollow Portion of Chapter 4. After descending down past the Buddha's Right Hand and spying on the Spider Sisters, you can head down a long path with an optional passage through a fissure on the right.\n\nThis path will lead you to a ledge with an archer, and then right along the path above the main trail where the Lower Hollow Shrine is to where the frog boss waits in a flooded cavern. You can also climb up to the ledge from the Shrine by jumping and performing aerial heavy attacks.\n\n## Baw-Li-Guhh-Baw Boss Fight and Guide\n\nThis will cause his tongue-hand to shoot out and carry you upwards, fill you with poison immediately, and then slam you down! It's more than likely this will eliminate almost all your health, leaving the poison to finish the job if you aren't quick with an antimiasma pill (or took one earlier).\"\n            - Following Text: \"It may take a bit to learn and anticipate all of his surprises, and you can try using the Thrust Stance to get some distance away from his close-range moves. Make the most of your deflections or Immobilize to press your attack and augment it with Spirits and Transformations to keep the boss staggered so that you can finish him off.\n\nWhen Baw-Li-Guhh-Baw is defeated, you'll gain another Tadpole to upgrade your frog Spirit, as well as the Left Hand of Buddha! This means you can now use both hands to craft and purchase a special Immortal Blessing Gourd when you visit the Shen Monkey in the Zodiac Village!\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.\n\n\n\n            Output Format:\n            Preceding Text Summary:\n            Provide a concise summary of the preceding text that gives context to the image.\n            Image Summary:\n            Provide a summary of the image, describing its purpose and content based on the context.\n            Following Text Summary:\n            Provide a concise summary of the following text that elaborates on the information related to the image.",
    "img_summary": "Preceding Text Summary:\nThe preceding text introduces Baw-Li-Guhh-Baw, an optional Yaoguai Chief boss in *Black Myth: Wukong*. Found in the Webbed Hollow area during Chapter 4, this frog-like miniboss is located in a flooded cavern accessible through specific paths. The encounter is challenging and rewards players with key items, experience points, and upgrade materials upon defeat.\n\nImage Summary:\nThe image depicts the boss fight against Baw-Li-Guhh-Baw in a dark, flooded cavern. The frog-like boss is shown attacking with a stream of poisonous projectiles aimed at the player character, who is engaged in combat. The game interface displays health bars, abilities, and status effects, emphasizing the intensity and danger of the encounter.\n\nFollowing Text Summary:\nThe following text provides strategies for defeating Baw-Li-Guhh-Baw, such as using Thrust Stance for distance, deflections, and immobilization techniques. It highlights the importance of using Spirits and Transformations to stagger the boss and secure victory. Defeating Baw-Li-Guhh-Baw rewards players with valuable items, including the Left Hand of Buddha, which unlocks crafting options for a special Immortal Blessing Gourd."
}