{
    "chunk_id": 388075471364,
    "source_file": "Pagoda_Realm_Walkthrough.md",
    "h1_title": "The Beguiling Chant of the Pagoda Realm",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/65/Wukong_Pagoda_5.jpg",
    "alt_text": "Wukong Pagoda 5.jpg",
    "position_desc": 4,
    "img_above_text": "# The Beguiling Chant of the Pagoda Realm\nIt's around this point that you'll likely get your first taste of the \"beguiling chants\" the prisoner mentioned, and there's a lot going on you'll have to make sense of. A large terrifying sound will echo throughout the realm, the pagoda itself will spin even faster, everyone will start glowing, strange new creatures will appear -- and your health will start lowering!\nLet's break it down: The Pagoda Realm's chanting curse is on a global timer, meaning even if you die or go to different Shines in the realm, or even sit around resting at a shrine, the curse can still trigger and persist. **Every three minutes, the chanting will begin, and last for exactly one minute and thirty seconds before resetting.**",
    "img_below_text": "",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: The Beguiling Chant of the Pagoda Realm\n\n            Context:\n            - Preceding Text: \"# The Beguiling Chant of the Pagoda Realm\nIt's around this point that you'll likely get your first taste of the \"beguiling chants\" the prisoner mentioned, and there's a lot going on you'll have to make sense of. A large terrifying sound will echo throughout the realm, the pagoda itself will spin even faster, everyone will start glowing, strange new creatures will appear -- and your health will start lowering!\nLet's break it down: The Pagoda Realm's chanting curse is on a global timer, meaning even if you die or go to different Shines in the realm, or even sit around resting at a shrine, the curse can still trigger and persist. **Every three minutes, the chanting will begin, and last for exactly one minute and thirty seconds before resetting.**\"\n            - Following Text: \"\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dark, eerie scene within the Pagoda Realm, featuring two characters engaged in combat. One character appears to be a menacing, glowing figure, while the other is a warrior wielding a weapon. The environment is shrouded in darkness, with mystical elements and creatures visible. The image aligns with the preceding text, which describes the chaotic and perilous nature of the Pagoda Realm during the chanting curse, where strange creatures appear and players' health deteriorates. The metadata title, \"The Beguiling Chant of the Pagoda Realm,\" suggests that this image illustrates the intense and supernatural experiences players encounter in this realm."
}