{
    "chunk_id": 136222399108,
    "source_file": "Umbral_Abyss.md",
    "h1_title": "Umbral Abyss",
    "h2_title": "Black Myth: Wukong Umbral Abyss Location",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/e/ed/Wukong_Thunderclap_87.jpg",
    "alt_text": "Wukong Thunderclap 87.jpg",
    "position_desc": 0,
    "img_above_text": "# Umbral Abyss\nUmbral Abyss is one of the later-game Transformation Spells you can obtain in Black Myth: Wukong. With it, you can transform into the Macaque Chief, become immune to Frost, and wield a longsword that unleashes Frost Bane. The Focus built up before a transformation can also be converted for use afterwards.\nTo find the Umbrall Abyss Transformation, you will need to explore the majority of The New West, which is easily the largest area in the game. The Umbral Abyss Transformation's moveset is:\n* **Light Attack: Sprouting Spring - Perform consecutive slashes to build up Focus** \\- This is a standard set of slashes that builds up focus, with the final one doing more damage.\n* **Heavy Attack: Withering Winter - Slower in movement, but heavier in damage, this move builds up Focus faster**. - This is a strong slash that deals significant damage but is very slow compared to other attacks.\n* **Spell: Cold Heart - Perform Cold Heart to empower yourself**. This is a strong enchantment that allows you to deal more damage with your blade slashes, and dodge easier thanks to turning into clouds and mist.\n## Black Myth: Wukong Umbral Abyss Location\nThe Umbral Abyss Transformation Spell can be obtained from the Mahavira Hall Shrine in New Thunderclap Temple in The New West. From the Shrine, head up into the large temple and defeat Yellowbrow and then the Macaque Chief for the final time.",
    "img_below_text": "You will get the Spell and be able to use it from the start of Chapter 4. If you are struggling with both of these fights, our detailed boss breakdowns on Yellowbrow and the Macaque Chief can give you some valuable tips to succeed in these final boss fights within Chapter 3.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Umbral Abyss\n            - Section Title: Black Myth: Wukong Umbral Abyss Location\n\n            Context:\n            - Preceding Text: \"# Umbral Abyss\nUmbral Abyss is one of the later-game Transformation Spells you can obtain in Black Myth: Wukong. With it, you can transform into the Macaque Chief, become immune to Frost, and wield a longsword that unleashes Frost Bane. The Focus built up before a transformation can also be converted for use afterwards.\nTo find the Umbrall Abyss Transformation, you will need to explore the majority of The New West, which is easily the largest area in the game. The Umbral Abyss Transformation's moveset is:\n* **Light Attack: Sprouting Spring - Perform consecutive slashes to build up Focus** \\- This is a standard set of slashes that builds up focus, with the final one doing more damage.\n* **Heavy Attack: Withering Winter - Slower in movement, but heavier in damage, this move builds up Focus faster**. - This is a strong slash that deals significant damage but is very slow compared to other attacks.\n* **Spell: Cold Heart - Perform Cold Heart to empower yourself**. This is a strong enchantment that allows you to deal more damage with your blade slashes, and dodge easier thanks to turning into clouds and mist.\n## Black Myth: Wukong Umbral Abyss Location\nThe Umbral Abyss Transformation Spell can be obtained from the Mahavira Hall Shrine in New Thunderclap Temple in The New West. From the Shrine, head up into the large temple and defeat Yellowbrow and then the Macaque Chief for the final time.\"\n            - Following Text: \"You will get the Spell and be able to use it from the start of Chapter 4. If you are struggling with both of these fights, our detailed boss breakdowns on Yellowbrow and the Macaque Chief can give you some valuable tips to succeed in these final boss fights within Chapter 3.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the game \"Black Myth: Wukong,\" specifically related to the Umbral Abyss Transformation Spell. In the image, three characters are seen in a red, foggy environment, with one character in the foreground holding a spear and another character in the background appearing to be in a combat stance. The text overlay at the bottom of the image reads, \"Join me, let's fight our way out!\" This scene likely represents a crucial moment in the game where the player must engage in a significant battle, possibly against the Macaque Chief, as mentioned in the context. The image serves to illustrate the intense and atmospheric nature of the game's combat sequences."
}