{
    "chunk_id": 414195242293,
    "source_file": "Pale-Axe_Stalwart.md",
    "h1_title": "Pale-Axe Stalwart",
    "h2_title": "Pale-Axe Stalwart Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/dc/Woods_Ember_Walkthrough_%2838%29.png",
    "alt_text": "Woods Ember Walkthrough \\(38\\).png",
    "position_desc": 6,
    "img_above_text": "# Pale-Axe Stalwart\nThe Pale-Axe Stalwart is a Character boss you'll go up against at the start of Chapter 5 in Black Myth: Wukong. After defeating the imposing Stalwart, you'll be asked to complete a side quest for him.\n## Pale-Axe Stalwart Boss Fight and Guide\n\nThe most beneficial thing to you here is the fire from above. He is also impacted by the fire attacks, so watch where the projectiles land and bait him into standing in the vicinity of them. This will build up his Fire Damage, weakening his health bar while you attack, and also completely stagger him at times, leaving him vulnerable to longer combos and heavier attacks.",
    "img_below_text": "When you've knocked his health bar almost all the way down, he will kneel. To make the area safer, clear out the rest of the fighting Yaoguais, then approach the Pale-Axe Stalwart, who will now become an NPC with his own side quest for you to complete.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Pale-Axe Stalwart\n            - Section Title: Pale-Axe Stalwart Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Pale-Axe Stalwart\nThe Pale-Axe Stalwart is a Character boss you'll go up against at the start of Chapter 5 in Black Myth: Wukong. After defeating the imposing Stalwart, you'll be asked to complete a side quest for him.\n## Pale-Axe Stalwart Boss Fight and Guide\n\nThe most beneficial thing to you here is the fire from above. He is also impacted by the fire attacks, so watch where the projectiles land and bait him into standing in the vicinity of them. This will build up his Fire Damage, weakening his health bar while you attack, and also completely stagger him at times, leaving him vulnerable to longer combos and heavier attacks.\"\n            - Following Text: \"When you've knocked his health bar almost all the way down, he will kneel. To make the area safer, clear out the rest of the fighting Yaoguais, then approach the Pale-Axe Stalwart, who will now become an NPC with his own side quest for you to complete.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the boss fight with the Pale-Axe Stalwart in *Black Myth: Wukong*, as described in the \"Pale-Axe Stalwart Boss Fight and Guide\" section. The setting is a desolate, rocky area with a somber atmosphere, featuring the protagonist facing off against the imposing Pale-Axe Stalwart, a large, armored character wielding a massive axe. The fire in the foreground aligns with the guide's strategy, suggesting its use to weaken the boss. This moment captures the tension of the encounter before the boss transitions into an NPC after being defeated."
}