{
    "chunk_id": 15176607374,
    "source_file": "Lang-Li-Guhh-Baw.md",
    "h1_title": "Lang-Li-Guhh-Baw",
    "h2_title": "Where to Find Lang-Li-Guhh-Baw",
    "h3_title": "Lang-Li-Guhh-Baw Mini-Boss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/27/Wukong_Sandgate_23.jpg",
    "alt_text": "Wukong Sandgate 23.jpg",
    "position_desc": 8,
    "img_above_text": "# Lang-Li-Guhh-Baw\nLang-Li-Guhh-Baw is an optional Yaoguai Chief miniboss that you can encounter in Chapter 2 of Black Myth Wukong. As an optional foe, you can seek out this boss near the entrance to Sandgate Village to help assist a friendly Xu Dog with a quest.\n* Rewards: Evil Repelling Medicament Formula, Tadpole, Silk x2, Yarn x2, 758 Experience, 776 Will\n## Where to Find Lang-Li-Guhh-Baw\nAs an optional battle, Lang-Li-Guhh-Baw is located very close to the start of Chapter 2 in the Yellow Wind Ridge. As soon as you arrive, you can head along the brackish pond water to its very end, where you'll find the Frog Guai in a large watery pit.\n### Lang-Li-Guhh-Baw Mini-Boss Fight and Guide\nThe frog in question is the one you may have seen from the pond earlier, down in a large flooded pit nearby. While he has much in common with the other optional frog boss from Black Wind Mountain, he’s got a few new attacks you’ll need to prepare for.\n\nIf you’re having trouble dealing with his many lightning attacks, remember to use Immobilize whenever you see him charge up to interrupt the attack entirely, limiting how much he can actually try to electrify you.",
    "img_below_text": "Once you defeat this frog boss, he’ll drop the Evil Repelling Medicament formula. Return it to the Xu dog back outside the pit. Not only will he reward you with 2 Evil Repelling Medicament for your trouble, but you’ll also unlock the ability to create all sorts of consumables yourself at any Shrine. With all the materials you’ve been harvesting, you can stock up on defensive, offensive, and status reducing consumables.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Lang-Li-Guhh-Baw\n            - Section Title: Where to Find Lang-Li-Guhh-Baw\n            - Sub-Section Title: Lang-Li-Guhh-Baw Mini-Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Lang-Li-Guhh-Baw\nLang-Li-Guhh-Baw is an optional Yaoguai Chief miniboss that you can encounter in Chapter 2 of Black Myth Wukong. As an optional foe, you can seek out this boss near the entrance to Sandgate Village to help assist a friendly Xu Dog with a quest.\n* Rewards: Evil Repelling Medicament Formula, Tadpole, Silk x2, Yarn x2, 758 Experience, 776 Will\n## Where to Find Lang-Li-Guhh-Baw\nAs an optional battle, Lang-Li-Guhh-Baw is located very close to the start of Chapter 2 in the Yellow Wind Ridge. As soon as you arrive, you can head along the brackish pond water to its very end, where you'll find the Frog Guai in a large watery pit.\n### Lang-Li-Guhh-Baw Mini-Boss Fight and Guide\nThe frog in question is the one you may have seen from the pond earlier, down in a large flooded pit nearby. While he has much in common with the other optional frog boss from Black Wind Mountain, he’s got a few new attacks you’ll need to prepare for.\n\nIf you’re having trouble dealing with his many lightning attacks, remember to use Immobilize whenever you see him charge up to interrupt the attack entirely, limiting how much he can actually try to electrify you.\"\n            - Following Text: \"Once you defeat this frog boss, he’ll drop the Evil Repelling Medicament formula. Return it to the Xu dog back outside the pit. Not only will he reward you with 2 Evil Repelling Medicament for your trouble, but you’ll also unlock the ability to create all sorts of consumables yourself at any Shrine. With all the materials you’ve been harvesting, you can stock up on defensive, offensive, and status reducing consumables.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a character resembling a dog dressed in traditional attire, possibly the Xu Dog mentioned in the context. This character is likely involved in a quest related to the Lang-Li-Guhh-Baw mini-boss fight in Chapter 2 of Black Myth Wukong. The preceding text explains the location and strategies for defeating Lang-Li-Guhh-Baw, while the following text describes the rewards obtained after defeating the boss, including the Evil Repelling Medicament formula, which is to be returned to the Xu Dog. The Xu Dog then rewards the player with additional items and unlocks the ability to create consumables at any Shrine. The image likely illustrates the Xu Dog preparing or handling items related to the quest rewards."
}