{
    "chunk_id": 899304335318,
    "source_file": "Black_Wind_King.md",
    "h1_title": "Black Wind King",
    "h2_title": "Black Wind King Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/d/df/Wukong_BlackWind_17.jpg",
    "alt_text": "Wukong BlackWind 17.jpg",
    "position_desc": 10,
    "img_above_text": "# Black Wind King\nThe Black Wind King is a required Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located in the middle of Black Wind Cave, this is the first of two forms you'll fight the self-imposed King of Black Wind Mountain. Even in his human form, he can be incredibly powerful.\n* **Rewards:** Cloud Step Spell, Yarn x3, 1049 Experience, 688 Will\n## Black Wind King Boss Fight and Guide\nThe self-imposed King of the Black Wind Mountain has been waiting for you, and though he’s only facing you now in his human form, he’s got a lot of powerful attacks to watch out for.\n\nAfter his next Black Wind assault, be ready to transform using the Red Tides Spell, and charge up a dash attack the moment he lands in the center of the arena, and use it and the transformation spell’s pogo attack to perform a massive hit once you catch him after a teleport.",
    "img_below_text": "Counter each of his teleports when his attacks complete, and you’ll soon defeat the Yaoguai King, forcing him to retreat as he yells for you to face his true form at the top of the mountain. However, in his retreat, he’ll leave behind some of his Black Wind, which the Keeper of the Mountain will harness and pass onto you, giving you a brand new spell: **Cloud Step**.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Black Wind King\n            - Section Title: Black Wind King Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Black Wind King\nThe Black Wind King is a required Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located in the middle of Black Wind Cave, this is the first of two forms you'll fight the self-imposed King of Black Wind Mountain. Even in his human form, he can be incredibly powerful.\n* **Rewards:** Cloud Step Spell, Yarn x3, 1049 Experience, 688 Will\n## Black Wind King Boss Fight and Guide\nThe self-imposed King of the Black Wind Mountain has been waiting for you, and though he’s only facing you now in his human form, he’s got a lot of powerful attacks to watch out for.\n\nAfter his next Black Wind assault, be ready to transform using the Red Tides Spell, and charge up a dash attack the moment he lands in the center of the arena, and use it and the transformation spell’s pogo attack to perform a massive hit once you catch him after a teleport.\"\n            - Following Text: \"Counter each of his teleports when his attacks complete, and you’ll soon defeat the Yaoguai King, forcing him to retreat as he yells for you to face his true form at the top of the mountain. However, in his retreat, he’ll leave behind some of his Black Wind, which the Keeper of the Mountain will harness and pass onto you, giving you a brand new spell: **Cloud Step**.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dynamic moment from the boss fight against the Black Wind King in his human form, as described in the \"Black Wind King Boss Fight and Guide\" section of the document titled \"Black Wind King.\" The scene shows intense combat, with the protagonist using powerful spells and attacks to counter the Black Wind King's moves. The preceding text outlines strategies for defeating the boss, while the following text explains the rewards and the next phase of the encounter."
}