{
    "chunk_id": 837898901262,
    "source_file": "Gray-Bronze_Cart.md",
    "h1_title": "Gray-Bronze Cart",
    "h2_title": "Gray-Bronze Cart Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/93/Chapter_5_Secret_Area_%289%29.png",
    "alt_text": "Chapter 5 Secret Area \\(9\\).png",
    "position_desc": 3,
    "img_above_text": "# Gray-Bronze Cart\nGray-Bronze Cart is a Yaoguai Chief boss fight that you'll go up against at the start of Chapter 5 in Black Myth: Wukong. Blocking the pathway to the Ashen Pass II, the cart is just one of the Five Element Carts you'll need to fight in this Chapter.\n## Gray-Bronze Cart Boss Fight and Guide\nHead straight up the narrow path, and when you're close to the cart, look to the left to find an alcove you can dip into to avoid the fire attacks that also has a green Wisp in it.",
    "img_below_text": "You can expect the same moveset from each of the carts, so again, the Fireproof Mantle Vessel works wonders here. For this one, though, you won't be able to get close to the feet and stay there without being hit with the fire attacks. So, stick close during the fist slam (without the fire) and dodge this. But when it rears up, jump back into the alcove to protect yourself from any fire attacks.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Gray-Bronze Cart\n            - Section Title: Gray-Bronze Cart Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Gray-Bronze Cart\nGray-Bronze Cart is a Yaoguai Chief boss fight that you'll go up against at the start of Chapter 5 in Black Myth: Wukong. Blocking the pathway to the Ashen Pass II, the cart is just one of the Five Element Carts you'll need to fight in this Chapter.\n## Gray-Bronze Cart Boss Fight and Guide\nHead straight up the narrow path, and when you're close to the cart, look to the left to find an alcove you can dip into to avoid the fire attacks that also has a green Wisp in it.\"\n            - Following Text: \"You can expect the same moveset from each of the carts, so again, the Fireproof Mantle Vessel works wonders here. For this one, though, you won't be able to get close to the feet and stay there without being hit with the fire attacks. So, stick close during the fist slam (without the fire) and dodge this. But when it rears up, jump back into the alcove to protect yourself from any fire attacks.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a narrow, rocky pathway leading to a large, ominous cart adorned with intricate carvings and statues. The cart appears to be a significant boss fight obstacle in the game \"Black Myth: Wukong,\" specifically the Gray-Bronze Cart encountered in Chapter 5. An arrow points to an alcove on the left side of the path, suggesting a strategic spot for players to avoid fire attacks during the fight. The preceding and following text provide guidance on using this alcove for protection and emphasize the importance of the Fireproof Mantle Vessel in combating the cart's fire-based attacks."
}