{
    "chunk_id": 936869958071,
    "source_file": "Yarn.md",
    "h1_title": "Yarn",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/28/Yarn.jpg",
    "alt_text": "Yarn.jpg",
    "position_desc": 0,
    "img_above_text": "# Yarn\nYarn is one of the uncommon Crafting Materials in Black Myth: Wukong. It is primarily used to upgrade your Armor and Gear and unlock new sets as you make your way through the game. Compared to many of the other materials in the game, including Silk, which is also needed to upgrade your armor and gear, it is quite common.",
    "img_below_text": "Even still, below, on this page, we will go over the most common places to find Yarn throughout the game. In addition to Silk, the other main materials you will need to find while playing are some of the main boss materials which drop upon killing them. Most mandatory bosses and side bosses will drop one of these Crafting Materials which you can use to get new weapons alongside your new armor sets.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Yarn\n\n            Context:\n            - Preceding Text: \"# Yarn\nYarn is one of the uncommon Crafting Materials in Black Myth: Wukong. It is primarily used to upgrade your Armor and Gear and unlock new sets as you make your way through the game. Compared to many of the other materials in the game, including Silk, which is also needed to upgrade your armor and gear, it is quite common.\"\n            - Following Text: \"Even still, below, on this page, we will go over the most common places to find Yarn throughout the game. In addition to Silk, the other main materials you will need to find while playing are some of the main boss materials which drop upon killing them. Most mandatory bosses and side bosses will drop one of these Crafting Materials which you can use to get new weapons alongside your new armor sets.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image displays the inventory screen from the game Black Myth: Wukong, highlighting Yarn as an uncommon crafting material used for upgrading armor. The description notes that Yarn is collected by lesser guais, who patrol the hills by day and spin yarn by night. Yarn is essential for crafting armor, and players can hold up to 999 units of it. The preceding and following text suggests that Yarn is a common material compared to others like Silk and boss materials, which are also necessary for crafting and upgrading gear in the game."
}