{
    "chunk_id": 769755479206,
    "source_file": "Flame_Ebongold.md",
    "h1_title": "Flame Ebongold",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/f/f8/Wukong_BlackWind_32.jpg",
    "alt_text": "Wukong BlackWind 32.jpg",
    "position_desc": 1,
    "img_above_text": "# Flame Ebongold\nFlame Ebongold is one of the unique materials in Black Myth: Wukong. It is used for weapon and armor crafting to craft unique gear unlocked upon defeating a boss.\nThe Flame Ebongold can be used to craft the Wind Bear Staff from the Shrine.\n\nTo obtain the Flame Ebongold, you need to defeat Black Bear Guai in Black Wind Cave in Black Wind Mountain.",
    "img_below_text": "For even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Weapons locations and Armor and Gear locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Flame Ebongold\n\n            Context:\n            - Preceding Text: \"# Flame Ebongold\nFlame Ebongold is one of the unique materials in Black Myth: Wukong. It is used for weapon and armor crafting to craft unique gear unlocked upon defeating a boss.\nThe Flame Ebongold can be used to craft the Wind Bear Staff from the Shrine.\n\nTo obtain the Flame Ebongold, you need to defeat Black Bear Guai in Black Wind Cave in Black Wind Mountain.\"\n            - Following Text: \"For even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Weapons locations and Armor and Gear locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the game \"Black Myth: Wukong,\" showing a player character in combat with a large, menacing creature named Black Bear Guai. This battle takes place in a fiery, outdoor environment, likely Black Wind Cave in Black Wind Mountain. Defeating Black Bear Guai is necessary to obtain the Flame Ebongold, a unique material used for crafting special gear such as the Wind Bear Staff. The image illustrates a critical moment in the game where players must overcome a challenging boss to progress and acquire valuable crafting resources."
}