{
    "chunk_id": 425448109011,
    "source_file": "The_Spirit_of_Captain_Lotus-Vision.md",
    "h1_title": "The Spirit of Captain Lotus-Vision",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/4/40/The_Spirit_of_Captain_Lotus-Vision_1.jpg",
    "alt_text": "The Spirit of Captain Lotus-Vision 1.jpg",
    "position_desc": 1,
    "img_above_text": "# The Spirit of Captain Lotus-Vision\nThe Spirit of Captain Lotus-Vision is one of the hidden Key Items in The New West. The item can be found after defeating Captain Lotus-Vision within the chapter. However, he is pretty hard to find, unless you know where he is.\n\nThe Spirit of Captain Lotus-Vision can be found in the Pagoda Realm in The New West. Specifically, right next to the Upper Pagoda Shrine. Once you spawn at the shrine, turn around and look down to find a small gap in the rocks with some enemies kneeling.",
    "img_below_text": "Drop down here to find Captain Lotus-Vision, whom you will need to defeat. He is a particularly tricky boss, but our Captain Lotus-Vision guide goes over everything you need to know to defeat him.\n\nOne key tip, however, is to start the fight right when the alarm ends in the Pagoda Realm, which halves your health. That way, you can get through most, if not all, of the fight without losing a huge chunk of your survivability.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: The Spirit of Captain Lotus-Vision\n\n            Context:\n            - Preceding Text: \"# The Spirit of Captain Lotus-Vision\nThe Spirit of Captain Lotus-Vision is one of the hidden Key Items in The New West. The item can be found after defeating Captain Lotus-Vision within the chapter. However, he is pretty hard to find, unless you know where he is.\n\nThe Spirit of Captain Lotus-Vision can be found in the Pagoda Realm in The New West. Specifically, right next to the Upper Pagoda Shrine. Once you spawn at the shrine, turn around and look down to find a small gap in the rocks with some enemies kneeling.\"\n            - Following Text: \"Drop down here to find Captain Lotus-Vision, whom you will need to defeat. He is a particularly tricky boss, but our Captain Lotus-Vision guide goes over everything you need to know to defeat him.\n\nOne key tip, however, is to start the fight right when the alarm ends in the Pagoda Realm, which halves your health. That way, you can get through most, if not all, of the fight without losing a huge chunk of your survivability.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from a video game where a character stands on a rocky ledge overlooking a group of kneeling enemies below. This setting is part of the Pagoda Realm in \"The New West,\" where players can find and defeat Captain Lotus-Vision, a challenging boss. The image illustrates the location described in the text, emphasizing the strategic drop-down point to initiate the battle against Captain Lotus-Vision."
}