{
    "chunk_id": 281377814923,
    "source_file": "Twin_Serpents_Staff.md",
    "h1_title": "Twin Serpents Staff",
    "h2_title": "Black Myth: Wukong Twin Serpents Staff Location",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/8/82/Wukong_Bamboo_42.jpg",
    "alt_text": "Wukong Bamboo 42.jpg",
    "position_desc": 1,
    "img_above_text": "# Twin Serpents Staff\nThe Twin Serpents Staff is an Uncommon weapon in Black Myth: Wukong. It comes with slightly improved stats compared to the Willow Wood Staff you are given at the beginning of the game. This will likely be your weapon of choice for most of the early game before you switch out to one of the other Weapons in Chapter 2 and beyond.\nThe weapon has a 40 damage stat, with no bonus critical hit chance. One perk of it over other weapons, however, is its unique effect. With the Twin Serpents Staff equipped, your light attack damage combo finishers have increased damage (by a moderate amount). When you are fighting in water, this effect is enhanced even more, making it a great weapon for the first chapter.\n## Black Myth: Wukong Twin Serpents Staff Location\nThe Twin Serpents Staff can be found in Chapter 1 - Black Wind Mountain upon defeating Whiteclad Noble in Bamboo Grove. This is a mandatory boss, so you can't miss him.",
    "img_below_text": "Weapons can be crafted throughout the game from the Shrines throughout the game's six chapters. Crafting weapons will require Will and various Crafting Materials from the game's locales and enemies. To craft the Twin Serpents Staff you will need:\n\n* 1 Jade Fang\n* 8 Stone Spirit\n* 2,700 Will\n\nFor even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Armor and Gear locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Twin Serpents Staff\n            - Section Title: Black Myth: Wukong Twin Serpents Staff Location\n\n            Context:\n            - Preceding Text: \"# Twin Serpents Staff\nThe Twin Serpents Staff is an Uncommon weapon in Black Myth: Wukong. It comes with slightly improved stats compared to the Willow Wood Staff you are given at the beginning of the game. This will likely be your weapon of choice for most of the early game before you switch out to one of the other Weapons in Chapter 2 and beyond.\nThe weapon has a 40 damage stat, with no bonus critical hit chance. One perk of it over other weapons, however, is its unique effect. With the Twin Serpents Staff equipped, your light attack damage combo finishers have increased damage (by a moderate amount). When you are fighting in water, this effect is enhanced even more, making it a great weapon for the first chapter.\n## Black Myth: Wukong Twin Serpents Staff Location\nThe Twin Serpents Staff can be found in Chapter 1 - Black Wind Mountain upon defeating Whiteclad Noble in Bamboo Grove. This is a mandatory boss, so you can't miss him.\"\n            - Following Text: \"Weapons can be crafted throughout the game from the Shrines throughout the game's six chapters. Crafting weapons will require Will and various Crafting Materials from the game's locales and enemies. To craft the Twin Serpents Staff you will need:\n\n* 1 Jade Fang\n* 8 Stone Spirit\n* 2,700 Will\n\nFor even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Armor and Gear locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the game \"Black Myth: Wukong\" where the player is engaged in a battle with a boss named Whiteclad Noble. This fight takes place in a water environment, which aligns with the context that the Twin Serpents Staff, an uncommon weapon in the game, has enhanced effects in water. The image serves to illustrate the location and the combat scenario where players can obtain the Twin Serpents Staff by defeating this mandatory boss in Chapter 1 - Black Wind Mountain."
}