{
    "chunk_id": 889280401478,
    "source_file": "Earth_Wolf.md",
    "h1_title": "Earth Wolf",
    "h2_title": "Earth Wolf Miniboss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/ac/Wukong_Sandgate_42.jpg",
    "alt_text": "Wukong Sandgate 42.jpg",
    "position_desc": 7,
    "img_above_text": "# Earth Wolf\nThe Earth Wolf is an optional Yaoguai Chief miniboss that you can encounter in Chapter 2 of Black Myth Wukong. As an optional foe, you can seek out this enemy to gain their Spirit power by defeating them inside the Sandgate Village.\n* Rewards: Earth Wolf Spirit\n## Earth Wolf Miniboss Fight and Guide\nThis strange looking yaoguai has a lot of rushing attacks that are hard to get a sense of due to its attack patterns, and you’ll want to utilize your Immobilize spell for help interrupting these when possible.\n\nThough it can often rise up on its hind legs to slash at you with its front claws, certain times its wild swings will make it crash forward to land belly up. After a moment it will thrash around and try to damage you if close, but with an exposed unarmored part of its body, you can try freezing it in place and expending a charged attack - preferably with the Smash or Pillar Style to slam down on its ribs for extra damage.\n\nYou can also get an opportune strike after dodging its grab by using that moment to hit it hard with a Spirit attack from the Wandering Wight, and big enough hits can cause it to fall on its belly as well.",
    "img_below_text": "With enough damage dealt, the Earth Wolf will fall, revealing its Spirit to be claimed by you. You can look around the arena to harvest some Jade Lotus in the pond, or check the back of the houses to find other materials like Aged Ginseng.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Earth Wolf\n            - Section Title: Earth Wolf Miniboss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Earth Wolf\nThe Earth Wolf is an optional Yaoguai Chief miniboss that you can encounter in Chapter 2 of Black Myth Wukong. As an optional foe, you can seek out this enemy to gain their Spirit power by defeating them inside the Sandgate Village.\n* Rewards: Earth Wolf Spirit\n## Earth Wolf Miniboss Fight and Guide\nThis strange looking yaoguai has a lot of rushing attacks that are hard to get a sense of due to its attack patterns, and you’ll want to utilize your Immobilize spell for help interrupting these when possible.\n\nThough it can often rise up on its hind legs to slash at you with its front claws, certain times its wild swings will make it crash forward to land belly up. After a moment it will thrash around and try to damage you if close, but with an exposed unarmored part of its body, you can try freezing it in place and expending a charged attack - preferably with the Smash or Pillar Style to slam down on its ribs for extra damage.\n\nYou can also get an opportune strike after dodging its grab by using that moment to hit it hard with a Spirit attack from the Wandering Wight, and big enough hits can cause it to fall on its belly as well.\"\n            - Following Text: \"With enough damage dealt, the Earth Wolf will fall, revealing its Spirit to be claimed by you. You can look around the arena to harvest some Jade Lotus in the pond, or check the back of the houses to find other materials like Aged Ginseng.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the game \"Black Myth Wukong,\" specifically during the Earth Wolf miniboss fight in Chapter 2. The player character is seen attacking the Earth Wolf, which is lying on the ground. The health bar of the Earth Wolf is visible, indicating the ongoing battle. The text at the bottom of the image suggests a dialogue or plea from the Earth Wolf. The context provided in the preceding and following text offers a guide on how to defeat the Earth Wolf, including strategies like using the Immobilize spell and targeting its unarmored belly for extra damage."
}