{
    "chunk_id": 845774107884,
    "source_file": "Green-Capped_Martialist.md",
    "h1_title": "Green-Capped Martialist",
    "h2_title": "Green-Capped Martialist Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/23/Wukong_Martial_11.jpg",
    "alt_text": "Wukong Martial 11.jpg",
    "position_desc": 16,
    "img_above_text": "# Green-Capped Martialist\nThe Green-Capped Martialist is an optional and secret Character Boss fight that you can encounter in Chapter 3 of Black Myth Wukong. This boss can only be fought by undertaking a Treasure Hunter's Quest that begins along the Bitter Lake and leads to the Valley of Ecstasy, where you'll have to uncover a secret Melon Field.\n* Rewards: Spell-Binder Spell, Cold Iron Leaves, Random Materials, 1847 Experience, 1190 Will\n## Green-Capped Martialist Boss Fight and Guide\nThe strange Green-Capped Martialist is a strong fighter who wields a fiery chakram that he can use in a variety of ways to surprise you with. It's not a bad idea to make sure you have some medicine on hand to cure burns, as you may find yourself in danger of taking fire damage often against this foes. Due to his prowess, you should also take other medicine to boost your damage and defenses, as he can be a relentless foes.\n\nOnce he's below half health, he may start to launch two flaming chakram wheels around the arena instead of one. It may seem impossible, but the key to surviving this phase is to always keep the two chakrams in view as much as possible. They will almost always alternate charging at you, so as long as you keep track of their positions, you can keep dodging them as they charge you.",
    "img_below_text": "The Martialist will often end this phase by trying to ambush you out of nowhere, slicing both weapons to create a half-ring of fire in front of him. Dodge around to the side of the fire he creates so you can flank him without getting burned.\n\nSince he's such a cagey foe, getting a lock on him will be the hardest part of the fight, so you'll want to rely on slowing him down by deflecting his ambushes, or Immobilizing him before he can flee and expend your focus points for big hits. Don't bet on slow attacks or Spirits that take too long, or he'll run away before the hits can land.\n\nOnce you've finally caught onto his tricks and taken him down, he'll flee the scene, declaring that he's \"done as our brother asked\".\n\nYou'll then find the mischievous little monk, as the entire field becomes verdant and full of melons. In lieu of eating some melons yourself, the monk will offer to share a very important power with you: the Spell-Binder Spell. This will actually lock down all of your spells, transferring an enormous amount of physical power to you instead, which can be incredibly useful when going up against bosses you'll meet later that can counter your spells.\n\nThe little monk will even give you a hint about its use, and allude to someone waiting for you in the Grand Pagoda of the Pagoda Realm (which you can't fully access until you complete the other chapters).",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Green-Capped Martialist\n            - Section Title: Green-Capped Martialist Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Green-Capped Martialist\nThe Green-Capped Martialist is an optional and secret Character Boss fight that you can encounter in Chapter 3 of Black Myth Wukong. This boss can only be fought by undertaking a Treasure Hunter's Quest that begins along the Bitter Lake and leads to the Valley of Ecstasy, where you'll have to uncover a secret Melon Field.\n* Rewards: Spell-Binder Spell, Cold Iron Leaves, Random Materials, 1847 Experience, 1190 Will\n## Green-Capped Martialist Boss Fight and Guide\nThe strange Green-Capped Martialist is a strong fighter who wields a fiery chakram that he can use in a variety of ways to surprise you with. It's not a bad idea to make sure you have some medicine on hand to cure burns, as you may find yourself in danger of taking fire damage often against this foes. Due to his prowess, you should also take other medicine to boost your damage and defenses, as he can be a relentless foes.\n\nOnce he's below half health, he may start to launch two flaming chakram wheels around the arena instead of one. It may seem impossible, but the key to surviving this phase is to always keep the two chakrams in view as much as possible. They will almost always alternate charging at you, so as long as you keep track of their positions, you can keep dodging them as they charge you.\"\n            - Following Text: \"The Martialist will often end this phase by trying to ambush you out of nowhere, slicing both weapons to create a half-ring of fire in front of him. Dodge around to the side of the fire he creates so you can flank him without getting burned.\n\nSince he's such a cagey foe, getting a lock on him will be the hardest part of the fight, so you'll want to rely on slowing him down by deflecting his ambushes, or Immobilizing him before he can flee and expend your focus points for big hits. Don't bet on slow attacks or Spirits that take too long, or he'll run away before the hits can land.\n\nOnce you've finally caught onto his tricks and taken him down, he'll flee the scene, declaring that he's \"done as our brother asked\".\n\nYou'll then find the mischievous little monk, as the entire field becomes verdant and full of melons. In lieu of eating some melons yourself, the monk will offer to share a very important power with you: the Spell-Binder Spell. This will actually lock down all of your spells, transferring an enormous amount of physical power to you instead, which can be incredibly useful when going up against bosses you'll meet later that can counter your spells.\n\nThe little monk will even give you a hint about its use, and allude to someone waiting for you in the Grand Pagoda of the Pagoda Realm (which you can't fully access until you complete the other chapters).\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the boss fight against the Green-Capped Martialist in the game Black Myth Wukong. The Green-Capped Martialist is shown wielding fiery chakrams and creating a ring of fire, which aligns with the guide's description of his combat tactics. The player is advised to dodge around the fire and keep track of the chakrams to avoid damage. The fight is challenging due to the Martialist's agility and fire attacks, and the player must use strategies to slow him down and land significant hits. The metadata and context indicate that this is part of a detailed guide on how to defeat this secret boss."
}