{
    "chunk_id": 675420664691,
    "source_file": "Fine_China_Tea_Bowl.md",
    "h1_title": "Fine China Tea Bowl",
    "h2_title": "Black Myth: Wukong Fine China Tea Bowl Location",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1d/Fine_China_Tea_Bowl_1.jpg",
    "alt_text": "Fine China Tea Bowl 1.jpg",
    "position_desc": 1,
    "img_above_text": "# Fine China Tea Bowl\nThe Fine China Tea Bowl is one of the Curios items found in Chapter 3 of Black Myth: Wukong. While found along the main progression path, the Curios is actually rather easy to miss as it is in the confusing and stressful Pagoda Realm area.\nWith the Fine China Tea Bowl equipped, your stamina recovery rate will moderately increase, making it easily one of the best Curios items in the game.\n## Black Myth: Wukong Fine China Tea Bowl Location\nAs mentioned, finding this Curios item isn't the easiest. The Fine China Tea Bowl is in a box by a statue and a blade-wielding enemy in the Pagoda Realm along the lowest level. From the Lower Pagoda Shrine in The New West continue along to the end of the path, ignoring the stairs up a level.\nAt the end of this lowest level, just ahead of the stairs, you can find the statue and box with the Curios item in it.\n\nCurios in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, you will want to switch to other Curios items to better fit your build as you play. This can be done at any point from the Equipment menu.",
    "img_below_text": "For even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Fine China Tea Bowl\n            - Section Title: Black Myth: Wukong Fine China Tea Bowl Location\n\n            Context:\n            - Preceding Text: \"# Fine China Tea Bowl\nThe Fine China Tea Bowl is one of the Curios items found in Chapter 3 of Black Myth: Wukong. While found along the main progression path, the Curios is actually rather easy to miss as it is in the confusing and stressful Pagoda Realm area.\nWith the Fine China Tea Bowl equipped, your stamina recovery rate will moderately increase, making it easily one of the best Curios items in the game.\n## Black Myth: Wukong Fine China Tea Bowl Location\nAs mentioned, finding this Curios item isn't the easiest. The Fine China Tea Bowl is in a box by a statue and a blade-wielding enemy in the Pagoda Realm along the lowest level. From the Lower Pagoda Shrine in The New West continue along to the end of the path, ignoring the stairs up a level.\nAt the end of this lowest level, just ahead of the stairs, you can find the statue and box with the Curios item in it.\n\nCurios in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, you will want to switch to other Curios items to better fit your build as you play. This can be done at any point from the Equipment menu.\"\n            - Following Text: \"For even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the game \"Black Myth: Wukong,\" specifically showing the location of the Fine China Tea Bowl Curios item. The player character is standing in a dimly lit, rocky area, with a red dashed circle highlighting the box containing the Curios item near a statue. This location is described as being on the lowest level of the Pagoda Realm, near the Lower Pagoda Shrine in The New West. The Fine China Tea Bowl, when equipped, enhances stamina recovery, making it a valuable item for players."
}