{
    "chunk_id": 938614663196,
    "source_file": "Boshan_Censer.md",
    "h1_title": "Boshan Censer",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5a/Boshan_Censer_2.jpg",
    "alt_text": "Boshan Censer 2.jpg",
    "position_desc": 0,
    "img_above_text": "# Boshan Censer\nThe Boshan Censer is a rare Curios item you can find in Black Myth: Wukong. While it has a specific use, the Boshan Censer's buff is rather strong, making it quite useful for those who like to play aggressive when they are out of healing.\nWith the Boshan Censer equipped, it grants considerable damage reduction when Gourd use is depleted. So, if you are someone who hasn't upgraded their Gourd or is running a Gourd with a low amount of uses, this can be incredibly powerful, granting you enhanced survivability for an extended period. Dodge masters and those using Cloud Step and Rock Solid can really benefit from this Curios item.",
    "img_below_text": "Curios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or boost the effect of them. Therefore, you will want to switch to other Curios items to better fit your build as you play if needed. This can be done easily from the game's Equipment menu.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Boshan Censer\n\n            Context:\n            - Preceding Text: \"# Boshan Censer\nThe Boshan Censer is a rare Curios item you can find in Black Myth: Wukong. While it has a specific use, the Boshan Censer's buff is rather strong, making it quite useful for those who like to play aggressive when they are out of healing.\nWith the Boshan Censer equipped, it grants considerable damage reduction when Gourd use is depleted. So, if you are someone who hasn't upgraded their Gourd or is running a Gourd with a low amount of uses, this can be incredibly powerful, granting you enhanced survivability for an extended period. Dodge masters and those using Cloud Step and Rock Solid can really benefit from this Curios item.\"\n            - Following Text: \"Curios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or boost the effect of them. Therefore, you will want to switch to other Curios items to better fit your build as you play if needed. This can be done easily from the game's Equipment menu.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the Equipment menu from the game \"Black Myth: Wukong,\" specifically highlighting the \"Boshan Censer,\" a rare Curios item. The Boshan Censer provides significant damage reduction when the player's Gourd use is depleted, enhancing survivability for aggressive players or those with limited healing resources. The menu also shows other Curios items and their effects, emphasizing the strategic choice of equipment to complement different playstyles."
}