{
    "chunk_id": 195676569104,
    "source_file": "Goji_Shoots.md",
    "h1_title": "Goji Shoots",
    "h2_title": "Black Myth: Wukong Goji Shoots Location",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/9c/Wukong_UpperHollow_6.jpg",
    "alt_text": "Wukong UpperHollow 6.jpg",
    "position_desc": 0,
    "img_above_text": "# Goji Shoots\nThe Goji Shoots is one of the Epic Soaks for your Gourds in Black Myth: Wukong.\nWith the Goji Shoots Soak equipped, each use of the Gourd moderately extends the duration of the next Ring of Fire for a short duration\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor.\n## Black Myth: Wukong Goji Shoots Location\nThe Goji Shoots can be found in the Upper Hollow area of The Webbed Hollow. From the Shrine, turn around and head up the stairs along the hillside. Continue all the way to the top. At the top you can find a hut with the Soak inside.",
    "img_below_text": "Soaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Goji Shoots\n            - Section Title: Black Myth: Wukong Goji Shoots Location\n\n            Context:\n            - Preceding Text: \"# Goji Shoots\nThe Goji Shoots is one of the Epic Soaks for your Gourds in Black Myth: Wukong.\nWith the Goji Shoots Soak equipped, each use of the Gourd moderately extends the duration of the next Ring of Fire for a short duration\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor.\n## Black Myth: Wukong Goji Shoots Location\nThe Goji Shoots can be found in the Upper Hollow area of The Webbed Hollow. From the Shrine, turn around and head up the stairs along the hillside. Continue all the way to the top. At the top you can find a hut with the Soak inside.\"\n            - Following Text: \"Soaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the game \"Black Myth: Wukong,\" specifically showing the location of the Goji Shoots Soak. The character is standing in front of a hut in the Upper Hollow area of The Webbed Hollow, where the Goji Shoots can be found. The Goji Shoots is an Epic Soak that extends the duration of the Ring of Fire when used with the Gourd. This item is static and cannot be upgraded. The image serves to visually guide players to the exact location of the Goji Shoots within the game."
}