{
    "chunk_id": 207926603338,
    "source_file": "Gold_Armored_Rhino.md",
    "h1_title": "Gold Armored Rhino",
    "h2_title": "How to Find Gold Armored Rhino",
    "h3_title": "Gold Armored Rhino Boss Fight and Guide",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/11/Foothills_Walkthrough_%2847%29.png",
    "alt_text": "Foothills Walkthrough \\(47\\).png",
    "position_desc": 7,
    "img_above_text": "# Gold Armored Rhino\nGold Armored Rhino is one of the main Yaoguai Chiefs you'll need to find in Chapter 6 of Black Myth: Wukong. You can find it at the Rhino Watch Slope, which the Feng-Tail General will conveniently take you to.\n## How to Find Gold Armored Rhino\n### Gold Armored Rhino Boss Fight and Guide\n\nBeyond this, expect attacks where it will charge at you. There are rocks you can use in the arena to hide behind for a little while. However, once these are destroyed, you'll need to dodge out of the way. When it's close to you, it will also try to swipe at you by pulling its head back, then swinging it to the side to catch you with its horn. These are great moves to dodge and build up focus if you've unlocked the ability to do so in the skills tab.",
    "img_below_text": "Lastly, you can expect a few projectile attacks from the Rhino as well. When it puts its horn down to the ground and drags along it, it will flick rocks up at you. Usually, these are five rocks at a time and you can move out of the way of them easily if you're not too close to the Rhino.\n\nThe fight is very much a rinse-and-repeat situation, where you'll just want to try and hit the horn as much as you can to try and break it.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Gold Armored Rhino\n            - Section Title: How to Find Gold Armored Rhino\n            - Sub-Section Title: Gold Armored Rhino Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Gold Armored Rhino\nGold Armored Rhino is one of the main Yaoguai Chiefs you'll need to find in Chapter 6 of Black Myth: Wukong. You can find it at the Rhino Watch Slope, which the Feng-Tail General will conveniently take you to.\n## How to Find Gold Armored Rhino\n### Gold Armored Rhino Boss Fight and Guide\n\nBeyond this, expect attacks where it will charge at you. There are rocks you can use in the arena to hide behind for a little while. However, once these are destroyed, you'll need to dodge out of the way. When it's close to you, it will also try to swipe at you by pulling its head back, then swinging it to the side to catch you with its horn. These are great moves to dodge and build up focus if you've unlocked the ability to do so in the skills tab.\"\n            - Following Text: \"Lastly, you can expect a few projectile attacks from the Rhino as well. When it puts its horn down to the ground and drags along it, it will flick rocks up at you. Usually, these are five rocks at a time and you can move out of the way of them easily if you're not too close to the Rhino.\n\nThe fight is very much a rinse-and-repeat situation, where you'll just want to try and hit the horn as much as you can to try and break it.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a dramatic moment in the boss fight against the Gold Armored Rhino in the game \"Black Myth: Wukong.\" The Rhino is seen charging and flicking rocks at the player, a move described in the guide. The scene is set in an arena with fiery explosions and debris, emphasizing the chaotic nature of the battle. The player character is poised to dodge or counter the Rhino's attacks, highlighting the need for strategic movement and focus during the fight."
}