{
    "chunk_id": 431069186997,
    "source_file": "Snow_Fox_Brush.md",
    "h1_title": "Snow Fox Brush",
    "h2_title": "Black Myth: Wukong Snow Fox Brush Location",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/c/ca/Wukong_Thunderclap_68.jpg",
    "alt_text": "Wukong Thunderclap 68.jpg",
    "position_desc": 2,
    "img_above_text": "# Snow Fox Brush\nThe Snow Fox Brush is one of the many Curios items you can find in Black Myth: Wukong. Like the rest of these items, once found, it can be equipped from the Equipment menu.\nWith the Snow Fox Brush equipped the duration of your Transformation Spells is moderately increased.\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, the item will stay at its current power throughout the game. If you want a better buff or something else to fit your build, you will need to switch it out.\n## Black Myth: Wukong Snow Fox Brush Location\nTo get the Snow Fox Brush, you need to complete the Snow Fox questline in The New West. Then in the Forest of Felicity in the Valley of Ecstasy in The New West, you need to obtain the fox form from the body near to the Shrine.\n\nApproach as the fox form and defeat him. Once defeated, grab his spirit and then return to the Forest of Felicity in the Valley of Ecstasy. Interact with the fox that is now here to get the Curios item.",
    "img_below_text": "For even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Snow Fox Brush\n            - Section Title: Black Myth: Wukong Snow Fox Brush Location\n\n            Context:\n            - Preceding Text: \"# Snow Fox Brush\nThe Snow Fox Brush is one of the many Curios items you can find in Black Myth: Wukong. Like the rest of these items, once found, it can be equipped from the Equipment menu.\nWith the Snow Fox Brush equipped the duration of your Transformation Spells is moderately increased.\nCurios items in Black Myth: Wukong can't be upgraded, so you can't increase their power or potency. Therefore, the item will stay at its current power throughout the game. If you want a better buff or something else to fit your build, you will need to switch it out.\n## Black Myth: Wukong Snow Fox Brush Location\nTo get the Snow Fox Brush, you need to complete the Snow Fox questline in The New West. Then in the Forest of Felicity in the Valley of Ecstasy in The New West, you need to obtain the fox form from the body near to the Shrine.\n\nApproach as the fox form and defeat him. Once defeated, grab his spirit and then return to the Forest of Felicity in the Valley of Ecstasy. Interact with the fox that is now here to get the Curios item.\"\n            - Following Text: \"For even more guides and tips on finding all the items, be sure to check out our other guides. These include a breakdown of the Drinks locations, Soaks locations, where to find new Weapons, and all the Armor and Gear sets in the game.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the game \"Black Myth: Wukong,\" specifically showing the location where the player can obtain the Snow Fox Brush, a Curios item. The setting is a snowy, forested area with a wooden structure, where a character is seen standing over a defeated enemy. The Snow Fox Brush, which increases the duration of Transformation Spells, is highlighted on the screen. This image serves to visually guide players on where to find this item in the game."
}