{
    "chunk_id": 779855132654,
    "source_file": "Forest_of_Wolves_Walkthrough.md",
    "h1_title": "The Forest of Wolves",
    "h2_title": "Front Hills",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/92/Wukong_Wolves_12.jpg",
    "alt_text": "Wukong Wolves 12.jpg",
    "position_desc": 19,
    "img_above_text": "# The Forest of Wolves\nWhile he may not be Sun Wukong, the Destined One is not above a bit of trickery and foolishness — as evidenced by luring some lesser Wolf Guais into trying to take a bite out of him disguised as a peach.\n## Front Hills\n\nThese are essentially Skill Points, which you can begin investing in a large number of different Skill Trees. These can include general skills, or ones that relate to specific combat stances. Your Smash stance has already been unlocked, but you can also unlock two other stances that have unique heavy attacks by investing skill points in them.\n\nWhen the path leads down, you’ll be able to head right to proceed to a mini-boss, or go left along the stream leading back to the bridge you crossed earlier.",
    "img_below_text": "",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: The Forest of Wolves\n            - Section Title: Front Hills\n\n            Context:\n            - Preceding Text: \"# The Forest of Wolves\nWhile he may not be Sun Wukong, the Destined One is not above a bit of trickery and foolishness — as evidenced by luring some lesser Wolf Guais into trying to take a bite out of him disguised as a peach.\n## Front Hills\n\nThese are essentially Skill Points, which you can begin investing in a large number of different Skill Trees. These can include general skills, or ones that relate to specific combat stances. Your Smash stance has already been unlocked, but you can also unlock two other stances that have unique heavy attacks by investing skill points in them.\n\nWhen the path leads down, you’ll be able to head right to proceed to a mini-boss, or go left along the stream leading back to the bridge you crossed earlier.\"\n            - Following Text: \"\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a character in a lush, forested area, possibly from a video game or fantasy setting. The character is holding a staff and appears to be interacting with the environment, specifically a flowering plant. The forest is dense with greenery, rocks, and trees, creating a serene yet mysterious atmosphere. The image includes UI elements such as health or skill bars and icons, indicating gameplay mechanics.\n\nBased on the preceding text, the image is likely illustrating a scene from \"The Forest of Wolves,\" specifically the \"Front Hills\" section. This area involves skill point investment in various combat stances, including the \"Smash\" stance. The character may be exploring the environment, preparing for combat, or engaging with elements that contribute to skill development. The narrative suggests the character is on a path leading to a mini-boss encounter or a return to a previously crossed bridge."
}