{
    "chunk_id": 848597299385,
    "source_file": "Black_Loong.md",
    "h1_title": "Black Loong",
    "h2_title": "Black Loong Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/2/26/Wukong_BlackLoong_15.jpg",
    "alt_text": "Wukong BlackLoong 15.jpg",
    "position_desc": 19,
    "img_above_text": "# Black Loong\nBlack Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Hidden beyond a waterfall of sand in the Fright Cliff, you won't be able to encounter this boss until you obtain a Key Item elswhere in this chapter, Black Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n* **Rewards:** Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n## Black Loong Boss Fight and Guide\n\nLearning the electric ring dance is arguably the hardest part of this fight, as is evading his sandstorm if you can’t dissipate it. Immobilize can help you get some breathing room, but it’s harder to stagger him out of attacks, and even Rock Solid deflections aren’t guaranteed to stop his assaults. However, the Azure Dust Transformation can reliably keep him stumbling with many of its attacks, and sometimes even knock him out of his attempts to create rings of electricity altogether! You can also try using the Pluck of Many to disorient him with attacks on all sides, and use that time wisely to charge up your strikes when he’s distracted.",
    "img_below_text": "When the Black Loong falls, you’ll earn plenty of rewards, including a Loong Pearl, Mind Core, 2 Refined Iron Sand, 1576 Will, and 2770 Experience. In addition to this, you can find a gold chest nearby that contains a Tridacna Pendant curio, and a Thunderbone weapon material — one of two Loong materials needed to craft the Loongwreathe Staff!",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Black Loong\n            - Section Title: Black Loong Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Black Loong\nBlack Loong is an optional secret Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Hidden beyond a waterfall of sand in the Fright Cliff, you won't be able to encounter this boss until you obtain a Key Item elswhere in this chapter, Black Loong is one of four Loong Dragons that can be defeated to earn powerful weapon crafting materials.\n* **Rewards:** Tridacna Pendant, Thunderbone, Loong Pearl x1, Refined Iron Sand x2, Mind Core x1\n## Black Loong Boss Fight and Guide\n\nLearning the electric ring dance is arguably the hardest part of this fight, as is evading his sandstorm if you can’t dissipate it. Immobilize can help you get some breathing room, but it’s harder to stagger him out of attacks, and even Rock Solid deflections aren’t guaranteed to stop his assaults. However, the Azure Dust Transformation can reliably keep him stumbling with many of its attacks, and sometimes even knock him out of his attempts to create rings of electricity altogether! You can also try using the Pluck of Many to disorient him with attacks on all sides, and use that time wisely to charge up your strikes when he’s distracted.\"\n            - Following Text: \"When the Black Loong falls, you’ll earn plenty of rewards, including a Loong Pearl, Mind Core, 2 Refined Iron Sand, 1576 Will, and 2770 Experience. In addition to this, you can find a gold chest nearby that contains a Tridacna Pendant curio, and a Thunderbone weapon material — one of two Loong materials needed to craft the Loongwreathe Staff!\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the game \"Black Myth Wukong,\" specifically related to the Black Loong boss fight. It shows a character approaching a gold chest located in a sandy, ancient-looking environment with large tree roots and carved stone structures. This chest is likely the one mentioned in the guide, containing valuable rewards such as the Tridacna Pendant and Thunderbone, which are obtained after defeating the Black Loong boss. The image serves to illustrate the moment of discovery and reward collection following the challenging boss encounter described in the guide."
}