{
    "chunk_id": 912618542654,
    "source_file": "Daoist_Mi.md",
    "h1_title": "Daoist Mi",
    "h2_title": "Daoist Mi Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/5e/Wukong_PurpleCloud_52.jpg",
    "alt_text": "Wukong PurpleCloud 52.jpg",
    "position_desc": 9,
    "img_above_text": "# Daoist Mi\nThe Daoist Mi is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the secret area of the Purple Cloud Mountain, the Daoist Mi will have a quest for you before you can face him in battle.\n* Rewards: Violet Hail Transformation Spell, Refined Iron Sand, 1562 Experience, 1451 Will\n## Daoist Mi Boss Fight and Guide\nThe Daoist Mi is a stronger version of the Sword Daoists you've encountered all over the Temple of Yellow Flowers. Despite being stronger, he's still kind of a pushover, as he doesn't boast much more than your average enemy, even with two distinct phases.\n\nThe one big new move that Daoist Mi can use in this form is spewing a lot more poison across the arena. In particular, if they arch backwards for a long moment before getting up, they'll run towards you while spewing poison in every possible direction. Knowing this in advance, simply keep your distance or prepare a charged thrust attack to repel them.",
    "img_below_text": "With Antimiasma powder on hand, the Daoist Mi won't last long against your superior skills. When you finally defeat him, the snake woman will appear and take the egg back from the fallen Daoist, before giving it to you, in the hopes you can make true use of its power. You'll gain the **Violet Hail Transformation Spell** , allowing you to temporarily turn into a Worm Practitioner yourself and become immune to poison!",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Daoist Mi\n            - Section Title: Daoist Mi Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Daoist Mi\nThe Daoist Mi is an optional Yaoguai Chief boss fight that you can find during Chapter 4 of Black Myth Wukong. Located in the secret area of the Purple Cloud Mountain, the Daoist Mi will have a quest for you before you can face him in battle.\n* Rewards: Violet Hail Transformation Spell, Refined Iron Sand, 1562 Experience, 1451 Will\n## Daoist Mi Boss Fight and Guide\nThe Daoist Mi is a stronger version of the Sword Daoists you've encountered all over the Temple of Yellow Flowers. Despite being stronger, he's still kind of a pushover, as he doesn't boast much more than your average enemy, even with two distinct phases.\n\nThe one big new move that Daoist Mi can use in this form is spewing a lot more poison across the arena. In particular, if they arch backwards for a long moment before getting up, they'll run towards you while spewing poison in every possible direction. Knowing this in advance, simply keep your distance or prepare a charged thrust attack to repel them.\"\n            - Following Text: \"With Antimiasma powder on hand, the Daoist Mi won't last long against your superior skills. When you finally defeat him, the snake woman will appear and take the egg back from the fallen Daoist, before giving it to you, in the hopes you can make true use of its power. You'll gain the **Violet Hail Transformation Spell** , allowing you to temporarily turn into a Worm Practitioner yourself and become immune to poison!\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the game \"Black Myth Wukong,\" specifically related to the Daoist Mi boss fight. In the context of the guide, this moment likely occurs after the player defeats Daoist Mi, as described in the text. The snake woman character appears to retrieve an egg from the fallen Daoist Mi, symbolizing a reward or significant plot development. The surrounding environment features rocky terrain and autumn foliage, enhancing the mystical atmosphere of the encounter."
}