{
    "chunk_id": 795026260282,
    "source_file": "Buddha%27s_Left_Hand.md",
    "h1_title": "Buddha's Left Hand",
    "h2_title": "",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1d/Wukong_LowerHollow_27.jpg",
    "alt_text": "Wukong LowerHollow 27.jpg",
    "position_desc": 0,
    "img_above_text": "# Buddha's Left Hand\nBuddha's Left Hand is one of the unique materials in Black Myth: Wukong. It is used for weapon and armor crafting to craft unique gear unlocked upon defeating a boss.\nThe Buddha's Left Hand can be used to craft a Gourd upgrade at the Shen Monkey Vendor in the Zodiac Village.\nTo obtain the Buddha's Left Hand, you need to defeat Baw-Li-Guhh-Baw in the Lower Hollow in The Webbed Hollow.",
    "img_below_text": "For even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Weapons locations and Armor and Gear locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Buddha's Left Hand\n\n            Context:\n            - Preceding Text: \"# Buddha's Left Hand\nBuddha's Left Hand is one of the unique materials in Black Myth: Wukong. It is used for weapon and armor crafting to craft unique gear unlocked upon defeating a boss.\nThe Buddha's Left Hand can be used to craft a Gourd upgrade at the Shen Monkey Vendor in the Zodiac Village.\nTo obtain the Buddha's Left Hand, you need to defeat Baw-Li-Guhh-Baw in the Lower Hollow in The Webbed Hollow.\"\n            - Following Text: \"For even more guides and tips on finding all the items in the game, be sure to check out our guide on all the Black Myth: Wukong Weapons locations and Armor and Gear locations, as well as the Gourds, Curios, Vessels, and Transformation Spells locations. You can also find a library of all the Medicine Ingredients and Consumable Items in the game.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the video game Black Myth: Wukong, showing a player character engaged in combat with a large, blue-green boss named Baw-Li-Guhh-Baw in a cavernous environment adorned with numerous Buddha statues. This battle is significant as defeating Baw-Li-Guhh-Baw in the Lower Hollow of The Webbed Hollow grants the player the Buddha's Left Hand, a unique material used for crafting special gear and upgrading items at the Shen Monkey Vendor in the Zodiac Village."
}