{
    "chunk_id": 818645849558,
    "source_file": "Rusty-Gold_Cart.md",
    "h1_title": "Rusty-Gold Cart",
    "h2_title": "Rusty-Gold Cart Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/bd/Field_Fire_Walkthrough_%2830%29.png",
    "alt_text": "Field Fire Walkthrough \\(30\\).png",
    "position_desc": 2,
    "img_above_text": "# Rusty-Gold Cart\nRusty-Gold Cart is a Yaoguai Chief boss fight that you'll go up against toward the end of Chapter 5 in Black Myth: Wukong. This is the final of the Five Element Carts and will allow you to get into the Chapter's Secret Area - Bishui Cave.\n## Rusty-Gold Cart Boss Fight and Guide\n\nUse Immobilize when you can to stop it from zooming around and follow up with combo attacks quickly. Landing heavy attacks in this manner will knock the cart down, leaving it vulnerable to further follow-up attacks.",
    "img_below_text": "The way the cart plays with fire will also differ. It will spin around while spewing fire from the front to try and get you. When this happens, stick close to it and spin with it. If you get caught with this move, throw on the Fireproof Mantle to negate some of the fire damage. Another variation you'll see is it spitting fireballs. For this move, it will aim the fireballs and spit them out, and you can dash out of the way to miss them entirely.\n\nLastly is the difference in punches. The cart will lunge and take swipes at you but also punch the ground like the other carts. To make things trickier, it will also try to grab you.\n\nWhen it does go to take a swipe at you, try to roll toward it. You'll either end up going underneath it or to the side of it and dodging the attack.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Rusty-Gold Cart\n            - Section Title: Rusty-Gold Cart Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Rusty-Gold Cart\nRusty-Gold Cart is a Yaoguai Chief boss fight that you'll go up against toward the end of Chapter 5 in Black Myth: Wukong. This is the final of the Five Element Carts and will allow you to get into the Chapter's Secret Area - Bishui Cave.\n## Rusty-Gold Cart Boss Fight and Guide\n\nUse Immobilize when you can to stop it from zooming around and follow up with combo attacks quickly. Landing heavy attacks in this manner will knock the cart down, leaving it vulnerable to further follow-up attacks.\"\n            - Following Text: \"The way the cart plays with fire will also differ. It will spin around while spewing fire from the front to try and get you. When this happens, stick close to it and spin with it. If you get caught with this move, throw on the Fireproof Mantle to negate some of the fire damage. Another variation you'll see is it spitting fireballs. For this move, it will aim the fireballs and spit them out, and you can dash out of the way to miss them entirely.\n\nLastly is the difference in punches. The cart will lunge and take swipes at you but also punch the ground like the other carts. To make things trickier, it will also try to grab you.\n\nWhen it does go to take a swipe at you, try to roll toward it. You'll either end up going underneath it or to the side of it and dodging the attack.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts the Rusty-Gold Cart, a Yaoguai Chief boss in the game Black Myth: Wukong, situated in a rocky, cavernous environment. The cart is adorned with intricate designs and emits flames, indicating its fiery nature and aggressive capabilities. This visual representation aligns with the guide's advice on combating the cart, emphasizing the use of immobilization tactics and fire defense strategies during the boss fight in Chapter 5. The image serves to illustrate the cart's formidable presence and the environmental context of the battle."
}