{
    "chunk_id": 305920169518,
    "source_file": "Stone_Essence.md",
    "h1_title": "Stone Essence",
    "h2_title": "Where To Use The Stone Essence in Black Myth: Wukong",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/b/b2/Stone_Essence_3.jpg",
    "alt_text": "Stone Essence 3.jpg",
    "position_desc": 2,
    "img_above_text": "# Stone Essence\nThe Stone Essence is one of the more hidden Key Items in Black Myth: Wukong. It is dropped by a secret boss found in Fright Cliff and you will need it to help the Man-In-Stone within the same area.\n## Where To Use The Stone Essence in Black Myth: Wukong\nWith the Stone Essence in hand, you can give it to the Man-In-Stone, who is located along the central path between the two raised paths from the Fright Cliff - Squall Hideout Shrine.\n\nHowever, if you have it, you are probably wondering where you can use it.",
    "img_below_text": "Giving it to him will cause him to stand up and he will tell you to go away. However, you can now target him and kill him, which is what you should do to get the Azure Dust Transformation Spells. For a full guide on the boss, be sure to check our Mother of Stones boss guide and our walkthrough of Fright Cliff.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Stone Essence\n            - Section Title: Where To Use The Stone Essence in Black Myth: Wukong\n\n            Context:\n            - Preceding Text: \"# Stone Essence\nThe Stone Essence is one of the more hidden Key Items in Black Myth: Wukong. It is dropped by a secret boss found in Fright Cliff and you will need it to help the Man-In-Stone within the same area.\n## Where To Use The Stone Essence in Black Myth: Wukong\nWith the Stone Essence in hand, you can give it to the Man-In-Stone, who is located along the central path between the two raised paths from the Fright Cliff - Squall Hideout Shrine.\n\nHowever, if you have it, you are probably wondering where you can use it.\"\n            - Following Text: \"Giving it to him will cause him to stand up and he will tell you to go away. However, you can now target him and kill him, which is what you should do to get the Azure Dust Transformation Spells. For a full guide on the boss, be sure to check our Mother of Stones boss guide and our walkthrough of Fright Cliff.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the game Black Myth: Wukong, showing a character standing in a rocky, desolate area, with an arrow pointing towards a specific location. This location is likely where the player can find the Man-In-Stone, who is mentioned in the text as being along the central path between two raised paths from the Fright Cliff - Squall Hideout Shrine. The Stone Essence can be given to this character, triggering a sequence where he stands up and can be targeted and killed to obtain the Azure Dust Transformation Spells."
}