{
    "chunk_id": 161663634885,
    "source_file": "Sweet_Ice.md",
    "h1_title": "Sweet Ice",
    "h2_title": "Black Myth: Wukong Sweet Ice Location",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/78/Wukong_Thunderclap_28.jpg",
    "alt_text": "Wukong Thunderclap 28.jpg",
    "position_desc": 1,
    "img_above_text": "# Sweet Ice\nThe Sweet Ice Soak is an Uncommon Soak Soaks for your Gourds in Black Myth: Wukong. The Soak's ability is particularly useful within The New West.\nWith the Sweet Ice Soak equipped, using the gourd moderately increases Chill Resistance for a short duration.\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor.\n## Black Myth: Wukong Sweet Ice Location\nThe Sweet Ice Soak can be found in New Thunderclap Temple in The New West, specifically at the Temple Entrance Shrine. From the Shrine, follow the path to the middle-right and through the red building's opening to get to the main plaza.\nContinue onwards, sticking to the right, and head through another red building's opening. Go up the staircase, and take a right, and another right to see a building just in front of you.\n\nBehind this building, you can find the Soak within a gazebo.",
    "img_below_text": "Soaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Sweet Ice\n            - Section Title: Black Myth: Wukong Sweet Ice Location\n\n            Context:\n            - Preceding Text: \"# Sweet Ice\nThe Sweet Ice Soak is an Uncommon Soak Soaks for your Gourds in Black Myth: Wukong. The Soak's ability is particularly useful within The New West.\nWith the Sweet Ice Soak equipped, using the gourd moderately increases Chill Resistance for a short duration.\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor.\n## Black Myth: Wukong Sweet Ice Location\nThe Sweet Ice Soak can be found in New Thunderclap Temple in The New West, specifically at the Temple Entrance Shrine. From the Shrine, follow the path to the middle-right and through the red building's opening to get to the main plaza.\nContinue onwards, sticking to the right, and head through another red building's opening. Go up the staircase, and take a right, and another right to see a building just in front of you.\n\nBehind this building, you can find the Soak within a gazebo.\"\n            - Following Text: \"Soaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a snowy outdoor setting in *Black Myth: Wukong*, showing a player character near a gazebo-like structure with a red-circled item, likely the Sweet Ice Soak, as described in the preceding text. The character wields a flaming staff, and another figure is crouched nearby. The interface displays various game elements, including health, abilities, and an item description (\"Bronze Buddha Pendant\"). This image supports the guide's explanation of locating the Sweet Ice Soak in the New Thunderclap Temple area."
}