{
    "chunk_id": 843187562028,
    "source_file": "Endings_Explained.md",
    "h1_title": "Endings Explained",
    "h2_title": "Ending 2 - The (True) Secret Ending",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/7/72/Endings_Explained_%2815%29.png",
    "alt_text": "Endings Explained \\(15\\).png",
    "position_desc": 4,
    "img_above_text": "# Endings Explained\nBlack Myth: Wukong has two endings and you can experience both in one playthrough if you complete them in the right order. One is the ending that happens naturally at the end of the game but is considered the bad ending, while the other is a secret ending only achieved by finding and completing several hidden areas and a side quest. On this page, we'll detail what both of the endings mean for The Destined One.\n## Ending 2 - The (True) Secret Ending\nTo reveal the secret and true ending of the game, you'll need to travel to The Great Pagoda in Chapter 3 and unlock Mount Mei. You can find out more about how to unlock Mount Mei and the secret ending here.\nThis will see you face off against Erlang, The Sacred Divinity, The Four Heavenly Kings, and Erlang Shen. After winning the battle against them, you'll need to return to fight the Stone Monkey and The Great Sage's Broken Shell.\nYou'll see the exact same cutscene for this ending, where Wukong falls to his knees and loses the Six Senses from his body only for The Destined One to absorb them.\n\nThe difference with this ending, however, is that when the gold crown drops into the water, and The Old Monkey picks it up and places it on The Destined One's head, there will be a flash where The Destined One opens his eyes.",
    "img_below_text": "You'll then see an illustration of Wukong's life, starting with him fighting Erlang. As The Destined One is not shown inside the rock before the credits roll, it suggests that The Destined One was worthy all along and that the cycle begins anew.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Endings Explained\n            - Section Title: Ending 2 - The (True) Secret Ending\n\n            Context:\n            - Preceding Text: \"# Endings Explained\nBlack Myth: Wukong has two endings and you can experience both in one playthrough if you complete them in the right order. One is the ending that happens naturally at the end of the game but is considered the bad ending, while the other is a secret ending only achieved by finding and completing several hidden areas and a side quest. On this page, we'll detail what both of the endings mean for The Destined One.\n## Ending 2 - The (True) Secret Ending\nTo reveal the secret and true ending of the game, you'll need to travel to The Great Pagoda in Chapter 3 and unlock Mount Mei. You can find out more about how to unlock Mount Mei and the secret ending here.\nThis will see you face off against Erlang, The Sacred Divinity, The Four Heavenly Kings, and Erlang Shen. After winning the battle against them, you'll need to return to fight the Stone Monkey and The Great Sage's Broken Shell.\nYou'll see the exact same cutscene for this ending, where Wukong falls to his knees and loses the Six Senses from his body only for The Destined One to absorb them.\n\nThe difference with this ending, however, is that when the gold crown drops into the water, and The Old Monkey picks it up and places it on The Destined One's head, there will be a flash where The Destined One opens his eyes.\"\n            - Following Text: \"You'll then see an illustration of Wukong's life, starting with him fighting Erlang. As The Destined One is not shown inside the rock before the credits roll, it suggests that The Destined One was worthy all along and that the cycle begins anew.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts Wukong, a central character in the game \"Black Myth: Wukong,\" in a determined and powerful stance, likely during a significant moment in the narrative. This illustration is part of the explanation for the true secret ending of the game, where Wukong's journey and battles culminate in a transformative event. The image serves to visually represent Wukong's confrontation and the subsequent revelation that The Destined One was worthy, hinting at the cyclical nature of the story."
}