{
    "chunk_id": 832700241195,
    "source_file": "Tiger_Vanguard.md",
    "h1_title": "Tiger Vanguard",
    "h2_title": "Tiger Vanguard Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/5/59/Wukong_Tiger_21.jpg",
    "alt_text": "Wukong Tiger 21.jpg",
    "position_desc": 18,
    "img_above_text": "# Tiger Vanguard\nThe Tiger Vanguard is a required Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Located in the center of the Crouching Tiger Temple, this fearsome Tiger Guai is one of the hardest bosses to overcome in all of Chapter 2.\n* **Rewards:** Rock Solid Spell, Keeness of Tiger, Mind Core x1, Silk x3, 1652 Experience, 1362 Will\n## Tiger Vanguard Boss Fight and Guide\nCompared to the slow and measured slams of the Stone Vanguard, the Tiger Vanguard is a relentless beast of a foe. You’ll need to be well prepared to take him down, and make sure you have the best armor and weapons crafted. If you haven’t been using them much before, now is also an excellent time to invest in crafting consumable medicines. Items like the Evil Repelling Medicament to reduce incoming damage, and the Tiger Subduing Pellets to increase your own.\n\nWhen at last the Tiger Vanguard is finally beaten by your attacks, he’ll turn to stone and crumble away. The headless musician will reappear, and return Sun Wukong’s legendary stone form back to the Destined One, giving you the **Rock Solid Spell**! This is your one big defensive parry, taking the place of Cloud Step to completely negate and incoming attack when timed right, and will stagger the enemy to open them up for attack.",
    "img_below_text": "Defeating the Tiger Vanguard will award you a Mind Core, and the Keeness of Tiger, the second Key Item needed along with the Sterness of Stone to finally open the big stone doors in this chapter that lead to the final boss. In fact, there’s one of those tallies in this very arena that can open up a secret path!",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Tiger Vanguard\n            - Section Title: Tiger Vanguard Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Tiger Vanguard\nThe Tiger Vanguard is a required Yaoguai King boss fight that you can encounter in Chapter 2 of Black Myth Wukong. Located in the center of the Crouching Tiger Temple, this fearsome Tiger Guai is one of the hardest bosses to overcome in all of Chapter 2.\n* **Rewards:** Rock Solid Spell, Keeness of Tiger, Mind Core x1, Silk x3, 1652 Experience, 1362 Will\n## Tiger Vanguard Boss Fight and Guide\nCompared to the slow and measured slams of the Stone Vanguard, the Tiger Vanguard is a relentless beast of a foe. You’ll need to be well prepared to take him down, and make sure you have the best armor and weapons crafted. If you haven’t been using them much before, now is also an excellent time to invest in crafting consumable medicines. Items like the Evil Repelling Medicament to reduce incoming damage, and the Tiger Subduing Pellets to increase your own.\n\nWhen at last the Tiger Vanguard is finally beaten by your attacks, he’ll turn to stone and crumble away. The headless musician will reappear, and return Sun Wukong’s legendary stone form back to the Destined One, giving you the **Rock Solid Spell**! This is your one big defensive parry, taking the place of Cloud Step to completely negate and incoming attack when timed right, and will stagger the enemy to open them up for attack.\"\n            - Following Text: \"Defeating the Tiger Vanguard will award you a Mind Core, and the Keeness of Tiger, the second Key Item needed along with the Sterness of Stone to finally open the big stone doors in this chapter that lead to the final boss. In fact, there’s one of those tallies in this very arena that can open up a secret path!\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the game \"Black Myth Wukong,\" specifically during the Tiger Vanguard boss fight in Chapter 2. The player character is standing in front of a large stone structure, which appears to be part of the Crouching Tiger Temple. The character is prompted to \"Examine\" an object, likely related to the aftermath of defeating the Tiger Vanguard boss. The metadata indicates this is part of the \"Tiger Vanguard Boss Fight and Guide\" section, suggesting the image is intended to illustrate the setting or a key moment in the battle. The preceding and following text describe the rewards and significance of defeating the Tiger Vanguard, including obtaining items necessary to progress in the chapter."
}