{
    "chunk_id": 467480817492,
    "source_file": "Stranded_Loong%27s_Whisker.md",
    "h1_title": "Stranded Loong's Whisker",
    "h2_title": "Black Myth: Wukong Iron Pellet Location",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/1/1f/Wukong_Snowhill_33.jpg",
    "alt_text": "Wukong Snowhill 33.jpg",
    "position_desc": 0,
    "img_above_text": "# Stranded Loong's Whisker\nThe Stranded Loong's Whisker is one of the Epic Soaks for your Gourds in Black Myth: Wukong. The Soak's ability is powerful, and definitely one of the stronger ones in the game.\nWith the Soak equipped, using the gourd moderately extends the duration of the next Immobilize Spell for a short duration.\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor.\n## Black Myth: Wukong Iron Pellet Location\nThe Stranded Loong's Whisker can be obtained at the Mirrormere Shrine in The New West. Walk onto the lake, but stick to the right side. Continue all the way to the back right corner of the lake to find the Soak sitting in a container.",
    "img_below_text": "Soaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Stranded Loong's Whisker\n            - Section Title: Black Myth: Wukong Iron Pellet Location\n\n            Context:\n            - Preceding Text: \"# Stranded Loong's Whisker\nThe Stranded Loong's Whisker is one of the Epic Soaks for your Gourds in Black Myth: Wukong. The Soak's ability is powerful, and definitely one of the stronger ones in the game.\nWith the Soak equipped, using the gourd moderately extends the duration of the next Immobilize Spell for a short duration.\nSoaks can't be upgraded in the game, unlike the Drinks and the Gourd. This buff you get will stay as it is and can't be increased. Therefore, if you want to switch to a different Soak, head back to the Shen Monkey vendor.\n## Black Myth: Wukong Iron Pellet Location\nThe Stranded Loong's Whisker can be obtained at the Mirrormere Shrine in The New West. Walk onto the lake, but stick to the right side. Continue all the way to the back right corner of the lake to find the Soak sitting in a container.\"\n            - Following Text: \"Soaks are far more plentiful than the drinks for your gourds. They are scattered throughout the game, across each chapter. For even more guides on these areas, check out our full Black Myth: Wukong walkthrough. You can also keep track of the Awaken Wine Worm locations and Luoija Fragrant Vine locations, which are key to upgrading your healing potential and Gourd.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the game \"Black Myth: Wukong,\" showing a character running across a frozen lake towards a marked location. This area, identified as the Mirrormere Shrine in The New West, is where players can find the Stranded Loong's Whisker, an Epic Soak for their Gourds. The red-circled spot highlights the exact location of the Soak, which enhances the duration of the next Immobilize Spell when used."
}