{
    "chunk_id": 556254609092,
    "source_file": "Old_Rattle-Drum.md",
    "h1_title": "Old Rattle-Drum",
    "h2_title": "Where To Use The Old Rattle-Drum in Black Myth: Wukong",
    "h3_title": "Sandgate Village Old Rattle-Drum Location",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/9/91/Old_Rattle-Drum_Spot_3.jpg",
    "alt_text": "Old Rattle-Drum Spot 3.jpg",
    "position_desc": 4,
    "img_above_text": "# Old Rattle-Drum\nThe Old Rattle-Drum is one of the more well-hidden Key Items in Black Myth: Wukong. However, it is one of the more important optional ones, as it unlocks a secret area, a hidden boss, and one of the Gourds in the game.\n## Where To Use The Old Rattle-Drum in Black Myth: Wukong\nThe Old-Rattle Drum can be used in the following spots:\n* The area just before the Windrest Hamlet Shrine\n* In a small yard by some huts, through the gates at the Valley of Despair Shrine\n* At the far back of Sandgate Village, where you fought the Earth Wolf and saw the horse man tied to the post\n### Sandgate Village Old Rattle-Drum Location\nThe last location is in Sandgate Village. From the Village Entrance Shrine, head through the gate you opened when you fought Earth Wolf in the large courtyard. You will have also seen the horse man here tied to a post. To the left of that post, where he was tied, is a small path leading to a well.\nHere you can use the drum and summon the boy who will lead you down into the well.",
    "img_below_text": "Once down in the well, you will be able to fight the Mad Tiger. It is one of the tougher fights in the Yellow Wind Ridge and our guide has a ton of tips on how to defeat them. You can also read our full walkthrough for the chapter.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Old Rattle-Drum\n            - Section Title: Where To Use The Old Rattle-Drum in Black Myth: Wukong\n            - Sub-Section Title: Sandgate Village Old Rattle-Drum Location\n\n            Context:\n            - Preceding Text: \"# Old Rattle-Drum\nThe Old Rattle-Drum is one of the more well-hidden Key Items in Black Myth: Wukong. However, it is one of the more important optional ones, as it unlocks a secret area, a hidden boss, and one of the Gourds in the game.\n## Where To Use The Old Rattle-Drum in Black Myth: Wukong\nThe Old-Rattle Drum can be used in the following spots:\n* The area just before the Windrest Hamlet Shrine\n* In a small yard by some huts, through the gates at the Valley of Despair Shrine\n* At the far back of Sandgate Village, where you fought the Earth Wolf and saw the horse man tied to the post\n### Sandgate Village Old Rattle-Drum Location\nThe last location is in Sandgate Village. From the Village Entrance Shrine, head through the gate you opened when you fought Earth Wolf in the large courtyard. You will have also seen the horse man here tied to a post. To the left of that post, where he was tied, is a small path leading to a well.\nHere you can use the drum and summon the boy who will lead you down into the well.\"\n            - Following Text: \"Once down in the well, you will be able to fight the Mad Tiger. It is one of the tougher fights in the Yellow Wind Ridge and our guide has a ton of tips on how to defeat them. You can also read our full walkthrough for the chapter.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the game \"Black Myth: Wukong,\" specifically in the area of Sandgate Village. The character is standing in a grassy, rocky environment with a structure in the background. This location is significant as it is where players can use the Old Rattle-Drum to summon a boy who will lead them into a well, initiating a sequence that includes a fight with the Mad Tiger. The image aligns with the guide's instructions on finding and using the Old Rattle-Drum in Sandgate Village."
}