{
    "chunk_id": 527086772873,
    "source_file": "Violet_Spider.md",
    "h1_title": "Violet Spider",
    "h2_title": "Violet Spider Boss Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/6/6c/Wukong_LowerHollow_85.jpg",
    "alt_text": "Wukong LowerHollow 85.jpg",
    "position_desc": 12,
    "img_above_text": "# Violet Spider\nThe Violet Spider is a main Yaoguai \"Queen\" boss fight that you can encounter in Chapter 4 of Black Myth Wukong. The leader of the Spider Guai and master of The Webbed Hollow, the Violet Spider and her six daughters control this region, and their mother has particular plans for the pig known as Zhu Bajie.\n* Rewards: Spider Leg, Refined Iron Sand, 3410 Experience, 2608 Will\n## Violet Spider Boss Fight and Guide\nMuch like The Second Sister, this boss will take the form of a gigantic and fearsome spider, and uses attacks in a few similar ways. She can lash out with her appendages, which will subtly shift into long blades but also give you a clue as to where her main attacks will come from. As you might expect, you'll also have to deal with dodging both poison and webbing, making mobility key to your survival.\n\nIf this happens, you'll suddenly be transported to an illusory realm where you're on a bed of webs instead of solid ground. This can get extremely bad as the more you move around, the more you'll be slowed until eventually you'll be exposed as you try and break free of the webbing.\n\nExpect the Violet Spider to absolutely take advantage of your vulnerability in these moments, attacking with both her talons and a large jump slam attack that even staggers her for a bit. You'll need to stand your ground and use Rock Solid to knock away her blasts if you're unable to dodge them in time.",
    "img_below_text": "The good news is this phase doesn't last forever, but you will need to survive it for about 30 seconds, so you should also consider utilizing Immobilize to trap her in place, or even a Transformation Spell to offload the damage onto a different form.\n\nHer eyes will stop glowing after you've been mesmerized once, so once the room is back to normal, continue to dodge her projectiles and get your hits in after her violent stabs and slam attacks.\n\nWhen the queen of spiders finally falls to your assault, she'll beat a hasty retreat to return to wherever she's hidden the Sage's Relic. You'll need to follow quickly, because a literal spider army will appear to give chase!",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Violet Spider\n            - Section Title: Violet Spider Boss Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Violet Spider\nThe Violet Spider is a main Yaoguai \"Queen\" boss fight that you can encounter in Chapter 4 of Black Myth Wukong. The leader of the Spider Guai and master of The Webbed Hollow, the Violet Spider and her six daughters control this region, and their mother has particular plans for the pig known as Zhu Bajie.\n* Rewards: Spider Leg, Refined Iron Sand, 3410 Experience, 2608 Will\n## Violet Spider Boss Fight and Guide\nMuch like The Second Sister, this boss will take the form of a gigantic and fearsome spider, and uses attacks in a few similar ways. She can lash out with her appendages, which will subtly shift into long blades but also give you a clue as to where her main attacks will come from. As you might expect, you'll also have to deal with dodging both poison and webbing, making mobility key to your survival.\n\nIf this happens, you'll suddenly be transported to an illusory realm where you're on a bed of webs instead of solid ground. This can get extremely bad as the more you move around, the more you'll be slowed until eventually you'll be exposed as you try and break free of the webbing.\n\nExpect the Violet Spider to absolutely take advantage of your vulnerability in these moments, attacking with both her talons and a large jump slam attack that even staggers her for a bit. You'll need to stand your ground and use Rock Solid to knock away her blasts if you're unable to dodge them in time.\"\n            - Following Text: \"The good news is this phase doesn't last forever, but you will need to survive it for about 30 seconds, so you should also consider utilizing Immobilize to trap her in place, or even a Transformation Spell to offload the damage onto a different form.\n\nHer eyes will stop glowing after you've been mesmerized once, so once the room is back to normal, continue to dodge her projectiles and get your hits in after her violent stabs and slam attacks.\n\nWhen the queen of spiders finally falls to your assault, she'll beat a hasty retreat to return to wherever she's hidden the Sage's Relic. You'll need to follow quickly, because a literal spider army will appear to give chase!\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts an intense boss fight against the Violet Spider in the game Black Myth Wukong. The spider is a large and fearsome creature, positioned in a dark, web-filled environment. The player character is engaged in combat, utilizing various attacks such as \"Sprouting Spring\" and \"Withering Winter.\" The preceding text describes the spider's attack patterns, including poison and webbing, while the following text provides strategies for surviving and defeating the spider, emphasizing the importance of dodging and using spells. The metadata indicates that this is part of a guide for the Violet Spider boss fight."
}