{
    "chunk_id": 814516078038,
    "source_file": "Baw-Li-Guhh-Lang.md",
    "h1_title": "Baw-Li-Guhh-Lang",
    "h2_title": "Where to Find Baw-Li-Guhh-Lang",
    "h3_title": "Yaoguai Chief Mini-Boss Fight - Baw-Li-Guhh-Lang",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/a5/Wukong_Bamboo_19.jpg",
    "alt_text": "Wukong Bamboo 19.jpg",
    "position_desc": 5,
    "img_above_text": "# Baw-Li-Guhh-Lang\nBaw-Li-Guhh-Lang is an optional Yaoguai Chief miniboss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located in an optional area of the Bamboo Grove, this Toad Guai will ambush you as you explore a marsh, and can use its long tongue as a formidable weapon.\n* **Rewards:** Baw-Li-Guhh-Lang Spirit, Stone Spirit x1, 482 Experience, 385 Will\n## Where to Find Baw-Li-Guhh-Lang\nYou can encounter this miniboss while exploring the large area partway through the Bamboo Grove in Snake Trail. From the Shrine, you can either head up and over the bridge, or jump through a grove of bamboo left of the shrine to reach a stream.\n### Yaoguai Chief Mini-Boss Fight - Baw-Li-Guhh-Lang\nA gargantuan Yaoguai Toad, Baw-Li-Guhh-Lang will waste no time leaping into battle with a powerful slam attack from the air. While he doesn’t have many moves, they can often land extremely quickly, which means you’ll need to be ready to dodge at any moment.\n\nFinally, he can unleash a tongue attack that sweeps back and forth with a large reach several times, and will require you to dodge back and forth out of its path — or use your Immobilize to stop him in the act. Using your Red Tide spell to transform can also help out during these attacks as he’ll be vulnerable to getting hit from the side.",
    "img_below_text": "When Baw-Li-Guhh-Lang finally falls, he’ll leave behind his purple Spirit and a Tadpole Material. Using your new Blessed Gourd upgrade, you can now absorb the Spirit and add Baw-Li-Guhh-Lang’s power to your own, and temporarily transform to unleash a tongue attack against several enemies. If you decide to commit to cultivating his spirit and upgrading its damage potential, you can use the Tadpole he dropped to further upgrade it later on.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Baw-Li-Guhh-Lang\n            - Section Title: Where to Find Baw-Li-Guhh-Lang\n            - Sub-Section Title: Yaoguai Chief Mini-Boss Fight - Baw-Li-Guhh-Lang\n\n            Context:\n            - Preceding Text: \"# Baw-Li-Guhh-Lang\nBaw-Li-Guhh-Lang is an optional Yaoguai Chief miniboss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located in an optional area of the Bamboo Grove, this Toad Guai will ambush you as you explore a marsh, and can use its long tongue as a formidable weapon.\n* **Rewards:** Baw-Li-Guhh-Lang Spirit, Stone Spirit x1, 482 Experience, 385 Will\n## Where to Find Baw-Li-Guhh-Lang\nYou can encounter this miniboss while exploring the large area partway through the Bamboo Grove in Snake Trail. From the Shrine, you can either head up and over the bridge, or jump through a grove of bamboo left of the shrine to reach a stream.\n### Yaoguai Chief Mini-Boss Fight - Baw-Li-Guhh-Lang\nA gargantuan Yaoguai Toad, Baw-Li-Guhh-Lang will waste no time leaping into battle with a powerful slam attack from the air. While he doesn’t have many moves, they can often land extremely quickly, which means you’ll need to be ready to dodge at any moment.\n\nFinally, he can unleash a tongue attack that sweeps back and forth with a large reach several times, and will require you to dodge back and forth out of its path — or use your Immobilize to stop him in the act. Using your Red Tide spell to transform can also help out during these attacks as he’ll be vulnerable to getting hit from the side.\"\n            - Following Text: \"When Baw-Li-Guhh-Lang finally falls, he’ll leave behind his purple Spirit and a Tadpole Material. Using your new Blessed Gourd upgrade, you can now absorb the Spirit and add Baw-Li-Guhh-Lang’s power to your own, and temporarily transform to unleash a tongue attack against several enemies. If you decide to commit to cultivating his spirit and upgrading its damage potential, you can use the Tadpole he dropped to further upgrade it later on.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the game \"Black Myth Wukong\" where the player has just defeated the miniboss Baw-Li-Guhh-Lang, a Yaoguai Chief Toad. The player character is shown in a marshy area with tall grass, and a notification on the screen indicates that a \"Tadpole\" material has been obtained. This material can be used to upgrade the player's abilities, specifically related to the miniboss's powers. The image visually supports the narrative of the miniboss fight and the rewards gained from it, as described in the surrounding text."
}