{
    "chunk_id": 191546650913,
    "source_file": "Elder_Jinchi.md",
    "h1_title": "Elder Jinchi",
    "h2_title": "Elder Jinchi Fight and Guide",
    "h3_title": "",
    "img_url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/black-myth-wukong/a/aa/Wukong_Guanyin_13.jpg",
    "alt_text": "Wukong Guanyin 13.jpg",
    "position_desc": 11,
    "img_above_text": "# Elder Jinchi\nElder Jinchi is an optional secret Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located in a secret realm locked away in the past, you'll need to activate three bells in order to locate and defeat him.\n* **Rewards:** Fireproof Mantle, 2,000 Will\n## Elder Jinchi Fight and Guide\nIf you fought the Wandering Wight then the good news is you’ll have a good idea of what to expect in this fight, as he shares many of the same moves. That said, he does hit harder and can empower certain moves, so don’t assume this will be a cakewalk. You’ll want to have upgraded your staff after defeating the Whiteclad Noble to dish out more damage, and using the Wandering Wight’s Spirit on this guy can help tremendously.\n\nSo long as you deny him opportunities to restore his health, and watch out for when his followers are activated, you only need to keep up the assault and shut down his ground slams or stay far away when they happen. Save your Red Tides transformation spell for right after his healing segment so you don’t waste any time in that form killing walking corpses.",
    "img_below_text": "Once Elder Jinchi is defeated, you’ll automatically be returned back to the third bell in the Marsh of the White Mist. You can now interact with the Wolf Guai hanging from the tree, causing it to turn to dust, and rewarding you with the Fireproof Mantle Vessel, and 2,000 Will.",
    "summary_promot": "You are given an image and related metadata and context.\n\n            Metadata:\n            - Document Title: Elder Jinchi\n            - Section Title: Elder Jinchi Fight and Guide\n\n            Context:\n            - Preceding Text: \"# Elder Jinchi\nElder Jinchi is an optional secret Yaoguai King boss fight that you can encounter in Chapter 1 of Black Myth Wukong. Located in a secret realm locked away in the past, you'll need to activate three bells in order to locate and defeat him.\n* **Rewards:** Fireproof Mantle, 2,000 Will\n## Elder Jinchi Fight and Guide\nIf you fought the Wandering Wight then the good news is you’ll have a good idea of what to expect in this fight, as he shares many of the same moves. That said, he does hit harder and can empower certain moves, so don’t assume this will be a cakewalk. You’ll want to have upgraded your staff after defeating the Whiteclad Noble to dish out more damage, and using the Wandering Wight’s Spirit on this guy can help tremendously.\n\nSo long as you deny him opportunities to restore his health, and watch out for when his followers are activated, you only need to keep up the assault and shut down his ground slams or stay far away when they happen. Save your Red Tides transformation spell for right after his healing segment so you don’t waste any time in that form killing walking corpses.\"\n            - Following Text: \"Once Elder Jinchi is defeated, you’ll automatically be returned back to the third bell in the Marsh of the White Mist. You can now interact with the Wolf Guai hanging from the tree, causing it to turn to dust, and rewarding you with the Fireproof Mantle Vessel, and 2,000 Will.\"\n\n            Your task:\n            1. Generate a **short, clear, and informative English summary** of the image.\n            2. Focus primarily on the **preceding and following text** to infer the image's **purpose, content, or narrative role**.\n            3. Incorporate any relevant metadata (e.g., section or document titles) to improve coherence, **but do not assume any domain-specific knowledge** unless explicitly stated.\n            4. Do **not** speculate beyond the visible content.",
    "img_summary": "The image depicts a scene from the game \"Black Myth Wukong\" where the player character stands before a tree in a misty, dark environment. The tree has a Wolf Guai hanging from it, which is turning to dust. This moment occurs after defeating the optional boss Elder Jinchi, as described in the section titled \"Elder Jinchi Fight and Guide.\" The player is rewarded with the Fireproof Mantle Vessel and 2,000 Will upon interacting with the Wolf Guai."
}